REMARK* BDIEMENT-FD.v.0001
      *****************************************************
      *  MAESTRO DE INFORMACION ENVIADA POR LAS ENTIDADES *
      *****************************************************

       FD BDIEMENT.
       01 BDIEMENT-REGISTRO.
          02 BDIEMENT-SECUEN          PIC 9(8).
          02 BDIEMENT-TIP-REG         PIC 9(1).
          02 BDIEMENT-RESTO           PIC X(71).

