REMARK*BDLDI2.PROC.v.0038
MATCH1$SET CONSTANT HACERMATCH"NO"                                      RMB0013 
MATCH1$IF HACERMATCH = "SI"                                             RMB0013 
MATCH1$DISPLAY ".............COMPILANDO BDLDI2 CON MATCH **********     RMB0013 
MATCH1$ELSE                                                             RMB0013 
MATCH1$DISPLAY ".............COMPILANDO BDLDI2 SIN MATCH **********     RMB0013 
MATCH1$END                                                              RMB0013 
REMARK******************************************************************
REMARK* RUTINA CREADA PARA MANEJAR LOS ALGORITMOS DE NOMBRES. HAY VARIAS
REMARK* RUTINAS QUE MANEJAN LO NECESARIO PARA ESTANDARIZAR Y ORDENAR.    
REMARK*    2010-U-INICIAR-TABLAS   INICIA LAS TABLAS DE ORDENAMIENTO
REMARK*    2018-U-PASAR-REG-ICBDIR ALMACENA EN MEMORIA LOS DATOS DEL    
REMARK*                            REGISTRO DIRECC .
REMARK*    2017-U-ELEGIR-DIRECCIONES SE UNIFICAN LAS DIRECCIONES Y SE 
REMARK*                              ORDENAN DE ACUERDO A LO DEFINIDO
REMARK*    2017-U-ELEGIR-TELEFONOS   SE UNIFICAN LOS TELEFONOS Y SE
REMARK*                              ORDENAN DE ACUERDO A LO DEFINIDO
REMARK*    06000-U-CARGAR-TABLA-DIRESTAN SE CARGAN EN MEMORIA LAS TABLAS
REMARK*                                  DE ESTANDARIZACION DE NOMBRES DE
REMARK*                                  COMPONENTES DE LAS DIRECCIONES
REMARK*    6100-U-ESTANDARIZAR-DIRECC SE ESTANDARIZA LA DIRECCION DE ACUERDO
REMARK*                               A LAS TABLAS DE SINONIMOS LEIDA.
REMARK*******************************************************************
REMARK* RMB0002      * ALG001 - SE CAMBIA EL ORDEN DE LA DIRECCION MAS
REMARK* FEB-15-2003  *          PROBABLE AUMENTANDO UN PESO CON BASE A LA
REMARK* R.MARTINEZ   *          CONFORMACION DE LA DIRECCION O DEL TELEFONO
REMARK*******************************************************************
REMARK* RMB0003      * DIRACC - SE DEJA COMO RUTINA LA VALIDACION DE LOS
REMARK* MAR-15-2003  *          PERMISOS DE ACCESO A LA BASE DE DATOS DE 
REMARK* R.MARTINEZ   *          DIRECCIONES                                
REMARK*******************************************************************
REMARK* RMB0004      * VEC001 - SE CORRIGE PROBLEMA EN EL VECTOR DE TELE
REMARK* ABR-15-2003  *          FONOS YA QUE USABA LA FECHA DE DIRECCIONES
REMARK* R.MARTINEZ   *          Y NO LA V-FECHATEL                         
REMARK*******************************************************************
REMARK* RMB0005      * UBI001 - SE CORRIGE PROBLEMA DE REFLEGAR EN EL   
REMARK* ABR-15-2003  *          INFORME LA MISMA DIRECCION COMO R,L,C DIF-
REMARK* R.MARTINEZ   *          ENTE EN DETALLE Y RESUMEN                  
REMARK*******************************************************************
REMARK* VHF0006      * ESTAN1 - SE PERMITE QUE LAS PARTICULAS PARA      
REMARK* MAY-27-2003  *          ESTANDARIZAR SEAN DE HASTA 30 CARACTERES  
REMARK* V.FORERO     *          
REMARK*******************************************************************
      * RMB0007     * VALPRI- SE ARREGLA PROBLEMA DE SACAR TIPO-5 SI   *
      * R.MARTINEZ  *         LA PERSONA TENIA SOLO UNA CUENTA Y ESTABA*
      * MAR.13/2003 *         BLOQUEADA                                *
REMARK******************************************************************
      * RMB0008     * VEC002- SE CORRIGE PROBLEMA ADICIONAL EN EL VECTO*
      * R.MARTINEZ  *         R DE TELEFONOS AL USAR LA FECHA DE LA    *
      * JUNIO /2003 *         DIRECCION                                *
REMARK******************************************************************
REMARK* FAC0009     * AMPDIR * AMPLIACIÓN DE LA ESTRUCTURA DE ARCHIVO  *
REMARK* F.CUADROS C.*          ICBDIR. SE AMPLIAN LOS TAMAÑOS DE CAMPOS*
REMARK* FEB.14/2006 *          TELÉFONOS, DIRECCIONES, CIUDADES, DPTOS.*
REMARK*             * DOMICI - SEÑAL PARA MATCH DE DOMICILIACION
***********************************************************************
REMARK* RMB0010     * RCNCER - OPTIMIZACION PARA PRODUCTO RECONOCER. SE*
REMARK* R.MARTINEZ  *          INCLUYO ESTANDARIZACION DE CIUDADES CON *
REMARK* JUN.15/2006 *          BASE EN ARCHIVO DE ESTANDARIZACION DE   *
REMARK*             *          CIUDADES DE OUTSOURCING DE DOCUMENTOS,  *
REMARK*             *          SE ADICIONARON NUEVAS PARTICULAS        *
REMARK*             *          ESTANDARIZADAS PARA DIRECCIONES, SE     *
REMARK*             *          OPTIMIZO ALGORITMO PAR SELECCION DE     *
REMARK*             *          TELEFONOS Y SE ADICIONARON LOS CONCEPTOS*
REMARK*             *          DE DIRECCIONES CERTIFICADAS Y PUNTOS    *
REMARK*             *          ADICIONALES (PARA GEOREFERENCIACION)    *
REMARK******************************************************************
REMARK* GJC0011     * NWDIRB - SE INCLUYE RUTINA EN LA QUE PARA LAS DI-*
REMARK* G.JIMENEZ   *          RECCIONES DE BOGOTA IDENTIFICA SI EXIS- *
REMARK* FEBRERO/2007*          TE NUEVA NOMENCLATURA                   *
REMARK******************************************************************
REMARK* RMB0012     * DIRB02 - SE ELIMINA LLENADO INOFICIOSO DE LA    -*
REMARK* G.JIMENEZ   *          LLAVE DEL ARCHIVO DE NUEVA NOMENCLATURA *
REMARK* FEB.26/2007 *          (ERROR    EN LCLZCN PROD = LOCALIZACION *
REMARK******************************************************************
REMARK* DLM0013     * UNLSUS - QUITAR EL LOCK AL MOMENTO DE LEER LOS   *
REMARK* DARIO LASSO.*   REGISTROS.                                     *
REMARK* RMB0013     * MATCH1 - MANEJO DEL MATCH DE NOMBRES A PARTIR DE *
REMARK* R.MARTINEZ  *          LAS ESTRUCTURAS BASE DE DATACREDITO
REMARK******************************************************************
REMARK* CAV0014     * CARTOT - CONTROLAR QUE EL INDICE QUE MANEJA      *
REMARK* C. VELASCO. *          LA TABLA V-CARTOT-BDLDIR NO EXCEDA LAS  *
REMARK* R.MARTINEZ  *          10 POSICIONES DE LAS MISMA.             *
REMARK******************************************************************
REMARK* VHF0015     * FASEII - DENTRO DE LA OPTIMIZACION DE RECONOCER  *
REMARK* VICTOR HUGO *          SE MODIFICA EL ALOGORITMO PARA LA       *
REMARK* FORERO      *          SELECCION DE LA MEJOR DIRECCION         *
REMARK* JUL.25/2008 *                                                  *
REMARK******************************************************************
REMARK* RMB0016     * FECH01 - SE TOMA COMO DEFAULT LA FECHA DE APERTUR*
REMARK* RICARDO MART*          COMO MEJOR FECHA, ESTO SI LA INDIVIDUAL *
REMARK*             *          ESTA EN CEROS, CASO QUE SERIA UN ERROR  *
REMARK* FEB.09/2009 *          LA MEJOR SIEMPRE ES LA INDIVIDUAL       *
REMARK******************************************************************
REMARK* AAM0017       * TELEXC - Se agrega validación para la exclusión*
REMARK* A. ALGARIN M. *          de teléfonos y unificación de los que *
REMARK* MAR.12/2009   *          coincidan en los últimos 7 números.   *
REMARK* INTERSCHEMES  *          Se agrega en la salida el campo fecha *
REMARK*               *          último reporte.                       *
REMARK*               * UNIDIR - UNIFICAR DIRECCIONES QUE TENGAN       *
REMARK*               *          COINCIDENCIAS CON OTRAS DIRECCIONES   *
REMARK*               *          CON MAYOR CANTIDAD DE INFORMACION -   *
REMARK*               *          INCLUIR EN LA SALIDA EL CAMPO FECHA   *
REMARK*               *          ULTIMO REP                            *
REMARK******************************************************************
REMARK* AAM0018       * INIVAR - Se inicializa variable de control de  *
REMARK* A. ALGARIN M. *          unificación de direcciones.           *
REMARK* MAR.26/2009   *                                                *
REMARK* INTERSCHEMES  *                                                *
REMARK******************************************************************
REMARK* HGO0019       * UNIDI1 - Se ajusta para cuando exista una      *
REMARK* H. GARCIA O.  *          direccion con basura y al estandarizar*
REMARK* JUN.30/2009   *          no la tenga en cuenta                 *
REMARK* INTERSCHEMES  *                                                *
REMARK******************************************************************
REMARK* HGO0020       * TEXTEL - Se agregan nuevas exclusiones en la   *
REMARK* H. GARCIA O.  *          tabla de telefonos y se amplia el     *
REMARK* SEP.01/2009   *          numero de ocurrencias                 *
REMARK* INTERSCHEMES  *                                                *
REMARK******************************************************************
REMARK* HGO0021       * PYSPAR - AJUSTE QUE BUSCAR GENERAR CALIFICACION*
REMARK* H. GARCIA O.  *          PARA LA PRIMERA Y SEGUNDA PARTICULA Y *
REMARK* SEP. 07/2009  *          LUEGO UNIFICAR TENIENDO EN CUENTA ESTE*
REMARK* INTERSCHEMES. *          CRITERIO                              *
REMARK******************************************************************
REMARK* HGO0022       * RECPF2 - AJUSTE VALIDACION TABLAS DE ACEPCIONES*
REMARK* H. GARCIA O.  *          Y EXCLUSIONES                         *
REMARK* SEP. 17/2009  *                                                *
REMARK* INTERSCHEMES. *                                                *
REMARK******************************************************************
REMARK* RGH0023       * MOD023 - ESTANDARIZACION DE MANEJO DE ARCHIVOS *
REMARK* R. GALVIS H.  *          BDLSTDCIU                             *
REMARK* ENE. 01/2010  *          BDLDIRACE                             *
REMARK* INTERSCHEMES. *          BDLMAIEXC                             *
REMARK*               *          BDLTELEXC                             *
REMARK******************************************************************
REMARK* RGH0024      * MOD024 - PARA LAS DIRECCIONES QUE SE UNIFICAN   *
REMARK* R.GALVIS     *          SE DEJA COMO FECHA DE ULTIMO REPORTE   *
REMARK* FEB.16/2010  *          LA FECHA MAS RESIENTE DE LOS REGISTROS *
REMARK* INTERSCHEMES *          QUE SE UNIFICAN                        *
REMARK******************************************************************
REMARK* RMB0025       * CELU01 - INCLUIR LOS CELULARES DEL ARCHIVO     *
REMARK* R. MARTINEZ.  *          DE DIRECCIONES EN LA TABLA DE CELULAR *
REMARK* MAR. 25/2010  *                                                *
REMARK******************************************************************
REMARK* PJV0026      * NN0026 - AJUSTE, PARA EVITAR QUE SE REPITAN     *
REMARK* P.VARGAS     *          DIRECCIONES EN EL MISMO REPORTE CUNADO *
REMARK* JUL 01/2010  *          SE TRATAN DE NUEVAS NOMENCLATURAS EN   *
REMARK* DATACREDITO  *          BOGOTA.                                *
REMARK******************************************************************
REMARK* PJV0027      * AMP027 -SE AMPLIAN LOS LIMITES DE LAS TABLAS DE *
REMARK* P.VARGAS     *         ACEPCIONES QUE SE CARGAN EN MEMORIA.    *
REMARK* SEP 09/2010  *         TAMBIEN SE AJUSTA PARA EVITAR LA        *
REMARK* DATACREDITO  *         REPETICION DE DIRECCIONES PARA UNA MISMA*
REMARK*              *         IDENTIFICACION.                         *
REMARK******************************************************************
REMARK* PJV0028      * TEL028 -NO MOSTRAR TELÉFONOS NI CELULARES CON 1 *
REMARK* P.VARGAS     *         Ó 9 EN LA POSICIÓN 7 DE DERECHA A       *
REMARK* SEP 21/2010  *         IZQUIERDA                               *
REMARK* DATACREDITO  * CAL028  SE CORRIGE CALIFICACION DE MOVILES      *                                              *
REMARK*              *                                                 *
REMARK******************************************************************
REMARK* RMB0029      * BLOQ01 -SE ADICIONA CONTROL DE BLOQUEO DE       *
REMARK* R.MARTINEZ   *         LA INFORMACION DE DIRECCIONES           *
REMARK* OCT 01/2011  *                                                 *
      *
REMARK* FARF029      * AJUCAL - SE AJUSTA PARA SUBIR DE 30 A 40 LOS 
REMARK* F.RODRIGUEZ  *          VALORES DE V-CALFIN-BDLDIR PARA 
REMARK* OCT 21/2011  *          DESEMPATAR POR FECHA
      *
REMARK*              * AJUACE - SE AJUSTA PARA QUE  MUEVA LAS PARTICULAS 
REMARK*              *          DE LAS ACCEPCIONES COMPUESTAS.
REMARK*              *          
REMARK******************************************************************
      * FARF030       * AJUDEP - SE AJUSTA PARA QUE CUANDO LA DIRECCION  
      * DIC.06-2011   *          NO TENGA DIGITOS NUMERICOS MUEVA EL 
      * FRANKLIN.R.   *          DEPARTAMENTO AL VECTOR                *
      ******************************************************************
      * FARF031       * AJUFUR - SE AJUSTA LA RUTINA 
      *               *  2020-UNIFICA-TELEFONOS PARA PARA QUE MUEVA LA   
      * ABR.18-2012   *  LA FECHA DE ULTIMO REPORTE CUANDO SE MUEVA LA
      * FRANKLIN.R.   *  FECHA REPORTADO DESDE. 
      *               *
      *               * AJNVDR - SE AJUSTA PARA QUE NO MARQUE LAS 
      *               *  DIRECCIONES DE NUEVA NOMENCLATURA Y LAS INTEGRE
      *               *  CON LAS DIRECIONES QUE NO SON DE NUEVA 
      *               *  NOMENCLATURA.
      ******************************************************************
      * FARF032       * PLNCHQ - SE AINTEGRA LAS REGLAS DESARROLLADAS  *  
      * Jul.17-2012   *  DESARROLLADAS POR RMB PARA EL PLAN DE CHOQUE. *
      * FRANKLIN.R.   *                                                *
      ******************************************************************
      * FARF033       * AJCIUU - SE AINTEGRA EL AJUSTE DESARROLLADO POR 
      * Sep.11-2012   * RMB QUE CAMBIA LA BUSQUEDA DEL CIU PARA QUE NO 
      * FRANKLIN.R.   * FALLE CUANDO SE UTILIZA FUERA DE LA RUTINA 
      *               * PRINCIPAL.
      ******************************************************************
REMARK* ABB0034      * NCAM18 -SE CREAN NUEVOS CAMPOS EN TRAMAS:       *
REMARK* ALBEIRO      *         ZONA                ZONADIR             *
REMARK* BERNAL       *         FECHA DE CREACION   FECCRE              *
REMARK* Oct 04/2012  *         NUMERO DE ENTIDADES NUMENT              *
      *              *                                                 *
REMARK*              * FCRGCR- SE INTEGRA EL AJUSTE DE FECHAS DE       *
      *              *  DIRECCIONES DE CUENTAS CERRADAS DESARROLLADO   *
      *              *  POR RMB.                                       *
      *              *                                                 *
REMARK*              * NCAM19 -SE CREA NUEVOS CAMPOS:                  *
REMARK*              *      TIPODI = 1=Res,2=Lab,4=Cor,3=Res+Lab       *
REMARK*              *               5=Res+Cor, 6=Lab+Cor,7=Res+Lab+Cor*
REMARK*              *      TIPOTE = 1=Res,2=Lab,3=Res+Lab             *
REMARK******************************************************************
      * FARF035       * AJCONT - SE AINTEGRA EL AJUSTE DESARROLLADO POR 
      * Nov.09-2012   * RMB QUE PERMITE HACER UNA CORRELACION ENTRE LAS  
      * FRANKLIN.R.   * DIRECCIONES FINALES Y LAS DIRECCIONES INCICIALES 
      *               * DE DONDE SALIERON
      ******************************************************************
REMARK* ABB0036      * NCAM20 -NUEVOS CAMPOS DESCRIPCION               *
REMARK* ALBEIRO      *                                                 *
REMARK* BERNAL       *                                                 *
REMARK*Nov 15/2012   * *                                               *
REMARK******************************************************************
      * FARF037       * LIMDIR - SE ADICIONAN UNA REGLAS DE LIMPIEZA Y  
      * Feb.15-2013   * DE EXCLUSION EXPECIFICADAS POR MERCADEOD DE   
      * FRANKLIN.R.   * PRODUCTO RECONOCER.
      *               *
      *               * AJCORR - SE AJUSTA LA CORRELACION A CERO EN LA  
      *               * MATRIZ ORIGINAL CUANDO SE HACE UNA EXCLUSION  EN   
      *               * LA MATRIZ  FINFIN, PARA QUE NO AFECTE LA NUEVA 
      *               * NUMERACION DE CORRELACION.
      ******************************************************************    
      * FARF038       * AJEXMA - Se ajusta  la exclusion de correos para  
      * Jul.03-2013   * que deje de ultimas el correo cuando lo excluye.
      * FRANKLIN.R.   *
      ******************************************************************
RUTINA*-----------------INICIALIZACION               --------------------
INICIO 2010-U-INICIAR-TABLAS.                    
RCNCER     MOVE 0 TO NUM-OK-SEND-BDLDIR.                                RMB0010 
RCNCER     MOVE 1 TO DIR-OK-BDLDIR.                                     RMB0010 
RCNCER     MOVE 1 TO TEL-OK-BDLDIR.                                     RMB0010 

REPLUS     MOVE 1 TO CEL-OK-BDLDIR
REPLUS     MOVE 1 TO MAIL-OK-BDLDIR
REPLUS     INITIALIZE TABLA-CEL-BDLDIR
REPLUS     INITIALIZE TABLA-CELFINALES-BDLDIR
REPLUS     INITIALIZE TABLA-MAIL-BDLDIR
REPLUS     INITIALIZE TABLA-MAILFINALES-BDLDIR

RCNCER     INITIALIZE TABLA-DIR-BDLDIR.                                 RMB0010 
RCNCER     INITIALIZE TABLA-TEL-BDLDIR.                                 RMB0010 
RCNCER     INITIALIZE TABLA-DIRFINALES-BDLDIR.                          RMB0010 
RCNCER     INITIALIZE TABLA-TELFINALES-BDLDIR.                          RMB0010 
UNIDIR     INITIALIZE TABLA-DIRFINALESFIN-BDLDIR.                       AAM0017
UNIDIR     INITIALIZE T-DIRFINALESAUX-BDLDIR.                           AAM0017
      *    SE INICIALIZA LOS CAMPOS PARA LA CORRELACION 
AJCONT     MOVE 1 TO I-BDLDIR.                                          FARF035
AJCONT     PERFORM UNTIL I-BDLDIR > 100                                 FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC00DIR-BDLDIR(I-BDLDIR)              FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC01DIRFIN-BDLDIR(I-BDLDIR)           FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC02DIRFINFIN-BDLDIR(I-BDLDIR)        FARF035
AJCONT*                                                                 FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC00TEL-BDLDIR(I-BDLDIR)              FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC01TELFIN-BDLDIR(I-BDLDIR)           FARF035
AJCONT*                                                                 FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC00CEL-BDLDIR(I-BDLDIR)              FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC01CELFIN-BDLDIR(I-BDLDIR)           FARF035
AJCONT*                                                                 FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC00MAIL-BDLDIR(I-BDLDIR)             FARF035
AJCONT        MOVE I-BDLDIR TO V-SEC01MAILFIN-BDLDIR(I-BDLDIR)          FARF035
AJCONT        ADD  1 TO I-BDLDIR                                        FARF035
AJCONT     END-PERFORM.                                                 FARF035
      *
RUTINA*--------------------- LLENADO DE DATOS  --------------------
RCNCER 2011-ESTANDARIZAR-CIUDAD.                                        RMB0010 
RCNCER       PERFORM 2018-TOMAR-CIUDADES-ORIGINALES                     RMB0010 
RCNCER       IF OPEN-BDLSTDCIU-BDLDIR = 0                               RMB0010 
RCNCER          MOVE 1 TO OPEN-BDLSTDCIU-BDLDIR                         RMB0010 
RCNCER          OPEN INPUT BDLSTDCIU                                    RMB0010 
MOD023*         IF COD-RETORNO-BDLSTDCIU <> "00"                        RGH0023
MOD023*           DISPLAY "ICGDI2: ERROR ABRIENDO BDLSTDCIU",           RGH0023
MOD023*           " FILE STATUS = " ,        COD-RETORNO-BDLSTDCIU      RGH0023
MOD023*           STOP RUN                                              RGH0023
MOD023*         END-IF                                                  RGH0023

REPLUS          OPEN INPUT BDLDIRESTR

RCNCER       END-IF.                                                    RMB0010 
RCNCER       IF CIURES-DIRECC NOT = SPACES                              RMB0010 
RCNCER           MOVE CIURES-DIRECC TO LLAVE-BDLSTDCIU                  RMB0010 
RCNCER           PERFORM 1000-PROCESAR-CIU                              RMB0010 
RCNCER           MOVE CIUDAD-ESTANDAR-CIU-BDLDIR TO CIURES-DIRECC       RMB0010 

REPLUS           MOVE CODIGO-DANE-CIU-BDLDIR TO CODIGO-RES

RCNCER        END-IF                                                    RMB0010 
RCNCER        IF CIUCOR-DIRECC NOT = SPACES                             RMB0010 
RCNCER           MOVE CIUCOR-DIRECC TO LLAVE-BDLSTDCIU                  RMB0010 
RCNCER           PERFORM 1000-PROCESAR-CIU                              RMB0010 
RCNCER           MOVE CIUDAD-ESTANDAR-CIU-BDLDIR TO CIUCOR-DIRECC       RMB0010 

REPLUS           MOVE CODIGO-DANE-CIU-BDLDIR TO CODIGO-COR

RCNCER        END-IF                                                    RMB0010 
RCNCER        IF CIULAB-DIRECC NOT = SPACES                             RMB0010 
RCNCER           MOVE CIULAB-DIRECC TO LLAVE-BDLSTDCIU                  RMB0010 
RCNCER           PERFORM 1000-PROCESAR-CIU                              RMB0010 
RCNCER           MOVE CIUDAD-ESTANDAR-CIU-BDLDIR TO CIULAB-DIRECC       RMB0010 

REPLUS           MOVE CODIGO-DANE-CIU-BDLDIR TO CODIGO-LAB

RCNCER        END-IF.                                                   RMB0010 
RCNCER 1000-PROCESAR-CIU.                                               RMB0010 
RCNCER     MOVE FUNCTION UPPER-CASE(LLAVE-BDLSTDCIU) TO LLAVE-BDLSTDCIU.RMB0010 
RCNCER     INSPECT LLAVE-BDLSTDCIU REPLACING ALL '"' BY " ".            RMB0010 
RCNCER     INSPECT LLAVE-BDLSTDCIU REPLACING ALL '*' BY " ".            RMB0010 
RCNCER     INSPECT LLAVE-BDLSTDCIU REPLACING ALL '_' BY " ".            RMB0010 
RCNCER     MOVE 0 TO PATRON-CIU-BDLDIR CODIGO-DANE-CIU-BDLDIR.          RMB0010 
RCNCER     MOVE SPACES TO CODIGO-DANE-CIU-BDLDIR.                       RMB0010 
RCNCER     MOVE 0 TO I-CIU-BDLDIR.                                      RMB0010 
RCNCER     INSPECT LLAVE-BDLSTDCIU TALLYING I-CIU-BDLDIR FOR ALL "BOGOT"RMB0010 
RCNCER     IF I-CIU-BDLDIR > 0                                          RMB0010 
RCNCER        MOVE 1 TO PATRON-CIU-BDLDIR                               RMB0010 
RCNCER        MOVE "BOGOTA" TO LLAVE-BDLSTDCIU                          RMB0010 
RCNCER     ELSE                                                         RMB0010 
RCNCER        MOVE LLAVE-BDLSTDCIU TO LLAVE-AUX-CIU-BDLDIR              RMB0010 
RCNCER        UNSTRING LLAVE-AUX21-CIU-BDLDIR DELIMITED BY ALL " " INTO RMB0010 
RCNCER           BASURA-CIU-BDLDIR CODIGO-DANE-CIU-BDLDIR               RMB0010 
RCNCER        INSPECT CODIGO-DANE-CIU-BDLDIR REPLACING ALL " " BY "0"   RMB0010 
RCNCER     END-IF.                                                      RMB0010 
RCNCER     MOVE SPACES TO CAMPO-CIU-BDLDIR                              RMB0010 
RCNCER     MOVE 1 TO I-CIU-BDLDIR J-CIU-BDLDIR                          RMB0010 
RCNCER     PERFORM UNTIL I-CIU-BDLDIR > 30                              RMB0010 
RCNCER        IF LLAVE-BDLSTDCIU(I-CIU-BDLDIR:1) <> " "                 RMB0010 
RCNCER           IF LLAVE-BDLSTDCIU(I-CIU-BDLDIR:1) =                   RMB0010 
RCNCER              ("(" OR "-" OR "." OR "," OR "/" OR "\" )           RMB0010 
RCNCER                                  AND J-CIU-BDLDIR > 4            RMB0010 
RCNCER              MOVE 50 TO I-CIU-BDLDIR                             RMB0010 
RCNCER           ELSE                                                   RMB0010 
RCNCER              IF LLAVE-BDLSTDCIU(I-CIU-BDLDIR:1) NOT NUMERIC      RMB0010 
RCNCER                 MOVE LLAVE-BDLSTDCIU(I-CIU-BDLDIR:1)             RMB0010 
RCNCER                      TO CAMPO-CIU-BDLDIR(J-CIU-BDLDIR:1)         RMB0010 
RCNCER                 ADD 1 TO J-CIU-BDLDIR                            RMB0010 
RCNCER              END-IF                                              RMB0010 
RCNCER           END-IF                                                 RMB0010 
RCNCER        END-IF                                                    RMB0010 
RCNCER        ADD 1 TO I-CIU-BDLDIR                                     RMB0010 
RCNCER     END-PERFORM.                                                 RMB0010 
RCNCER     IF CAMPO-CIU-BDLDIR = SPACES                                 RMB0010 
RCNCER        IF CODIGO-DANE-CIU-BDLDIR NUMERIC AND                     RMB0010 
RCNCER           CODIGO-DANE-N-CIU-BDLDIR > 01000000                    RMB0010 
RCNCER           MOVE CODIGO-DANE-CIU-BDLDIR TO CAMPO-CIU-BDLDIR        RMB0010 
RCNCER        END-IF                                                    RMB0010 
RCNCER     END-IF.                                                      RMB0010 
RCNCER     MOVE CAMPO-CIU-BDLDIR TO LLAVE-BDLSTDCIU                     RMB0010 
RCNCER     READ BDLSTDCIU INVALID KEY                                   RMB0010 
RCNCER            MOVE SPACES        TO CIUDAD-ESTANDAR-CIU-BDLDIR      RMB0010 
RCNCER        NOT INVALID KEY                                           RMB0010 
RECPF2            IF ACTIVO-BDLSTDCIU NOT = "N"                         HGO0022
RCNCER            MOVE CIUDAD-BDLSTDCIU TO CIUDAD-ESTANDAR-CIU-BDLDIR   RMB0010 
RECPF2            END-IF                                                HGO0022

REPLUS            MOVE CODIGO-BDLSTDCIU TO CODIGO-DANE-CIU-BDLDIR

RCNCER     END-READ.                                                    RMB0010 
LLENAR 2018-U-PASAR-REG-ICBDIR.
REMARK******************************************************************
REMARK* SE VERIFICA QUE NO SEAN MAS DE 500 DIRECCIONES LAS QUE SE VAN  *
REMARK* A ENCADENAR                                                    *
REMARK******************************************************************

RCNCER     IF NUM-OK-SEND-BDLDIR <= 500                                 RMB0010 
LLENAR        PERFORM 2018-TOMAR-DATOS
LLENAR     END-IF.
RCNCER     ADD 1 TO NUM-OK-SEND-BDLDIR.                                 RMB0010 

RCNCER 2018-TOMAR-CIUDADES-ORIGINALES.                                  RMB0010 
RCNCER******************************************************************RMB0010 
RCNCER*2018-TOMAR-CIUDADES-ORIGINALES.                                 *RMB0010 
RCNCER*    TOMA LAS CIUDADES ORIGINALES DEL ARCHIVO DE DIRECCIONES     *RMB0010 
RCNCER*    PARA CADA TIPO DE INFORMACION (RESIDENCIAL, LABORAL, ETC)   *RMB0010 
RCNCER******************************************************************RMB0010 
RCNCER     MOVE CIURES-DIRECC TO CIUDAD-RES-A-ESTANDAR-BDLDIR           RMB0010 
RCNCER     MOVE CIULAB-DIRECC TO CIUDAD-LAB-A-ESTANDAR-BDLDIR           RMB0010 
RCNCER     MOVE CIUCOR-DIRECC TO CIUDAD-COR-A-ESTANDAR-BDLDIR.          RMB0010 

LLENAR 2018-TOMAR-DATOS.
REMARK******************************************************************
REMARK* SE TOMAN LOS DATOS DEL REGISTRO DE DIRECCIONES Y SE PASAN A LOS*
REMARK* SIGUIENTES VECTORES:                                           *
REMARK*        DIRECCIONES V-DIRECCION         DIRECCION
REMARK*                    V-TIPODIR           UBICACION
REMARK*                    V-CIUDADDIR         CIUDAD
REMARK*                    V-SUSDIR            CODIGO SUSCRIPTOR
REMARK*                    V-FECHADIR          FECHA MEJOR       
REMARK*                    V-TNUMDIR           VECTOR DE NUMEROS ORDENAD
REMARK*                    V-HASDIR            STRING DE NUMEROS ORDENAD
NCAM18*                    V-FECCRE            FECHA EN LA QUE SE REPORTO
NCAM18*                                        POR PRIMERA VEZ
REMARK*        TELEFONOS   V-TELEFONO          TELEFONO
REMARK*                    V-TIPOTEL           UBICACION
REMARK*                    V-CIUDTEL           CIUDAD
REMARK*                    V-SUSTEL            CODIGO SUSCRIPTOR
REMARK*                    V-FECHATEL          FECHA MEJOR  
NCAM18*                    V-FECCRETEL         FECHA EN LA QUE SE REPORTO
NCAM18*                                        POR PRIMERA VEZ
REPLUS*        CELULARES   V-CELULAR           CELULAR
REPLUS*                    V-SUSCEL            CODIGO SUSCRIPTOR
REPLUS*                    V-FECHACEL          FECHA MEJOR
NCAM18*                    V-FECCRECEL         FECHA EN LA QUE SE REPORTO
NCAM18*                                        POR PRIMERA VEZ
REPLUS*        MAILS       V-MAIL              EMAIL
REPLUS*                    V-SUSMAIL           CODIGO SUSCRIPTOR
REPLUS*                    V-FECHAMAIL         FECHA MEJOR
NCAM18*                    V-FECCREMAIL        FECHA EN LA QUE SE REPORTO
NCAM18*                                        POR PRIMERA VEZ
REMARK******************************************************************
RCNCER     PERFORM 2011-ESTANDARIZAR-CIUDAD.                            RMB0010 
CELU01     PERFORM 2011-EXTRACTAR-CEL-BDLDIR.                           RMB0025
LLENAR     IF CIURES-DIRECC NOT = SPACES 
RCNCER        IF DIRRES-DIRECC NOT = SPACES AND DIR-OK-BDLDIR < 100     RMB0010 
RCNCER           MOVE DIRRES-DIRECC TO V-DIRECCION-BDLDIR(DIR-OK-BDLDIR)RMB0010 
RCNCER           MOVE "R"           TO V-TIPODIR-BDLDIR(DIR-OK-BDLDIR)  RMB0010 
RCNCER                                 IND-DATO-BDLDIR                  RMB0010 
RCNCER           MOVE CIURES-DIRECC TO V-CIUDADDIR-BDLDIR(DIR-OK-BDLDIR)RMB0010 
RCNCER           MOVE COD-SUS-DIRECC TO V-SUSDIR-BDLDIR(DIR-OK-BDLDIR)  RMB0010 
RCNCER           MOVE DIRRES-DIRECC TO T-CARDIR-BDLDIR                  RMB0010 
FASEII           PERFORM 2019-ELEGIR-FECHA-DIR                          VHF0015 
NCAM18           MOVE 1             TO V-NUMENT-BDLDIR(DIR-OK-BDLDIR)   ABB0034 
NCAM19           MOVE 1             TO V-TIPODI-BDLDIR(DIR-OK-BDLDIR)   ABB0034 
NCAM18           MOVE FECHA-MEJOR-BDLDIR                                 ABB0034 
NCAM18                                 TO V-FECCRE-BDLDIR(DIR-OK-BDLDIR)ABB0034 
RCNCER           MOVE FECHA-MEJOR-BDLDIR                                RMB0010 
RCNCER                TO V-FECHADIR-BDLDIR(DIR-OK-BDLDIR)               RMB0010 
UNIDIR           MOVE FECULT-DIRECC TO V-FECULT-BDLDIR(DIR-OK-BDLDIR)   AAM0017

REPLUS           MOVE CIURES-DIRECC TO CIUDAD-BDLDIRESTR 
REPLUS                                 DUPCIUDAD-BDLDIR
REPLUS           MOVE DIRRES-DIRECC TO DIRECC-BDLDIRESTR
REPLUS           MOVE CODIGO-RES    TO DANE-BDLDIRESTR
REPLUS           MOVE CODIGO-RES(1:2) TO COD-DPTO
REPLUS           PERFORM 2018-BUSCAR-DUPCIUDAD
REPLUS           READ BDLDIRESTR INVALID KEY
REPLUS              MOVE ZEROS TO V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)
RECPF2                            V-PRBENTDIR-BDLDIR(DIR-OK-BDLDIR)     HGO0022
REPLUS              MOVE SPACES TO V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS                             V-ESTRATODIR-BDLDIR(DIR-OK-BDLDIR)
NCAM18              MOVE CODIGO-RES TO V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)  ABB0034 
REPLUS           NOT INVALID KEY
REPLUS              MOVE CODDANE-BDLDIRESTR TO 
REPLUS                                 V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS              MOVE DEPEST-BDLDIRESTR TO 
REPLUS                                 V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS              MOVE ESTR-BDLDIRESTR TO
REPLUS                              V-ESTRATODIR-BDLDIR(DIR-OK-BDLDIR)
RECPF2              MOVE PRBENT-BDLDIRESTR TO                           HGO0022
RECPF2                              V-PRBENTDIR-BDLDIR(DIR-OK-BDLDIR)   HGO0022
REPLUS           END-READ
      *
REPLUS           IF V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR) = SPACES
REPLUS           AND COD-DPTO > 0 AND SW-DUPCIUDAD = 0
REPLUS              MOVE T-NOM-DEP-DANE(COD-DPTO) TO 
REPLUS                   V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS           END-IF
      *
NCAM18           PERFORM 2018-CALCULAR-ZONA                             ABB0034 
LLENAR           PERFORM 2020-U-BUSCAR-NUMEROS
LLENAR        END-IF
      *
RCNCER        IF TELRES-DIRECC > 0 AND TEL-OK-BDLDIR < 100 AND          RMB0010 
LLENAR           TELRES-DIRECC < 9999999999
RCNCER           MOVE CIURES-DIRECC TO V-CIUDADTEL-BDLDIR(TEL-OK-BDLDIR)RMB0010 
REPLUS                                 DUPCIUDAD-BDLDIR
RCNCER           MOVE TELRES-DIRECC TO V-TELEFONO-BDLDIR(TEL-OK-BDLDIR) RMB0010 
RCNCER                                 V-HASTEL-BDLDIR(TEL-OK-BDLDIR)   RMB0010 
RCNCER           MOVE COD-SUS-DIRECC TO V-SUSTEL-BDLDIR(TEL-OK-BDLDIR)  RMB0010 
RCNCER           MOVE "R"           TO V-TIPOTEL-BDLDIR(TEL-OK-BDLDIR)  RMB0010 
RCNCER                                 IND-DATO-BDLDIR                  RMB0010 
FASEII           PERFORM 2019-ELEGIR-FECHA-TEL                          VHF0015 
NCAM18           MOVE 1             TO V-NUMENTTEL-BDLDIR(TEL-OK-BDLDIR)ABB0034 
NCAM19           MOVE 1             TO V-TIPOTE-BDLDIR   (TEL-OK-BDLDIR)ABB0034 
NCAM18           MOVE FECHA-MEJOR-BDLDIR                                ABB0034
NCAM18                              TO V-FECCRETEL-BDLDIR(TEL-OK-BDLDIR)ABB0034 
RCNCER           MOVE FECHA-MEJOR-BDLDIR                                RMB0010 
RCNCER                TO V-FECHATEL-BDLDIR(TEL-OK-BDLDIR)               RMB0010 
TELEXC           MOVE FECULT-DIRECC                                     AAM0017
TELEXC                TO V-FECULTTEL-BDLDIR(TEL-OK-BDLDIR)              AAM0017
REPLUS           PERFORM 2018-BUSCAR-DUPCIUDAD
REPLUS           MOVE CODIGO-RES(1:2) TO COD-DPTO
REPLUS           IF COD-DPTO > 0 AND SW-DUPCIUDAD = 0
REPLUS              MOVE T-NOM-DEP-DANE(COD-DPTO) TO 
REPLUS                   V-DEPTEL-BDLDIR(TEL-OK-BDLDIR)
REPLUS           END-IF
      *
RCNCER           ADD 1 TO TEL-OK-BDLDIR                                 RMB0010
              END-IF
LLENAR     END-IF.
      *
AMPDIR     IF CIULAB-DIRECC NOT = SPACES                                FAC0009 
RCNCER        IF DIRLAB-DIRECC NOT = SPACES AND DIR-OK-BDLDIR < 100     RMB0010 
RCNCER           MOVE DIRLAB-DIRECC TO V-DIRECCION-BDLDIR(DIR-OK-BDLDIR)RMB0010 
RCNCER           MOVE "L"           TO V-TIPODIR-BDLDIR(DIR-OK-BDLDIR)  RMB0010 
RCNCER                                 IND-DATO-BDLDIR                  RMB0010 
RCNCER           MOVE CIULAB-DIRECC TO V-CIUDADDIR-BDLDIR(DIR-OK-BDLDIR)RMB0010 
RCNCER           MOVE COD-SUS-DIRECC TO V-SUSDIR-BDLDIR(DIR-OK-BDLDIR)  RMB0010 
RCNCER           MOVE DIRLAB-DIRECC TO T-CARDIR-BDLDIR                  RMB0010 
FASEII           PERFORM 2019-ELEGIR-FECHA-DIR                          VHF0015 
NCAM18           MOVE 1             TO V-NUMENT-BDLDIR(DIR-OK-BDLDIR)   ABB0034 
NCAM19           MOVE 2             TO V-TIPODI-BDLDIR(DIR-OK-BDLDIR)   ABB0034 
NCAM18           MOVE FECHA-MEJOR-BDLDIR                                ABB0034
NCAM18                              TO V-FECCRE-BDLDIR(DIR-OK-BDLDIR)   ABB0034 
RCNCER           MOVE FECHA-MEJOR-BDLDIR                                RMB0010 
RCNCER                TO V-FECHADIR-BDLDIR(DIR-OK-BDLDIR)               RMB0010 
UNIDIR           MOVE FECULT-DIRECC TO V-FECULT-BDLDIR(DIR-OK-BDLDIR)   AAM0017

REPLUS           MOVE CIULAB-DIRECC TO CIUDAD-BDLDIRESTR
REPLUS                                 DUPCIUDAD-BDLDIR
REPLUS           MOVE DIRLAB-DIRECC TO DIRECC-BDLDIRESTR
REPLUS           MOVE CODIGO-LAB    TO DANE-BDLDIRESTR
REPLUS           MOVE CODIGO-LAB(1:2) TO COD-DPTO
REPLUS           PERFORM 2018-BUSCAR-DUPCIUDAD
REPLUS           READ BDLDIRESTR INVALID KEY
REPLUS              MOVE ZEROS TO V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)
RECPF2                            V-PRBENTDIR-BDLDIR(DIR-OK-BDLDIR)     HGO0022
REPLUS              MOVE SPACES TO V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS                             V-ESTRATODIR-BDLDIR(DIR-OK-BDLDIR)
NCAM18              MOVE CODIGO-LAB TO V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)  ABB0034 
REPLUS           NOT INVALID KEY
REPLUS              MOVE CODDANE-BDLDIRESTR TO 
REPLUS                                 V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS              MOVE DEPEST-BDLDIRESTR TO 
REPLUS                                 V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS              MOVE ESTR-BDLDIRESTR TO
REPLUS                              V-ESTRATODIR-BDLDIR(DIR-OK-BDLDIR)
RECPF2              MOVE PRBENT-BDLDIRESTR TO                           HGO0022
RECPF2                              V-PRBENTDIR-BDLDIR(DIR-OK-BDLDIR)   HGO0022
REPLUS           END-READ
REPLUS           IF V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR) = SPACES
REPLUS           AND COD-DPTO > 0 AND SW-DUPCIUDAD = 0
REPLUS              MOVE T-NOM-DEP-DANE(COD-DPTO) TO
REPLUS                   V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS           END-IF
      *
NCAM18           PERFORM 2018-CALCULAR-ZONA                             ABB0034 
AMPDIR           PERFORM 2020-U-BUSCAR-NUMEROS                          FAC0009 
AMPDIR        END-IF                                                    FAC0009 
      *
RCNCER        IF TELLAB-DIRECC > 0 AND TEL-OK-BDLDIR < 100 AND          RMB0010 
AMPDIR           TELLAB-DIRECC < 9999999999                             FAC0009 
RCNCER           MOVE CIULAB-DIRECC TO V-CIUDADTEL-BDLDIR(TEL-OK-BDLDIR)RMB0010 
REPLUS                                 DUPCIUDAD-BDLDIR
RCNCER           MOVE TELLAB-DIRECC TO V-TELEFONO-BDLDIR(TEL-OK-BDLDIR) RMB0010 
RCNCER                              V-HASTEL-BDLDIR(TEL-OK-BDLDIR)      RMB0010 
RCNCER           MOVE COD-SUS-DIRECC TO V-SUSTEL-BDLDIR(TEL-OK-BDLDIR)  RMB0010 
RCNCER           MOVE "L"           TO V-TIPOTEL-BDLDIR(TEL-OK-BDLDIR)  RMB0010 
RCNCER                                 IND-DATO-BDLDIR                  RMB0010 
FASEII           PERFORM 2019-ELEGIR-FECHA-TEL                          VHF0015 
NCAM18           MOVE 1             TO V-NUMENTTEL-BDLDIR(TEL-OK-BDLDIR)ABB0034 
NCAM19           MOVE 2             TO V-TIPOTE-BDLDIR   (TEL-OK-BDLDIR)ABB0034 
NCAM18           MOVE FECHA-MEJOR-BDLDIR                                ABB0034
NCAM18                              TO V-FECCRETEL-BDLDIR(TEL-OK-BDLDIR)ABB0034
RCNCER           MOVE FECHA-MEJOR-BDLDIR                                RMB0010 
RCNCER                TO V-FECHATEL-BDLDIR(TEL-OK-BDLDIR)               RMB0010 
TELEXC           MOVE FECULT-DIRECC                                     AAM0017
TELEXC                TO V-FECULTTEL-BDLDIR(TEL-OK-BDLDIR)              AAM0017

REPLUS           PERFORM 2018-BUSCAR-DUPCIUDAD
REPLUS           MOVE CODIGO-LAB(1:2) TO COD-DPTO
REPLUS           IF COD-DPTO > 0 AND SW-DUPCIUDAD = 0
REPLUS              MOVE T-NOM-DEP-DANE(COD-DPTO) TO
REPLUS                   V-DEPTEL-BDLDIR(TEL-OK-BDLDIR)
REPLUS           END-IF
      *
RCNCER           ADD 1 TO TEL-OK-BDLDIR                                 RMB0010 
AMPDIR        END-IF                                                    FAC0009 
AMPDIR     END-IF.                                                      FAC0009
      *
RCNCER     IF CIUCOR-DIRECC NOT = SPACES AND DIR-OK-BDLDIR < 100 AND    RMB0010 
LLENAR        DIRCOR-DIRECC NOT = SPACES
RCNCER        MOVE CIUCOR-DIRECC TO V-CIUDADDIR-BDLDIR(DIR-OK-BDLDIR)   RMB0010 
RCNCER        MOVE DIRCOR-DIRECC TO V-DIRECCION-BDLDIR(DIR-OK-BDLDIR)   RMB0010 
RCNCER        MOVE COD-SUS-DIRECC TO V-SUSDIR-BDLDIR(DIR-OK-BDLDIR)     RMB0010 
RCNCER        MOVE "C"           TO V-TIPODIR-BDLDIR(DIR-OK-BDLDIR)     RMB0010 
RCNCER                              IND-DATO-BDLDIR                     RMB0010 
RCNCER        MOVE DIRCOR-DIRECC TO T-CARDIR-BDLDIR                     RMB0010 
FASEII        PERFORM 2019-ELEGIR-FECHA-DIR                             VHF0015 
NCAM18        MOVE 1             TO V-NUMENT-BDLDIR(DIR-OK-BDLDIR)      ABB0034 
NCAM19        MOVE 4             TO V-TIPODI-BDLDIR(DIR-OK-BDLDIR)      ABB0034 
NCAM18        MOVE FECHA-MEJOR-BDLDIR                                   ABB0034
NCAM18                           TO V-FECCRE-BDLDIR(DIR-OK-BDLDIR)      ABB0034 
RCNCER        MOVE FECHA-MEJOR-BDLDIR                                   RMB0010 
RCNCER             TO V-FECHADIR-BDLDIR(DIR-OK-BDLDIR)                  RMB0010 
UNIDIR        MOVE FECULT-DIRECC TO V-FECULT-BDLDIR(DIR-OK-BDLDIR)      AAM0017
              
REPLUS        MOVE CIUCOR-DIRECC TO CIUDAD-BDLDIRESTR
REPLUS                              DUPCIUDAD-BDLDIR
REPLUS        MOVE DIRCOR-DIRECC TO DIRECC-BDLDIRESTR
REPLUS        MOVE CODIGO-COR    TO DANE-BDLDIRESTR
REPLUS        MOVE CODIGO-COR(1:2) TO COD-DPTO
REPLUS        PERFORM 2018-BUSCAR-DUPCIUDAD
REPLUS        READ BDLDIRESTR INVALID KEY
REPLUS           MOVE ZEROS TO V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)
RECPF2                       V-PRBENTDIR-BDLDIR(DIR-OK-BDLDIR)          HGO0022
REPLUS           MOVE SPACES TO V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS                     V-ESTRATODIR-BDLDIR(DIR-OK-BDLDIR)
NCAM18           MOVE CODIGO-COR TO V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)     ABB0034 
REPLUS        NOT INVALID KEY
REPLUS           MOVE CODDANE-BDLDIRESTR TO 
REPLUS                              V-DANEDIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS           MOVE DEPEST-BDLDIRESTR TO 
REPLUS                              V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)
REPLUS           MOVE ESTR-BDLDIRESTR TO
REPLUS                           V-ESTRATODIR-BDLDIR(DIR-OK-BDLDIR)
RECPF2           MOVE PRBENT-BDLDIRESTR TO                                HGO0022
RECPF2                           V-PRBENTDIR-BDLDIR(DIR-OK-BDLDIR)      HGO0022
REPLUS        END-READ
      *
REPLUS        IF V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR) = SPACES
REPLUS        AND COD-DPTO > 0 AND SW-DUPCIUDAD = 0
REPLUS           MOVE T-NOM-DEP-DANE(COD-DPTO) TO
REPLUS              V-DEPTODIR-BDLDIR(DIR-OK-BDLDIR)             
REPLUS        END-IF
      *
NCAM18        PERFORM 2018-CALCULAR-ZONA                                ABB0034 
LLENAR        PERFORM 2020-U-BUSCAR-NUMEROS
LLENAR     END-IF.

REPLUS     IF TELCEL-DIRECC > 0 AND CEL-OK-BDLDIR < 100 AND
REPLUS        TELCEL-DIRECC < 9999999999
REPLUS        MOVE TELCEL-DIRECC TO V-CELULAR-BDLDIR(CEL-OK-BDLDIR)
REPLUS                          V-HASCEL-BDLDIR(CEL-OK-BDLDIR)
REPLUS        MOVE COD-SUS-DIRECC TO V-SUSCEL-BDLDIR(CEL-OK-BDLDIR)
REPLUS        PERFORM 2019-ELEGIR-FECHA-CEL
NCAM18        MOVE 1             TO V-NUMENTCEL-BDLDIR(CEL-OK-BDLDIR)   ABB0034 
NCAM18        MOVE FECHA-MEJOR-BDLDIR                                   ABB0034
NCAM18             TO V-FECCRECEL-BDLDIR(CEL-OK-BDLDIR)                 ABB0034 
REPLUS        MOVE FECHA-MEJOR-BDLDIR 
REPLUS             TO V-FECHACEL-BDLDIR(CEL-OK-BDLDIR) 
REPLUS        MOVE FECULT-DIRECC
REPLUS             TO V-FECULTCEL-BDLDIR(CEL-OK-BDLDIR)
REPLUS        MOVE 3 TO V-ORIGENCEL-BDLDIR(CEL-OK-BDLDIR)
REPLUS        ADD 1 TO CEL-OK-BDLDIR 
REPLUS     END-IF.
      *
REPLUS     IF E-MAIL-DIRECC NOT = SPACES AND MAIL-OK-BDLDIR < 100
AJCONT        MOVE FUNCTION LOWER-CASE (E-MAIL-DIRECC) TO E-MAIL-DIRECC FARF035
REPLUS        MOVE E-MAIL-DIRECC TO V-MAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS                          V-HASMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        MOVE COD-SUS-DIRECC TO V-SUSMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        PERFORM 2019-ELEGIR-FECHA-MAIL
NCAM18        MOVE 1             TO V-NUMENTMAIL-BDLDIR(MAIL-OK-BDLDIR) ABB0034 
NCAM18        MOVE FECHA-MEJOR-BDLDIR                                   ABB0034
NCAM18             TO V-FECCREMAIL-BDLDIR(MAIL-OK-BDLDIR)               ABB0034 
REPLUS        MOVE FECHA-MEJOR-BDLDIR 
REPLUS             TO V-FECHAMAIL-BDLDIR(MAIL-OK-BDLDIR) 
REPLUS        MOVE FECULT-DIRECC
REPLUS             TO V-FECULTMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        MOVE 3 TO V-ORIGENMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        ADD 1 TO MAIL-OK-BDLDIR 
REPLUS     END-IF.
NCAM18*                                                                *ABB0034 
NCAM18 2018-CALCULAR-ZONA.                                              ABB0034 
NCAM18******************************************************************ABB0034 
NCAM18*    A PARTIR DEL CODIGO DANE DE LA CIUDAD SE CALCULA LA ZONA    *ABB0034 
NCAM18*    R RURAL, U URBANA - NO DETERMINADA                          *ABB0034 
NCAM18*                                                                *ABB0034 
NCAM18******************************************************************ABB0034 
NCAM18     MOVE "-" TO V-ZONADIR-BDLDIR(DIR-OK-BDLDIR)                  ABB0034 
NCAM18     MOVE V-DANEDIR-BDLDIR(DIR-OK-BDLDIR) TO CODANE-BDLDI2        ABB0034 
NCAM18     IF CODANE-BDLDI2 NOT = ZEROS                                 ABB0034 
NCAM18        IF CODANE-BDLDI2(6:3) = "000"                             ABB0034 
NCAM18           MOVE "U" TO V-ZONADIR-BDLDIR(DIR-OK-BDLDIR)            ABB0034 
NCAM18        ELSE                                                      ABB0034 
NCAM18           MOVE "R" TO V-ZONADIR-BDLDIR(DIR-OK-BDLDIR)            ABB0034 
NCAM18        END-IF                                                    ABB0034 
NCAM18     END-IF.                                                      ABB0034 
NCAM18******************************************************************ABB0034 
CELU01 2011-EXTRACTAR-CEL-BDLDIR.                                       RMB0025
CELU01     MOVE TELLAB-DIRECC TO TEL-AUX-BDLDIR.                        RMB0025
CELU01     IF ES-CELULAR-BDLDIR AND P1-TEL-AUX-BDLDIR = 0               RMB0025
CELU01        MOVE "L"  TO IND-DATO-BDLDIR                              RMB0025
CELU01        PERFORM 2019-ELEGIR-FECHA-TEL                             RMB0025
CELU01        MOVE FECHA-MEJOR-BDLDIR TO FECHA-APERT-ICBDIM             RMB0025
CELU01        MOVE FECULT-DIRECC      TO FEC-AUX-BDLDIR                 RMB0025 
CELU01        MOVE FEC-AUX-BDLDIR     TO FECHA-ACT-ICBDIM               RMB0025
CELU01        MOVE TELLAB-DIRECC TO TEL-CEL-ICBDIM                      RMB0025
CELU01        MOVE 3             TO ORIGEN-ICBDIM                       RMB0025
CELU01        MOVE SPACES        TO E-MAIL-ICBDIM                       RMB0025
CELU01        PERFORM 2018-U-PASAR-REG-ICBDIM                           RMB0025
CELU01        MOVE 0             TO TELLAB-DIRECC                       RMB0025
CELU01     END-IF.                                                      RMB0025
CELU01     MOVE TELRES-DIRECC TO TEL-AUX-BDLDIR.                        RMB0025
CELU01     IF ES-CELULAR-BDLDIR AND P1-TEL-AUX-BDLDIR = 0               RMB0025
CELU01        MOVE "R"  TO IND-DATO-BDLDIR                              RMB0025
CELU01        PERFORM 2019-ELEGIR-FECHA-TEL                             RMB0025
CELU01        MOVE FECHA-MEJOR-BDLDIR TO FECHA-APERT-ICBDIM             RMB0025
CELU01        MOVE FECULT-DIRECC      TO FEC-AUX-BDLDIR                 RMB0025 
CELU01        MOVE FEC-AUX-BDLDIR     TO FECHA-ACT-ICBDIM               RMB0025
CELU01        MOVE TELRES-DIRECC  TO TEL-CEL-ICBDIM                     RMB0025
CELU01        MOVE 3             TO ORIGEN-ICBDIM                       RMB0025
CELU01        MOVE SPACES        TO E-MAIL-ICBDIM                       RMB0025
CELU01        PERFORM 2018-U-PASAR-REG-ICBDIM                           RMB0025
CELU01        MOVE 0             TO TELRES-DIRECC                       RMB0025
CELU01     END-IF.                                                      RMB0025
REPLUS 2018-CARGA-DUPCIUDAD.
REMARK******************************************************************
REPLUS*2018-CARGA-DUPCIUDAD.
REMARK******************************************************************
REPLUS*     MOVE 1 TO CON-DUPCIUDAD
REPLUS     IF FIN-DUPCIUDAD = 0
REPLUS      READ DUPCIUDAD AT END MOVE 1 TO FIN-DUPCIUDAD
REPLUS      NOT AT END 
REPLUS         MOVE REG-DUPCIUDAD TO T-DUPCIUDAD(CON-DUPCIUDAD)
REPLUS         ADD 1 TO CON-DUPCIUDAD
REPLUS      END-READ
REPLUS     END-IF.
REPLUS 2018-BUSCAR-DUPCIUDAD.
REMARK*========================================================*
REMARK*2018-BUSCAR-DUPCIUDAD.
REMARK* Busca en tabla de memoria si existe la ciudad
REMARK*========================================================*
REPLUS     MOVE 1 TO CON1-DUPCIUDAD
REPLUS     MOVE 0 TO SW-DUPCIUDAD
REPLUS     PERFORM UNTIL CON1-DUPCIUDAD > 99
REPLUS       IF CIUDAD-DUPCIUDAD(CON1-DUPCIUDAD) = DUPCIUDAD-BDLDIR
REPLUS         MOVE 1 TO SW-DUPCIUDAD
REPLUS         MOVE 100 TO CON1-DUPCIUDAD
REPLUS       END-IF
REPLUS       ADD 1 TO CON1-DUPCIUDAD
REPLUS     END-PERFORM.
REPLUS 2018-U-PASAR-REG-ICBDIM.
REMARK******************************************************************
REMARK* SE TOMAN LOS DATOS DEL REGISTRO DE ICBDIM Y SE PASAN A LOS     *
REMARK* SIGUIENTES VECTORES:                                           *
REPLUS*        CELULARES       V-CELULAR        CELULAR
REPLUS*                        V-SUSCEL         CODIGO SUSCRIPTOR
REPLUS*                        V-FECHACEL       FECHA MEJOR
REPLUS*        MAILS           V-MAIL           EMAIL
REPLUS*                        V-SUSMAIL        CODIGO SUSCRIPTOR
REPLUS*                        V-FECHAMAIL      FECHA MEJOR
REMARK******************************************************************
REPLUS     IF TEL-CEL-ICBDIM > 0 AND CEL-OK-BDLDIR < 100 AND
REPLUS        TEL-CEL-ICBDIM < 9999999999
REPLUS        MOVE TEL-CEL-ICBDIM TO V-CELULAR-BDLDIR(CEL-OK-BDLDIR)
REPLUS                          V-HASCEL-BDLDIR(CEL-OK-BDLDIR)
REPLUS        PERFORM 2019-ELEGIR-FECHA-CELDIM
NCAM18        MOVE 1             TO V-NUMENTCEL-BDLDIR(CEL-OK-BDLDIR)   ABB0034
NCAM18        MOVE FECHA-MEJOR-BDLDIR                                   ABB0034
NCAM18                           TO V-FECCRECEL-BDLDIR(CEL-OK-BDLDIR)   ABB0034
REPLUS        MOVE FECHA-MEJOR-BDLDIR 
REPLUS             TO V-FECHACEL-BDLDIR(CEL-OK-BDLDIR) 
REPLUS        MOVE FECHA-ACT-ICBDIM
REPLUS             TO V-FECULTCEL-BDLDIR(CEL-OK-BDLDIR)
REPLUS        IF ORIGEN-ICBDIM = 1
REPLUS           MOVE 990003 TO V-SUSCEL-BDLDIR(CEL-OK-BDLDIR)
REPLUS        ELSE 
CELU01         IF ORIGEN-ICBDIM = 2                                     RMB0025
CELU01            MOVE 990005 TO V-SUSCEL-BDLDIR(CEL-OK-BDLDIR)         RMB0025
CELU01         ELSE                                                     RMB0025
CELU01            MOVE COD-SUS-DIRECC TO V-SUSCEL-BDLDIR(CEL-OK-BDLDIR) RMB0025
CELU01         END-IF                                                   RMB0025
REPLUS        END-IF
REPLUS        MOVE ORIGEN-ICBDIM TO V-ORIGENCEL-BDLDIR(CEL-OK-BDLDIR)
REPLUS        ADD 1 TO CEL-OK-BDLDIR 
REPLUS     END-IF.
REPLUS     IF E-MAIL-ICBDIM NOT = SPACES AND MAIL-OK-BDLDIR < 100
AJCONT        MOVE FUNCTION LOWER-CASE (E-MAIL-ICBDIM) TO E-MAIL-ICBDIM FARF035
REPLUS        MOVE E-MAIL-ICBDIM TO V-MAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS                          V-HASMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        PERFORM 2019-ELEGIR-FECHA-CELDIM
NCAM18        MOVE 1             TO V-NUMENTMAIL-BDLDIR(MAIL-OK-BDLDIR) ABB0034
NCAM18        MOVE FECHA-MEJOR-BDLDIR                                   ABB0034
NCAM18                           TO V-FECCREMAIL-BDLDIR(MAIL-OK-BDLDIR) ABB0034
REPLUS        MOVE FECHA-MEJOR-BDLDIR 
REPLUS             TO V-FECHAMAIL-BDLDIR(MAIL-OK-BDLDIR) 
REPLUS        MOVE FECHA-ACT-ICBDIM
REPLUS             TO V-FECULTMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        IF ORIGEN-ICBDIM = 1
REPLUS           MOVE 990003 TO V-SUSMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        ELSE 
REPLUS           MOVE 990005 TO V-SUSMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        END-IF
REPLUS        MOVE ORIGEN-ICBDIM TO V-ORIGENMAIL-BDLDIR(MAIL-OK-BDLDIR)
REPLUS        ADD 1 TO MAIL-OK-BDLDIR 
REPLUS     END-IF.

FASEII 2019-ELEGIR-FECHA-DIR.                                           VHF0015 
REMARK******************************************************************RMB0010
REMARK*2019-ELEGIR-FECHA-DIR.                                          *VHF0015
REMARK*    RUTINA PARA SELECCIONAR LA MEJOR FECHA DEL DATO EN PROCESO  *RMB0010
REMARK******************************************************************RMB0010
REMARK***  POR DEFECTO SE TOMA LA MEJOR FECHA ENTRE LA DE ACTUALIZACION RMB0010
REMARK***  Y LA DE CREACION                                             RMB0010                                  
FECH01*    IF FECACT-DIRECC >  FECCRE-DIRECC                            RMB0016 
FECH01*       MOVE FECACT-DIRECC TO FECHA-MEJOR-BDLDIR                  RMB0016 
FECH01*    ELSE                                                         RMB0016 
FECH01*       MOVE FECAPE-DIRECC TO FECHA-MEJOR-BDLDIR                  RMB0016 
FECH01*    END-IF.                                                      RMB0016 
FECH01     MOVE FECAPE-DIRECC TO FECHA-MEJOR-BDLDIR *> DEFAULT SI ES 0  RMB0016 
REMARK***  SI EXISTE LA FECHA ASOCIADA AL TIPO DE DATO SE TOMA COMO LA  RMB0010
REMARK***  MEJOR
RCNCER     EVALUATE IND-DATO-BDLDIR                                     RMB0010 
RCNCER        WHEN "R"                                                  RMB0010 
FASEII           IF FECDRES-DIRECC > 0                                  VHF0015 
FASEII              MOVE FECDRES-DIRECC TO FECHA-MEJOR-BDLDIR           VHF0015 
RCNCER           END-IF                                                 RMB0010 
RCNCER        WHEN "L"                                                  RMB0010 
RCNCER           IF FECDLAB-DIRECC > 0                                  VHF0015 
FASEII              MOVE FECDLAB-DIRECC TO FECHA-MEJOR-BDLDIR           VHF0015 
RCNCER           END-IF                                                 RMB0010 
RCNCER        WHEN "C"                                                  RMB0010 
FASEII           IF FECDCOR-DIRECC > 0                                  VHF0015 
FASEII              MOVE FECDCOR-DIRECC TO FECHA-MEJOR-BDLDIR           VHF0015 
RCNCER           END-IF                                                 RMB0010 
RCNCER     END-EVALUATE.                                                RMB0010 

FASEII 2019-ELEGIR-FECHA-TEL.                                           VHF0015 
REMARK******************************************************************VHF0015
REMARK*2019-ELEGIR-FECHA-TEL.                                          *VHF0015
REMARK*    FECHAS PARA EL MEJOR TELEFONO                               *VHF0015
REMARK*    RUTINA PARA SELECCIONAR LA MEJOR FECHA DEL DATO EN PROCESO  *VHF0015
REMARK******************************************************************VHF0015
REMARK***  POR DEFECTO SE TOMA LA MEJOR FECHA ENTRE LA DE ACTUALIZACION VHF0015
REMARK***  Y LA DE CREACION                                             VHF0015
FECH01*    IF FECACT-DIRECC >  FECCRE-DIRECC                            RMB0016 
FECH01*       MOVE FECACT-DIRECC TO FECHA-MEJOR-BDLDIR                  RMB0016 
FECH01*    ELSE                                                         RMB0016 
FECH01*       MOVE FECAPE-DIRECC TO FECHA-MEJOR-BDLDIR                  RMB0016 
FECH01*    END-IF.                                                      RMB0016 
FECH01     MOVE FECAPE-DIRECC TO FECHA-MEJOR-BDLDIR *> DEFAULT SI ES 0  RMB0016 
REMARK***  SI EXISTE LA FECHA ASOCIADA AL TIPO DE DATO SE TOMA COMO LA  VHF0015
REMARK***  MEJOR                                                        VHF0015
FASEII     EVALUATE IND-DATO-BDLDIR                                     VHF0015
FASEII        WHEN "R"                                                  VHF0015
FASEII           IF FECTRES-DIRECC > 0                                  VHF0015
FASEII              MOVE FECTRES-DIRECC TO FECHA-MEJOR-BDLDIR           VHF0015
FASEII           END-IF                                                 VHF0015
FASEII        WHEN "L"                                                  VHF0015
FASEII           IF FECTLAB-DIRECC > 0                                  VHF0015
FASEII              MOVE FECTLAB-DIRECC TO FECHA-MEJOR-BDLDIR           VHF0015
FASEII           END-IF                                                 VHF0015
FASEII     END-EVALUATE.                                                VHF0015

REPLUS 2019-ELEGIR-FECHA-CEL.
REMARK******************************************************************
REMARK*2019-ELEGIR-FECHA-CEL.                                          *
REMARK*    FECHAS PARA EL MEJOR CELULAR                                *
REMARK*    RUTINA PARA SELECCIONAR LA MEJOR FECHA DEL DATO EN PROCESO  *
REMARK******************************************************************
REMARK***  POR DEFECTO SE TOMA LA MEJOR FECHA ENTRE LA DE ACTUALIZACION
REMARK***  Y LA DE CREACION
REPLUS     MOVE FECAPE-DIRECC TO FECHA-MEJOR-BDLDIR *> DEFAULT SI ES 0 
REMARK***  SI EXISTE LA FECHA ASOCIADA AL TIPO DE DATO SE TOMA COMO LA
REMARK***  MEJOR
REPLUS     IF FECCEL-DIRECC > 0
REPLUS        MOVE FECCEL-DIRECC TO FECHA-MEJOR-BDLDIR
REPLUS     END-IF.
REPLUS 2019-ELEGIR-FECHA-CELDIM.
REMARK******************************************************************
REMARK*2019-ELEGIR-FECHA-CEL.                                          *
REMARK*    FECHAS PARA EL MEJOR CELULAR                                *
REMARK*    RUTINA PARA SELECCIONAR LA MEJOR FECHA DEL DATO EN PROCESO  *
REMARK******************************************************************
REMARK***  POR DEFECTO SE TOMA LA MEJOR FECHA ENTRE LA DE ACTUALIZACION
REMARK***  Y LA DE CREACION
REPLUS     MOVE FECHA-APERT-ICBDIM TO FECHA-MEJOR-BDLDIR
REMARK***  SI EXISTE LA FECHA ASOCIADA AL TIPO DE DATO SE TOMA COMO LA
REMARK***  MEJOR
CELU01*    IF FECHA-ACT-ICBDIM > 0
CELU01*       MOVE FECHA-ACT-ICBDIM TO FECHA-MEJOR-BDLDIR
CELU01*    END-IF.
CELU01     IF FECHA-ACT-ICBDIM = 0
CELU01        MOVE  FECHA-APERT-ICBDIM TO FECHA-MEJOR-BDLDIR
CELU01     END-IF.
REPLUS 2019-ELEGIR-FECHA-MAIL.
REMARK******************************************************************
REMARK*2019-ELEGIR-FECHA-MAIL.                                         *
REMARK*    FECHAS PARA EL MEJOR MAIL                                   *
REMARK*    RUTINA PARA SELECCIONAR LA MEJOR FECHA DEL DATO EN PROCESO  *
REMARK******************************************************************
REMARK***  POR DEFECTO SE TOMA LA MEJOR FECHA ENTRE LA DE ACTUALIZACION
REMARK***  Y LA DE CREACION
REPLUS     MOVE FECAPE-DIRECC TO FECHA-MEJOR-BDLDIR *> DEFAULT SI ES 0 
REMARK***  SI EXISTE LA FECHA ASOCIADA AL TIPO DE DATO SE TOMA COMO LA
REMARK***  MEJOR
REPLUS     IF FECMAIL-DIRECC > 0
REPLUS        MOVE FECMAIL-DIRECC TO FECHA-MEJOR-BDLDIR
REPLUS     END-IF.

LLENAR 2020-U-BUSCAR-NUMEROS.
RCNCER     MOVE 1 TO I-BDLDIR.                                          RMB0010 
RCNCER     MOVE 0 TO J-BDLDIR.                                          RMB0010 
RCNCER     MOVE " " TO CAR-ANT-BDLDIR.                                  RMB0010 
RCNCER     INITIALIZE T-CARTOT-BDLDIR.                                  RMB0010 
CARTOT     PERFORM UNTIL I-BDLDIR > 60 OR J-BDLDIR >= 10                CAV0014 
RCNCER       IF V-CARDIR-BDLDIR(I-BDLDIR) NUMERIC                       RMB0010 
RCNCER          MOVE V-CARDIR-BDLDIR(I-BDLDIR) TO CAR-ACT-BDLDIR        RMB0010 
RCNCER          IF CAR-ANT-BDLDIR NUMERIC                               RMB0010 
RCNCER             COMPUTE V-CARTOT-BDLDIR(J-BDLDIR)                    RMB0010 
RCNCER                     = V-CARTOT-BDLDIR(J-BDLDIR)                  RMB0010 
RCNCER                     * 10 + CAR-ACT-BDLDIR                        RMB0010 
LLENAR          ELSE
RCNCER             ADD 1 TO J-BDLDIR                                    RMB0010 
RCNCER             MOVE V-CARDIR-BDLDIR(I-BDLDIR)                       RMB0010 
RCNCER                  TO V-CARTOT-BDLDIR(J-BDLDIR)                    RMB0010 
LLENAR          END-IF
LLENAR       END-IF
RCNCER       MOVE V-CARDIR-BDLDIR(I-BDLDIR) TO CAR-ANT-BDLDIR           RMB0010 
RCNCER       ADD 1 TO I-BDLDIR                                          RMB0010 
LLENAR     END-PERFORM.
RCNCER     MOVE T-CARTOT-BDLDIR(1:10) TO V-PRIDIG-BDLDIR(DIR-OK-BDLDIR).RMB0010 
RCNCER     SORT V-CARTOT-BDLDIR DESCENDING.                             RMB0010 
RCNCER     MOVE 1 TO I-BDLDIR.                                          RMB0010 
RCNCER     PERFORM UNTIL I-BDLDIR > J-BDLDIR                            RMB0010 
RCNCER       MOVE V-CARTOT-BDLDIR(I-BDLDIR)                             RMB0010 
RCNCER            TO V-NUMDIR-BDLDIR(DIR-OK-BDLDIR,I-BDLDIR)            RMB0010 
RCNCER       ADD 1 TO I-BDLDIR                                          RMB0010 
LLENAR     END-PERFORM.
RCNCER     MOVE T-CARTOT-BDLDIR    TO V-HASDIR-BDLDIR(DIR-OK-BDLDIR).   RMB0010 
RCNCER     ADD 1 TO DIR-OK-BDLDIR.                                      RMB0010 
NCAM18*                                                                *ABB0034 
NCAM18 2017-CALCULAR-ENTIDADES.                                         ABB0034 
NCAM18******************************************************************ABB0034 
NCAM18*    CUENTA EL NUMERO DE ENTIDADES QUE REPORTAN LA MISMA         *ABB0034 
NCAM18*    DIRECCION                                                   *ABB0034 
NCAM18*                                                                *ABB0034 
NCAM18******************************************************************ABB0034 
NCAM18     MOVE 1 TO I-BDLDIR                                           ABB0034 
NCAM18     PERFORM UNTIL I-BDLDIR >= DIR-OK-BDLDIR                      ABB0034 
NCAM19       MOVE ZEROS TO I-RES-BDLDIR I-LAB-BDLDIR I-COR-BDLDIR       ABB0034 
NCAM18       MOVE 1     TO K-BDLDIR                                     ABB0034 
NCAM18       INITIALIZE TABLA-SUS-BDLDIR                                ABB0034
NCAM18       MOVE 1     TO I-SUS-BDLDIR                                 ABB0034 
NCAM18       MOVE V-SUSDIR-BDLDIR(I-BDLDIR) TO COD-SUSCRIP-ABD02        ABB0034 
NCAM18       PERFORM 2017-LEER-SUSCRIPTOR                               ABB0034 
NCAM18       MOVE NIT-SUSCRIP-S-ABD02 TO V-SUS-BDLDIR(I-SUS-BDLDIR)     ABB0034 
NCAM18       PERFORM UNTIL K-BDLDIR >= DIR-OK-BDLDIR                    ABB0034 
NCAM18         IF V-DIRECCION-BDLDIR(I-BDLDIR) =                        ABB0034 
NCAM18            V-DIRECCION-BDLDIR(K-BDLDIR)                          ABB0034 
NCAM18            IF V-FECCRE-BDLDIR(I-BDLDIR) >                        ABB0034 
NCAM18               V-FECCRE-BDLDIR(K-BDLDIR)                          ABB0034 
NCAM18               MOVE V-FECCRE-BDLDIR(K-BDLDIR) TO                  ABB0034 
NCAM18                    V-FECCRE-BDLDIR(I-BDLDIR)                     ABB0034 
NCAM18            ELSE                                                  ABB0034 
NCAM18               MOVE V-FECCRE-BDLDIR(I-BDLDIR) TO                  ABB0034 
NCAM18                    V-FECCRE-BDLDIR(K-BDLDIR)                     ABB0034 
NCAM18            END-IF                                                ABB0034 
NCAM19            IF V-TIPODIR-BDLDIR(K-BDLDIR) = "R"                   ABB0034 
NCAM19               MOVE 1 TO I-RES-BDLDIR                             ABB0034 
NCAM19            END-IF                                                ABB0034 
NCAM19            IF V-TIPODIR-BDLDIR(K-BDLDIR) = "L"                   ABB0034 
NCAM19               MOVE 2 TO I-LAB-BDLDIR                             ABB0034 
NCAM19            END-IF                                                ABB0034 
NCAM19            IF V-TIPODIR-BDLDIR(K-BDLDIR) = "C"                   ABB0034 
NCAM19               MOVE 4 TO I-COR-BDLDIR                             ABB0034 
NCAM19            END-IF                                                ABB0034 
NCAM18            MOVE V-SUSDIR-BDLDIR(K-BDLDIR) TO COD-SUSCRIP-ABD02   ABB0034 
NCAM18            PERFORM 2017-LEER-SUSCRIPTOR                          ABB0034 
NCAM18            MOVE NIT-SUSCRIP-S-ABD02 TO N-SUS-BDLDIR              ABB0034 
NCAM18            MOVE 1 TO K-SUS-BDLDIR                                ABB0034 
NCAM18            MOVE 0 TO J-SUS-BDLDIR                                ABB0034 
NCAM18            PERFORM UNTIL K-SUS-BDLDIR > I-SUS-BDLDIR             ABB0034 
NCAM18              IF N-SUS-BDLDIR = V-SUS-BDLDIR(K-SUS-BDLDIR)        ABB0034
NCAM18                 MOVE 1 TO J-SUS-BDLDIR                           ABB0034 
NCAM18                 MOVE I-SUS-BDLDIR TO K-SUS-BDLDIR                ABB0034 
NCAM18              END-IF                                              ABB0034 
NCAM18              ADD 1 TO K-SUS-BDLDIR                               ABB0034 
NCAM18            END-PERFORM                                           ABB0034 
NCAM18            IF J-SUS-BDLDIR = 0                                   ABB0034 
NCAM18               ADD  1 TO I-SUS-BDLDIR                             ABB0034 
NCAM18               MOVE N-SUS-BDLDIR TO V-SUS-BDLDIR(I-SUS-BDLDIR)    ABB0034 
NCAM18            END-IF                                                ABB0034
NCAM18         END-IF                                                   ABB0034 
NCAM18         ADD 1 TO K-BDLDIR                                        ABB0034 
NCAM18       END-PERFORM                                                ABB0034 
NCAM19       COMPUTE I-SDT-BDLDIR =                                     ABB0034 
NCAM19               I-RES-BDLDIR + I-LAB-BDLDIR + I-COR-BDLDIR         ABB0034 
NCAM19       MOVE I-SDT-BDLDIR TO V-TIPODI-BDLDIR(I-BDLDIR)             ABB0034 
NCAM18       MOVE I-SUS-BDLDIR TO V-NUMENT-BDLDIR(I-BDLDIR)             ABB0034
NCAM18       ADD 1 TO I-BDLDIR                                          ABB0034 
NCAM18     END-PERFORM.                                                 ABB0034 
NCAM18*                                                                *ABB0034 
NCAM18 2017-LEER-SUSCRIPTOR.                                            ABB0034 
NCAM18******************************************************************ABB0034 
NCAM18*    LEE SUSCRIPTORES PARA OBTENER EL NIT                        *ABB0034 
NCAM18******************************************************************ABB0034 
NCAM18     READ SUSCRIPTOR IGNORE LOCK                                  ABB0034
NCAM18        INVALID KEY                                               ABB0034
NCAM18           MOVE COD-SUSCRIP-ABD02 TO NIT-SUSCRIP-S-ABD02          ABB0034
NCAM18     END-READ.                                                    ABB0034
NCAM18*                                                                *ABB0034
ELEJIR*-----------------MEJORES DIRECCIONES -----------------------------
ELEGIR 2017-U-ELEGIR-DIRECCIONES.
REMARK*******************************************************************
REMARK* SE UNIFICAN LAS DIRECCIONES Y SE ORDENAN POR EL CRITERIO DE LA
REMARK* MEJOR FECHA Y EL NUMERO DE OCURRENCIAS.                          
REMARK* LA RUTINA DEVUELVE UN ARREGLO CON ESTAS DIRECCIONES ORDENADAS
AMPDIR*         05 V-DIRFIN       PIC X(60) DIRECCION                   FAC0009 
AMPDIR*         05 V-CIUFIN       PIC X(20) CIUDAD                      FAC0009 
REMARK*         05 V-TIPFIN       PIC X(01) UBICACION
REMARK*         05 V-FECFIN       PIC 9(6)  FECHA MEJOR.
REMARK*         05 V-NUMFIN       PIC 9(3)  NUMERO DE COINCIDENCIAS.
REMARK*         05 V-SUSFIN       PIC 9(6)  CODIGO DE SUSCRIPTOR.
REMARK*         05 V-HASDIRFIN    PIC X(50) STRING DE NUMEROS.  
NCAM18*         05 V-FECCREFIN    PIC 9(06) FECHA REPORTE PEIMERA VEZ
REMARK*******************************************************************
RCNCER     MOVE 0 TO J-BDLDIR.                                          RMB0010 
PYSPAR     MOVE 0 TO J2-BDLDIR                                          HGO0021
PYSPAR     INITIALIZE DIRECCION-BDLDIR                                  HGO0021
RCNCER     IF DIR-OK-BDLDIR > 1                                         RMB0010
      *       se ordena por direccion original y tipo de direccion 
      *       (R,L,C)
RCNCER        SORT T-DIR-BDLDIR                                         RMB0010 
PYSPAR*RCNCER             DESCENDING T-NUMDIR-BDLDIR V-TIPODIR-BDLDIR   HGO0021
PYSPAR             DESCENDING V-DIRECCION-BDLDIR V-TIPODIR-BDLDIR       HGO0021
NCAM18        PERFORM 2017-CALCULAR-ENTIDADES                           ABB0034 
RCNCER        MOVE ALL "9" TO NUMDIR-BDLDIR                             RMB0010 
RCNCER        MOVE 1 TO I-BDLDIR                                        RMB0010 
RCNCER        MOVE ALL "0" TO TABLA-FECHADIR-AUX-BDLDIR                 RMB0010 
RCNCER        MOVE 1 TO K-BDLDIR                                        RMB0010
      *       se unifica por direccion original
RCNCER        PERFORM UNTIL I-BDLDIR >= DIR-OK-BDLDIR                   RMB0010
PYSPAR          IF T-NUMDIR-BDLDIR(I-BDLDIR) = ZEROS                    HGO0021
PYSPAR             IF I-BDLDIR > 1                                      HGO0021
PYSPAR                PERFORM 2017-CALCULAR-VECTOR-RES                  HGO0021
PYSPAR                MOVE VEC-HIS-BDLDIR TO V-VECFIN-BDLDIR(J-BDLDIR)  HGO0021
PYSPAR             END-IF                                               HGO0021
      *
PYSPAR             MOVE V-FECHADIR-BDLDIR(I-BDLDIR)                     HGO0021
PYSPAR                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)              HGO0021
PYSPAR             ADD 1 TO K-BDLDIR                                    HGO0021
PYSPAR             ADD 1 TO J-BDLDIR                                    HGO0021
      *            MOVEMOS LOS VALORES DE DIR A FIN
AJCONT             PERFORM 2017-MOVER-DIR-I-A-FIN-J                     FARF035
PYSPAR             MOVE V-DIRECCION-BDLDIR(I-BDLDIR)                    HGO0021
PYSPAR               TO DIRECCION-BDLDIR                                HGO0021
PYSPAR             MOVE 1                  TO V-NUMFIN-BDLDIR(J-BDLDIR) HGO0021
PYSPAR             MOVE T-NUMDIR-BDLDIR(I-BDLDIR)    TO NUMDIR-BDLDIR   HGO0021
PYSPAR          END-IF                                                  HGO0021
      *
PYSPAR*RCNCER          IF NUMDIR-BDLDIR NOT = T-NUMDIR-BDLDIR (I-BDLDIR)HGO0021
PYSPAR          IF DIRECCION-BDLDIR NOT = V-DIRECCION-BDLDIR(I-BDLDIR)  HGO0021
PYSPAR          AND T-NUMDIR-BDLDIR(I-BDLDIR) NOT = ZEROS               HGO0021
RCNCER             IF I-BDLDIR > 1                                      RMB0010 
ORDDIR                PERFORM 2017-CALCULAR-VECTOR-RES        
RCNCER                MOVE VEC-HIS-BDLDIR TO V-VECFIN-BDLDIR(J-BDLDIR)  RMB0010 
ORDDIR             END-IF
      *
RCNCER             MOVE V-FECHADIR-BDLDIR(I-BDLDIR)                     RMB0010 
RCNCER                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)              RMB0010 
RCNCER             ADD 1 TO K-BDLDIR                                    RMB0010 
RCNCER             ADD 1 TO J-BDLDIR                                    RMB0010
      *            MOVEMOS LOS VALORES DE DIR A FIN
AJCONT             PERFORM 2017-MOVER-DIR-I-A-FIN-J                     FARF035
PYSPAR             MOVE V-DIRECCION-BDLDIR(I-BDLDIR)                    HGO0021
PYSPAR               TO DIRECCION-BDLDIR                                HGO0021
RCNCER             MOVE 1                  TO V-NUMFIN-BDLDIR(J-BDLDIR) RMB0010 
RCNCER             MOVE T-NUMDIR-BDLDIR(I-BDLDIR)    TO NUMDIR-BDLDIR   RMB0010 
ORDDIR          ELSE
PYSPAR             IF T-NUMDIR-BDLDIR(I-BDLDIR) NOT = ZEROS             HGO0021
RCNCER             MOVE V-FECHADIR-BDLDIR(I-BDLDIR)                     RMB0010 
RCNCER                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)              RMB0010 
ORDDIR             ADD 1 TO K-BDLDIR
RCNCER             ADD  1 TO V-NUMFIN-BDLDIR(J-BDLDIR)                  RMB0010 
RCNCER             IF V-FECHADIR-BDLDIR(I-BDLDIR) >                     RMB0010 
RCNCER                V-FECFIN-BDLDIR(J-BDLDIR)                         RMB0010 
NCAM18                MOVE V-ZONADIR-BDLDIR(I-BDLDIR)                   ABB0034 
NCAM18                  TO V-ZONAFIN-BDLDIR(J-BDLDIR)                   ABB0034 
NCAM18                MOVE V-FECCRE-BDLDIR(I-BDLDIR)                    ABB0034 
NCAM18                  TO V-FECCREFIN-BDLDIR(J-BDLDIR)                 ABB0034 
NCAM18                MOVE V-NUMENT-BDLDIR(I-BDLDIR)                    ABB0034 
NCAM18                  TO V-NUMENTFIN-BDLDIR(J-BDLDIR)                 ABB0034 
NCAM19                MOVE V-TIPODI-BDLDIR(I-BDLDIR)                    ABB0034 
NCAM19                  TO V-TIPODIFIN-BDLDIR(J-BDLDIR)                 ABB0034 
RCNCER                MOVE V-FECHADIR-BDLDIR(I-BDLDIR)                  RMB0010 
RCNCER                     TO V-FECFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER                MOVE V-DIRECCION-BDLDIR(I-BDLDIR)                 RMB0010 
RCNCER                     TO V-DIRFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER                MOVE V-CIUDADDIR-BDLDIR(I-BDLDIR)                 RMB0010 
RCNCER                     TO V-CIUFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER                MOVE V-TIPODIR-BDLDIR(I-BDLDIR)                   RMB0010 
RCNCER                     TO V-TIPFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER                MOVE V-SUSDIR-BDLDIR (I-BDLDIR)                   RMB0010 
RCNCER                     TO V-SUSFIN-BDLDIR(J-BDLDIR)                 RMB0010 
UNIDIR                MOVE V-FECULT-BDLDIR(I-BDLDIR)                    AAM0017
UNIDIR                     TO V-FECULTFIN-BDLDIR(J-BDLDIR)              AAM0017
MOD024*               MOVE V-FECULT-BDLDIR(I-BDLDIR)                    RGH0024
MOD024*                    TO V-FECULTFIN-BDLDIR(J-BDLDIR)              RGH0024
MOD024                IF V-FECULT-BDLDIR(I-BDLDIR) >                    RGH0024
MOD024                   V-FECULTFIN-BDLDIR(J-BDLDIR)                   RGH0024
MOD024                   MOVE V-FECULT-BDLDIR(I-BDLDIR)  TO             RGH0024
MOD024                        V-FECULTFIN-BDLDIR(J-BDLDIR)              RGH0024
MOD024                END-IF                                            RGH0024
UNIDIR                MOVE V-NUENOM-BDLDIR(I-BDLDIR)                    AAM0017
UNIDIR                     TO V-NUENOMFIN-BDLDIR(J-BDLDIR)              AAM0017

REPLUS                MOVE V-DANEDIR-BDLDIR(I-BDLDIR)
REPLUS                     TO V-DANEFIN-BDLDIR(J-BDLDIR)
REPLUS                MOVE V-DEPTODIR-BDLDIR(I-BDLDIR)
REPLUS                     TO V-DEPFIN-BDLDIR(J-BDLDIR)
REPLUS                MOVE V-ESTRATODIR-BDLDIR(I-BDLDIR)
REPLUS                     TO V-ESTFIN-BDLDIR(J-BDLDIR)
RECPF2                MOVE V-PRBENTDIR-BDLDIR(I-BDLDIR)                 HGO0022
RECPF2                     TO V-PRBFIN-BDLDIR(J-BDLDIR)                 HGO0022

ORDDIR             END-IF
PYSPAR             END-IF                                               HGO0021
ORDDIR          END-IF
      *         MARCA EN LA INICIAL EN CUAL FINAL VA
AJCONT          MOVE V-SEC01DIRFIN-BDLDIR(J-BDLDIR) TO                  FARF035
AJCONT               V-SECUNI00DIR-BDLDIR(I-BDLDIR)                     FARF035
RCNCER          ADD 1 TO I-BDLDIR                                       RMB0010 
ORDDIR        END-PERFORM
      *
RCNCER        IF I-BDLDIR > 1                                           RMB0010 
ORDDIR           PERFORM 2017-CALCULAR-VECTOR-RES         
RCNCER           MOVE VEC-HIS-BDLDIR TO V-VECFIN-BDLDIR(J-BDLDIR)       RMB0010 
ORDDIR        END-IF
ORDDIR     END-IF.
      *    se inicia el procesos de estandarizar direccion
RCNCER     IF J-BDLDIR > 0                                              RMB0010 
RCNCER        MOVE 1 TO I-BDLDIR                                        RMB0010 
RCNCER        PERFORM UNTIL I-BDLDIR > J-BDLDIR                         RMB0010 
RCNCER           MOVE V-DIRFIN-BDLDIR (I-BDLDIR)                        RMB0010 
RCNCER                TO DIRECCION-A-ESTANDARIZAR-BDLDIR                RMB0010 
RCNCER           EVALUATE V-TIPFIN-BDLDIR(I-BDLDIR)                     RMB0010 
RCNCER              WHEN "R"                                            RMB0010 
RCNCER                 MOVE CIUDAD-RES-A-ESTANDAR-BDLDIR                RMB0010 
RCNCER                      TO CIUDAD-BDLDIR                            RMB0010 
RCNCER                 MOVE 0 TO DIRCER-BDLDIR                          RMB0010 
RCNCER                 MOVE 0 TO PTSADI-BDLDIR                          RMB0010 
RCNCER                 IF CERRES-DIRECC NUMERIC                         RMB0010 
RCNCER                    MOVE CERRES-DIRECC TO DIRCER-BDLDIR           RMB0010 
RCNCER                 END-IF                                           RMB0010 
RCNCER                 IF ADIRES-DIRECC NUMERIC                         RMB0010 
RCNCER                    MOVE ADIRES-DIRECC TO PTSADI-BDLDIR           RMB0010 
RCNCER                 END-IF                                           RMB0010 
RCNCER              WHEN "L"                                            RMB0010 
RCNCER                 MOVE CIUDAD-LAB-A-ESTANDAR-BDLDIR                RMB0010 
RCNCER                      TO CIUDAD-BDLDIR                            RMB0010 
RCNCER                 MOVE 0 TO DIRCER-BDLDIR                          RMB0010 
RCNCER                 MOVE 0 TO PTSADI-BDLDIR                          RMB0010 
RCNCER                 IF CERLAB-DIRECC NUMERIC                         RMB0010 
RCNCER                    MOVE CERLAB-DIRECC TO DIRCER-BDLDIR           RMB0010 
RCNCER                 END-IF                                           RMB0010 
RCNCER                 IF ADILAB-DIRECC NUMERIC                         RMB0010 
RCNCER                    MOVE ADILAB-DIRECC TO PTSADI-BDLDIR           RMB0010 
RCNCER                 END-IF                                           RMB0010 
RCNCER              WHEN "C"                                            RMB0010 
RCNCER                 MOVE CIUDAD-COR-A-ESTANDAR-BDLDIR                RMB0010 
RCNCER                      TO CIUDAD-BDLDIR                            RMB0010 
RCNCER                 MOVE 0 TO DIRCER-BDLDIR                          RMB0010 
RCNCER                 MOVE 0 TO PTSADI-BDLDIR                          RMB0010 
RCNCER                 IF CERCOR-DIRECC NUMERIC                         RMB0010 
RCNCER                    MOVE CERCOR-DIRECC TO DIRCER-BDLDIR           RMB0010 
RCNCER                 END-IF                                           RMB0010 
RCNCER                 IF ADICOR-DIRECC NUMERIC                         RMB0010 
RCNCER                    MOVE ADICOR-DIRECC TO PTSADI-BDLDIR           RMB0010 
RCNCER                 END-IF                                           RMB0010 
RCNCER           END-EVALUATE                                           RMB0010
      *
AJCIUU           MOVE V-DANEFIN-BDLDIR(I-BDLDIR) TO                     FARF033
AJCIUU                V-DANEFIN-BDLDIR-AUX                              FARF033
ALG001           PERFORM 6100-U-ESTANDARIZAR-DIRECC
RCNCER           MOVE DIRECCION-ESTANDARIZADA-BDLDIR                    RMB0010 
RCNCER                TO V-STAFIN-BDLDIR(I-BDLDIR)                      RMB0010 
PYSPAR           MOVE PRIPART-ESTANDARIZADA-BDLDIR TO                   HGO0021
PYSPAR            V-PRIPARTFIN-BDLDIR(I-BDLDIR)                         HGO0021
PYSPAR           MOVE SEGPART-ESTANDARIZADA-BDLDIR TO                   HGO0021
PYSPAR            V-SEGPARTFIN-BDLDIR(I-BDLDIR)                         HGO0021
RCNCER           MOVE CALIFICA-DIR-BDLDIR TO V-CALFIN-BDLDIR(I-BDLDIR)  RMB0010 
AJUCAL           IF V-CALFIN-BDLDIR(I-BDLDIR) >= 30                     FARF029
AJUCAL              MOVE 40 TO V-CALFIN-BDLDIR(I-BDLDIR)                FARF029
AJUCAL           END-IF                                                 FARF029
      *
PYSPAR           MOVE CALIFICA-DIRPART1-BDLDIR TO                       HGO0021
PYSPAR            V-CALFIN-PART1-BDLDIR(I-BDLDIR)                       HGO0021
PYSPAR           MOVE CALIFICA-DIRPART2-BDLDIR TO                       HGO0021
PYSPAR            V-CALFIN-PART2-BDLDIR(I-BDLDIR)                       HGO0021
RCNCER***        SE ELIMINAN LAS DIRECCIONES MENORES A LA POLITICA      RMB0010 
RCNCER           IF CALIFICA-DIR-BDLDIR < POLITICA-EXC-CAL-DIR-BDLDIR ORRMB0010 
RCNCER              CALIFICA-DIR-BDLDIR = 0                             RMB0010 
RCNCER              MOVE 0                  TO V-FECFIN-BDLDIR(I-BDLDIR)RMB0010 
RCNCER           END-IF                                                 RMB0010 
RCNCER           ADD 1 TO I-BDLDIR                                      RMB0010 
ALG001        END-PERFORM
      *       busca nueva nomenclatura de bogota
UNIDIR        MOVE 1 TO I-BDLDIR                                        AAM0017
UNIDIR        PERFORM UNTIL I-BDLDIR > J-BDLDIR                         AAM0017
UNIDIR         MOVE V-CIUFIN-BDLDIR(I-BDLDIR)  TO CIUDAD-BTA-BDLDIR     AAM0017
UNIDIR         MOVE V-STAFIN-BDLDIR(I-BDLDIR)  TO DIRECCION-BTA-BDLDIR  AAM0017
UNIDIR         PERFORM 2590-NVA-DIRECC-BOGOTA                           AAM0017
UNIDIR         IF HAY-BDLNEWDIRBOG-BDLDIR = 1                           AAM0017
UNIDIR          MOVE DIRNEW-BDLNEWDIRBOG TO V-STAFIN-BDLDIR(I-BDLDIR)   AAM0017
AJNVDR          MOVE 0 TO V-NUENOMFIN-BDLDIR(I-BDLDIR)                  FARF031
AJCONT          MOVE 1 TO V-NN01DIRFIN-BDLDIR(I-BDLDIR)                 FARF035
AJNVDR* inicio comentario                                               FARF031
UNIDIR*          MOVE 1 TO V-NUENOMFIN-BDLDIR(I-BDLDIR)                  AAM0017
AJNVDR* fin comentario                                                  FARF031
UNIDIR         END-IF                                                   AAM0017
UNIDIR         ADD 1 TO I-BDLDIR                                        AAM0017
UNIDIR        END-PERFORM                                               AAM0017
      *       calcula el hash de unificaciondesde la estandar
UNIDIR        MOVE 1 TO I-BDLDIR                                        AAM0017
UNIDIR        PERFORM UNTIL I-BDLDIR > J-BDLDIR                         AAM0017
UNIDIR         MOVE V-STAFIN-BDLDIR(I-BDLDIR) TO DIRECCION              AAM0017
UNIDIR         PERFORM 2017-VECTOR-UNO                                  AAM0017
UNIDIR         MOVE DIRECCION1 TO V-NUMDIRFIN-BDLDIR(I-BDLDIR)          AAM0017
UNIDIR         ADD 1 TO I-BDLDIR                                        AAM0017
UNIDIR        END-PERFORM                                               AAM0017
      *       ordena las finales por si tiene nueva nomenclatura
UNIDIR        MOVE 0 TO CAMBIO                                          AAM0017
INIVAR        MOVE 0 TO RMAYOR                                          AAM0018
PYSPAR*UNIDIR        SORT T-DIRFINALES-BDLDIR DESCENDING V-NUMDIRFIN-BDLHGO0021
PYSPAR*UNIDIR                                            V-NUENOMFIN-BDLHGO0021
PYSPAR        SORT T-DIRFINALES-BDLDIR DESCENDING V-NUENOMFIN-BDLDIR    HGO0021
      *       unifica direcciones de nueva nomenclatura en matrix 
      *       auxiliar
PYSPAR        MOVE 1 TO J1-BDLDIR                                       HGO0021
PYSPAR        MOVE 1 TO G-BDLDIR                                        HGO0021
PYSPAR        PERFORM UNTIL J1-BDLDIR > J-BDLDIR                        HGO0021
PYSPAR         IF V-NUENOMFIN-BDLDIR(J1-BDLDIR) = 1 AND                 HGO0021
PYSPAR         V-STAFIN-BDLDIR(J1-BDLDIR) <> SPACES                     HGO0021
PYSPAR            MOVE 0 TO CONTA                                       HGO0021
PYSPAR            INSPECT V-NUMDIRFIN-BDLDIR(J1-BDLDIR) TALLYING CONTA  HGO0021
PYSPAR            FOR CHARACTERS BEFORE INITIAL "  "                    HGO0021
PYSPAR            COMPUTE H-BDLDIR = J1-BDLDIR + 1                      HGO0021
NN0026            MOVE 0 TO SW-NN                                       PJV0026
PYSPAR            PERFORM UNTIL H-BDLDIR > J-BDLDIR                     HGO0021
NN0026              MOVE 1 TO SW-NN                                     PJV0026
PYSPAR              MOVE 0 TO CONTA1                                    HGO0021
PYSPAR              INSPECT V-NUMDIRFIN-BDLDIR(H-BDLDIR) TALLYING CONTA1HGO0021
PYSPAR              FOR CHARACTERS BEFORE INITIAL "   "                 HGO0021
PYSPAR               IF CONTA >= CONTA1 AND CONTA1 > 0 AND              HGO0021
PYSPAR               (V-NUMDIRFIN-BDLDIR(J1-BDLDIR)(1:CONTA1) =         HGO0021
PYSPAR               V-NUMDIRFIN-BDLDIR(H-BDLDIR)(1:CONTA1))            HGO0021
PYSPAR                  PERFORM 2017-UNINN                              HGO0021
PYSPAR               ELSE                                               HGO0021
PYSPAR                  IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR) NOT =          HGO0021
PYSPAR                  V-NUMDIRFINAUX-BDLDIR                           HGO0021
PYSPAR                     MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO       HGO0021
PYSPAR                     T-DIRFINALESAUX-BDLDIR                       HGO0021
PYSPAR                  END-IF                                          HGO0021
PYSPAR               END-IF                                             HGO0021
PYSPAR               ADD 1 TO H-BDLDIR                                  HGO0021
PYSPAR            END-PERFORM                                           HGO0021
NN0026            IF SW-NN = 0                                          PJV0026
NN0026               MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO             PJV0026
NN0026                    T-DIRFINALESAUX-BDLDIR                        PJV0026
NN0026            END-IF                                                PJV0026
      *           se salva la secuencia antes de inicializar
AJCONT            MOVE V-SEC01DIRFIN-BDLDIR(J1-BDLDIR) TO SEC-BDLDIR    FARF035
PYSPAR            INITIALIZE T-DIRFINALES-BDLDIR(J1-BDLDIR)             HGO0021
AJCONT            MOVE SEC-BDLDIR TO V-SEC01DIRFIN-BDLDIR(J1-BDLDIR)    FARF035
AJCONT            MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO             FARF035
AJCONT                 V-SECUNI01DIRFIN-BDLDIR(J1-BDLDIR)               FARF035
PYSPAR            ADD 1 TO J2-BDLDIR                                    HGO0021
AJCONT            MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO SEC-BDLDIR  FARF035
PYSPAR            MOVE T-DIRFINALESAUX-BDLDIR TO                        HGO0021
PYSPAR               T-DIRFINALESFIN-BDLDIR(G-BDLDIR)                   HGO0021
AJCONT            MOVE SEC-BDLDIR TO V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR)  FARF035
NN0026            INITIALIZE T-DIRFINALESAUX-BDLDIR                     PJV0026
PYSPAR            ADD 1 TO G-BDLDIR                                     HGO0021
PYSPAR            ADD 1 TO J1-BDLDIR                                    HGO0021
PYSPAR         ELSE                                                     HGO0021
PYSPAR            COMPUTE J1-BDLDIR = J-BDLDIR + 1                      HGO0021
PYSPAR         END-IF                                                   HGO0021
PYSPAR        END-PERFORM                                               HGO0021
      *       ordena por parte numerica y calificacion
PYSPAR        SORT T-DIRFINALES-BDLDIR DESCENDING V-NUMDIRFIN-BDLDIR    HGO0021
PYSPAR                                            V-CALFIN-BDLDIR       HGO0021
PYSPAR                                            V-STAFIN-BDLDIR       HGO0021
PYSPAR        COMPUTE J-BDLDIR = J-BDLDIR - J2-BDLDIR                   HGO0021
PYSPAR        MOVE 1 TO J1-BDLDIR                                       HGO0021
PYSPAR        PERFORM UNTIL J1-BDLDIR > J-BDLDIR                        HGO0021
UNIDIR         MOVE 0 TO COMPO                                          AAM0017
PYSPAR         INSPECT V-STAFIN-BDLDIR(J1-BDLDIR) TALLYING COMPO        HGO0021
UNIDIR         FOR ALL SPACE BEFORE INITIAL "  "                        AAM0017
PYSPAR         IF COMPO > 0 AND V-CALFIN-BDLDIR(J1-BDLDIR) > 0          HGO0021
AJCONT            MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO             FARF035
AJCONT                 V-SECUNI01DIRFIN-BDLDIR(J1-BDLDIR)               FARF035
UNIDIR*          MOVE 0 TO CONTA                                         AAM0017
PYSPAR*          INSPECT V-NUMDIRFIN-BDLDIR(J1-BDLDIR) TALLYING CONTA    HGO0021
UNIDIR*          FOR CHARACTERS BEFORE INITIAL "  "                      AAM0017
PYSPAR          COMPUTE H-BDLDIR = J1-BDLDIR + 1                        HGO0021
PYSPAR          PERFORM UNTIL H-BDLDIR > J-BDLDIR                       HGO0021
AMP027*           IF V-NUMDIRFIN-BDLDIR(H-BDLDIR) = SPACES               PJV0027
AMP027*            MOVE ZEROS TO V-NUMDIRFIN-BDLDIR(H-BDLDIR)            PJV0027
AMP027*           END-IF                                                 PJV0027
      *
PYSPAR           IF V-NUMDIRFIN-BDLDIR(H-BDLDIR) = SPACES
PYSPAR            MOVE ZEROS TO V-NUMDIRFIN-BDLDIR(H-BDLDIR)
PYSPAR           END-IF
      *
UNIDIR           MOVE 0 TO CONTA1                                       AAM0017
UNIDIR           INSPECT V-NUMDIRFIN-BDLDIR(H-BDLDIR) TALLYING CONTA1   AAM0017
UNIDIR           FOR CHARACTERS BEFORE INITIAL "   "                    AAM0017
PYSPAR            IF (V-PRIPARTFIN-BDLDIR(J1-BDLDIR) =                  HGO0021
PYSPAR              V-PRIPARTFIN-BDLDIR(H-BDLDIR) OR                    HGO0021
PYSPAR              V-SEGPARTFIN-BDLDIR(J1-BDLDIR) =                    HGO0021
PYSPAR              V-SEGPARTFIN-BDLDIR(H-BDLDIR) OR                    HGO0021
PYSPAR              V-PRIPARTFIN-BDLDIR(J1-BDLDIR) =                    HGO0021
PYSPAR              V-SEGPARTFIN-BDLDIR(H-BDLDIR) OR                    HGO0021
PYSPAR              V-SEGPARTFIN-BDLDIR(J1-BDLDIR) =                    HGO0021
PYSPAR              V-PRIPARTFIN-BDLDIR(H-BDLDIR))                      HGO0021
UNIDIR             PERFORM 2017-UNIMAYOR                                AAM0017
UNIDIR            ELSE                                                  AAM0017
PYSPAR               IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR) NOT =             HGO0021
PYSPAR               V-NUMDIRFINAUX-BDLDIR                              HGO0021
PYSPAR                  MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO          HGO0021
UNIDIR                   T-DIRFINALESAUX-BDLDIR                         AAM0017
PYSPAR               END-IF                                             HGO0021
UNIDIR            END-IF                                                AAM0017
      *
PYSPAR           ADD 1 TO H-BDLDIR                                      HGO0021
UNIDIR          END-PERFORM                                             AAM0017
      *
PYSPAR          IF H-BDLDIR > J-BDLDIR                                  HGO0021
PYSPAR            IF ((V-CALFIN-PART1-BDLDIR(J1-BDLDIR) > 6 AND         HGO0021
PYSPAR            V-STAFIN-BDLDIR(J1-BDLDIR) NOT =                      HGO0021
PYSPAR            V-STAFINAUX-BDLDIR) OR                                HGO0021
PYSPAR            (V-CALFIN-PART1-BDLDIR(J1-BDLDIR) > 6 AND             HGO0021
PYSPAR            V-NUMDIRFIN-BDLDIR(J1-BDLDIR) = SPACES)) AND          HGO0021
PYSPAR            V-DIRFIN-BDLDIR(J1-BDLDIR) NOT =                      HGO0021
PYSPAR            V-DIRFINAUX-BDLDIR                                    HGO0021
PYSPAR               MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO             HGO0021
UNIDIR               T-DIRFINALESAUX-BDLDIR                             AAM0017
PYSPAR            END-IF                                                HGO0021
PYSPAR          END-IF                                                  HGO0021
UNIDIR         END-IF                                                   AAM0017
      *
PYSPAR         MOVE 0 TO CONTA1                                         HGO0021
PYSPAR         INSPECT V-PRIPARTFIN-BDLDIR(J1-BDLDIR) TALLYING CONTA1   HGO0021
PYSPAR         FOR CHARACTERS BEFORE INITIAL "   "                      HGO0021
PYSPAR         IF V-CALFIN-PART1-BDLDIR(J1-BDLDIR) > 6 AND              HGO0021
PYSPAR            V-CALFIN-BDLDIR(J1-BDLDIR) > 0 AND CONTA1 > 1         HGO0021
AJCONT            MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO SEC-BDLDIR  FARF035
PYSPAR            MOVE T-DIRFINALESAUX-BDLDIR TO                        HGO0021
PYSPAR            T-DIRFINALESFIN-BDLDIR(G-BDLDIR)                      HGO0021
AJCONT            MOVE SEC-BDLDIR TO V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR)  FARF035
PYSPAR            ADD 1 TO G-BDLDIR                                     HGO0021
AJCONT         ELSE                                                     FARF035
AJCONT            IF CONTA1 > 0                                         FARF035
AJCONT              *> DIRECCION ELIMINADA POR NO CUMPLIR LO MINIMO     FARF035
AJCONT               MOVE 0 TO V-SECUNI01DIRFIN-BDLDIR(J1-BDLDIR)       FARF035
AJCONT            END-IF                                                FARF035
PYSPAR         END-IF                                                   HGO0021
PYSPAR         ADD 1 TO J1-BDLDIR                                       HGO0021
UNIDIR        END-PERFORM                                               AAM0017
AMP027        PERFORM PASAR-A-TABLA-FINAL                               PJV0027
ORDDIR     END-IF.                                                      FARF035
AJCONT*    CONTEO DE ENTIDADES PARA DIRECCIONES                         FARF035
AJCONT     MOVE 1  TO I-BDLDIR.                                         FARF035
AJCONT     PERFORM UNTIL V-FECFIN-BDLDIR(I-BDLDIR) = 0                  FARF035
AJCONT                  OR I-BDLDIR > 100                               FARF035
AJCONT        MOVE  1 TO J-BDLDIR                                       FARF035
AJCONT        MOVE SPACES TO M-CONTEOS-TEX                              FARF035
AJCONT        MOVE ZEROS  TO M-CONTEOS-NUM                              FARF035
AJCONT        MOVE 0 TO I-RES-BDLDIR I-LAB-BDLDIR I-COR-BDLDIR          FARF035
AJCONT        MOVE 0 TO I-SDT-BDLDIR                                    FARF035
AJCONT        PERFORM UNTIL J-BDLDIR > 100                              FARF035
AJCONT           IF V-SECUNI00DIR-BDLDIR(J-BDLDIR) =                    FARF035
AJCONT              V-SEC01DIRFIN-BDLDIR(I-BDLDIR)                      FARF035
AJCONT              MOVE V-SUSDIR-BDLDIR(J-BDLDIR) TO COD-SUSCRIP-ABD02 FARF035
AJCONT              PERFORM 1000-CONTAR-SUSCRIPTORES                    FARF035
AJCONT              PERFORM 1000-CONTAR-TIPOS-UBICACION-DIR             FARF035
AJCONT           END-IF                                                 FARF035
AJCONT*                                                                 FARF035
AJCONT           ADD 1 TO J-BDLDIR                                      FARF035
AJCONT        END-PERFORM                                               FARF035
AJCONT*                                                                 FARF035
AJCONT        MOVE I-SDT-BDLDIR TO V-NUMENTFIN-BDLDIR(I-BDLDIR)         FARF035
AJCONT        COMPUTE V-TIPODIFIN-BDLDIR(I-BDLDIR) =                    FARF035
AJCONT                I-RES-BDLDIR * 1 +                                FARF035
AJCONT                I-LAB-BDLDIR * 2 +                                FARF035
AJCONT                I-COR-BDLDIR * 4                                  FARF035
AJCONT        ADD 1 TO I-BDLDIR                                         FARF035
AJCONT     END-PERFORM.                                                 FARF035
AJCONT*                                                                 FARF035
AJCONT*2017-MOVER-DIR-I-A-FIN-J                                         FARF035
AJCONT*    SE MUEVEN LOS ELEMENTOS DE LA MATRIZ DIR A LA MATRIZ FIN     FARF035
AJCONT*                                                                 FARF035
AJCONT 2017-MOVER-DIR-I-A-FIN-J.                                        FARF035
NCAM18     MOVE V-ZONADIR-BDLDIR(I-BDLDIR)                              ABB0034 
NCAM18       TO V-ZONAFIN-BDLDIR(J-BDLDIR).                             ABB0034 
NCAM18     MOVE V-FECCRE-BDLDIR(I-BDLDIR)                               ABB0034 
NCAM18       TO V-FECCREFIN-BDLDIR(J-BDLDIR).                           ABB0034 
NCAM18     MOVE V-NUMENT-BDLDIR(I-BDLDIR)                               ABB0034 
NCAM18       TO V-NUMENTFIN-BDLDIR(J-BDLDIR).                           ABB0034 
NCAM19     MOVE V-TIPODI-BDLDIR(I-BDLDIR)                               ABB0034 
NCAM19       TO V-TIPODIFIN-BDLDIR(J-BDLDIR).                           ABB0034 
PYSPAR     MOVE V-DIRECCION-BDLDIR(I-BDLDIR)                            HGO0021
PYSPAR       TO V-DIRFIN-BDLDIR(J-BDLDIR).                              HGO0021
PYSPAR     MOVE V-FECHADIR-BDLDIR(I-BDLDIR)                             HGO0021
PYSPAR       TO V-FECFIN-BDLDIR(J-BDLDIR).                              HGO0021
PYSPAR     MOVE V-CIUDADDIR-BDLDIR(I-BDLDIR)                            HGO0021
PYSPAR       TO V-CIUFIN-BDLDIR(J-BDLDIR).                              HGO0021
PYSPAR     MOVE V-TIPODIR-BDLDIR(I-BDLDIR)                              HGO0021
PYSPAR       TO V-TIPFIN-BDLDIR(J-BDLDIR).                              HGO0021
PYSPAR     MOVE V-SUSDIR-BDLDIR (I-BDLDIR)                              HGO0021
PYSPAR       TO V-SUSFIN-BDLDIR(J-BDLDIR).                              HGO0021
PYSPAR     MOVE V-HASDIR-BDLDIR (I-BDLDIR)                              HGO0021
PYSPAR       TO V-HASDIRFIN-BDLDIR(J-BDLDIR).                           HGO0021
PYSPAR     MOVE V-PRIDIG-BDLDIR (I-BDLDIR)                              HGO0021
PYSPAR       TO V-PRIDIGFIN-BDLDIR(J-BDLDIR).                           HGO0021
PYSPAR     MOVE V-FECULT-BDLDIR(I-BDLDIR)                               HGO0021
PYSPAR       TO V-FECULTFIN-BDLDIR(J-BDLDIR).                           HGO0021
PYSPAR     MOVE V-NUENOM-BDLDIR(I-BDLDIR)                               HGO0021
PYSPAR       TO V-NUENOMFIN-BDLDIR(J-BDLDIR).                           HGO0021
AJUDEP     MOVE V-DANEDIR-BDLDIR(I-BDLDIR)                              FARF030
AJUDEP       TO V-DANEFIN-BDLDIR(J-BDLDIR).                             FARF030
AJUDEP     MOVE V-DEPTODIR-BDLDIR(I-BDLDIR)                             FARF030
AJUDEP       TO V-DEPFIN-BDLDIR(J-BDLDIR).                              FARF030
AJUDEP     MOVE V-ESTRATODIR-BDLDIR(I-BDLDIR)                           FARF030
AJUDEP       TO V-ESTFIN-BDLDIR(J-BDLDIR).                              FARF030
AJUDEP     MOVE V-PRBENTDIR-BDLDIR(I-BDLDIR)                            FARF030
AJUDEP       TO V-PRBFIN-BDLDIR(J-BDLDIR).                              FARF030
      *
AJCONT 1000-CONTAR-SUSCRIPTORES.                                        FARF035
AJCONT     PERFORM 2017-LEER-SUSCRIPTOR                                 FARF035
AJCONT     MOVE 1 TO K-BDLDIR                                           FARF035
AJCONT     PERFORM UNTIL NIT-SUSCRIP-S-ABD02 = V-NUM-CONTEO1(K-BDLDIR)  FARF035
AJCONT             OR V-NUM-CONTEO1(K-BDLDIR) = 0 OR K-BDLDIR > 100     FARF035
AJCONT        ADD 1 TO K-BDLDIR                                         FARF035
AJCONT     END-PERFORM.                                                 FARF035
AJCONT*                                                                 FARF035
AJCONT     IF V-NUM-CONTEO1(K-BDLDIR) = ZEROS                           FARF035
AJCONT        MOVE NIT-SUSCRIP-S-ABD02 TO  V-NUM-CONTEO1(K-BDLDIR)      FARF035
AJCONT        MOVE K-BDLDIR TO I-SDT-BDLDIR                             FARF035
AJCONT     END-IF.                                                      FARF035
      *
AJCONT 1000-CONTAR-TIPOS-UBICACION-DIR.                                 FARF035
AJCONT     IF V-TIPODIR-BDLDIR(J-BDLDIR) = "R"                          FARF035
AJCONT        MOVE 1 TO I-RES-BDLDIR                                    FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF V-TIPODIR-BDLDIR(J-BDLDIR) = "L"                          FARF035
AJCONT        MOVE 1 TO I-LAB-BDLDIR                                    FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF V-TIPODIR-BDLDIR(J-BDLDIR) = "C"                          FARF035
AJCONT        MOVE 1 TO I-COR-BDLDIR                                    FARF035
AJCONT     END-IF.                                                      FARF035
      *
AJCONT 1000-CONTAR-TIPOS-UBICACION-TEL.                                 FARF035
AJCONT     IF V-TIPOTEL-BDLDIR(J-BDLDIR) = "R"                          FARF035
AJCONT        MOVE 1 TO I-RES-BDLDIR                                    FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF V-TIPOTEL-BDLDIR(J-BDLDIR) = "L"                          FARF035
AJCONT        MOVE 1 TO I-LAB-BDLDIR                                    FARF035
AJCONT     END-IF.                                                      FARF035
      *
AJCONT PASAR-A-TABLA-FINAL.                                             PJV0027
AJCONT     INITIALIZE T-DIRFINALESAUX-BDLDIR                            PJV0027
AJCONT     MOVE 1 TO CON-PART-ESTANDARIZADA-BDLDIR                      PJV0027
AJCONT*    PERFORM UNTIL CON-PART-ESTANDARIZADA-BDLDIR > J-BDLDIR       PJV0027
AJCONT     PERFORM UNTIL CON-PART-ESTANDARIZADA-BDLDIR > 100 OR         FARF035
AJCONT        V-DIRFINFIN-BDLDIR(CON-PART-ESTANDARIZADA-BDLDIR) = SPACESFARF035
AJCONT        IF V-STAFINFIN-BDLDIR(CON-PART-ESTANDARIZADA-BDLDIR) =    PJV0027
AJCONT              V-STAFINAUX-BDLDIR                                  PJV0027
AJCONT            MOVE V-STAFINFIN-BDLDIR(CON-PART-ESTANDARIZADA-BDLDIR)PJV0027
AJCONT              TO V-STAFINAUX-BDLDIR                               PJV0027
AJCONT           INITIALIZE                                             PJV0027
AJCONT             T-DIRFINALESFIN-BDLDIR(CON-PART-ESTANDARIZADA-BDLDIR)PJV0027
AJCONT*          SE ALMACENA LA SECUENCIA DEL REGISTRO IGUAL            FARF035
AJCONT*          PARA LUEGO SER RESTAURADA EN EL LOOP SIGUIENTE         FARF035
AJCONT           MOVE SEC-BDLDIR TO                                     FARF035
AJCONT         V-SECUNI02DIRFINFIN-BDLDIR(CON-PART-ESTANDARIZADA-BDLDIR)FARF035
AJCONT        ELSE                                                      PJV0027
AJCONT           MOVE V-STAFINFIN-BDLDIR(CON-PART-ESTANDARIZADA-BDLDIR) PJV0027
AJCONT             TO V-STAFINAUX-BDLDIR                                PJV0027
AJCONT*          SE GUARDA LA SECUENCIA POR SI SE BORRA UN REGISTR IGUALFARF035
AJCONT           MOVE                                                   FARF035
AJCONT            V-SEC02DIRFINFIN-BDLDIR(CON-PART-ESTANDARIZADA-BDLDIR)FARF035
AJCONT             TO SEC-BDLDIR                                        FARF035
AJCONT        END-IF                                                    PJV0027
AJCONT        ADD 1 TO CON-PART-ESTANDARIZADA-BDLDIR                    PJV0027
AJCONT     END-PERFORM                                                  PJV0027
AJCONT*                                                                 FARF035
AJCONT*    SE ACTUALIZA LA RELACION ENTRE LA TABLA 02 (FINAL) Y LO      FARF035
AJCONT*    QUE DEBE QUEDAR EN LA TABLA 00  (INICIAL)                    FARF035
AJCONT     MOVE 1 TO I-BDLDIR.                                          FARF035
AJCONT     PERFORM UNTIL I-BDLDIR > 100                                 FARF035
AJCONT        IF V-SECUNI00DIR-BDLDIR(I-BDLDIR) > 0                     FARF035
AJCONT           MOVE 1 TO J-BDLDIR                                     FARF035
AJCONT           PERFORM UNTIL J-BDLDIR > 100                           FARF035
AJCONT              IF V-SECUNI00DIR-BDLDIR(I-BDLDIR) =                 FARF035
AJCONT                 V-SEC01DIRFIN-BDLDIR(J-BDLDIR)                   FARF035
AJCONT                 MOVE V-SECUNI01DIRFIN-BDLDIR(J-BDLDIR) TO        FARF035
AJCONT                      SEC-BDLDIR                                  FARF035
AJCONT                 IF SEC-BDLDIR > 0                                FARF035
AJCONT                    IF V-SEC02DIRFINFIN-BDLDIR(SEC-BDLDIR) > 0    FARF035
AJCONT                       MOVE V-SECUNI01DIRFIN-BDLDIR(J-BDLDIR) TO  FARF035
AJCONT                            V-SECUNI00DIR-BDLDIR(I-BDLDIR)        FARF035
AJCONT                    ELSE *> SE RESTAURA LA SECUENCIA DEL          FARF035
AJCONT                         *> REGISTRO INICIALIZADO EN EL PASO ANTESFARF035
AJCONT                       MOVE V-SECUNI02DIRFINFIN-BDLDIR(SEC-BDLDIR)FARF035
AJCONT                            TO V-SECUNI00DIR-BDLDIR(I-BDLDIR)     FARF035
AJCONT                    END-IF                                        FARF035
AJCORR                 ELSE                                             FARF037
AJCORR                    MOVE 0 TO V-SECUNI00DIR-BDLDIR(I-BDLDIR)      FARF037
AJCONT                 END-IF                                           FARF035
AJCONT*                                                                 FARF035
AJCONT                 MOVE 200  TO J-BDLDIR                            FARF035
AJCONT              ELSE                                                FARF035
AJCONT                 ADD 1 TO J-BDLDIR                                FARF035
AJCONT              END-IF                                              FARF035
AJCONT           END-PERFORM                                            FARF035
AJCONT        END-IF                                                    FARF035
AJCONT        ADD 1 TO I-BDLDIR                                         FARF035
AJCONT     END-PERFORM.                                                 FARF035
AJCONT*                                                                 FARF035
AJCONT     MOVE TABLA-DIRFINALESFIN-BDLDIR TO TABLA-DIRFINALES-BDLDIR   PJV0027
AJCONT*    LAS DIRECCIONES NO RELACIONADAS SE COLOCAN EN 0              FARF035
AJCONT     MOVE 1  TO I-BDLDIR.                                         FARF035
AJCONT     PERFORM UNTIL I-BDLDIR > 100                                 FARF035
AJCONT        IF V-SECUNI00DIR-BDLDIR(I-BDLDIR) > 0                     FARF035
AJCONT           MOVE 1 TO J-BDLDIR                                     FARF035
AJCONT           PERFORM UNTIL J-BDLDIR > 100                           FARF035
AJCONT              IF V-SECUNI00DIR-BDLDIR(I-BDLDIR) =                 FARF035
AJCONT                 V-SEC01DIRFIN-BDLDIR(J-BDLDIR)                   FARF035
AJCONT                 IF  V-FECFIN-BDLDIR(J-BDLDIR) = ZEROS            FARF035
AJCONT                     MOVE 0 TO V-SECUNI00DIR-BDLDIR(I-BDLDIR)     FARF035
AJCONT                 END-IF                                           FARF035
AJCONT*                                                                 FARF035
AJCONT                 MOVE V-NN01DIRFIN-BDLDIR    (J-BDLDIR) TO        FARF035
AJCONT                      V-NUENOM-BDLDIR(I-BDLDIR)                   FARF035
AJCONT                 MOVE V-STAFIN-BDLDIR        (J-BDLDIR) TO        FARF035
AJCONT                      V-DIRNN00DIR-BDLDIR(I-BDLDIR)               FARF035
AJCONT                 MOVE 200  TO J-BDLDIR                            FARF035
AJCONT              ELSE                                                FARF035
AJCONT                 ADD 1 TO J-BDLDIR                                FARF035
AJCONT              END-IF                                              FARF035
AJCONT           END-PERFORM                                            FARF035
AJCONT        END-IF                                                    FARF035
AJCONT*                                                                 FARF035
AJCONT        ADD 1 TO I-BDLDIR                                         FARF035
AJCONT     END-PERFORM.                                                 FARF035
      *                                                                 FARF035
AJCONT     SORT T-DIRFINALES-BDLDIR DESCENDING V-CALFIN-BDLDIR          PJV0027
AJCONT                              DESCENDING V-FECFIN-BDLDIR          PJV0027
AJCONT                              DESCENDING V-NUMFIN-BDLDIR.         PJV0027
      *                                                                 
UNIDIR 2017-UNINN.                                                      AAM0017
REMARK******************************************************************
REMARK*2017-UNINN.                                                     *
REMARK*    SE CALCULA UNIFICACION DE DIRECCIONES NUEVA NOMENCALTURA    *
REMARK******************************************************************
PYSPAR     IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR) NOT = V-NUMDIRFINAUX-BDLDIR HGO0021
      *       se mueve el elemnto j a la variable              
PYSPAR        MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO                    HGO0021
PYSPAR             T-DIRFINALESAUX-BDLDIR                               HGO0021
              PERFORM  2017-MOVER-H-TO-J     
UNIDIR     ELSE                                                         AAM0017
              PERFORM  2017-MOVER-H-TO-J     
UNIDIR     END-IF.                                                      AAM0017
      *    se salva la secuencia antes de inicializar
AJCONT     MOVE V-SEC01DIRFIN-BDLDIR(H-BDLDIR) TO SEC-BDLDIR            FARF035
PYSPAR     INITIALIZE T-DIRFINALES-BDLDIR(H-BDLDIR)                     HGO0021
AJCONT     MOVE SEC-BDLDIR TO V-SEC01DIRFIN-BDLDIR(H-BDLDIR)            FARF035
AJCONT     MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO                    FARF035
AJCONT          V-SECUNI01DIRFIN-BDLDIR(H-BDLDIR)                       FARF035
PYSPAR     ADD 1 TO J2-BDLDIR.                                          HGO0021
      *
UNIDIR 2017-UNIMAYOR.                                                   AAM0017
REMARK******************************************************************
REMARK*2017-UNIMAYOR.                                                  *
REMARK*    SE CALCULA UNIFICACION DE DIRECCIONES MAS COMPLETAS         *
REMARK******************************************************************
PYSPAR     IF V-PRIPARTFIN-BDLDIR(J1-BDLDIR) =                          HGO0021
PYSPAR        V-PRIPARTFIN-BDLDIR(H-BDLDIR) AND                         HGO0021
PYSPAR        V-SEGPARTFIN-BDLDIR(J1-BDLDIR) =                          HGO0021
PYSPAR        V-SEGPARTFIN-BDLDIR(H-BDLDIR)                             HGO0021
PYSPAR        IF CONTA1 = 0                                             HGO0021
PYSPAR           MOVE 1 TO CONTA1                                       HGO0021
PYSPAR        END-IF                                                    HGO0021
      *
PYSPAR        IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR)(1:CONTA1) =              HGO0021
PYSPAR           V-NUMDIRFIN-BDLDIR(H-BDLDIR)(1:CONTA1)                 HGO0021
PYSPAR           IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR) NOT =                 HGO0021
PYSPAR              V-NUMDIRFINAUX-BDLDIR OR 
                    V-DIRFIN-BDLDIR(J1-BDLDIR) NOT =  V-DIRFINAUX-BDLDIRHGO0021
      *             se mueve el elemnto j a la variable              
PYSPAR              MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO              HGO0021
PYSPAR                   T-DIRFINALESAUX-BDLDIR                         HGO0021
                    PERFORM  2017-MOVER-H-TO-J     
      *             se salva la secuencia antes de inicializar
AJCONT              MOVE V-SEC01DIRFIN-BDLDIR(H-BDLDIR) TO SEC-BDLDIR   FARF035
PYSPAR              INITIALIZE T-DIRFINALES-BDLDIR(H-BDLDIR)            HGO0021
AJCONT              MOVE SEC-BDLDIR TO V-SEC01DIRFIN-BDLDIR(H-BDLDIR)   FARF035
AJCONT              MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO           FARF035
AJCONT                   V-SECUNI01DIRFIN-BDLDIR(H-BDLDIR)              FARF035
PYSPAR           ELSE                                                   HGO0021
                    PERFORM  2017-MOVER-H-TO-J                                         
AJCONT              MOVE V-SEC01DIRFIN-BDLDIR(H-BDLDIR) TO SEC-BDLDIR   FARF035
PYSPAR              INITIALIZE T-DIRFINALES-BDLDIR(H-BDLDIR)            HGO0021
AJCONT              MOVE SEC-BDLDIR TO V-SEC01DIRFIN-BDLDIR(H-BDLDIR)   FARF035
AJCONT              MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO           FARF035
AJCONT                   V-SECUNI01DIRFIN-BDLDIR(H-BDLDIR)              FARF035
PYSPAR           END-IF                                                 HGO0021
PYSPAR        ELSE                                                      HGO0021
PYSPAR          IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR) NOT =                  HGO0021
PYSPAR             V-NUMDIRFINAUX-BDLDIR                                HGO0021
PYSPAR               MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO             HGO0021
PYSPAR                    T-DIRFINALESAUX-BDLDIR                        HGO0021
PYSPAR          END-IF                                                  HGO0021
PYSPAR        END-IF                                                    HGO0021
PYSPAR     ELSE                                                         HGO0021
PYSPAR        IF V-SEGPARTFIN-BDLDIR(J1-BDLDIR) =                       HGO0021
PYSPAR           V-PRIPARTFIN-BDLDIR(H-BDLDIR)                          HGO0021
PYSPAR           IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR)(1:CONTA1) =           HGO0021
PYSPAR              V-NUMDIRFIN-BDLDIR(H-BDLDIR)(1:CONTA1)              HGO0021
PYSPAR              IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR) NOT =              HGO0021
PYSPAR                 V-NUMDIRFINAUX-BDLDIR                            HGO0021
      *                se mueve el elemnto j a la variable                                     
PYSPAR                 MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO           HGO0021
PYSPAR                      T-DIRFINALESAUX-BDLDIR                      HGO0021
                       PERFORM  2017-MOVER-H-TO-J                                         
AJCONT                 MOVE V-SEC01DIRFIN-BDLDIR(H-BDLDIR) TO SEC-BDLDIRFARF035
PYSPAR                 INITIALIZE T-DIRFINALES-BDLDIR(H-BDLDIR)         HGO0021
AJCONT                 MOVE SEC-BDLDIR TO V-SEC01DIRFIN-BDLDIR(H-BDLDIR)FARF035
AJCONT                 MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO        FARF035
AJCONT                      V-SECUNI01DIRFIN-BDLDIR(H-BDLDIR)           FARF035
PYSPAR              ELSE                                                HGO0021
                       PERFORM  2017-MOVER-H-TO-J                                         
AJCONT                 MOVE V-SEC01DIRFIN-BDLDIR(H-BDLDIR) TO SEC-BDLDIRFARF035 
PYSPAR                 INITIALIZE T-DIRFINALES-BDLDIR(H-BDLDIR)         HGO0021
AJCONT                 MOVE SEC-BDLDIR TO V-SEC01DIRFIN-BDLDIR(H-BDLDIR)FARF035
AJCONT                 MOVE V-SEC02DIRFINFIN-BDLDIR(G-BDLDIR) TO        FARF035
AJCONT                      V-SECUNI01DIRFIN-BDLDIR(H-BDLDIR)           FARF035
PYSPAR              END-IF                                              HGO0021
PYSPAR           ELSE                                                   HGO0021
PYSPAR              IF V-NUMDIRFIN-BDLDIR(J1-BDLDIR) NOT =              HGO0021
PYSPAR                 V-NUMDIRFINAUX-BDLDIR                            HGO0021
PYSPAR                 MOVE T-DIRFINALES-BDLDIR(J1-BDLDIR) TO           HGO0021
PYSPAR                      T-DIRFINALESAUX-BDLDIR                      HGO0021
PYSPAR              END-IF                                              HGO0021
PYSPAR           END-IF                                                 HGO0021
PYSPAR        END-IF                                                    HGO0021
PYSPAR     END-IF.                                                      HGO0021
      *
REMARK******************************************************************
REMARK*2017-MOVER-H-TO-J.                                                *
REMARK*    SE MUEVEN LOS VALORES DEL ELEMENTO H AL J DE LA VARIABLE 
      *    AUXILIAR                                                   *
REMARK******************************************************************
       2017-MOVER-H-TO-J.                                               
PYSPAR     COMPUTE V-NUMFINAUX-BDLDIR = V-NUMFINAUX-BDLDIR +            HGO0021
PYSPAR             V-NUMFIN-BDLDIR(H-BDLDIR).                           HGO0021
PYSPAR     IF V-CALFIN-BDLDIR(H-BDLDIR) > V-CALFINAUX-BDLDIR            HGO0021
PYSPAR        MOVE V-CALFIN-BDLDIR(H-BDLDIR) TO                         HGO0021
                   V-CALFINAUX-BDLDIR                                   HGO0021
PYSPAR     END-IF.                                                      HGO0021
      *                                                                 HGO0021
PYSPAR     IF V-FECFIN-BDLDIR(H-BDLDIR) > V-FECFINAUX-BDLDIR            HGO0021
PYSPAR        MOVE V-FECFIN-BDLDIR(H-BDLDIR) TO                         HGO0021
                   V-FECFINAUX-BDLDIR                                   HGO0021
PYSPAR     END-IF.                                                      HGO0021
      *                                                                 
MOD024     IF V-FECULTFIN-BDLDIR(H-BDLDIR) >  V-FECULTFINAUX-BDLDIR     RGH0024
MOD024        MOVE V-FECULTFIN-BDLDIR(H-BDLDIR) TO                      RGH0024
MOD024             V-FECULTFINAUX-BDLDIR                                RGH0024
MOD024     END-IF.                                                      RGH0024
      *                                                                 
MOD024     IF V-FECCREFIN-BDLDIR(H-BDLDIR) <  V-FECCREFINAUX-BDLDIR     RGH0024
MOD024        MOVE V-FECCREFIN-BDLDIR(H-BDLDIR) TO                      RGH0024
MOD024             V-FECCREFINAUX-BDLDIR                                RGH0024
MOD024     END-IF.                                                      RGH0024
      *    se salva el flag de nueva nomenclatura
AJCONT     IF V-NN01DIRFIN-BDLDIR(H-BDLDIR) = 1                         FARF035
AJCONT         MOVE 1 TO V-NN02DIRFINAUX-BDLDIR                         FARF035
AJCONT     END-IF.                                                      FARF035
      *
UNIDIR 2017-VECTOR-UNO.                                                 AAM0017
REMARK******************************************************************
REMARK*2017-VECTOR-UNO.                                                *
REMARK*    SE CALCULA EL VECTOR DE COMPONENTES DE DIRECCION 1          *
REMARK******************************************************************
UNIDIR     MOVE 1 TO E-BDLDIR                                           AAM0017
UNIDIR     MOVE 1 TO F-BDLDIR                                           AAM0017
UNIDIR     MOVE SPACES TO DIRECCION1                                    AAM0017
UNIDIR     PERFORM UNTIL E-BDLDIR > 60                                  AAM0017
UNIDIR      IF DIRECCION(E-BDLDIR:1) IS NUMERIC                         AAM0017
UNIDIR         OR DIRECCION(E-BDLDIR:1) = SPACES                        AAM0017
UNIDIR       IF F-BDLDIR > 1                                            AAM0017
UNIDIR        IF DIRECCION(E-BDLDIR:1) NOT = SPACES                     AAM0017
UNIDIR         MOVE DIRECCION(E-BDLDIR:1) TO DIRECCION1(F-BDLDIR:1)     AAM0017
UNIDIR         ADD 1 TO F-BDLDIR                                        AAM0017
UNIDIR        END-IF                                                    AAM0017
UNIDIR        IF DIRECCION(E-BDLDIR:1) = SPACES                         AAM0017
UNIDIR           AND DIRECCION1(F-BDLDIR - 1:1) NOT = SPACES            AAM0017
UNIDIR         MOVE DIRECCION(E-BDLDIR:1) TO DIRECCION1(F-BDLDIR:1)     AAM0017
UNIDIR         ADD 1 TO F-BDLDIR                                        AAM0017
UNIDIR        END-IF                                                    AAM0017
UNIDIR       END-IF                                                     AAM0017
UNIDIR       IF F-BDLDIR = 1 AND DIRECCION(E-BDLDIR:1) NOT = SPACES     AAM0017
UNIDIR        MOVE DIRECCION(E-BDLDIR:1) TO DIRECCION1(F-BDLDIR:1)      AAM0017
UNIDIR        ADD 1 TO F-BDLDIR                                         AAM0017
UNIDIR       END-IF                                                     AAM0017
UNIDIR      END-IF                                                      AAM0017
UNIDIR      ADD 1 TO E-BDLDIR                                           AAM0017
UNIDIR     END-PERFORM.                                                 AAM0017
ORDDIR 2017-CALCULAR-VECTOR-RES.
REMARK******************************************************************
REMARK*2018-CALCULAR-VECTOR-RES-DI4.                                   *
REMARK*    SE CALCULA EL VECTOR DE CAMBIOS DE DIRECCION                *
REMARK******************************************************************
RCNCER     SORT O-FECHADIR-AUX-BDLDIR DESCENDING V-FECHADIR-AUX-BDLDIR. RMB0010 
RCNCER     MOVE V-FECHADIR-AUX-BDLDIR(1) TO FECHA-RUTINA-BDLDIR.        RMB0010 
RCNCER     MOVE 1 TO  JJ-BDLDIR.                                        RMB0010 
RCNCER     MOVE 2 TO  II-BDLDIR.                                        RMB0010 
RCNCER     MOVE SPACES TO VEC-HIS-BDLDIR.                               RMB0010 
ORDDIR     PERFORM 2017-UN-MES-ATRAS
RCNCER     PERFORM UNTIL II-BDLDIR >= K-BDLDIR OR                       RMB0010 
RCNCER                   JJ-BDLDIR > 12                                 RMB0010 
RCNCER        IF FECHA-RUTINA-BDLDIR =                                  RMB0010 
RCNCER           V-FECHADIR-AUX-BDLDIR(II-BDLDIR)                       RMB0010 
RCNCER           MOVE "R" TO VEC-HIS-BDLDIR(JJ-BDLDIR:1)                RMB0010 
RCNCER           ADD 1 TO JJ-BDLDIR                                     RMB0010 
ORDDIR           PERFORM 2017-UN-MES-ATRAS
RCNCER           ADD 1 TO II-BDLDIR                                     RMB0010 
ORDDIR         ELSE
RCNCER           IF FECHA-RUTINA-BDLDIR >                               RMB0010 
RCNCER              V-FECHADIR-AUX-BDLDIR(II-BDLDIR)                    RMB0010 
RCNCER              MOVE "I" TO VEC-HIS-BDLDIR(JJ-BDLDIR:1)             RMB0010 
RCNCER              ADD 1 TO JJ-BDLDIR                                  RMB0010 
ORDDIR              PERFORM 2017-UN-MES-ATRAS
ORDDIR           ELSE
RCNCER              ADD 1 TO II-BDLDIR                                  RMB0010 
ORDDIR           END-IF
ORDDIR        END-IF
ORDDIR     END-PERFORM.
RCNCER     MOVE ALL "0" TO TABLA-FECHADIR-AUX-BDLDIR.                   RMB0010 
RCNCER     MOVE 1 TO K-BDLDIR.                                          RMB0010 
ORDDIR 2017-UN-MES-ATRAS.
REMARK******************************************************************
REMARK*2017-UN-MES-ATRAS.                                              *
REMARK*    SE CALCULA EL MES ANTERIOR DE LA FECHA DADA PARA HACER LA   *
REMARK*    LINEA DE BALANCE Y UBICAR EL VECTOR DE CAMBIOS DE DIRECCION *
REMARK******************************************************************
RCNCER     SUBTRACT 1 FROM MES-RUTINA-BDLDIR.                           RMB0010 
RCNCER     IF MES-RUTINA-BDLDIR = 0                                     RMB0010 
RCNCER        SUBTRACT 1 FROM ANO-RUTINA-BDLDIR                         RMB0010 
RCNCER        MOVE 12 TO MES-RUTINA-BDLDIR                              RMB0010 
ORDDIR     END-IF.
NCAM18*                                                                *ABB0034
NCAM18 2017-CALCULAR-ENTIDADES-TEL.                                     ABB0034
NCAM18******************************************************************ABB0034
NCAM18*    CUENTA EL NUMERO DE ENTIDADES QUE REPORTAN EL MISMO         *ABB0034
NCAM18*    TELEFONO                                                    *ABB0034
NCAM18******************************************************************ABB0034
NCAM18     MOVE 1 TO I-BDLDIR                                           ABB0034
NCAM18     PERFORM UNTIL I-BDLDIR >= TEL-OK-BDLDIR                      ABB0034
NCAM19       MOVE ZEROS TO I-RES-BDLDIR I-LAB-BDLDIR I-COR-BDLDIR       ABB0034
NCAM18       MOVE 1     TO K-BDLDIR                                     ABB0034
NCAM18       INITIALIZE TABLA-SUS-BDLDIR                                ABB0034
NCAM18       MOVE 1     TO I-SUS-BDLDIR                                 ABB0034
NCAM18       MOVE V-SUSTEL-BDLDIR(I-BDLDIR) TO COD-SUSCRIP-ABD02        ABB0034
NCAM18       PERFORM 2017-LEER-SUSCRIPTOR                               ABB0034
NCAM18       MOVE NIT-SUSCRIP-S-ABD02 TO V-SUS-BDLDIR(I-SUS-BDLDIR)     ABB0034
NCAM18       PERFORM UNTIL K-BDLDIR >= TEL-OK-BDLDIR                    ABB0034
NCAM18         IF V-TELEFONO-BDLDIR(I-BDLDIR) =                         ABB0034
NCAM18            V-TELEFONO-BDLDIR(K-BDLDIR)                           ABB0034
NCAM18            IF V-FECCRETEL-BDLDIR(I-BDLDIR) >                     ABB0034 
NCAM18               V-FECCRETEL-BDLDIR(K-BDLDIR)                       ABB0034 
NCAM18               MOVE V-FECCRETEL-BDLDIR(K-BDLDIR) TO               ABB0034 
NCAM18                    V-FECCRETEL-BDLDIR(I-BDLDIR)                  ABB0034 
NCAM18            ELSE                                                  ABB0034 
NCAM18               MOVE V-FECCRETEL-BDLDIR(I-BDLDIR) TO               ABB0034 
NCAM18                    V-FECCRETEL-BDLDIR(K-BDLDIR)                  ABB0034 
NCAM18            END-IF                                                ABB0034 
NCAM19            IF V-TIPOTEL-BDLDIR(K-BDLDIR) = "R"                   ABB0034
NCAM19               MOVE 1 TO I-RES-BDLDIR                             ABB0034
NCAM19            END-IF                                                ABB0034
NCAM19            IF V-TIPOTEL-BDLDIR(K-BDLDIR) = "L"                   ABB0034
NCAM19               MOVE 2 TO I-LAB-BDLDIR                             ABB0034
NCAM19            END-IF                                                ABB0034
NCAM19            IF V-TIPOTEL-BDLDIR(K-BDLDIR) = "C"                   ABB0034
NCAM19               MOVE 4 TO I-COR-BDLDIR                             ABB0034
NCAM19            END-IF                                                ABB0034
NCAM18            MOVE V-SUSTEL-BDLDIR(K-BDLDIR) TO COD-SUSCRIP-ABD02   ABB0034
NCAM18            PERFORM 2017-LEER-SUSCRIPTOR                          ABB0034
NCAM18            MOVE NIT-SUSCRIP-S-ABD02 TO N-SUS-BDLDIR              ABB0034
NCAM18            MOVE 1 TO K-SUS-BDLDIR                                ABB0034
NCAM18            MOVE 0 TO J-SUS-BDLDIR                                ABB0034
NCAM18            PERFORM UNTIL K-SUS-BDLDIR > I-SUS-BDLDIR             ABB0034
NCAM18              IF N-SUS-BDLDIR = V-SUS-BDLDIR(K-SUS-BDLDIR)        ABB0034
NCAM18                 MOVE 1 TO J-SUS-BDLDIR                           ABB0034
NCAM18                 MOVE I-SUS-BDLDIR TO K-SUS-BDLDIR                ABB0034
NCAM18              END-IF                                              ABB0034
NCAM18              ADD 1 TO K-SUS-BDLDIR                               ABB0034
NCAM18            END-PERFORM                                           ABB0034
NCAM18            IF J-SUS-BDLDIR = 0                                   ABB0034
NCAM18               ADD  1 TO I-SUS-BDLDIR                             ABB0034
NCAM18               MOVE N-SUS-BDLDIR TO V-SUS-BDLDIR(I-SUS-BDLDIR)    ABB0034
NCAM18            END-IF                                                ABB0034
NCAM18         END-IF                                                   ABB0034
NCAM18         ADD 1 TO K-BDLDIR                                        ABB0034
NCAM18       END-PERFORM                                                ABB0034
NCAM19       COMPUTE I-SDT-BDLDIR =                                     ABB0034
NCAM19               I-RES-BDLDIR + I-LAB-BDLDIR + I-COR-BDLDIR         ABB0034
NCAM19       MOVE I-SDT-BDLDIR TO V-TIPOTE-BDLDIR(I-BDLDIR)             ABB0034
NCAM18       MOVE I-SUS-BDLDIR TO V-NUMENTTEL-BDLDIR(I-BDLDIR)          ABB0034
NCAM18       ADD 1 TO I-BDLDIR                                          ABB0034
NCAM18     END-PERFORM.                                                 ABB0034
NCAM18*                                                                *ABB0034
ORDTEL*-----------------MEJORES TELEFONOS     ---------------------------
ORDTEL 2017-U-ELEGIR-TELEFONOS.     
REMARK*******************************************************************
REMARK* SE UNIFICAN LAS TELEFONOS   Y SE ORDENAN POR EL CRITERIO DE LA
REMARK* MEJOR FECHA Y EL NUMERO DE OCURRENCIAS.                          
REMARK* LA RUTINA DEVUELVE UN ARREGLO CON ESTOS TELEFONOS   ORDENADOS
AMPDIR*         05 V-TELFIN       PIC X(12) TELEFONO                    FAC0009 
AMPDIR*         05 V-CIUTELFIN    PIC X(20) CIUDAD                      FAC0009 
REMARK*         05 V-TIPTELFIN    PIC X(01) UBICACION
REMARK*         05 V-FECTELFIN    PIC 9(6)  FECHA MEJOR.
REMARK*         05 V-NUMTELFIN    PIC 9(3)  NUMERO DE COINCIDENCIAS.
REMARK*         05 V-SUSTELFIN    PIC 9(6)  CODIGO DE SUSCRIPTOR.
NCAM18*         05 V-FECCRETELFIN PIC 9(6)  FECHA REPORTE PRIMERA VEZ
REMARK*******************************************************************
RCNCER     MOVE 0 TO J-BDLDIR.                                          RMB0010 
RCNCER     IF TEL-OK-BDLDIR > 1                                         RMB0010 
RCNCER        SORT T-TEL-BDLDIR                                         RMB0010 
RCNCER             DESCENDING V-TELEFONO-BDLDIR V-TIPOTEL-BDLDIR        RMB0010 
NCAM18        PERFORM 2017-CALCULAR-ENTIDADES-TEL                       ABB0034
RCNCER        MOVE ALL "9" TO NUMTEL-BDLDIR                             RMB0010 
RCNCER        MOVE 1 TO I-BDLDIR                                        RMB0010 
RCNCER        MOVE ALL "0" TO TABLA-FECHADIR-AUX-BDLDIR                 RMB0010 
RCNCER        MOVE 1 TO K-BDLDIR                                        RMB0010 
RCNCER        PERFORM UNTIL I-BDLDIR >= TEL-OK-BDLDIR                   RMB0010 
RCNCER          IF NUMTEL-BDLDIR NOT = V-TELEFONO-BDLDIR (I-BDLDIR)     RMB0010 
RCNCER             IF I-BDLDIR > 1                                      RMB0010 
ORDTEL                PERFORM 2017-CALCULAR-VECTOR-RES        
RCNCER                MOVE VEC-HIS-BDLDIR                               RMB0010 
RCNCER                     TO V-VECTELFIN-BDLDIR(J-BDLDIR)              RMB0010 
ORDTEL             END-IF
RCNCER             MOVE V-FECHATEL-BDLDIR(I-BDLDIR)                     RMB0010 
RCNCER                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)              RMB0010 
RCNCER             ADD 1 TO K-BDLDIR                                    RMB0010 
RCNCER             ADD 1 TO J-BDLDIR                                    RMB0010 
NCAM18             MOVE V-FECCRETEL-BDLDIR(I-BDLDIR)                    ABB0034 
NCAM18                  TO V-FECCRETELFIN-BDLDIR(J-BDLDIR)              ABB0034 
NCAM18             MOVE V-NUMENTTEL-BDLDIR(I-BDLDIR)                    ABB0034 
NCAM18                  TO V-NUMENTTELFIN-BDLDIR(J-BDLDIR)              ABB0034 
NCAM19             MOVE V-TIPOTE-BDLDIR   (I-BDLDIR)                    ABB0034 
NCAM19                  TO V-TIPOTEFIN-BDLDIR   (J-BDLDIR)              ABB0034 
RCNCER             MOVE V-TELEFONO-BDLDIR (I-BDLDIR)                    RMB0010 
RCNCER                  TO V-TELFIN-BDLDIR(J-BDLDIR)                    RMB0010 
RCNCER             MOVE V-FECHATEL-BDLDIR(I-BDLDIR)                     RMB0010 
RCNCER                  TO V-FECTELFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER             MOVE V-CIUDADTEL-BDLDIR(I-BDLDIR)                    RMB0010 
RCNCER                  TO V-CIUTELFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER             MOVE V-TIPOTEL-BDLDIR(I-BDLDIR)                      RMB0010 
RCNCER                  TO V-TIPTELFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER             MOVE V-SUSTEL-BDLDIR (I-BDLDIR)                      RMB0010 
RCNCER                  TO V-SUSTELFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER             MOVE V-HASTEL-BDLDIR (I-BDLDIR)                      RMB0010 
RCNCER                  TO V-HASTELFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER             MOVE 1  TO V-NUMTELFIN-BDLDIR(J-BDLDIR)              RMB0010 
RCNCER             MOVE V-TELEFONO-BDLDIR(I-BDLDIR)  TO NUMTEL-BDLDIR   RMB0010 
TELEXC             MOVE V-FECULTTEL-BDLDIR(I-BDLDIR)                    AAM0017
TELEXC                  TO V-FECULTTELFIN-BDLDIR(J-BDLDIR)              AAM0017

REPLUS             MOVE V-DEPTEL-BDLDIR(I-BDLDIR)
REPLUS                  TO V-DEPTELFIN-BDLDIR(J-BDLDIR)

ORDTEL          ELSE
RCNCER             MOVE V-FECHATEL-BDLDIR(I-BDLDIR)                     RMB0010 
RCNCER                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)              RMB0010 
RCNCER             ADD 1 TO K-BDLDIR                                    RMB0010 
RCNCER             ADD 1 TO V-NUMTELFIN-BDLDIR(J-BDLDIR)                RMB0010 
RCNCER             IF V-FECHATEL-BDLDIR(I-BDLDIR) >                     RMB0010 
RCNCER                V-FECTELFIN-BDLDIR(J-BDLDIR)                      RMB0010 
NCAM18                MOVE V-FECCRETEL-BDLDIR(I-BDLDIR)                 ABB0034 
NCAM18                     TO V-FECCRETELFIN-BDLDIR(J-BDLDIR)           ABB0034 
NCAM18                MOVE V-NUMENTTEL-BDLDIR(I-BDLDIR)                 ABB0034 
NCAM18                     TO V-NUMENTTELFIN-BDLDIR(J-BDLDIR)           ABB0034 
NCAM19                MOVE V-TIPOTE-BDLDIR   (I-BDLDIR)                 ABB0034 
NCAM19                     TO V-TIPOTEFIN-BDLDIR   (J-BDLDIR)           ABB0034 
RCNCER                MOVE V-FECHATEL-BDLDIR(I-BDLDIR)                  RMB0010 
RCNCER                     TO V-FECTELFIN-BDLDIR(J-BDLDIR)              RMB0010 
RCNCER                MOVE V-TELEFONO-BDLDIR (I-BDLDIR)                 RMB0010 
RCNCER                     TO V-TELFIN-BDLDIR(J-BDLDIR)                 RMB0010 
RCNCER                MOVE V-CIUDADTEL-BDLDIR(I-BDLDIR)                 RMB0010 
RCNCER                     TO V-CIUTELFIN-BDLDIR(J-BDLDIR)              RMB0010 
RCNCER                MOVE V-TIPOTEL-BDLDIR(I-BDLDIR)                   RMB0010 
RCNCER                     TO V-TIPTELFIN-BDLDIR(J-BDLDIR)              RMB0010 
RCNCER                MOVE V-SUSTEL-BDLDIR (I-BDLDIR)                   RMB0010 
RCNCER                     TO V-SUSTELFIN-BDLDIR(J-BDLDIR)              RMB0010 
RCNCER                MOVE V-HASTEL-BDLDIR (I-BDLDIR)                   RMB0010 
RCNCER                     TO V-HASTELFIN-BDLDIR(J-BDLDIR)              RMB0010 
TELEXC                MOVE V-FECULTTEL-BDLDIR(I-BDLDIR)                 AAM0017
TELEXC                     TO V-FECULTTELFIN-BDLDIR(J-BDLDIR)           AAM0017

REPLUS                MOVE V-DEPTEL-BDLDIR(I-BDLDIR)
REPLUS                     TO V-DEPTELFIN-BDLDIR(J-BDLDIR)

ORDTEL             END-IF
ORDTEL          END-IF
      *
AJCONT          MOVE V-SEC01TELFIN-BDLDIR(J-BDLDIR) TO                  FARF035
AJCONT               V-SECUNI00TEL-BDLDIR(I-BDLDIR)                     FARF035
RCNCER          ADD 1 TO I-BDLDIR                                       RMB0010 
ORDTEL        END-PERFORM
RCNCER        IF I-BDLDIR > 1                                           RMB0010 
ORDTEL           PERFORM 2017-CALCULAR-VECTOR-RES         
RCNCER           MOVE VEC-HIS-BDLDIR                                    RMB0010 
RCNCER                TO V-VECTELFIN-BDLDIR(J-BDLDIR)                   RMB0010 
ORDTEL        END-IF
ORDTEL     END-IF.
RCNCER     IF J-BDLDIR > 0                                              RMB0010 
RCNCER        MOVE 1 TO I-BDLDIR                                        RMB0010 
RCNCER        PERFORM UNTIL I-BDLDIR > J-BDLDIR                         RMB0010 
RCNCER           MOVE V-TELFIN-BDLDIR(I-BDLDIR) TO TELEFONO-BDLDIR      RMB0010 
RCNCER           PERFORM 2017-U-CALIFICAR-TELEFONOS                     RMB0010 
RCNCER           MOVE CAL-TEL-BDLDIR TO V-CALTELFIN-BDLDIR(I-BDLDIR)    RMB0010 
TELEXC*-------- Se Excluyen Teléfonos según tabla de exclusión --------*AAM0017
TELEXC           IF CAL-TEL-BDLDIR <> 0                                 AAM0017
TELEXC              PERFORM 2018-EVALUA-EXCLUSION-TEL                   AAM0017
TELEXC           END-IF                                                 AAM0017
RCNCER***        SE ELIMINAN LOS TELEFONOS CALIFICADOS EN CERO          RMB0010 
RCNCER           IF CAL-TEL-BDLDIR = 0                                  RMB0010 
RCNCER              MOVE 0 TO V-FECTELFIN-BDLDIR(I-BDLDIR)              RMB0010 
RCNCER           END-IF                                                 RMB0010 
RCNCER           ADD  1 TO I-BDLDIR                                     RMB0010 
RCNCER        END-PERFORM                                               RMB0010 
TELEXC        PERFORM 2020-UNIFICA-TELEFONOS                            AAM0017
      *                                                                 FARF035
AJCONT        MOVE 1 TO I-BDLDIR                                        FARF035
AJCONT        PERFORM UNTIL I-BDLDIR > 100                              FARF035
AJCONT           IF V-SECUNI00TEL-BDLDIR(I-BDLDIR) > 0                  FARF035
AJCONT              MOVE 1 TO J-BDLDIR                                  FARF035
AJCONT              PERFORM UNTIL J-BDLDIR > 100                        FARF035
AJCONT                 IF V-SECUNI00TEL-BDLDIR(I-BDLDIR) =              FARF035
AJCONT                    V-SEC01TELFIN-BDLDIR(J-BDLDIR)                FARF035
AJCONT                    IF  V-FECTELFIN-BDLDIR(J-BDLDIR) = 0          FARF035
AJCONT                        MOVE 0 TO V-SECUNI00TEL-BDLDIR(I-BDLDIR)  FARF035
AJCONT                    END-IF                                        FARF035
AJCONT                    MOVE 200  TO J-BDLDIR                         FARF035
AJCONT                 ELSE                                             FARF035
AJCONT                    ADD 1 TO J-BDLDIR                             FARF035
AJCONT                 END-IF                                           FARF035
AJCONT              END-PERFORM                                         FARF035
AJCONT           END-IF                                                 FARF035
      *
AJCONT           ADD 1 TO I-BDLDIR                                      FARF035
AJCONT        END-PERFORM                                               FARF035
      *
RCNCER        SORT T-TELFINALES-BDLDIR DESCENDING V-CALTELFIN-BDLDIR    RMB0010 
RCNCER                                 DESCENDING V-FECTELFIN-BDLDIR    RMB0010 
RCNCER                                 DESCENDING V-NUMTELFIN-BDLDIR    RMB0010 
RCNCER        MOVE 1 TO I-BDLDIR                                        RMB0010 
RCNCER     END-IF.                                                      RMB0010 
AJCONT*    CONTEO DE ENTIDADES PARA TELEFONOS                           FARF035
AJCONT     MOVE 1  TO I-BDLDIR.                                         FARF035
AJCONT     PERFORM UNTIL V-FECTELFIN-BDLDIR(I-BDLDIR) = 0               FARF035
AJCONT                  OR I-BDLDIR > 100                               FARF035
AJCONT        MOVE  1 TO J-BDLDIR                                       FARF035
AJCONT        MOVE SPACES TO M-CONTEOS-TEX                              FARF035
AJCONT        MOVE ZEROS  TO M-CONTEOS-NUM                              FARF035
AJCONT        MOVE 0 TO I-RES-BDLDIR I-LAB-BDLDIR I-COR-BDLDIR          FARF035
AJCONT        MOVE 0 TO I-SDT-BDLDIR                                    FARF035
AJCONT        PERFORM UNTIL J-BDLDIR > 100                              FARF035
AJCONT           IF V-SECUNI00TEL-BDLDIR(J-BDLDIR) =                    FARF035
AJCONT              V-SEC01TELFIN-BDLDIR(I-BDLDIR)                      FARF035
AJCONT              MOVE V-SUSTEL-BDLDIR(J-BDLDIR) TO COD-SUSCRIP-ABD02 FARF035
AJCONT              PERFORM 1000-CONTAR-SUSCRIPTORES                    FARF035
AJCONT              PERFORM 1000-CONTAR-TIPOS-UBICACION-TEL             FARF035
AJCONT           END-IF
      *
AJCONT           ADD 1 TO J-BDLDIR                                      FARF035
AJCONT        END-PERFORM                                               FARF035
      *
AJCONT        MOVE I-SDT-BDLDIR TO V-NUMENTTELFIN-BDLDIR(I-BDLDIR)      FARF035
AJCONT        COMPUTE V-TIPOTEFIN-BDLDIR(I-BDLDIR) =                    FARF035
AJCONT                I-RES-BDLDIR * 1 +                                FARF035
AJCONT                I-LAB-BDLDIR * 2                                  FARF035
AJCONT        ADD 1 TO I-BDLDIR                                         FARF035
AJCONT     END-PERFORM.                                                 FARF035
      *
RCNCER*----------------- CALIFICAR TELEFONOS  --------------------------RMB0010 
RCNCER 2017-U-CALIFICAR-TELEFONOS.                                      RMB0010 
RCNCER     MOVE 1 TO M-BDLDIR                                           RMB0010 
RCNCER     PERFORM UNTIL TELEFONO-BDLDIR(M-BDLDIR:1) NOT = "0"          RMB0010 
RCNCER       ADD 1 TO M-BDLDIR                                          RMB0010 
RCNCER       IF M-BDLDIR > 12                                           RMB0010 
RCNCER          NEXT SENTENCE                                           RMB0010 
RCNCER       END-IF                                                     RMB0010 
RCNCER     END-PERFORM.                                                 RMB0010
      *
RCNCER     MOVE 0 TO CAL-TEL-BDLDIR                                     RMB0010
TEL028     IF TELEFONO-BDLDIR(6:1) = "0" OR                             PJV0028
TEL028        TELEFONO-BDLDIR(6:1) = "1" OR                             PJV0028
TEL028        TELEFONO-BDLDIR(6:1) = "9"                                PJV0028
TEL028        MOVE 1 TO M-BDLDIR                                        PJV0028
TEL028     END-IF.                                                      PJV0028
      *
RCNCER     EVALUATE M-BDLDIR                                            RMB0010 
RCNCER       WHEN 6                                                     RMB0010 
RCNCER         MOVE 15 TO CAL-TEL-BDLDIR                                RMB0010 
RCNCER       WHEN 4                                                     RMB0010 
RCNCER         IF TELEFONO-BDLDIR(6:1) NOT = "0"                        RMB0010 
RCNCER            IF TELEFONO-BDLDIR(4:1) = "9" OR "7" OR "5"           RMB0010 
RCNCER               MOVE 15 TO CAL-TEL-BDLDIR                          RMB0010 
RCNCER            END-IF                                                RMB0010 
RCNCER         END-IF                                                   RMB0010 
RCNCER       WHEN 3                                                     RMB0010 
RCNCER          IF TELEFONO-BDLDIR(6:1) NOT = "0"                       RMB0010 
RCNCER             IF TELEFONO-BDLDIR(3:2) = "57" AND                   RMB0010 
RCNCER                (TELEFONO-BDLDIR(5:1) NOT = "3" OR "9")           RMB0010 
RCNCER                MOVE 15 TO CAL-TEL-BDLDIR                         RMB0010 
RCNCER             END-IF                                               RMB0010 
RCNCER             IF TELEFONO-BDLDIR(3:1) = "3"                        RMB0010
PLNCHQ*               APLICACION REGLA 10 EXCLUSION TELEFONOS(1)        FARF032
PLNCHQ                MOVE TELEFONO-BDLDIR TO TEL-AUX-BDLDIR            FARF032
PLNCHQ                IF ES-CELULAR-BDLDIR AND P1-TEL-AUX-BDLDIR = 0    FARF032
RCNCER                    MOVE 15 TO CAL-TEL-BDLDIR                     RMB0010
PLNCHQ                END-IF                                            FARF032
RCNCER             END-IF                                               RMB0010 
RCNCER         END-IF                                                   RMB0010 
RCNCER     END-EVALUATE.                                                RMB0010
      *
TELEXC*----------------- EVALUA EXCLUSION DE TELEFONOS ----------------*AAM0017
TELEXC 2018-EVALUA-EXCLUSION-TEL.                                       AAM0017
MOD023*    OPEN INPUT BDLTELEXC                                         RGH0023
MOD023     IF OPEN-BDLTELEXC-BDLDIR = 0                                 RGH0023
MOD023        MOVE 1 TO OPEN-BDLTELEXC-BDLDIR                           RGH0023
MOD023        OPEN INPUT BDLTELEXC                                      RGH0023
MOD023     END-IF                                                       RGH0023
RECPF2*TELEXC     MOVE 1 TO IQ                                          HGO0022
TEXTEL*TELEXC     PERFORM UNTIL IQ > 12 OR CAL-TEL-BDLDIR = 0           HGO0020
RECPF2*TEXTEL     PERFORM UNTIL IQ > 24 OR CAL-TEL-BDLDIR = 0           HGO0022
RECPF2     MOVE SPACES TO LLAVE-BDLTELEXC                               HGO0022
RECPF2     START BDLTELEXC KEY >= LLAVE-BDLTELEXC                       HGO0022
MOD023*    MOVE 0 TO FIN-BDLTELEXC                                      RGH0023
MOD023     MOVE 0 TO FIN-BDLTELEXC-BDLDIR                               RGH0023
RECPF2     READ BDLTELEXC NEXT RECORD                                   HGO0022
MOD023*    AT END MOVE 1 TO FIN-BDLTELEXC                               RGH0023
MOD023     AT END MOVE 1 TO FIN-BDLTELEXC-BDLDIR                        RGH0023
RECPF2     END-READ                                                     HGO0022
MOD023*    PERFORM UNTIL FIN-BDLTELEXC = 1 OR CAL-TEL-BDLDIR = 0        RGH0023
MOD023     PERFORM UNTIL FIN-BDLTELEXC-BDLDIR = 1 OR CAL-TEL-BDLDIR = 0 RGH0023
TELEXC        PERFORM 2019-BUSCA-POSINI-LONG-TELEXCLU                   AAM0017
TELEXC        IF POSI-EXCLU < 7                                         AAM0017
RECPF2*TELEXC           IF T-BDLTELEXC(IQ)(POSI-EXCLU:LONGCOMP-EXCLU)   HGO0022
MOD023*          IF TEL-EXCLU(POSI-EXCLU:LONGCOMP-EXCLU)                RGH0023
MOD023           IF TEL-EXCLU-BDLTELEXC(POSI-EXCLU:LONGCOMP-EXCLU)      RGH0023
TELEXC              = TELEFONO-BDLDIR(POSI-EXCLU:LONGCOMP-EXCLU)        AAM0017
TELEXC              MOVE 0 TO CAL-TEL-BDLDIR                            AAM0017
TELEXC           END-IF                                                 AAM0017
TELEXC        END-IF                                                    AAM0017
RECPF2*TELEXC        ADD 1 TO IQ                                        HGO0022
RECPF2        READ BDLTELEXC NEXT RECORD                                HGO0022
MOD023*       AT END MOVE 1 TO FIN-BDLTELEXC                            RGH0023
MOD023        AT END MOVE 1 TO FIN-BDLTELEXC-BDLDIR                     RGH0023
RECPF2        END-READ                                                  HGO0022
MOD023*    END-PERFORM                                                  RGH0023
MOD023     END-PERFORM.                                                 RGH0023
MOD023*    CLOSE BDLTELEXC.                                             RGH0023
TELEXC******************************************************************AAM0017
TELEXC*2019-BUSCA-POSINI-LONG-TELEXCLU                                  AAM0017
TELEXC*    BUSCA POSICION INICIAL Y LONGITUD DE REGISTRO DE TELEFONOS A AAM0017
TELEXC*    EXCLUIR.                                                     AAM0017
TELEXC******************************************************************AAM0017
TELEXC 2019-BUSCA-POSINI-LONG-TELEXCLU.                                 AAM0017
TELEXC     MOVE 0                TO SW-ENCUENTRA-PI                     AAM0017
TELEXC     MOVE 1                TO W-POSI                              AAM0017
RECPF2*TELEXC     INSPECT T-BDLTELEXC(IQ) REPLACING ALL LOW-VALUES      HGO0022
MOD023*    INSPECT TEL-EXCLU REPLACING ALL LOW-VALUES                   RGH0023
MOD023     INSPECT TEL-EXCLU-BDLTELEXC REPLACING ALL LOW-VALUES         RGH0023
TELEXC                                        BY SPACES                 AAM0017
TELEXC     PERFORM UNTIL SW-ENCUENTRA-PI = 1 OR W-POSI > 12             AAM0017
RECPF2*TELEXC        IF T-BDLTELEXC(IQ)(W-POSI:1) NOT EQUAL " "         HGO0022
MOD023*       IF TEL-EXCLU(W-POSI:1) NOT EQUAL " "                      RGH0023
MOD023        IF TEL-EXCLU-BDLTELEXC(W-POSI:1) NOT EQUAL " "            RGH0023
TELEXC           MOVE 1          TO SW-ENCUENTRA-PI                     AAM0017
TELEXC           MOVE W-POSI     TO POSI-EXCLU                          AAM0017
TELEXC           COMPUTE LONGCOMP-EXCLU = 12 - ( W-POSI - 1 )           AAM0017
TELEXC        END-IF                                                    AAM0017
TELEXC        ADD 1              TO W-POSI                              AAM0017
TELEXC     END-PERFORM                                                  AAM0017
TELEXC     IF W-POSI > 12                                               AAM0017
TELEXC        MOVE 12            TO POSI-EXCLU                          AAM0017
TELEXC        MOVE 0             TO LONGCOMP-EXCLU                      AAM0017
TELEXC     END-IF.                                                      AAM0017
TELEXC******************************************************************AAM0017
TELEXC*2020-UNIFICA-TELEFONOS                                           AAM0017
TELEXC*    UNIFICA TELEFONOS REPETIDOS                                  AAM0017
TELEXC******************************************************************AAM0017
TELEXC 2020-UNIFICA-TELEFONOS.                                          AAM0017
TELEXC     SORT T-TELFINALES-BDLDIR DESCENDING V-TELFIN-BDLDIR-2        AAM0017
TELEXC     MOVE 1                      TO W-I                           AAM0017
TELEXC*    MOVE W-I                    TO W-POSRC                       AAM0017
TELEXC     MOVE 0                      TO SW-1 SW-2                     AAM0017
TELEXC     MOVE 0                      TO W-OCURR                       AAM0017
TELEXC     PERFORM UNTIL W-I > 99  OR SW-1 = 1                          AAM0017
TELEXC       IF V-CALTELFIN-BDLDIR(W-I) > 0                             AAM0017
TELEXC         MOVE 1                   TO SW-1                         AAM0017
TELEXC         MOVE W-I                 TO W-POSRC                      AAM0017
TELEXC         COMPUTE W-I = W-I - 1                                    AAM0017
TELEXC       END-IF                                                     AAM0017
TELEXC       ADD 1 TO W-I                                               AAM0017
TELEXC     END-PERFORM                                                  AAM0017
TELEXC     IF W-I < 100                                                 AAM0017
TELEXC       MOVE V-TELFIN-BDLDIR(W-POSRC) TO W-TELANT                  AAM0017
TELEXC       MOVE V-NUMTELFIN-BDLDIR(W-POSRC) TO W-OCURR                AAM0017
TELEXC       MOVE 0 TO SW-1                                             AAM0017
TELEXC     END-IF                                                       AAM0017
TELEXC     PERFORM UNTIL W-I > 99  OR SW-1 = 1                          AAM0017
TELEXC       MOVE V-TELFIN-BDLDIR(W-I + 1) TO W-TELDES                  AAM0017
TELEXC       MOVE 1                     TO W-POSIUNI                    AAM0017
TELEXC       IF W-TELDES(6:7) = "       "                               AAM0017
TELEXC        MOVE 1                    TO SW-1                         AAM0017
TELEXC       END-IF                                                     AAM0017
TELEXC       IF V-CALTELFIN-BDLDIR(W-I + 1) > 0                         AAM0017
TELEXC        IF W-TELANT(6:7) = W-TELDES(6:7)                          AAM0017
TELEXC         COMPUTE W-OCURR = W-OCURR +                              AAM0017
TELEXC                           V-NUMTELFIN-BDLDIR(W-I + 1)            AAM0017
TELEXC         MOVE 0 TO SW-2                                           AAM0017
TELEXC         PERFORM UNTIL W-POSIUNI > 12 OR SW-2 = 1                 AAM0017
TELEXC          INSPECT W-TELANT REPLACING ALL LOW-VALUES BY SPACES     AAM0017
TELEXC          INSPECT W-TELDES REPLACING ALL LOW-VALUES BY SPACES     AAM0017
TELEXC          IF W-TELANT(W-POSIUNI:1) <> "0"                         AAM0017
TELEXC           MOVE W-POSIUNI TO W-POSANT                             AAM0017
TELEXC           MOVE 1         TO SW-2                                 AAM0017
TELEXC          END-IF                                                  AAM0017
TELEXC          ADD 1           TO W-POSIUNI                            AAM0017
TELEXC         END-PERFORM                                              AAM0017
TELEXC         IF W-POSIUNI > 12                                        AAM0017
TELEXC          MOVE 12         TO W-POSANT                             AAM0017
TELEXC         END-IF                                                   AAM0017
TELEXC         MOVE 0           TO SW-2                                 AAM0017
TELEXC         MOVE 1           TO W-POSIUNI                            AAM0017
TELEXC         PERFORM UNTIL W-POSIUNI > 12 OR SW-2 = 1                 AAM0017
TELEXC          IF W-TELDES(W-POSIUNI:1) <> "0"                         AAM0017
TELEXC           MOVE W-POSIUNI TO W-POSDES                             AAM0017
TELEXC           MOVE 1         TO SW-2                                 AAM0017
TELEXC          END-IF                                                  AAM0017
TELEXC          ADD 1           TO W-POSIUNI                            AAM0017
TELEXC         END-PERFORM                                              AAM0017
TELEXC         IF W-POSIUNI > 12                                        AAM0017
TELEXC          MOVE 12         TO W-POSDES                             AAM0017
TELEXC         END-IF                                                   AAM0017
TELEXC         MOVE 0           TO SW-2                                 AAM0017
TELEXC         IF W-POSANT < W-POSDES                                   AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION INI *-------*            AAM0017
TELEXC          IF V-FECTELFIN-BDLDIR(W-POSRC) <                        AAM0017
TELEXC             V-FECTELFIN-BDLDIR(W-I + 1)                          AAM0017
TELEXC           MOVE V-FECTELFIN-BDLDIR(W-I + 1)                       AAM0017
TELEXC             TO V-FECTELFIN-BDLDIR(W-POSRC)                       AAM0017
AJUFUR           MOVE V-FECULTTELFIN-BDLDIR(W-I + 1)                    FARF031
AJUFUR             TO V-FECULTTELFIN-BDLDIR(W-POSRC)                    FARF031 
TELEXC          END-IF                                                  AAM0017
TELEXC          IF V-CALTELFIN-BDLDIR(W-POSRC) <                        AAM0017
TELEXC             V-CALTELFIN-BDLDIR(W-I + 1)                          AAM0017
TELEXC           MOVE V-CALTELFIN-BDLDIR(W-I + 1)                       AAM0017
TELEXC             TO V-CALTELFIN-BDLDIR(W-POSRC)                       AAM0017
TELEXC          END-IF                                                  AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION FIN *-------*            AAM0017
TELEXC          MOVE 0 TO V-FECTELFIN-BDLDIR(W-I + 1)                   AAM0017
AJUFUR          MOVE 0 TO V-FECULTTELFIN-BDLDIR(W-I + 1)                FARF031 
TELEXC          MOVE 0 TO V-CALTELFIN-BDLDIR(W-I + 1)                   AAM0017
AJCONT          MOVE V-SEC01TELFIN-BDLDIR(W-I + 1) TO SEC-BDLDIR        FARF035
AJCONT          MOVE V-SEC01TELFIN-BDLDIR(W-POSRC) TO                   FARF035
AJCONT               V-SECUNI00TEL-BDLDIR(SEC-BDLDIR)                   FARF035
TELEXC         ELSE                                                     AAM0017
TELEXC          IF W-POSANT = W-POSDES                                  AAM0017
TELEXC           IF V-NUMTELFIN-BDLDIR(W-POSRC) >                       AAM0017
TELEXC              V-NUMTELFIN-BDLDIR(W-I + 1)                         AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION INI *-------*            AAM0017
TELEXC            IF V-FECTELFIN-BDLDIR(W-POSRC) <                      AAM0017
TELEXC               V-FECTELFIN-BDLDIR(W-I + 1)                        AAM0017
TELEXC             MOVE V-FECTELFIN-BDLDIR(W-I + 1)                     AAM0017
TELEXC               TO V-FECTELFIN-BDLDIR(W-POSRC)                     AAM0017
AJUFUR             MOVE V-FECULTTELFIN-BDLDIR(W-I + 1)                  FARF031
AJUFUR               TO V-FECULTTELFIN-BDLDIR(W-POSRC)                  FARF031 
TELEXC            END-IF                                                AAM0017
TELEXC            IF V-CALTELFIN-BDLDIR(W-POSRC) <                      AAM0017
TELEXC               V-CALTELFIN-BDLDIR(W-I + 1)                        AAM0017
TELEXC             MOVE V-CALTELFIN-BDLDIR(W-I + 1)                     AAM0017
TELEXC               TO V-CALTELFIN-BDLDIR(W-POSRC)                     AAM0017
TELEXC            END-IF                                                AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION FIN *-------*            AAM0017
TELEXC            MOVE 0 TO V-FECTELFIN-BDLDIR(W-I + 1)                 AAM0017
AJUFUR            MOVE 0 TO V-FECULTTELFIN-BDLDIR(W-I + 1)              FARF031 
TELEXC            MOVE 0 TO V-CALTELFIN-BDLDIR(W-I + 1)                 AAM0017
AJCONT            MOVE V-SEC01TELFIN-BDLDIR(W-I + 1) TO SEC-BDLDIR      FARF035
AJCONT            MOVE V-SEC01TELFIN-BDLDIR(W-POSRC) TO                 FARF035
AJCONT                 V-SECUNI00TEL-BDLDIR(SEC-BDLDIR)                 FARF035
TELEXC           ELSE                                                   AAM0017
TELEXC            IF V-NUMTELFIN-BDLDIR(W-POSRC) =                      AAM0017
TELEXC               V-NUMTELFIN-BDLDIR(W-I + 1)                        AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION INI *-------*            AAM0017
TELEXC             IF V-FECTELFIN-BDLDIR(W-POSRC) <                     AAM0017
TELEXC                V-FECTELFIN-BDLDIR(W-I + 1)                       AAM0017
TELEXC              MOVE V-FECTELFIN-BDLDIR(W-I + 1)                    AAM0017
TELEXC                TO V-FECTELFIN-BDLDIR(W-POSRC)                    AAM0017
AJUFUR              MOVE V-FECULTTELFIN-BDLDIR(W-I + 1)                 FARF031
AJUFUR                TO V-FECULTTELFIN-BDLDIR(W-POSRC)                 FARF031 
TELEXC             END-IF                                               AAM0017
TELEXC             IF V-CALTELFIN-BDLDIR(W-POSRC) <                     AAM0017
TELEXC                V-CALTELFIN-BDLDIR(W-I + 1)                       AAM0017
TELEXC              MOVE V-CALTELFIN-BDLDIR(W-I + 1)                    AAM0017
TELEXC                TO V-CALTELFIN-BDLDIR(W-POSRC)                    AAM0017
TELEXC             END-IF                                               AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION FIN *-------*            AAM0017
TELEXC             IF V-CALTELFIN-BDLDIR(W-POSRC) >                     AAM0017
TELEXC                V-CALTELFIN-BDLDIR(W-I + 1)                       AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION INI *-------*            AAM0017
TELEXC              IF V-FECTELFIN-BDLDIR(W-POSRC) <                    AAM0017
TELEXC                 V-FECTELFIN-BDLDIR(W-I + 1)                      AAM0017
TELEXC               MOVE V-FECTELFIN-BDLDIR(W-I + 1)                   AAM0017
TELEXC                 TO V-FECTELFIN-BDLDIR(W-POSRC)                   AAM0017
AJUFUR               MOVE V-FECULTTELFIN-BDLDIR(W-I + 1)                FARF031
AJUFUR                 TO V-FECULTTELFIN-BDLDIR(W-POSRC)                FARF031 
TELEXC              END-IF                                              AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION FIN *-------*            AAM0017
TELEXC              MOVE 0 TO V-FECTELFIN-BDLDIR(W-I + 1)               AAM0017
AJUFUR              MOVE 0 TO V-FECULTTELFIN-BDLDIR(W-I + 1)            FARF031 
TELEXC              MOVE 0 TO V-CALTELFIN-BDLDIR(W-I + 1)               AAM0017
AJCONT              MOVE V-SEC01TELFIN-BDLDIR(W-I + 1) TO SEC-BDLDIR    FARF035
AJCONT              MOVE V-SEC01TELFIN-BDLDIR(W-POSRC) TO               FARF035
AJCONT                   V-SECUNI00TEL-BDLDIR(SEC-BDLDIR)               FARF035
TELEXC             ELSE                                                 AAM0017
TELEXC              IF V-CALTELFIN-BDLDIR(W-POSRC) =                    AAM0017
TELEXC                 V-CALTELFIN-BDLDIR(W-I + 1)                      AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION INI *-------*            AAM0017
TELEXC               IF V-FECTELFIN-BDLDIR(W-POSRC) <                   AAM0017
TELEXC                  V-FECTELFIN-BDLDIR(W-I + 1)                     AAM0017
TELEXC                MOVE V-FECTELFIN-BDLDIR(W-I + 1)                  AAM0017
TELEXC                  TO V-FECTELFIN-BDLDIR(W-POSRC)                  AAM0017
AJUFUR                MOVE V-FECULTTELFIN-BDLDIR(W-I + 1)               FARF031
AJUFUR                  TO V-FECULTTELFIN-BDLDIR(W-POSRC)               FARF031 
TELEXC               END-IF                                             AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION FIN *-------*            AAM0017
TELEXC               IF V-FECTELFIN-BDLDIR(W-POSRC) >                   AAM0017
TELEXC                  V-FECTELFIN-BDLDIR(W-I + 1)                     AAM0017
TELEXC                MOVE 0 TO V-FECTELFIN-BDLDIR(W-I + 1)             AAM0017
AJUFUR                MOVE 0 TO V-FECULTTELFIN-BDLDIR(W-I + 1)          FARF031 
TELEXC                MOVE 0 TO V-CALTELFIN-BDLDIR(W-I + 1)             AAM0017
AJCONT                MOVE V-SEC01TELFIN-BDLDIR(W-I + 1) TO SEC-BDLDIR  FARF035
AJCONT                MOVE V-SEC01TELFIN-BDLDIR(W-POSRC) TO             FARF035
AJCONT                     V-SECUNI00TEL-BDLDIR(SEC-BDLDIR)             FARF035
TELEXC               ELSE                                               AAM0017
TELEXC                IF V-FECTELFIN-BDLDIR(W-POSRC) =                  AAM0017
TELEXC                   V-FECTELFIN-BDLDIR(W-I + 1)                    AAM0017
TELEXC                 MOVE 0 TO V-FECTELFIN-BDLDIR(W-I + 1)            AAM0017
AJUFUR                 MOVE 0 TO V-FECULTTELFIN-BDLDIR(W-I + 1)         FARF031 
TELEXC                 MOVE 0 TO V-CALTELFIN-BDLDIR(W-I + 1)            AAM0017
AJCONT                 MOVE V-SEC01TELFIN-BDLDIR(W-I + 1) TO SEC-BDLDIR FARF035
AJCONT                 MOVE V-SEC01TELFIN-BDLDIR(W-POSRC) TO            FARF035
AJCONT                      V-SECUNI00TEL-BDLDIR(SEC-BDLDIR)            FARF035
TELEXC                ELSE                                              AAM0017
TELEXC                 MOVE 1 TO SW-2                                   AAM0017
TELEXC                END-IF                                            AAM0017
TELEXC               END-IF                                             AAM0017
TELEXC              ELSE                                                AAM0017
TELEXC               MOVE 1 TO SW-2                                     AAM0017
TELEXC              END-IF                                              AAM0017
TELEXC             END-IF                                               AAM0017
TELEXC            ELSE                                                  AAM0017
TELEXC             MOVE 1 TO SW-2                                       AAM0017
TELEXC            END-IF                                                AAM0017
TELEXC           END-IF                                                 AAM0017
TELEXC          ELSE                                                    AAM0017
TELEXC           IF V-FECTELFIN-BDLDIR(W-POSRC) >                       AAM0017
TELEXC              V-FECTELFIN-BDLDIR(W-I + 1)                         AAM0017
TELEXC            MOVE V-FECTELFIN-BDLDIR(W-POSRC)                      AAM0017
TELEXC              TO V-FECTELFIN-BDLDIR(W-I + 1)                      AAM0017
AJUFUR            MOVE V-FECULTTELFIN-BDLDIR(W-POSRC)                   FARF031
AJUFUR              TO V-FECULTTELFIN-BDLDIR(W-I + 1)                   FARF031 
TELEXC           END-IF                                                 AAM0017
TELEXC           IF V-CALTELFIN-BDLDIR(W-POSRC) >                       AAM0017
TELEXC              V-CALTELFIN-BDLDIR(W-I + 1)                         AAM0017
TELEXC            MOVE V-CALTELFIN-BDLDIR(W-POSRC)                      AAM0017
TELEXC              TO V-CALTELFIN-BDLDIR(W-I + 1)                      AAM0017
TELEXC           END-IF                                                 AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION FIN *-------*            AAM0017
TELEXC           MOVE 0        TO V-FECTELFIN-BDLDIR(W-POSRC)           AAM0017
AJUFUR           MOVE 0        TO V-FECULTTELFIN-BDLDIR(W-POSRC)        FARF031 
TELEXC           MOVE 0        TO V-CALTELFIN-BDLDIR(W-POSRC)           AAM0017
AJCONT           MOVE V-SEC01TELFIN-BDLDIR(W-POSRC) TO SEC-BDLDIR       FARF035
AJCONT           MOVE V-SEC01TELFIN-BDLDIR(W-I + 1) TO                  FARF035
AJCONT                V-SECUNI00TEL-BDLDIR(SEC-BDLDIR)                  FARF035
TELEXC           MOVE W-TELDES TO W-TELANT                              AAM0017
TELEXC           COMPUTE W-POSRC = W-I + 1                              AAM0017
TELEXC*          MOVE 1 TO SW-2                                         AAM0017
TELEXC          END-IF                                                  AAM0017
TELEXC         END-IF                                                   AAM0017
TELEXC         IF SW-2 = 1                                              AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION INI *-------*            AAM0017
TELEXC          IF V-FECTELFIN-BDLDIR(W-POSRC) <                        AAM0017
TELEXC             V-FECTELFIN-BDLDIR(W-I + 1)                          AAM0017
TELEXC           MOVE V-FECTELFIN-BDLDIR(W-I + 1)                       AAM0017
TELEXC             TO V-FECTELFIN-BDLDIR(W-POSRC)                       AAM0017
AJUFUR            MOVE V-FECULTTELFIN-BDLDIR(W-I + 1)                   FARF031
AJUFUR              TO V-FECULTTELFIN-BDLDIR(W-POSRC)                   FARF031 
TELEXC          ELSE                                                    AAM0017
TELEXC           MOVE V-FECTELFIN-BDLDIR(W-POSRC)                       AAM0017
TELEXC             TO V-FECTELFIN-BDLDIR(W-I + 1)                       AAM0017
AJUFUR           MOVE V-FECULTTELFIN-BDLDIR(W-POSRC)                    FARF031
AJUFUR             TO V-FECULTTELFIN-BDLDIR(W-I + 1)                    FARF031 
TELEXC          END-IF                                                  AAM0017
TELEXC          IF V-CALTELFIN-BDLDIR(W-POSRC) <                        AAM0017
TELEXC             V-CALTELFIN-BDLDIR(W-I + 1)                          AAM0017
TELEXC           MOVE V-CALTELFIN-BDLDIR(W-I + 1)                       AAM0017
TELEXC             TO V-CALTELFIN-BDLDIR(W-POSRC)                       AAM0017
TELEXC          ELSE                                                    AAM0017
TELEXC           MOVE V-CALTELFIN-BDLDIR(W-POSRC)                       AAM0017
TELEXC             TO V-CALTELFIN-BDLDIR(W-I + 1)                       AAM0017
TELEXC          END-IF                                                  AAM0017
TELEXC*----------* VALIDA FECHA Y CALIFICACION FIN *-------*            AAM0017
TELEXC          MOVE 0        TO V-FECTELFIN-BDLDIR(W-POSRC)            AAM0017
AJUFUR          MOVE 0        TO V-FECULTTELFIN-BDLDIR(W-POSRC)         FARF031 
TELEXC          MOVE 0        TO V-CALTELFIN-BDLDIR(W-POSRC)            AAM0017
AJCONT          MOVE V-SEC01TELFIN-BDLDIR(W-POSRC) TO SEC-BDLDIR        FARF035
AJCONT          MOVE V-SEC01TELFIN-BDLDIR(W-I + 1) TO                   FARF035
AJCONT               V-SECUNI00TEL-BDLDIR(SEC-BDLDIR)                   FARF035
TELEXC          MOVE W-TELDES TO W-TELANT                               AAM0017
TELEXC          COMPUTE W-POSRC = W-I + 1                               AAM0017
TELEXC         END-IF                                                   AAM0017
TELEXC        ELSE                                                      AAM0017
TELEXC         MOVE W-OCURR  TO V-NUMTELFIN-BDLDIR(W-POSRC)             AAM0017
TELEXC         MOVE W-TELDES TO W-TELANT                                AAM0017
TELEXC         COMPUTE W-POSRC = W-I + 1                                AAM0017
TELEXC         MOVE V-NUMTELFIN-BDLDIR(W-POSRC) TO W-OCURR              AAM0017
TELEXC        END-IF                                                    AAM0017
TELEXC       END-IF                                                     AAM0017
TELEXC       IF SW-1 = 1 AND V-CALTELFIN-BDLDIR(W-I + 1) < 1            AAM0017
TELEXC         MOVE W-OCURR  TO V-NUMTELFIN-BDLDIR(W-POSRC)             AAM0017
TELEXC       END-IF                                                     AAM0017
TELEXC       ADD 1 TO W-I                                               AAM0017
TELEXC     END-PERFORM.                                                 AAM0017
NCAM18*                                                                *ABB0034
NCAM18 2017-CALCULAR-ENTIDADES-CEL.                                     ABB0034
NCAM18******************************************************************ABB0034
NCAM18*    CUENTA EL NUMERO DE ENTIDADES QUE REPORTAN EL MISMO         *ABB0034
NCAM18*    CELULAR                                                     *ABB0034
NCAM18******************************************************************ABB0034
NCAM18     MOVE 1 TO I-BDLDIR                                           ABB0034
NCAM18     PERFORM UNTIL I-BDLDIR >= CEL-OK-BDLDIR                      ABB0034
NCAM18       MOVE 1     TO K-BDLDIR                                     ABB0034
NCAM18       INITIALIZE TABLA-SUS-BDLDIR                                ABB0034
NCAM18       MOVE 1 TO I-SUS-BDLDIR                                     ABB0034
NCAM18       MOVE V-SUSCEL-BDLDIR(I-BDLDIR) TO COD-SUSCRIP-ABD02        ABB0034
NCAM18       PERFORM 2017-LEER-SUSCRIPTOR                               ABB0034
NCAM18       MOVE NIT-SUSCRIP-S-ABD02 TO V-SUS-BDLDIR(I-SUS-BDLDIR)     ABB0034
NCAM18       PERFORM UNTIL K-BDLDIR >= CEL-OK-BDLDIR                    ABB0034
NCAM18         IF V-CELULAR-BDLDIR(I-BDLDIR) =                          ABB0034
NCAM18            V-CELULAR-BDLDIR(K-BDLDIR)                            ABB0034
NCAM18            IF V-FECCRECEL-BDLDIR(I-BDLDIR) >                     ABB0034 
NCAM18               V-FECCRECEL-BDLDIR(K-BDLDIR)                       ABB0034 
NCAM18               MOVE V-FECCRECEL-BDLDIR(K-BDLDIR) TO               ABB0034 
NCAM18                    V-FECCRECEL-BDLDIR(I-BDLDIR)                  ABB0034 
NCAM18            ELSE                                                  ABB0034 
NCAM18               MOVE V-FECCRECEL-BDLDIR(I-BDLDIR) TO               ABB0034 
NCAM18                    V-FECCRECEL-BDLDIR(K-BDLDIR)                  ABB0034 
NCAM18            END-IF                                                ABB0034 
NCAM18            MOVE V-SUSCEL-BDLDIR(K-BDLDIR) TO COD-SUSCRIP-ABD02   ABB0034
NCAM18            PERFORM 2017-LEER-SUSCRIPTOR                          ABB0034
NCAM18            MOVE NIT-SUSCRIP-S-ABD02 TO N-SUS-BDLDIR              ABB0034
NCAM18            MOVE 1 TO K-SUS-BDLDIR                                ABB0034
NCAM18            MOVE 0 TO J-SUS-BDLDIR                                ABB0034
NCAM18            PERFORM UNTIL K-SUS-BDLDIR > I-SUS-BDLDIR             ABB0034
NCAM18              IF N-SUS-BDLDIR = V-SUS-BDLDIR(K-SUS-BDLDIR)        ABB0034
NCAM18                 MOVE 1 TO J-SUS-BDLDIR                           ABB0034
NCAM18                 MOVE I-SUS-BDLDIR TO K-SUS-BDLDIR                ABB0034
NCAM18              END-IF                                              ABB0034
NCAM18              ADD 1 TO K-SUS-BDLDIR                               ABB0034
NCAM18            END-PERFORM                                           ABB0034
NCAM18            IF J-SUS-BDLDIR = 0                                   ABB0034
NCAM18               ADD 1 TO I-SUS-BDLDIR                              ABB0034
NCAM18               MOVE N-SUS-BDLDIR TO V-SUS-BDLDIR(I-SUS-BDLDIR)    ABB0034
NCAM18            END-IF                                                ABB0034
NCAM18         END-IF                                                   ABB0034
NCAM18         ADD 1 TO K-BDLDIR                                        ABB0034
NCAM18       END-PERFORM                                                ABB0034
NCAM18       MOVE I-SUS-BDLDIR TO V-NUMENTCEL-BDLDIR(I-BDLDIR)          ABB0034
NCAM18       ADD 1 TO I-BDLDIR                                          ABB0034
NCAM18     END-PERFORM.                                                 ABB0034
NCAM18*                                                                *ABB0034
REPLUS 2017-U-ELEGIR-CELULARES.
REPLUS*******************************************************************
REPLUS* SE UNIFICAN LOS CELULARES Y SE ORDENAN POR EL CRITERIO DE LA
REPLUS* MEJOR FECHA Y EL NUMERO DE OCURRENCIAS.
REPLUS* LA RUTINA DEVUELVE UN ARREGLO CON ESTOS CELULARES ORDENADOS
REPLUS*         05 V-CELFIN       PIC X(12) CELULAR
REPLUS*         05 V-FECCELFIN    PIC 9(6)  FECHA MEJOR.
REPLUS*         05 V-NUMCELFIN    PIC 9(3)  NUMERO DE COINCIDENCIAS.
REPLUS*         05 V-SUSCELFIN    PIC 9(6)  CODIGO DE SUSCRIPTOR.
NCAM18*         05 V-FECCRECELFIN PIC 9(6)  FECHA REPORTE PRIMERA VEZ  
REPLUS*******************************************************************
REPLUS     MOVE 0 TO J-BDLDIR.                                           
REPLUS     IF CEL-OK-BDLDIR > 1                                          
REPLUS        SORT T-CEL-BDLDIR                                          
REPLUS             DESCENDING V-CELULAR-BDLDIR                          
NCAM18        PERFORM 2017-CALCULAR-ENTIDADES-CEL                       ABB0034
REPLUS        MOVE ALL "9" TO NUMCEL-BDLDIR                              
REPLUS        MOVE 1 TO I-BDLDIR                                         
REPLUS        MOVE ALL "0" TO TABLA-FECHADIR-AUX-BDLDIR                  
REPLUS        MOVE 1 TO K-BDLDIR                                         
REPLUS        PERFORM UNTIL I-BDLDIR >= CEL-OK-BDLDIR                    
REPLUS          IF NUMCEL-BDLDIR NOT = V-CELULAR-BDLDIR (I-BDLDIR)      
REPLUS             IF I-BDLDIR > 1                                       
REPLUS                PERFORM 2017-CALCULAR-VECTOR-RES                  
REPLUS                MOVE VEC-HIS-BDLDIR                                
REPLUS                     TO V-VECCELFIN-BDLDIR(J-BDLDIR)               
REPLUS             END-IF                                               
REPLUS             MOVE V-FECHACEL-BDLDIR(I-BDLDIR)                      
REPLUS                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)               
REPLUS             ADD 1 TO K-BDLDIR                                     
REPLUS             ADD 1 TO J-BDLDIR                                     
NCAM18             MOVE V-FECCRECEL-BDLDIR(I-BDLDIR)                    ABB0034
NCAM18                  TO V-FECCRECELFIN-BDLDIR(J-BDLDIR)              ABB0034
NCAM18             MOVE V-NUMENTCEL-BDLDIR(I-BDLDIR)                    ABB0034
NCAM18                  TO V-NUMENTCELFIN-BDLDIR(J-BDLDIR)              ABB0034
REPLUS             MOVE V-CELULAR-BDLDIR (I-BDLDIR)                    
REPLUS                  TO V-CELFIN-BDLDIR(J-BDLDIR)                     
REPLUS             MOVE V-FECHACEL-BDLDIR(I-BDLDIR)                      
REPLUS                  TO V-FECCELFIN-BDLDIR(J-BDLDIR)                  
REPLUS             MOVE V-SUSCEL-BDLDIR (I-BDLDIR)                       
REPLUS                  TO V-SUSCELFIN-BDLDIR(J-BDLDIR)                  
REPLUS             MOVE V-HASCEL-BDLDIR (I-BDLDIR)                       
REPLUS                  TO V-HASCELFIN-BDLDIR(J-BDLDIR)                  
REPLUS             MOVE 1  TO V-NUMCELFIN-BDLDIR(J-BDLDIR)               
REPLUS             MOVE V-CELULAR-BDLDIR(I-BDLDIR)  TO NUMCEL-BDLDIR   
REPLUS             MOVE V-FECULTCEL-BDLDIR(I-BDLDIR)                    
REPLUS                  TO V-FECULTCELFIN-BDLDIR(J-BDLDIR)
REPLUS             MOVE V-ORIGENCEL-BDLDIR(I-BDLDIR)                    
REPLUS                  TO V-ORIGENCELFIN-BDLDIR(J-BDLDIR)
REPLUS             MOVE 1 TO V-INDICACELFIN-BDLDIR(J-BDLDIR)
REPLUS          ELSE                                                    
REPLUS             MOVE V-FECHACEL-BDLDIR(I-BDLDIR)                      
REPLUS                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)               
REPLUS             ADD 1 TO K-BDLDIR                                     
REPLUS             ADD 1 TO V-NUMCELFIN-BDLDIR(J-BDLDIR)                 
REPLUS             IF V-FECHACEL-BDLDIR(I-BDLDIR) >                      
REPLUS                V-FECCELFIN-BDLDIR(J-BDLDIR)                       
NCAM18                MOVE V-FECCRECEL-BDLDIR(I-BDLDIR)                 ABB0034
NCAM18                     TO V-FECCRECELFIN-BDLDIR(J-BDLDIR)           ABB0034
NCAM18                MOVE V-NUMENTCEL-BDLDIR(I-BDLDIR)                 ABB0034
NCAM18                     TO V-NUMENTCELFIN-BDLDIR(J-BDLDIR)           ABB0034
REPLUS                MOVE V-FECHACEL-BDLDIR(I-BDLDIR)                   
REPLUS                     TO V-FECCELFIN-BDLDIR(J-BDLDIR)               
REPLUS                MOVE V-CELULAR-BDLDIR (I-BDLDIR)                 
REPLUS                     TO V-CELFIN-BDLDIR(J-BDLDIR)                  
REPLUS                MOVE V-SUSCEL-BDLDIR (I-BDLDIR)                    
REPLUS                     TO V-SUSCELFIN-BDLDIR(J-BDLDIR)               
REPLUS                MOVE V-HASCEL-BDLDIR (I-BDLDIR)                    
REPLUS                     TO V-HASCELFIN-BDLDIR(J-BDLDIR)               
REPLUS                MOVE V-FECULTCEL-BDLDIR(I-BDLDIR)                 
REPLUS                     TO V-FECULTCELFIN-BDLDIR(J-BDLDIR)
REPLUS                MOVE V-ORIGENCEL-BDLDIR(I-BDLDIR)                    
REPLUS                     TO V-ORIGENCELFIN-BDLDIR(J-BDLDIR)
REPLUS                MOVE 1 TO V-INDICACELFIN-BDLDIR(J-BDLDIR)
REPLUS             END-IF                                               
REPLUS          END-IF 
      *
AJCONT          MOVE V-SEC01CELFIN-BDLDIR(J-BDLDIR) TO                  FARF035
AJCONT               V-SECUNI00CEL-BDLDIR(I-BDLDIR)                     FARF035
REPLUS          ADD 1 TO I-BDLDIR                                        
REPLUS        END-PERFORM                                               
REPLUS        IF I-BDLDIR > 1                                            
REPLUS           PERFORM 2017-CALCULAR-VECTOR-RES                       
REPLUS           MOVE VEC-HIS-BDLDIR                                     
REPLUS                TO V-VECCELFIN-BDLDIR(J-BDLDIR)                    
REPLUS        END-IF                                                    
REPLUS     END-IF.                                                      
REPLUS     IF J-BDLDIR > 0                                               
REPLUS        MOVE 1 TO I-BDLDIR                                         
REPLUS        PERFORM UNTIL I-BDLDIR > J-BDLDIR                          
REPLUS           MOVE V-CELFIN-BDLDIR(I-BDLDIR) TO TELEFONO-BDLDIR       
REPLUS           PERFORM 2017-U-CALIFICAR-CELULARES                      
CAL028*          MOVE CAL-TEL-BDLDIR TO V-CALTELFIN-BDLDIR(I-BDLDIR)    PJV0028
CAL028           MOVE CAL-TEL-BDLDIR TO V-CALCELFIN-BDLDIR(I-BDLDIR)    PJV0028
REPLUS*-------- Se Excluyen Teléfonos según tabla de exclusión --------*
REPLUS           IF CAL-TEL-BDLDIR <> 0                                 
REPLUS              PERFORM 2018-EVALUA-EXCLUSION-TEL                   
REPLUS           END-IF                                                 
REPLUS***        SE ELIMINAN LOS TELEFONOS CALIFICADOS EN CERO           
REPLUS           IF CAL-TEL-BDLDIR = 0                                   
REPLUS              MOVE 0 TO V-FECCELFIN-BDLDIR(I-BDLDIR)               
REPLUS           END-IF                                                  
REPLUS           ADD  1 TO I-BDLDIR                                      
REPLUS        END-PERFORM    
      *
AJCONT        MOVE 1 TO I-BDLDIR
AJCONT        PERFORM UNTIL I-BDLDIR > 100
AJCONT           IF V-SECUNI00CEL-BDLDIR(I-BDLDIR) > 0
AJCONT              MOVE 1 TO J-BDLDIR
AJCONT              PERFORM UNTIL J-BDLDIR > 100
AJCONT                 IF V-SECUNI00CEL-BDLDIR(I-BDLDIR) =
AJCONT                    V-SEC01CELFIN-BDLDIR(J-BDLDIR)
AJCONT                    IF  V-FECCELFIN-BDLDIR(J-BDLDIR) = 0
AJCONT                        MOVE 0 TO V-SECUNI00CEL-BDLDIR(I-BDLDIR)
AJCONT                    END-IF
      *
AJCONT                    MOVE 200  TO J-BDLDIR
AJCONT                 ELSE
AJCONT                    ADD 1 TO J-BDLDIR
AJCONT                 END-IF
AJCONT              END-PERFORM
AJCONT           END-IF
      *
AJCONT           ADD 1 TO I-BDLDIR
AJCONT        END-PERFORM
      *
REPLUS        SORT T-CELFINALES-BDLDIR DESCENDING V-INDICACELFIN-BDLDIR
REPLUS                                 ASCENDING V-ORIGENCELFIN-BDLDIR
REPLUS                                 DESCENDING V-CALCELFIN-BDLDIR
REPLUS                                 DESCENDING V-FECCELFIN-BDLDIR     
REPLUS                                 DESCENDING V-NUMCELFIN-BDLDIR     
REPLUS        MOVE 1 TO I-BDLDIR                                         
REPLUS     END-IF.                                                       
AJCONT*    CONTEO DE ENTIDADES PARA CELULARES                           FARF035
AJCONT     MOVE 1  TO I-BDLDIR.                                         FARF035
AJCONT     PERFORM UNTIL V-FECCELFIN-BDLDIR(I-BDLDIR) = 0               FARF035
AJCONT                  OR I-BDLDIR > 100                               FARF035
AJCONT        MOVE  1 TO J-BDLDIR                                       FARF035
AJCONT        MOVE SPACES TO M-CONTEOS-TEX                              FARF035
AJCONT        MOVE ZEROS  TO M-CONTEOS-NUM                              FARF035
AJCONT        MOVE 0 TO I-RES-BDLDIR I-LAB-BDLDIR I-COR-BDLDIR          FARF035
AJCONT        MOVE 0 TO I-SDT-BDLDIR                                    FARF035
AJCONT        PERFORM UNTIL J-BDLDIR > 100                              FARF035
AJCONT           IF V-SECUNI00CEL-BDLDIR(J-BDLDIR) =                    FARF035
AJCONT              V-SEC01CELFIN-BDLDIR(I-BDLDIR)                      FARF035
AJCONT              MOVE V-SUSCEL-BDLDIR(J-BDLDIR) TO COD-SUSCRIP-ABD02 FARF035
AJCONT              PERFORM 1000-CONTAR-SUSCRIPTORES                    FARF035
AJCONT           END-IF                                                 FARF035
AJCONT*                                                                 FARF035
AJCONT           ADD 1 TO J-BDLDIR                                      FARF035
AJCONT        END-PERFORM                                               FARF035
AJCONT*                                                                 FARF035
AJCONT        MOVE I-SDT-BDLDIR TO V-NUMENTCELFIN-BDLDIR(I-BDLDIR)      FARF035
AJCONT        ADD 1 TO I-BDLDIR                                         FARF035
AJCONT     END-PERFORM.                                                 FARF035
      *
REPLUS*----------------- CALIFICAR CELULARES  --------------------------
REPLUS 2017-U-CALIFICAR-CELULARES.                                      
REPLUS     MOVE 1 TO M-BDLDIR.                                           
REPLUS     PERFORM UNTIL TELEFONO-BDLDIR(M-BDLDIR:1) NOT = "0"          
REPLUS       ADD 1 TO M-BDLDIR                                          
REPLUS       IF M-BDLDIR > 12                                           
REPLUS          NEXT SENTENCE                                           
REPLUS       END-IF                                                     
REPLUS     END-PERFORM.
      *
REPLUS     MOVE 0 TO CAL-TEL-BDLDIR.
TEL028     IF TELEFONO-BDLDIR(6:1) = "0" OR                             PJV0028
TEL028        TELEFONO-BDLDIR(6:1) = "1" OR                             PJV0028
TEL028        TELEFONO-BDLDIR(6:1) = "9"                                PJV0028
TEL028        MOVE 1 TO M-BDLDIR                                        PJV0028
TEL028     END-IF.                                                      PJV0028
      *
REPLUS     EVALUATE M-BDLDIR                                            
REPLUS       WHEN 3                                                     
PLNCHQ*        APLICACION REGLA 10 EXCLUSION TELEFONOS(1)               FARF032
PLNCHQ*        IF TELEFONO-BDLDIR(3:1) = "3"                            FARF032
PLNCHQ         MOVE TELEFONO-BDLDIR TO TEL-AUX-BDLDIR                   FARF032
PLNCHQ         IF ES-CELULAR-BDLDIR AND P1-TEL-AUX-BDLDIR = 0           FARF032
REPLUS            MOVE 15 TO CAL-TEL-BDLDIR                         
REPLUS         END-IF                                                   
REPLUS     END-EVALUATE.
NCAM18*                                                                *ABB0034
NCAM18 2017-CALCULAR-ENTIDADES-MAIL.                                    ABB0034
NCAM18******************************************************************ABB0034
NCAM18*    CUENTA EL NUMERO DE ENTIDADES QUE REPORTAN EL MISMO         *ABB0034
NCAM18*    EMAIL                                                       *ABB0034
NCAM18******************************************************************ABB0034
NCAM18     MOVE 1 TO I-BDLDIR                                           ABB0034
NCAM18     PERFORM UNTIL I-BDLDIR >= MAIL-OK-BDLDIR                     ABB0034
NCAM18       MOVE 1     TO K-BDLDIR                                     ABB0034
NCAM18       INITIALIZE TABLA-SUS-BDLDIR                                ABB0034
NCAM18       MOVE 1 TO I-SUS-BDLDIR                                     ABB0034
NCAM18       MOVE V-SUSMAIL-BDLDIR(I-BDLDIR) TO COD-SUSCRIP-ABD02       ABB0034
NCAM18       PERFORM 2017-LEER-SUSCRIPTOR                               ABB0034
NCAM18       MOVE NIT-SUSCRIP-S-ABD02 TO V-SUS-BDLDIR(I-SUS-BDLDIR)     ABB0034
NCAM18       PERFORM UNTIL K-BDLDIR >= MAIL-OK-BDLDIR                   ABB0034
NCAM18         IF V-MAIL-BDLDIR(I-BDLDIR) =                             ABB0034
NCAM18            V-MAIL-BDLDIR(K-BDLDIR)                               ABB0034
NCAM18            IF V-FECCREMAIL-BDLDIR(I-BDLDIR) >                    ABB0034 
NCAM18               V-FECCREMAIL-BDLDIR(K-BDLDIR)                      ABB0034 
NCAM18               IF   V-FECCREMAIL-BDLDIR(K-BDLDIR) > ZEROS         ABB0034 
NCAM18               MOVE V-FECCREMAIL-BDLDIR(K-BDLDIR) TO              ABB0034 
NCAM18                    V-FECCREMAIL-BDLDIR(I-BDLDIR)                 ABB0034 
NCAM18               END-IF                                             ABB0034 
NCAM18            ELSE                                                  ABB0034 
NCAM18               IF   V-FECCREMAIL-BDLDIR(I-BDLDIR) > ZEROS         ABB0034 
NCAM18               MOVE V-FECCREMAIL-BDLDIR(I-BDLDIR) TO              ABB0034 
NCAM18                    V-FECCREMAIL-BDLDIR(K-BDLDIR)                 ABB0034 
NCAM18               END-IF                                             ABB0034 
NCAM18            END-IF                                                ABB0034 
NCAM18            MOVE V-SUSMAIL-BDLDIR(K-BDLDIR) TO COD-SUSCRIP-ABD02  ABB0034
NCAM18            PERFORM 2017-LEER-SUSCRIPTOR                          ABB0034
NCAM18            MOVE NIT-SUSCRIP-S-ABD02 TO N-SUS-BDLDIR              ABB0034
NCAM18            MOVE 1 TO K-SUS-BDLDIR                                ABB0034
NCAM18            MOVE 0 TO J-SUS-BDLDIR                                ABB0034
NCAM18            PERFORM UNTIL K-SUS-BDLDIR > I-SUS-BDLDIR             ABB0034
NCAM18              IF N-SUS-BDLDIR = V-SUS-BDLDIR(K-SUS-BDLDIR)        ABB0034
NCAM18                 MOVE 1 TO J-SUS-BDLDIR                           ABB0034
NCAM18                 MOVE I-SUS-BDLDIR TO K-SUS-BDLDIR                ABB0034
NCAM18              END-IF                                              ABB0034
NCAM18              ADD 1 TO K-SUS-BDLDIR                               ABB0034
NCAM18            END-PERFORM                                           ABB0034
NCAM18            IF J-SUS-BDLDIR = 0                                   ABB0034
NCAM18               ADD 1 TO I-SUS-BDLDIR                              ABB0034
NCAM18               MOVE N-SUS-BDLDIR TO V-SUS-BDLDIR(I-SUS-BDLDIR)    ABB0034
NCAM18            END-IF                                                ABB0034
NCAM18         END-IF                                                   ABB0034
NCAM18         ADD 1 TO K-BDLDIR                                        ABB0034
NCAM18       END-PERFORM                                                ABB0034
NCAM18       MOVE I-SUS-BDLDIR TO V-NUMENTMAIL-BDLDIR(I-BDLDIR)         ABB0034
NCAM18       ADD 1 TO I-BDLDIR                                          ABB0034
NCAM18     END-PERFORM.                                                 ABB0034
NCAM18*                                                                *ABB0034
REPLUS 2017-U-ELEGIR-MAILS.
REPLUS*******************************************************************
REPLUS* SE UNIFICAN LOS MAILS Y SE ORDENAN POR EL CRITERIO DE LA
REPLUS* MEJOR FECHA Y EL NUMERO DE OCURRENCIAS.
REPLUS* LA RUTINA DEVUELVE UN ARREGLO CON ESTOS MAILS ORDENADOS
REPLUS*      05 V-MAILFIN       PIC X(40) E-MAIL
REPLUS*      05 V-FECMAILFIN    PIC 9(6)  FECHA MEJOR.
REPLUS*      05 V-NUMMAILFIN    PIC 9(3)  NUMERO DE COINCIDENCIAS.
REPLUS*      05 V-SUSMAILFIN    PIC 9(6)  CODIGO DE SUSCRIPTOR.
NCAM18*      05 V-FECCREMAILFIN PIC 9(6)  FECHA REPORTE PRIMERA VEZ
REPLUS*******************************************************************
REPLUS     MOVE 0 TO J-BDLDIR.                                           
REPLUS     IF MAIL-OK-BDLDIR > 1                                          
REPLUS        SORT T-MAIL-BDLDIR                                          
REPLUS             DESCENDING V-MAIL-BDLDIR                          
NCAM18        PERFORM 2017-CALCULAR-ENTIDADES-MAIL                      ABB0034
REPLUS        MOVE ALL "9" TO NUMMAIL-BDLDIR                              
REPLUS        MOVE 1 TO I-BDLDIR                                         
REPLUS        MOVE ALL "0" TO TABLA-FECHADIR-AUX-BDLDIR                  
REPLUS        MOVE 1 TO K-BDLDIR                                         
REPLUS        PERFORM UNTIL I-BDLDIR >= MAIL-OK-BDLDIR                    
REPLUS          IF NUMMAIL-BDLDIR NOT = V-MAIL-BDLDIR (I-BDLDIR)      
REPLUS             IF I-BDLDIR > 1                                       
REPLUS                PERFORM 2017-CALCULAR-VECTOR-RES                  
REPLUS                MOVE VEC-HIS-BDLDIR                                
REPLUS                     TO V-VECMAILFIN-BDLDIR(J-BDLDIR)               
REPLUS             END-IF                                               
REPLUS             MOVE V-FECHAMAIL-BDLDIR(I-BDLDIR)                      
REPLUS                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)               
REPLUS             ADD 1 TO K-BDLDIR                                     
REPLUS             ADD 1 TO J-BDLDIR                                     
NCAM18             MOVE V-FECCREMAIL-BDLDIR(I-BDLDIR)                   ABB0034
NCAM18                  TO V-FECCREMAILFIN-BDLDIR(J-BDLDIR)             ABB0034
NCAM18             MOVE V-NUMENTMAIL-BDLDIR(I-BDLDIR)                   ABB0034
NCAM18                  TO V-NUMENTMAILFIN-BDLDIR(J-BDLDIR)             ABB0034
REPLUS             MOVE V-MAIL-BDLDIR (I-BDLDIR)                    
REPLUS                  TO V-MAILFIN-BDLDIR(J-BDLDIR)                     
REPLUS             MOVE V-FECHAMAIL-BDLDIR(I-BDLDIR)                      
REPLUS                  TO V-FECMAILFIN-BDLDIR(J-BDLDIR)                  
REPLUS             MOVE V-SUSMAIL-BDLDIR (I-BDLDIR)                       
REPLUS                  TO V-SUSMAILFIN-BDLDIR(J-BDLDIR)                  
REPLUS             MOVE V-HASMAIL-BDLDIR (I-BDLDIR)                       
REPLUS                  TO V-HASMAILFIN-BDLDIR(J-BDLDIR)                  
REPLUS             MOVE 1  TO V-NUMMAILFIN-BDLDIR(J-BDLDIR)               
REPLUS             MOVE V-MAIL-BDLDIR(I-BDLDIR)  TO NUMMAIL-BDLDIR   
REPLUS             MOVE V-FECULTMAIL-BDLDIR(I-BDLDIR)                    
REPLUS                  TO V-FECULTMAILFIN-BDLDIR(J-BDLDIR)              
REPLUS             MOVE V-ORIGENMAIL-BDLDIR(I-BDLDIR)                    
REPLUS                  TO V-ORIGENMAILFIN-BDLDIR(J-BDLDIR)
REPLUS             MOVE 1 TO V-INDICAMAILFIN-BDLDIR(J-BDLDIR)
REPLUS          ELSE                                                    
REPLUS             MOVE V-FECHAMAIL-BDLDIR(I-BDLDIR)                      
REPLUS                  TO V-FECHADIR-AUX-BDLDIR(K-BDLDIR)               
REPLUS             ADD 1 TO K-BDLDIR                                     
REPLUS             ADD 1 TO V-NUMMAILFIN-BDLDIR(J-BDLDIR)                 
REPLUS             IF V-FECHAMAIL-BDLDIR(I-BDLDIR) >                      
REPLUS                V-FECMAILFIN-BDLDIR(J-BDLDIR)                       
NCAM18                MOVE V-FECCREMAIL-BDLDIR(I-BDLDIR)                ABB0034
NCAM18                     TO V-FECCREMAILFIN-BDLDIR(J-BDLDIR)          ABB0034
NCAM18                MOVE V-NUMENTMAIL-BDLDIR(I-BDLDIR)                ABB0034
NCAM18                     TO V-NUMENTMAILFIN-BDLDIR(J-BDLDIR)          ABB0034
REPLUS                MOVE V-FECHAMAIL-BDLDIR(I-BDLDIR)                   
REPLUS                     TO V-FECMAILFIN-BDLDIR(J-BDLDIR)               
REPLUS                MOVE V-MAIL-BDLDIR (I-BDLDIR)                 
REPLUS                     TO V-MAILFIN-BDLDIR(J-BDLDIR)                  
REPLUS                MOVE V-SUSMAIL-BDLDIR (I-BDLDIR)                    
REPLUS                     TO V-SUSMAILFIN-BDLDIR(J-BDLDIR)               
REPLUS                MOVE V-HASMAIL-BDLDIR (I-BDLDIR)                    
REPLUS                     TO V-HASMAILFIN-BDLDIR(J-BDLDIR)               
REPLUS                MOVE V-FECULTMAIL-BDLDIR(I-BDLDIR)                 
REPLUS                     TO V-FECULTMAILFIN-BDLDIR(J-BDLDIR)           
REPLUS               MOVE V-ORIGENMAIL-BDLDIR(I-BDLDIR)                    
REPLUS                     TO V-ORIGENMAILFIN-BDLDIR(J-BDLDIR)
REPLUS               MOVE 1 TO V-INDICAMAILFIN-BDLDIR(J-BDLDIR)
REPLUS             END-IF                                               
REPLUS          END-IF   
      *
AJCONT          MOVE V-SEC01MAILFIN-BDLDIR(J-BDLDIR) TO                 FARF035
AJCONT               V-SECUNI00MAIL-BDLDIR(I-BDLDIR)                    FARF035
REPLUS          ADD 1 TO I-BDLDIR                                        
REPLUS        END-PERFORM                                               
REPLUS        IF I-BDLDIR > 1                                            
REPLUS           PERFORM 2017-CALCULAR-VECTOR-RES                       
REPLUS           MOVE VEC-HIS-BDLDIR                                     
REPLUS                TO V-VECMAILFIN-BDLDIR(J-BDLDIR)                    
REPLUS        END-IF                                                    
REPLUS     END-IF.                                                      
REPLUS     IF J-BDLDIR > 0                                               
REPLUS        MOVE 1 TO I-BDLDIR
MOD023*       OPEN INPUT BDLMAIEXC                                      RGH0023
MOD023        IF OPEN-BDLMAIEXC-BDLDIR = 0                              RGH0023
MOD023           MOVE 1 TO OPEN-BDLMAIEXC-BDLDIR                        RGH0023
MOD023           OPEN INPUT BDLMAIEXC                                   RGH0023
MOD023        END-IF                                                    RGH0023
      *
REPLUS        PERFORM UNTIL I-BDLDIR > J-BDLDIR                          
REPLUS           MOVE V-MAILFIN-BDLDIR(I-BDLDIR) TO MAIL-BDLDIR
RECPF2                                              LLAVE-BDLMAIEXC     HGO0022
REPLUS           PERFORM 2017-U-CALIFICAR-MAIL                      
REPLUS           MOVE CAL-MAIL-BDLDIR TO V-CALMAILFIN-BDLDIR(I-BDLDIR)     
REPLUS***        SE ELIMINAN LOS MAILS CALIFICADOS EN CERO           
REPLUS           IF CAL-MAIL-BDLDIR = 0                                   
REPLUS              MOVE 0 TO V-FECMAILFIN-BDLDIR(I-BDLDIR)
AJEXMA              MOVE 0 TO V-INDICAMAILFIN-BDLDIR(I-BDLDIR)          FARF038
REPLUS           END-IF                                                  
REPLUS           ADD  1 TO I-BDLDIR                                      
REPLUS        END-PERFORM
      *
MOD023*       CLOSE BDLMAIEXC                                           RGH0023
AJCONT        MOVE 1 TO I-BDLDIR                                        FARF035
AJCONT        PERFORM UNTIL I-BDLDIR > 100                              FARF035
AJCONT           IF V-SECUNI00MAIL-BDLDIR(I-BDLDIR) > 0                 FARF035
AJCONT              MOVE 1 TO J-BDLDIR                                  FARF035
AJCONT              PERFORM UNTIL J-BDLDIR > 100                        FARF035
AJCONT                 IF V-SECUNI00MAIL-BDLDIR(I-BDLDIR) =             FARF035
AJCONT                    V-SEC01MAILFIN-BDLDIR(J-BDLDIR)               FARF035
AJCONT                    IF  V-FECMAILFIN-BDLDIR(J-BDLDIR) = 0         FARF035
AJCONT                        MOVE 0 TO V-SECUNI00MAIL-BDLDIR(I-BDLDIR) FARF035
AJCONT                    END-IF                                        FARF035
AJCONT                    MOVE 200  TO J-BDLDIR                         FARF035
AJCONT                 ELSE                                             FARF035
AJCONT                    ADD 1 TO J-BDLDIR                             FARF035
AJCONT                 END-IF                                           FARF035
AJCONT              END-PERFORM                                         FARF035
AJCONT           END-IF                                                 FARF035
      *                                                                 FARF035
AJCONT           ADD 1 TO I-BDLDIR                                      FARF035
AJCONT        END-PERFORM                                               FARF035
REPLUS       SORT T-MAILFINALES-BDLDIR DESCENDING V-INDICAMAILFIN-BDLDIR
REPLUS                                  ASCENDING V-ORIGENMAILFIN-BDLDIR
REPLUS                                  DESCENDING V-CALMAILFIN-BDLDIR
REPLUS                                  DESCENDING V-FECMAILFIN-BDLDIR     
REPLUS                                  DESCENDING V-NUMMAILFIN-BDLDIR     
REPLUS        MOVE 1 TO I-BDLDIR                                         
REPLUS     END-IF.
      *                                                                 FARF035
AJCONT*    CONTEO DE ENTIDADES PARA EMAILS                              FARF035
AJCONT     MOVE 1  TO I-BDLDIR.                                         FARF035
AJCONT     PERFORM UNTIL V-FECMAILFIN-BDLDIR(I-BDLDIR) = 0              FARF035
AJCONT                  OR I-BDLDIR > 100                               FARF035
AJCONT        MOVE  1 TO J-BDLDIR                                       FARF035
AJCONT        MOVE SPACES TO M-CONTEOS-TEX                              FARF035
AJCONT        MOVE ZEROS  TO M-CONTEOS-NUM                              FARF035
AJCONT        MOVE 0 TO I-RES-BDLDIR I-LAB-BDLDIR I-COR-BDLDIR          FARF035
AJCONT        MOVE 0 TO I-SDT-BDLDIR                                    FARF035
AJCONT        PERFORM UNTIL  J-BDLDIR > 100                             FARF035
AJCONT           IF V-SECUNI00MAIL-BDLDIR(J-BDLDIR) =                   FARF035
AJCONT              V-SEC01MAILFIN-BDLDIR(I-BDLDIR)                     FARF035
AJCONT              MOVE V-SUSMAIL-BDLDIR(J-BDLDIR) TO COD-SUSCRIP-ABD02FARF035
AJCONT              PERFORM 1000-CONTAR-SUSCRIPTORES                    FARF035
AJCONT           END-IF                                                 FARF035
      *                                                                 FARF035
AJCONT           ADD 1 TO J-BDLDIR                                      FARF035
AJCONT        END-PERFORM                                               FARF035
      *                                                                 FARF035
AJCONT        MOVE I-SDT-BDLDIR TO V-NUMENTMAILFIN-BDLDIR(I-BDLDIR)     FARF035
AJCONT        ADD 1 TO I-BDLDIR                                         FARF035
AJCONT     END-PERFORM.                                                 FARF035
      *
REPLUS*----------------- CALIFICAR MAIL  --------------------------
REPLUS 2017-U-CALIFICAR-MAIL.                                      
REPLUS     MOVE 0 TO CONTA
REPLUS     MOVE 0 TO CAL-MAIL-BDLDIR 
      *    verificamos si tiene el simbolo arroba
REPLUS     INSPECT MAIL-BDLDIR TALLYING CONTA FOR ALL "@"
REPLUS     IF CONTA = 1
REPLUS        MOVE 15 TO CAL-MAIL-BDLDIR
REPLUS     END-IF.
      *
      *    verificamos si tiene el punto.
           IF CAL-MAIL-BDLDIR > 0
REPLUS        MOVE 0 TO CONTA
REPLUS        INSPECT MAIL-BDLDIR TALLYING CONTA FOR ALL "."
REPLUS        IF CONTA = 0
REPLUS           MOVE 0 TO CAL-MAIL-BDLDIR
REPLUS        END-IF
           END-IF.
      *
      *    verificamos si tiene un caracter de control invalido.
AJCONT     IF CAL-MAIL-BDLDIR > 0                                       FARF035
AJCONT        MOVE 1 TO CONTA                                           FARF035
      *       se hace el ciclo hasta el tamaño de la varibale.
AJCONT        PERFORM UNTIL CONTA > 40                                  FARF035
AJCONT           IF FUNCTION ORD(MAIL-BDLDIR(CONTA:1)) < 32             FARF035
AJCONT              MOVE 0 TO CAL-MAIL-BDLDIR                           FARF035
AJCONT              MOVE 50 TO CONTA                                    FARF035
AJCONT           END-IF                                                 FARF035
      *                                                                 FARF035
AJCONT           ADD 1 TO CONTA                                         FARF035
AJCONT        END-PERFORM                                               FARF035
AJCONT     END-IF.                                                      FARF035
      *    
      *    verificamos si existe en el archivo de mail excluidos
           IF CAL-MAIL-BDLDIR > 0
RECPF2        READ BDLMAIEXC NOT INVALID KEY                            HGO0022
RECPF2           MOVE 0 TO CAL-MAIL-BDLDIR                              HGO0022
RECPF2       END-READ                                                   HGO0022
           END-IF.
      *
NEWDIR*-----------------------------------------------------------------
REMARK*         RUTINAS PARA LA ESTANDARIZACION DE DIRECCIONES 
REMARK*-----------------------------------------------------------------
STANDA 06000-U-CARGAR-TABLA-DIRESTAN.
REMARK******************************************************************
REMARK*06000-CARGAR-TABLA-DIRESTAN.                                    *
REMARK*    SE CARGA EN MEMORIA LA TABLA PARA ESTANDARIZACION DE        *
REMARK*    DIRECCIONES                                                 *
REMARK*    PARAMETROS
REMARK*       INPUT      DECLARAR ARCHIVO DIREST
REMARK*       OUTPUT     TABLA-DIR-ESTANDAR.
REPLUS*    CARGA EN MEMORIA ARCHIVO DE CIUDADES DUPLICADAS
REMARK******************************************************************
RCNCER     INITIALIZE TABLA-DIR-COMPUESTAS-BDLDIR                       RMB0010 
RECPF2*RCNCER     OPEN INPUT DIREST                                     HGO0022
MOD023*    MOVE "$DATABASE/BDLDIRACE" TO TITLE-BDLDIRACE                RGH0023
RECPF2     OPEN INPUT BDLDIRACE                                         HGO0022
RCNCER     MOVE 0 TO FDA-DIREST-BDLDIR                                  RMB0010 
RECPF2*STANDA     READ DIREST                                           HGO0022
RECPF2     READ BDLDIRACE NEXT RECORD                                   HGO0022
STANDA        AT END
RCNCER           MOVE 1 TO FDA-DIREST-BDLDIR                            RMB0010 
STANDA     END-READ
RCNCER     MOVE 1 TO I-STA-BDLDIR                                       RMB0010 
RCNCER     MOVE 1 TO J-STA-BDLDIR                                       RMB0010 
RCNCER*    PERFORM UNTIL FDA-DIREST-BDLDIR = 1 OR I-STA-BDLDIR >= 500   RMB0010
AMP027     PERFORM UNTIL FDA-DIREST-BDLDIR = 1 OR I-STA-BDLDIR >= 2000  PJV0027
RECPF2*RCNCER        IF DIR-ORIG-DIREST (1:4) <> "****"                 HGO0022
RECPF2*RCNCER           MOVE DIR-ORIG-DIREST                            HGO0022
RECPF2           MOVE DIR-ORIG-BDLDIRACE                                HGO0022
RCNCER                TO DIR-ORIGINAL-BDLDIR (I-STA-BDLDIR)             RMB0010 
RECPF2*RCNCER           MOVE DIR-ESTAN-DIREST                           HGO0022
RECPF2           MOVE DIR-ESTAN-BDLDIRACE                               HGO0022
RCNCER                TO DIR-ESTANDAR-BDLDIR (I-STA-BDLDIR)             RMB0010 
RCNCER           INITIALIZE M-BDLDIR                                    RMB0010 
RECPF2*RCNCER           INSPECT DIR-ORIG-DIREST TALLYING M-BDLDIR FOR ALHGO0022
RECPF2           INSPECT DIR-ORIG-BDLDIRACE TALLYING M-BDLDIR           HGO0022
RECPF2            FOR ALL "*"                                           HGO0022
RCNCER           IF M-BDLDIR > 0                                        RMB0010 
RCNCER              INITIALIZE M-BDLDIR                                 RMB0010 
RECPF2*RCNCER              INSPECT DIR-ORIG-DIREST                      HGO0022
RECPF2              INSPECT DIR-ORIG-BDLDIRACE                          HGO0022
RCNCER                      TALLYING M-BDLDIR                           RMB0010 
RCNCER                      FOR CHARACTERS BEFORE INITIAL " "           RMB0010 
RCNCER              MOVE 0 TO DIR-COMPUESTAS-TIP-BDLDIR (J-STA-BDLDIR)  RMB0010 
RCNCER              MOVE M-BDLDIR                                       RMB0010 
RCNCER                   TO DIR-COMPUESTAS-LON-BDLDIR (J-STA-BDLDIR)    RMB0010 
RECPF2*RCNCER              MOVE DIR-ORIG-DIREST                         HGO0022
RECPF2              MOVE DIR-ORIG-BDLDIRACE                             HGO0022
RCNCER                   TO DIR-COMPUESTAS-AST-BDLDIR (J-STA-BDLDIR)    RMB0010 
RECPF2*RCNCER              INSPECT DIR-ORIG-DIREST REPLACING ALL "*" BY HGO0022
RECPF2              INSPECT DIR-ORIG-BDLDIRACE REPLACING ALL "*" BY " " HGO0022
RECPF2*RCNCER              MOVE DIR-ORIG-DIREST                         HGO0022
RECPF2              MOVE DIR-ORIG-BDLDIRACE                             HGO0022
RCNCER                   TO DIR-COMPUESTAS-BLN-BDLDIR (J-STA-BDLDIR)    RMB0010 
RCNCER              ADD 1 TO J-STA-BDLDIR                               RMB0010 
RCNCER           END-IF                                                 RMB0010 
RECPF2*RCNCER           IF DIR-ORIG-DIREST (1:1) = "/" OR "(" OR ")" OR HGO0022
RECPF2           IF DIR-ORIG-BDLDIRACE (1:1) = "/" OR "(" OR ")" OR     HGO0022
RCNCER                                      "=" OR "?"                  RMB0010 
RCNCER              INITIALIZE M-BDLDIR                                 RMB0010 
RECPF2*RCNCER              INSPECT DIR-ORIG-DIREST                      HGO0022
RECPF2              INSPECT DIR-ORIG-BDLDIRACE                          HGO0022
RCNCER                      TALLYING M-BDLDIR FOR CHARACTERS BEFORE     RMB0010 
RCNCER                               INITIAL " "                        RMB0010 
RCNCER              MOVE 1 TO DIR-COMPUESTAS-TIP-BDLDIR (J-STA-BDLDIR)  RMB0010 
RCNCER              MOVE M-BDLDIR                                       RMB0010 
RCNCER                   TO DIR-COMPUESTAS-LON-BDLDIR (J-STA-BDLDIR)    RMB0010 
RECPF2*RCNCER              MOVE DIR-ORIG-DIREST                         HGO0022
RECPF2              MOVE DIR-ORIG-BDLDIRACE                             HGO0022
RCNCER                   TO DIR-COMPUESTAS-AST-BDLDIR (J-STA-BDLDIR)    RMB0010 
RECPF2*RCNCER              EVALUATE  DIR-ORIG-DIREST (1:1)              HGO0022
RECPF2              EVALUATE  DIR-ORIG-BDLDIRACE (1:1)                  HGO0022
RCNCER                WHEN "/"                                          RMB0010 
RECPF2*RCNCER                  INSPECT DIR-ORIG-DIREST REPLACING ALL "/"HGO0022
RECPF2                  INSPECT DIR-ORIG-BDLDIRACE REPLACING ALL "/"    HGO0022
RECPF2                     BY "0"                                       HGO0022
RCNCER                WHEN "("                                          RMB0010 
RECPF2*RCNCER                  INSPECT DIR-ORIG-DIREST REPLACING ALL "("HGO0022
RECPF2                  INSPECT DIR-ORIG-BDLDIRACE REPLACING ALL "("    HGO0022
RECPF2                     BY "1"                                       HGO0022
RCNCER                WHEN ")"                                          RMB0010 
RECPF2*RCNCER                  INSPECT DIR-ORIG-DIREST REPLACING ALL ")"HGO0022
RECPF2                  INSPECT DIR-ORIG-BDLDIRACE REPLACING ALL ")"    HGO0022
RECPF2                     BY "2"                                       HGO0022
RCNCER                WHEN "="                                          RMB0010 
RECPF2*RCNCER                  INSPECT DIR-ORIG-DIREST REPLACING ALL "="HGO0022
RECPF2                  INSPECT DIR-ORIG-BDLDIRACE REPLACING ALL "="    HGO0022
RECPF2                     BY "5"                                       HGO0022
RCNCER                WHEN "?"                                          RMB0010 
RECPF2*RCNCER                  INSPECT DIR-ORIG-DIREST REPLACING ALL "?"HGO0022
RECPF2                  INSPECT DIR-ORIG-BDLDIRACE REPLACING ALL "?"    HGO0022
RECPF2                     BY "7"                                       HGO0022
RCNCER              END-EVALUATE                                        RMB0010 
RECPF2*RCNCER              MOVE DIR-ORIG-DIREST                         HGO0022
RECPF2              MOVE DIR-ORIG-BDLDIRACE                             HGO0022
RCNCER                   TO DIR-COMPUESTAS-BLN-BDLDIR (J-STA-BDLDIR)    RMB0010 
RCNCER              ADD 1 TO J-STA-BDLDIR                               RMB0010 
RCNCER           END-IF                                                 RMB0010 
RCNCER           ADD 1 TO I-STA-BDLDIR                                  RMB0010 
RECPF2*RCNCER        END-IF                                             HGO0022
RECPF2*RCNCER        READ DIREST                                        HGO0022
RECPF2        READ BDLDIRACE NEXT RECORD                                HGO0022
RCNCER           AT END                                                 RMB0010 
RCNCER              MOVE 1 TO FDA-DIREST-BDLDIR                         RMB0010 
RCNCER        END-READ                                                  RMB0010 
STANDA     END-PERFORM
RCNCER*    PERFORM UNTIL I-STA-BDLDIR >= 500                            RMB0010
AMP027     PERFORM UNTIL I-STA-BDLDIR >= 2000                           PJV0027
RCNCER        MOVE "ZZZZZZZZZZZZZZZZZZZZ"                               RMB0010 
RCNCER             TO DIR-ORIGINAL-BDLDIR (I-STA-BDLDIR)                RMB0010 
RCNCER        MOVE SPACES                                               RMB0010 
RCNCER             TO DIR-ESTANDAR-BDLDIR (I-STA-BDLDIR)                RMB0010 
RCNCER        ADD 1 TO I-STA-BDLDIR                                     RMB0010 
STANDA     END-PERFORM
REPLUS     OPEN INPUT DUPCIUDAD
REPLUS     PERFORM 2018-CARGA-DUPCIUDAD VARYING 
REPLUS             CON-DUPCIUDAD FROM 1 BY 1 UNTIL CON-DUPCIUDAD > 99
REPLUS     CLOSE DUPCIUDAD
RCNCER     SORT TABLA-DIR-ESTANDAR-BDLDIR ASCENDING DIR-ORIGINAL-BDLDIR.RMB0010 
STANDA 6100-U-ESTANDARIZAR-DIRECC.
REMARK******************************************************************
REMARK*6100-ESTANDARIZAR-DIRECC.                                       *
REMARK*    ESTA RUTINA TOMA LA DIRECCION DE ENTRADA Y LA ESTANDARIZA DE*
REMARK*    ACUERDO A LA TABLA DE ESTADARIZACION DE DIRECCIONES         *
REMARK*    APLICANDO ADEMAS REEMPLAZOS DE CARACTERES ESPECIALES        *
REMARK*    PARAMETROS
REMARK*       INPUT        DIRECCION-A-ESTANDARIZAR.
REMARK*       OUTPUT       DIRECCION-ESTANDARIZADA.     
REMARK******************************************************************
RCNCER***  SE DESCARTAN LAS DIRECCIONES QUE CONTIENEN EL NOMBRE DE LA   RMB0010 
RCNCER***  CIUDAD                                                       RMB0010 
RCNCER     IF DIRECCION-A-ESTANDARIZAR-BDLDIR (1:20) <> CIUDAD-BDLDIR   RMB0010 
RCNCER        INSPECT DIRECCION-A-ESTANDARIZAR-BDLDIR                   RMB0010 
RCNCER                REPLACING ALL "." BY " "                          RMB0010 
RCNCER                              "-" BY " "                          RMB0010 
RCNCER                              "'" BY " "                          RMB0010 
RCNCER                              "#" BY " "                          RMB0010 
RCNCER                              ":" BY " "                          RMB0010 
RCNCER                              "/" BY " "                          RMB0010 
RCNCER                              "," BY " "                          RMB0010 
RCNCER                              "*" BY " "                          RMB0010 
RCNCER                              "?" BY " "                          RMB0010 
RCNCER                              "\" BY " "                          RMB0010 
RCNCER                              "_" BY " "                          RMB0010 
RCNCER                              ";" BY " "                          RMB0010 
RCNCER                              "´" BY " "                          RMB0010 
RCNCER                              "+" BY " "                          RMB0010 
RCNCER                              "¿" BY " "                          RMB0010 
RCNCER                              "!" BY " "                          RMB0010 
RCNCER                              "¡" BY " "                          RMB0010 
RCNCER                              "^" BY " "                          RMB0010 
RCNCER                              "`" BY " "                          RMB0010 
RCNCER                              "¬" BY " "                          RMB0010 
RCNCER                              "|" BY " "                          RMB0010 
RCNCER                              "&" BY " "                          RMB0010 
RCNCER                              "%" BY " "                          RMB0010 
RCNCER                              "¨" BY " "                          RMB0010 
RCNCER                              "[" BY " "                          RMB0010 
RCNCER                              "]" BY " "                          RMB0010 
RCNCER                              "{" BY " "                          RMB0010 
RCNCER                              "}" BY " "                          RMB0010 
RCNCER                              "~" BY " "                          RMB0010 
RCNCER                              '"' BY " "                          RMB0010 
RCNCER                              "(" BY " "                          RMB0010 
RCNCER                              ")" BY " "                          RMB0010 
RCNCER                              "°" BY " "                          RMB0010 
RCNCER                              "$" BY " "                          RMB0010 
RCNCER                              "@" BY " "                          RMB0010 
RCNCER                              "<" BY " "                          RMB0010 
RCNCER                              ">" BY " "                          RMB0010 
RCNCER                              "=" BY " "                          RMB0010 
RCNCER        MOVE FUNCTION UPPER-CASE (DIRECCION-A-ESTANDARIZAR-BDLDIR)RMB0010 
RCNCER             TO DIRECCION-A-ESTANDARIZAR-BDLDIR                   RMB0010 
RCNCER        PERFORM 6130-FILTRO-INICIAL                               RMB0010 
RCNCER        MOVE 1 TO KK-STA-BDLDIR                                   RMB0010 
RCNCER        INITIALIZE NUEVA-DIRECCION-BDLDIR                         RMB0010 
RCNCER                   SUM-DIGITOS-BDLDIR                             RMB0010 
RCNCER                   TIP-NUEVA-DIRECCION-BDLDIR                     RMB0010 +
PYSPAR                   CON-PART-ESTANDARIZADA-BDLDIR                  HGO0021
RCNCER        MOVE 1 TO II-STA-BDLDIR                                   RMB0010 
RCNCER        PERFORM UNTIL II-STA-BDLDIR > 60                          RMB0010 
RCNCER           IF DIR-A-EST-BDLDIR (II-STA-BDLDIR) NUMERIC            RMB0010 
RCNCER              MOVE "N" TO IND-TIPCAR-BDLDIR                       RMB0010 
RCNCER              ADD   1  TO SUM-DIGITOS-BDLDIR                      RMB0010 
RCNCER           ELSE                                                   RMB0010 
RCNCER              MOVE "A" TO IND-TIPCAR-BDLDIR                       RMB0010 
RCNCER           END-IF                                                 RMB0010
      *
RCNCER           INITIALIZE PART-A-ESTANDARIZAR-BDLDIR                  RMB0010 
RCNCER           MOVE 1 TO JJ-STA-BDLDIR                                RMB0010 
RCNCER           MOVE IND-TIPCAR-BDLDIR TO TIPCAR-WS-BDLDIR             RMB0010 
RCNCER           PERFORM UNTIL II-STA-BDLDIR > 60 OR                    RMB0010 
RCNCER                         JJ-STA-BDLDIR > 60 OR                    RMB0010 
RCNCER                         IND-TIPCAR-BDLDIR <> TIPCAR-WS-BDLDIR OR RMB0010 
RCNCER                         DIR-A-EST-BDLDIR (II-STA-BDLDIR) = SPACESRMB0010 
RCNCER              MOVE DIR-A-EST-BDLDIR (II-STA-BDLDIR)               RMB0010 
RCNCER                   TO PART-A-ESTAN-BDLDIR (JJ-STA-BDLDIR)         RMB0010 
RCNCER              ADD 1 TO II-STA-BDLDIR                              RMB0010 
RCNCER              ADD 1 TO JJ-STA-BDLDIR                              RMB0010 
RCNCER              IF II-STA-BDLDIR <= 60                              RMB0010 
RCNCER                 IF DIR-A-EST-BDLDIR (II-STA-BDLDIR) NUMERIC      RMB0010 
RCNCER                    MOVE "N" TO IND-TIPCAR-BDLDIR                 RMB0010 
RCNCER                    ADD   1  TO SUM-DIGITOS-BDLDIR                RMB0010 
RCNCER                 ELSE                                             RMB0010 
RCNCER                    MOVE "A" TO IND-TIPCAR-BDLDIR                 RMB0010 
RCNCER                 END-IF                                           RMB0010 
RCNCER              END-IF                                              RMB0010 
RCNCER           END-PERFORM                                            RMB0010
      *
PYSPAR           ADD 1 TO CON-PART-ESTANDARIZADA-BDLDIR                 HGO0021
RCNCER           IF TIPCAR-WS-BDLDIR = "A"                              RMB0010 
RCNCER              PERFORM 6110-ESTANDARIZAR-PART                      RMB0010 
RCNCER              IF PART-ESTANDARIZADA-BDLDIR <> SPACES              RMB0010 
PYSPAR                 IF CON-PART-ESTANDARIZADA-BDLDIR = 1             HGO0021
PYSPAR                    MOVE PART-ESTANDARIZADA-BDLDIR TO             HGO0021
PYSPAR                         PRIPART-ESTANDARIZADA-BDLDIR             HGO0021
PYSPAR                 ELSE                                             HGO0021
PYSPAR                    IF CON-PART-ESTANDARIZADA-BDLDIR = 2          HGO0021
PYSPAR                       MOVE PART-ESTANDARIZADA-BDLDIR TO          HGO0021
PYSPAR                           SEGPART-ESTANDARIZADA-BDLDIR           HGO0021
PYSPAR                    END-IF                                        HGO0021
PYSPAR                 END-IF                                           HGO0021
      *
RCNCER                 MOVE PART-ESTANDARIZADA-BDLDIR                   RMB0010 
RCNCER                      TO NVA-DIR-BDLDIR (KK-STA-BDLDIR)           RMB0010 
RCNCER                 IF ENC-DIREST-BDLDIR = 0                         RMB0010 
RCNCER                    MOVE "S" TO TIP-NVA-DIR-BDLDIR(KK-STA-BDLDIR) RMB0010 
RCNCER                 ELSE                                             RMB0010 
RCNCER                    MOVE "A" TO TIP-NVA-DIR-BDLDIR(KK-STA-BDLDIR) RMB0010 
RCNCER                 END-IF                                           RMB0010
      *
RCNCER                 ADD 1 TO KK-STA-BDLDIR                           RMB0010
PLNCHQ*                                                                 FARF031
PLNCHQ*                REGLA DE LIMPIEZA 3 - PARTICULAS REPETIDAS AL    FARF031
PLNCHQ*                PRINCIPIO DE LA DIRECCION                        FARF031
PLNCHQ                 IF KK-STA-BDLDIR = 3 AND                         FARF031
PLNCHQ                    TIP-NVA-DIR-BDLDIR(2) = "S"                   FARF031
PLNCHQ                    IF NVA-DIR-BDLDIR(1) = NVA-DIR-BDLDIR(2)      FARF031
PLNCHQ                       MOVE SPACES TO TIP-NVA-DIR-BDLDIR(2)       FARF031
PLNCHQ                       MOVE SPACES TO NVA-DIR-BDLDIR(2)           FARF031
PLNCHQ                       MOVE SPACES TO SEGPART-ESTANDARIZADA-BDLDIRFARF031
PLNCHQ                       SUBTRACT 1 FROM KK-STA-BDLDIR              FARF031
PLNCHQ                       SUBTRACT 1                                 FARF031
PLNCHQ                          FROM CON-PART-ESTANDARIZADA-BDLDIR      FARF031
PLNCHQ                    END-IF                                        FARF031
PLNCHQ                 END-IF                                           FARF031
PYSPAR              ELSE                                                HGO0021
PYSPAR*                 IF PART-ESTANDARIZADA-BDLDIR = SPACES AND        HGO0021
PYSPAR*                    PART-A-ESTANDARIZAR-BDLDIR = SPACES           HGO0021
PYSPAR                    COMPUTE CON-PART-ESTANDARIZADA-BDLDIR =       HGO0021
PYSPAR                            CON-PART-ESTANDARIZADA-BDLDIR - 1     HGO0021
PYSPAR*                 END-IF                                           HGO0021
RCNCER              END-IF                                              RMB0010 
RCNCER           ELSE                                                   RMB0010 
RCNCER              IF PART-A-ESTANDARIZAR-BDLDIR <> SPACES             RMB0010 
PYSPAR                 IF CON-PART-ESTANDARIZADA-BDLDIR = 1             HGO0021
PYSPAR                    MOVE PART-A-ESTANDARIZAR-BDLDIR TO            HGO0021
PYSPAR                         PRIPART-ESTANDARIZADA-BDLDIR             HGO0021
PYSPAR                 ELSE                                             HGO0021
PYSPAR                    IF CON-PART-ESTANDARIZADA-BDLDIR = 2          HGO0021
PYSPAR                       MOVE PART-A-ESTANDARIZAR-BDLDIR TO         HGO0021
PYSPAR                            SEGPART-ESTANDARIZADA-BDLDIR          HGO0021
PYSPAR                    END-IF                                        HGO0021
PYSPAR                 END-IF                                           HGO0021
      *
RCNCER                 MOVE PART-A-ESTANDARIZAR-BDLDIR                  RMB0010 
RCNCER                      TO NVA-DIR-BDLDIR (KK-STA-BDLDIR)           RMB0010 
RCNCER                 MOVE "N" TO TIP-NVA-DIR-BDLDIR(KK-STA-BDLDIR)    RMB0010 
RCNCER                 ADD 1 TO KK-STA-BDLDIR                           RMB0010 
RCNCER              END-IF                                              RMB0010 
RCNCER           END-IF                                                 RMB0010
      *
RCNCER           PERFORM UNTIL II-STA-BDLDIR > 60 OR                    RMB0010 
RCNCER                   DIR-A-EST-BDLDIR (II-STA-BDLDIR) <> SPACES     RMB0010 
RCNCER              ADD 1 TO II-STA-BDLDIR                              RMB0010 
RCNCER           END-PERFORM                                            RMB0010 
RCNCER        END-PERFORM                                               RMB0010
      *
RCNCER        INITIALIZE DIRECCION-ESTANDARIZADA-BDLDIR                 RMB0010 
RCNCER        MOVE 2 TO JJ-STA-BDLDIR                                   RMB0010 
RCNCER        MOVE NVA-DIR-BDLDIR (1) TO DIRECCION-ESTANDARIZADA-BDLDIR RMB0010 
RCNCER        MOVE 0 TO CALIFICA-DIR-BDLDIR                             RMB0010 
RCNCER        IF TIP-NVA-DIR-BDLDIR(1) = "S"                            RMB0010 
PYSPAR           MOVE 10 TO CALIFICA-DIRPART1-BDLDIR                    HGO0021
PYSPAR           ADD 10 TO CALIFICA-DIR-BDLDIR                          HGO0021
RCNCER           ADD 10 TO CALIFICA-DIR-BDLDIR                          RMB0010 
RCNCER        ELSE                                                      RMB0010 
RCNCER           IF TIP-NVA-DIR-BDLDIR(1) = "N"                         RMB0010 
PYSPAR              MOVE 6 TO CALIFICA-DIRPART1-BDLDIR                  HGO0021
PYSPAR              ADD 6 TO CALIFICA-DIR-BDLDIR                        HGO0021
RCNCER              ADD 0 TO CALIFICA-DIR-BDLDIR                        RMB0010 
RCNCER           ELSE                                                   RMB0010 
PYSPAR              MOVE 8 TO CALIFICA-DIRPART1-BDLDIR                  HGO0021
PYSPAR*RCNCER              ADD 5 TO CALIFICA-DIR-BDLDIR                 HGO0021
RCNCER           END-IF                                                 RMB0010 
RCNCER        END-IF                                                    RMB0010
      *
RCNCER        MOVE 0 TO CAMPOS-N-DIR-BDLDIR                             RMB0010 
RCNCER        PERFORM UNTIL JJ-STA-BDLDIR >= KK-STA-BDLDIR              RMB0010 
RCNCER           IF JJ-STA-BDLDIR = 2                                   RMB0010 
PYSPAR*RCNCER              IF NVA-DIR-BDLDIR(2) NOT = SPACES            HGO0021
PYSPAR*RCNCER                 ADD 10 TO CALIFICA-DIR-BDLDIR             HGO0021
PYSPAR*RCNCER              END-IF                                       HGO0021
PYSPAR              IF TIP-NVA-DIR-BDLDIR(2) = "S"                      HGO0021
PYSPAR                 MOVE 10 TO CALIFICA-DIRPART2-BDLDIR              HGO0021
PYSPAR                 ADD 10 TO CALIFICA-DIR-BDLDIR                    HGO0021
PYSPAR              ELSE                                                HGO0021
PYSPAR                 IF TIP-NVA-DIR-BDLDIR(2) = "N"                   HGO0021
PYSPAR                    MOVE 10 TO CALIFICA-DIRPART2-BDLDIR           HGO0021
PYSPAR                    ADD 10 TO CALIFICA-DIR-BDLDIR                 HGO0021
PYSPAR                 ELSE                                             HGO0021
PYSPAR                    MOVE 8 TO CALIFICA-DIRPART2-BDLDIR            HGO0021
PYSPAR                 END-IF                                           HGO0021
PYSPAR              END-IF                                              HGO0021
RCNCER           ELSE                                                   RMB0010 
RCNCER              IF TIP-NVA-DIR-BDLDIR(JJ-STA-BDLDIR) = "N"          RMB0010 
RCNCER                 ADD 1 TO CAMPOS-N-DIR-BDLDIR                     RMB0010 
RCNCER              END-IF                                              RMB0010 
RCNCER           END-IF                                                 RMB0010
      *
RCNCER           STRING DIRECCION-ESTANDARIZADA-BDLDIR DELIMITED BY "  "RMB0010 
RCNCER                  " "                     DELIMITED BY SIZE       RMB0010
AJUACE                 NVA-DIR-BDLDIR (JJ-STA-BDLDIR) DELIMITED BY "  " FARF026
AJUACE*RCNCER           NVA-DIR-BDLDIR (JJ-STA-BDLDIR) DELIMITED BY " " RMB0010 
RCNCER               INTO DIRECCION-ESTANDARIZADA-BDLDIR                RMB0010 
RCNCER           END-STRING                                             RMB0010
      *
RCNCER           ADD 1 TO JJ-STA-BDLDIR                                 RMB0010 
RCNCER        END-PERFORM                                               RMB0010
      *
RCNCER        IF CAMPOS-N-DIR-BDLDIR > 1                                RMB0010 
RCNCER           ADD 10 TO CALIFICA-DIR-BDLDIR                          RMB0010 
RCNCER        END-IF                                                    RMB0010
      *
RCNCER        IF DIRECCION-ESTANDARIZADA-BDLDIR <> SPACES               RMB0010 
RCNCER           IF POLITICA-EXC-MAL-DIR-BDLDIR = 1                     RMB0010 
RCNCER              PERFORM 6140-ELIMINAR-DIR-MALAS                     RMB0010 
RCNCER           END-IF                                                 RMB0010
      *
RCNCER           IF CALIFICA-DIR-BDLDIR > POLITICA-EXC-CAL-DIR-BDLDIR   RMB0010 
RCNCER              PERFORM 6120-EVALUAR-ADICION-PUNTOS                 RMB0010 
RCNCER           END-IF                                                 RMB0010 
      *
LIMDIR           IF CALIFICA-DIR-BDLDIR > 0                             FARF037
LIMDIR               PERFORM 6150-LIMPIA-DIR-ESTANDARIZADA              FARF037
LIMDIR           END-IF                                                 FARF037
      *
RCNCER        ELSE                                                      RMB0010 
RCNCER           MOVE 0 TO CALIFICA-DIR-BDLDIR                          RMB0010 
RCNCER        END-IF                                                    RMB0010
RCNCER     ELSE                                                         RMB0010 
RCNCER        MOVE 0 TO CALIFICA-DIR-BDLDIR                             RMB0010 
RCNCER     END-IF.                                                      RMB0010 
      *
AJCIUU     MOVE ZEROS TO V-DANEFIN-BDLDIR-AUX.                          FARF033
      *
STANDA 6110-ESTANDARIZAR-PART.
REMARK******************************************************************
REMARK*6110-ESTANDARIZAR-PART.                                         *
REMARK*    LA PARTICULA A ESTANDARIZAR SE BUSCA EN LA TABLA DE         *
REMARK*    ESTANDARIZACION DE DIRECCIONES Y ES REEMPLAZADA, SI ES QUE  *
REMARK*    SE ENCUENTRA                                                *
REMARK******************************************************************
      *
PLNCHQ*    APLICACION DE REGLAS ESPECIALES DE LIMPIEZA                  FARF032
PLNCHQ*    REGLAS DE ESTANDARIZACION OBLIGADAS                          FARF032
PLNCHQ     IF KK-STA-BDLDIR = 1                                         FARF032
PLNCHQ        IF PART-A-ESTANDARIZAR-BDLDIR = "DA" *> REGLA 1           FARF032
PLNCHQ           MOVE "DG" TO PART-A-ESTANDARIZAR-BDLDIR                FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ        IF PART-A-ESTANDARIZAR-BDLDIR = "TR" *> REGLA 2           FARF032
PLNCHQ           MOVE "TV" TO PART-A-ESTANDARIZAR-BDLDIR                FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ     END-IF.                                                      FARF032
PLNCHQ*                                                                 FARF032
RCNCER     MOVE 0 TO ENC-DIREST-BDLDIR.                                 RMB0010 
RCNCER     SEARCH ALL TABLA-DIR-ESTANDAR-BDLDIR                         RMB0010 
STANDA        AT END
RCNCER           MOVE 1 TO ENC-DIREST-BDLDIR                            RMB0010 
RCNCER        WHEN DIR-ORIGINAL-BDLDIR (I-DIR-ESTANDAR-BDLDIR) =        RMB0010 
RCNCER             PART-A-ESTANDARIZAR-BDLDIR                           RMB0010 
RCNCER           SET JJ-STA-BDLDIR TO I-DIR-ESTANDAR-BDLDIR             RMB0010 
RCNCER           MOVE DIR-ESTANDAR-BDLDIR (JJ-STA-BDLDIR)               RMB0010 
RCNCER                TO PART-ESTANDARIZADA-BDLDIR                      RMB0010 
STANDA     END-SEARCH.
      *
RCNCER     IF ENC-DIREST-BDLDIR = 1                                     RMB0010 
RCNCER        MOVE PART-A-ESTANDARIZAR-BDLDIR                           RMB0010 
RCNCER             TO PART-ESTANDARIZADA-BDLDIR                         RMB0010 
STANDA     END-IF.
      *
RCNCER 6130-FILTRO-INICIAL.                                             RMB0010 
RCNCER     MOVE 0 TO CASO-NUMEROLETRA-BDLDIR                            RMB0010 
RCNCER     MOVE 1 TO M-BDLDIR                                           RMB0010 
RCNCER     PERFORM UNTIL M-BDLDIR > 58 OR                               RMB0010 
RCNCER       (DIRECCION-A-ESTANDARIZAR-BDLDIR(M-BDLDIR:1) <> SPACES AND RMB0010 
RCNCER        DIRECCION-A-ESTANDARIZAR-BDLDIR(M-BDLDIR:1) NOT NUMERIC)  RMB0010 
RCNCER       ADD 1 TO M-BDLDIR                                          RMB0010 
RCNCER     END-PERFORM.                                                 RMB0010 
RCNCER     IF M-BDLDIR > 1 AND < 58                                     RMB0010 
RCNCER        IF DIRECCION-A-ESTANDARIZAR-BDLDIR(M-BDLDIR - 1:1) NUMERICRMB0010 
RCNCER           MOVE 1 TO CASO-NUMEROLETRA-BDLDIR                      RMB0010 
RCNCER        END-IF                                                    RMB0010 
RCNCER     END-IF                                                       RMB0010 
RCNCER     MOVE 1 TO M-BDLDIR                                           RMB0010 
RCNCER     MOVE DIRECCION-A-ESTANDARIZAR-BDLDIR TO DIRECCION-60-BDLDIR  RMB0010 
RCNCER*    PERFORM UNTIL M-BDLDIR > 89 OR                               RMB0010
AMP027     PERFORM UNTIL M-BDLDIR > 499 OR                              PJV0027
RCNCER                   DIR-COMPUESTAS-AST-BDLDIR (M-BDLDIR) = SPACES  RMB0010 
RCNCER        IF DIR-COMPUESTAS-TIP-BDLDIR (M-BDLDIR) = 0 OR            RMB0010 
RCNCER          (DIR-COMPUESTAS-TIP-BDLDIR (M-BDLDIR) = 1 AND           RMB0010 
RCNCER           CASO-NUMEROLETRA-BDLDIR = 1)                           RMB0010 
RCNCER           MOVE DIR-COMPUESTAS-LON-BDLDIR(M-BDLDIR) TO N-BDLDIR   RMB0010 
RCNCER           INITIALIZE DIR-COMPUESTAS-BLN-AUX-BDLDIR               RMB0010 
RCNCER                      DIR-COMPUESTAS-AST-AUX-BDLDIR               RMB0010 
RCNCER           MOVE DIR-COMPUESTAS-BLN-BDLDIR(M-BDLDIR)(1:N-BDLDIR) TORMB0010 
RCNCER                DIR-COMPUESTAS-BLN-AUX-BDLDIR(2:N-BDLDIR)         RMB0010 
RCNCER           MOVE DIR-COMPUESTAS-AST-BDLDIR(M-BDLDIR)(1:N-BDLDIR) TORMB0010 
RCNCER                DIR-COMPUESTAS-AST-AUX-BDLDIR(2:N-BDLDIR)         RMB0010 
RCNCER           ADD 2 TO N-BDLDIR                                      RMB0010 
RCNCER           INSPECT DIRECCION-62-BDLDIR  REPLACING ALL             RMB0010 
RCNCER                   DIR-COMPUESTAS-BLN-AUX-BDLDIR(1:N-BDLDIR) BY   RMB0010 
RCNCER                   DIR-COMPUESTAS-AST-AUX-BDLDIR(1:N-BDLDIR)      RMB0010 
RCNCER        END-IF                                                    RMB0010 
RCNCER        ADD 1 TO M-BDLDIR                                         RMB0010 
RCNCER     END-PERFORM.                                                 RMB0010 
RCNCER     MOVE DIRECCION-60-BDLDIR TO DIRECCION-A-ESTANDARIZAR-BDLDIR  RMB0010 
RCNCER     MOVE 1 TO M-BDLDIR                                           RMB0010 
RCNCER     PERFORM UNTIL M-BDLDIR > 58 OR    *>MEJORA                   RMB0010 
RCNCER             DIRECCION-A-ESTANDARIZAR-BDLDIR(M-BDLDIR:1) <> SPACESRMB0010 
RCNCER       ADD 1 TO M-BDLDIR                                          RMB0010 
RCNCER     END-PERFORM.                                                 RMB0010 
RCNCER     IF DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) = "C "       RMB0010 
RCNCER***     CALLE                                                     RMB0010 
RCNCER        MOVE "! " TO DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) RMB0010 
RCNCER     END-IF                                                       RMB0010 
RCNCER     IF DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) = "K "       RMB0010 
RCNCER***     CARRERA                                                   RMB0010 
RCNCER        MOVE "# " TO DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) RMB0010 
RCNCER     END-IF.                                                      RMB0010 
RCNCER     IF DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) = "B "       RMB0010 
RCNCER***     BARRIO                                                    RMB0010 
RCNCER        MOVE "$ " TO DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) RMB0010 
RCNCER     END-IF.                                                      RMB0010 
RCNCER     IF DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) = "D "       RMB0010 
RCNCER***     DIAGONAL                                                  RMB0010 
RCNCER        MOVE "% " TO DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) RMB0010 
RCNCER     END-IF.                                                      RMB0010 
RCNCER     IF DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) = "T "       RMB0010 
RCNCER***     TRANSVERSAL                                               RMB0010 
RCNCER        MOVE "& " TO DIRECCION-A-ESTANDARIZAR-BDLDIR (M-BDLDIR:2) RMB0010 
RCNCER     END-IF.                                                      RMB0010 

RCNCER 6120-EVALUAR-ADICION-PUNTOS.                                     RMB0010 
RCNCER******************************************************************RMB0010 
RCNCER*6120-EVALUAR-ADICION-PUNTOS.                                    *RMB0010 
RCNCER*    ESTA PARTE DE LA RUTINA DETERMINA POR UN LADO SI LA         *RMB0010 
RCNCER*    DIRECCION ES CERTIFICADA (CASO EN EL CUAL ADICIONA 50 A LA  *RMB0010 
RCNCER*    CALIFICACION DEFINITIVA) O SI TIENE PUNTOS ADICIONALES POR  *RMB0010 
RCNCER*    GEOREFERENCIACION (10 PUNTOS ADICIONALES)                   *RMB0010 
RCNCER******************************************************************RMB0010 
RCNCER     IF DIRCER-BDLDIR = 1                                         RMB0010 
RCNCER***     DIRECCION CERTIFICADA EXITOSAMENTE                        RMB0010
RCNCER        ADD 50 TO CALIFICA-DIR-BDLDIR                             RMB0010 
RCNCER     END-IF                                                       RMB0010 
RCNCER     IF PTSADI-BDLDIR = 1                                         RMB0010
RCNCER***     DIRECCION GEOREFERENCIADA EXITOSAMENTE                    RMB0010
RCNCER        ADD 10 TO CALIFICA-DIR-BDLDIR                             RMB0010
RCNCER     END-IF.                                                      RMB0010

RCNCER 6140-ELIMINAR-DIR-MALAS.                                         RMB0010 
RCNCER******************************************************************RMB0010 
RCNCER*6140-ELIMINAR-DIR-MALAS.                                        *RMB0010 
RCNCER*    SE CALIFICAN CON 0 DIRECCIONES MALAS                        *RMB0010 
RCNCER******************************************************************RMB0010 
RCNCER     MOVE CALIFICA-DIR-BDLDIR TO CALIFICA-REAL-BDLDIR             RMB0010 
RCNCER     MOVE DIRECCION-ESTANDARIZADA-BDLDIR TO DIRECCION-AUX-BDLDIR  RMB0010 
PYSPAR*RCNCER     INSPECT DIRECCION-AUX-BDLDIR REPLACING ALL " " BY "0" HGO0021
PYSPAR*RCNCER     IF DIRECCION-AUX-BDLDIR NUMERIC                       HGO0021
PYSPAR*RCNCER        MOVE 0 TO CALIFICA-DIR-BDLDIR                      HGO0021
PYSPAR*RCNCER     END-IF.                                               HGO0021
RCNCER****                                                              RMB0010 
RCNCER     IF CALIFICA-DIR-BDLDIR > 0                                   RMB0010 
RCNCER        MOVE 1 TO M-BDLDIR                                        RMB0010 
RCNCER        MOVE 0 TO N-BDLDIR                                        RMB0010 
RCNCER        PERFORM UNTIL M-BDLDIR > 60                               RMB0010 
RCNCER          IF DIRECCION-ESTANDARIZADA-BDLDIR(M-BDLDIR:1) <> SPACES RMB0010 
RCNCER             ADD 1 TO N-BDLDIR                                    RMB0010 
RCNCER          END-IF                                                  RMB0010
      *
RCNCER          ADD 1 TO M-BDLDIR                                       RMB0010 
RCNCER        END-PERFORM                                               RMB0010
      *
RCNCER        IF N-BDLDIR < 6                                           RMB0010 
RCNCER           IF CALIFICA-DIR-BDLDIR < 25                            RMB0010 
RCNCER              MOVE 0 TO CALIFICA-DIR-BDLDIR                       RMB0010 
RCNCER           END-IF                                                 RMB0010 
RCNCER        END-IF                                                    RMB0010 
RCNCER     END-IF.                                                      RMB0010
      *
PLNCHQ*    REGLA EXCLUSION 4 : MENOS DE 8 CARACTERES                    FARF032
PLNCHQ     IF CALIFICA-DIR-BDLDIR > 0                                   FARF032
PLNCHQ        IF DIRECCION-ESTANDARIZADA-BDLDIR(8:) = SPACES            FARF032
PLNCHQ           MOVE 0 TO CALIFICA-DIR-BDLDIR                          FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ     END-IF.                                                      FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ*    REGLA EXCLUSION 5 : SOLO TEXTO EN CIUDADES PRINCIPALES       FARF032
PLNCHQ     IF CALIFICA-DIR-BDLDIR > 0                                   FARF032
PLNCHQ        PERFORM 6141-NUMEROS-LETRAS-BDLDIR                        FARF032
AJCIUU        IF HAY-NUMEROS-BDLDIR = 0 AND                             FARF033
AJCIUU           V-DANEFIN-BDLDIR-AUX(3:6) = "001000" AND               FARF033
AJCIUU           V-DANEFIN-BDLDIR-AUX(1:2) <> "25"                      FARF033
AJCIUU           MOVE 0 TO CALIFICA-DIR-BDLDIR                          FARF033
AJCIUU        END-IF                                                    FARF033
AJCIUU     END-IF.                                                      FARF033
AJCIUU*    INICIA COMENTARIO
PLNCHQ*        IF HAY-NUMEROS-BDLDIR = 0 AND                             FARF032
PLNCHQ*           V-DANEFIN-BDLDIR(I-BDLDIR)(3:6) = "001000" AND         FARF032
PLNCHQ*           V-DANEFIN-BDLDIR(I-BDLDIR)(1:2) <> "25"                FARF032
PLNCHQ*           MOVE 0 TO CALIFICA-DIR-BDLDIR                          FARF032
PLNCHQ*        END-IF                                                    FARF032
PLNCHQ*     END-IF.                                                      FARF032
AJCIUU*    FIN COMENTARIO
PLNCHQ*                                                                 FARF032
PLNCHQ*    REGLA EXCLUSION 6 : SOLO NUMEROS EN LA DIRECCION             FARF032
PLNCHQ     IF CALIFICA-DIR-BDLDIR > 0                                   FARF032
PLNCHQ        IF HAY-LETRAS-BDLDIR = 0                                  FARF032
PLNCHQ           MOVE 0 TO CALIFICA-DIR-BDLDIR                          FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ     END-IF.                                                      FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ*    REGLA EXCLUSION 7 : 3 O MAS NUMEROS IGUALES                  FARF032
PLNCHQ     IF CALIFICA-DIR-BDLDIR > 0                                   FARF032
PLNCHQ        PERFORM 6141-VER-PART-IGUALES-BDLDIR                      FARF032
PLNCHQ        IF HAY-MASDE3-REPETIDAS-BDLDIR = 1                        FARF032
PLNCHQ           MOVE 0 TO CALIFICA-DIR-BDLDIR                          FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ     END-IF.                                                      FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ*    REGLA EXCLUSION 8 : ELIMIAR SI EMPIEZA POR AP O OF           FARF032
PLNCHQ     IF CALIFICA-DIR-BDLDIR > 0                                   FARF032
PLNCHQ        PERFORM 6141-VER-PRIMERA-PART-BDLDIR                      FARF032
PLNCHQ        IF HAY-PRIMERA-MALA-BDLDIR = 1                            FARF032
PLNCHQ           MOVE 0 TO CALIFICA-DIR-BDLDIR                          FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ     END-IF.                                                      FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ*    REGLA EXCLUSION 9 : NUMERO DE 4 O MAS AFTER VIA PRINCIPAL    FARF032
PLNCHQ     IF CALIFICA-DIR-BDLDIR > 0                                   FARF032
PLNCHQ        PERFORM 6141-VER-NUM-AFTER-VIA-BDLDIR                     FARF032
PLNCHQ        IF HAY-NUMEROS4-VIAS-BDLDIR   = 1                         FARF032
PLNCHQ           MOVE 0 TO CALIFICA-DIR-BDLDIR                          FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ     END-IF.                                                      FARF032
      *                                                                 
      *    REGLAS DE EXCLUSION 10 : ELIMINAR SI COMIENZA POR UNA        
      *    PARTICULA ESPECIFICA.                                        
LIMDIR     IF CALIFICA-DIR-BDLDIR > 0                                   FARF037
LIMDIR        MOVE 0 TO  JJ-BDLDIR *> sw de si excluye por regla 10     FARF037
LIMDIR        PERFORM 6141-EXCL-POR-INICIO-PARTICULA                    FARF037
LIMDIR        IF JJ-BDLDIR = 1                                          FARF037
LIMDIR           MOVE 0 TO CALIFICA-DIR-BDLDIR                          FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037

      *    6141-EXCL-POR-INICIO-PARTICULA
      *    se eliminan direcciones que comiensen con ALTO,AP,BG,BL,BRR,
      *    CA,CIUD,CONJ,CORRG,CRT,DA,ED,ET,IN,KM,LC,LT,M,MT,MZ,MZANA,
      *    MZB,MZD,ND,NN,NR,NTE,OF,OT,PA,PD,PI,PL, PLA, PLAN, PLZ,PN,
      *    PQUE,PRJ,PS, PT,RA,SC,SCT,SCTR,SD,SE,SEC,SM, SMZ ,SUR,TO ,UN,
      *    URB,ZN
      *    si adicionalmente no contiene otras particulas. si la 
      *    vairable JJ-BDLDIR queda con valor en 1, se debe excluir la
      *    direccion.
      *                                                                
LIMDIR     6141-EXCL-POR-INICIO-PARTICULA.                              FARF037
LIMDIR     EVALUATE NVA-DIR-BDLDIR(1)                                   FARF037
LIMDIR     WHEN "ALTO"                                                  FARF037
LIMDIR     WHEN "AP"                                                    FARF037
LIMDIR     WHEN "BG"                                                    FARF037
LIMDIR     WHEN "BL"                                                    FARF037
LIMDIR     WHEN "BRR"                                                   FARF037
LIMDIR     WHEN "CA"                                                    FARF037
LIMDIR     WHEN "CIUD"                                                  FARF037
LIMDIR     WHEN "CONJ"                                                  FARF037
LIMDIR     WHEN "CORRG"                                                 FARF037
LIMDIR     WHEN "CRT"                                                   FARF037
LIMDIR     WHEN "DA"                                                    FARF037
LIMDIR     WHEN "ED"                                                    FARF037
LIMDIR     WHEN "ET"                                                    FARF037
LIMDIR     WHEN "IN"                                                    FARF037
LIMDIR     WHEN "KM"                                                    FARF037
LIMDIR     WHEN "LC"                                                    FARF037
LIMDIR     WHEN "LT"                                                    FARF037
LIMDIR     WHEN "M"                                                     FARF037
LIMDIR     WHEN "MT"                                                    FARF037
LIMDIR     WHEN "MZ"                                                    FARF037
LIMDIR     WHEN "MZANA"                                                 FARF037
LIMDIR     WHEN "MZB"                                                   FARF037
LIMDIR     WHEN "MZD"                                                   FARF037
LIMDIR     WHEN "ND"                                                    FARF037
LIMDIR     WHEN "NN"                                                    FARF037
LIMDIR     WHEN "NR"                                                    FARF037
LIMDIR     WHEN "NTE"                                                   FARF037
LIMDIR     WHEN "OF"                                                    FARF037
LIMDIR     WHEN "OT"                                                    FARF037
LIMDIR     WHEN "PA"                                                    FARF037
LIMDIR     WHEN "PD"                                                    FARF037
LIMDIR     WHEN "PI"                                                    FARF037
LIMDIR     WHEN "PL"                                                    FARF037
LIMDIR     WHEN "PLA"                                                   FARF037
LIMDIR     WHEN "PLAN"                                                  FARF037
LIMDIR     WHEN "PLZ"                                                   FARF037
LIMDIR     WHEN "PN"                                                    FARF037
LIMDIR     WHEN "PQUE"                                                  FARF037
LIMDIR     WHEN "PRJ"                                                   FARF037
LIMDIR     WHEN "PS"                                                    FARF037
LIMDIR     WHEN "PT"                                                    FARF037
LIMDIR     WHEN "RA"                                                    FARF037
LIMDIR     WHEN "SC"                                                    FARF037
LIMDIR     WHEN "SCT"                                                   FARF037
LIMDIR     WHEN "SCTR"                                                  FARF037
LIMDIR     WHEN "SD"                                                    FARF037
LIMDIR     WHEN "SE"                                                    FARF037
LIMDIR     WHEN "SEC"                                                   FARF037
LIMDIR     WHEN "SM"                                                    FARF037
LIMDIR     WHEN "SMZ"                                                   FARF037
LIMDIR     WHEN "SUR"                                                   FARF037
LIMDIR     WHEN "TO"                                                    FARF037
LIMDIR     WHEN "UN"                                                    FARF037
LIMDIR     WHEN "URB"                                                   FARF037
LIMDIR     WHEN "VIA"                                                   FARF037
LIMDIR     WHEN "VDA"                                                   FARF037
LIMDIR     WHEN "ZN"                                                    FARF037
LIMDIR        MOVE 1 TO JJ-BDLDIR                                       FARF037
LIMDIR     END-EVALUATE.                                                FARF037
      *                                                                
      *    si contiene la particula CL,KR,AV,DG,TV,AC,AK,AP es valida  
LIMDIR     IF JJ-BDLDIR = 1                                             FARF037
LIMDIR        MOVE 2 TO M-BDLDIR  *> Recorre vector de particulas       FARF037
LIMDIR        PERFORM UNTIL M-BDLDIR > CON-PART-ESTANDARIZADA-BDLDIR    FARF037
LIMDIR           EVALUATE NVA-DIR-BDLDIR(M-BDLDIR)                      FARF037
LIMDIR           WHEN "AC"                                              FARF037
LIMDIR           WHEN "AK"                                              FARF037
LIMDIR           WHEN "AV"                                              FARF037
LIMDIR           WHEN "CL"                                              FARF037
LIMDIR           WHEN "DG"                                              FARF037
LIMDIR           WHEN "KR"                                              FARF037
LIMDIR           WHEN "TV"                                              FARF037
LIMDIR              MOVE 0 TO JJ-BDLDIR                                 FARF037
LIMDIR              MOVE 60 TO M-BDLDIR                                 FARF037
LIMDIR           END-EVALUATE                                           FARF037
      *                                                                 
LIMDIR           ADD 1 TO M-BDLDIR                                      FARF037
LIMDIR        END-PERFORM                                               FARF037
LIMDIR     END-IF.                                                      FARF037
      *                                                               
      *    si inicia por una de estas                                             
      *    y contiene otra combinacion se puede no excluir              FARF037
LIMDIR     IF JJ-BDLDIR = 1                                             FARF037
LIMDIR        EVALUATE NVA-DIR-BDLDIR(1)                                FARF037
LIMDIR        WHEN "BRR"                                                FARF037
LIMDIR        WHEN "MZ"                                                 FARF037
LIMDIR        WHEN "URB"                                                FARF037
LIMDIR        WHEN "KM"                                                 FARF037
LIMDIR        WHEN "BL"                                                 FARF037
LIMDIR        WHEN "ET"                                                 FARF037
LIMDIR        WHEN "BRR"                                                FARF037
LIMDIR        WHEN "CA"                                                 FARF037
LIMDIR        WHEN "CONJ"                                               FARF037
LIMDIR        WHEN "LT"                                                 FARF037
LIMDIR        WHEN "SEC"                                                FARF037
LIMDIR        WHEN "ALTO"                                               FARF037
LIMDIR        WHEN "CIUD"                                               FARF037
LIMDIR        WHEN "CRT"                                                FARF037
LIMDIR        WHEN "SMZ"                                                FARF037
LIMDIR        WHEN "ED"                                                 FARF037
LIMDIR        WHEN "VIA"                                                FARF037
LIMDIR        WHEN "VDA"                                                FARF037
LIMDIR           PERFORM 6141-VERIFICA-OTRA-PARTICULA                   FARF037
LIMDIR        END-EVALUATE                                              FARF037
LIMDIR     END-IF.                                                      FARF037
      *                                                                
      *    6141-VERIFICA-OTRA-PARTICULA                                
      *    se verefica si cumple con la combinacion de otras particulas
      *    se utilizara la variable TIP-NUEVA-DIRECCION-BDLDIR como un 
      *    arreglo de swiches para saber si la direccion tiene las     
      *    otras particulas con la posiciones.                                              
      *                                                                
LIMDIR     6141-VERIFICA-OTRA-PARTICULA.                                FARF037
      *    llenamos el vectoe de swiches                                FARF037
LIMDIR     INITIALIZE TIP-NUEVA-DIRECCION-BDLDIR.                       FARF037
LIMDIR     MOVE 2 TO M-BDLDIR  *> Recorre vector de particulas          FARF037
LIMDIR     PERFORM UNTIL M-BDLDIR > CON-PART-ESTANDARIZADA-BDLDIR       FARF037
LIMDIR        EVALUATE NVA-DIR-BDLDIR(M-BDLDIR)                         FARF037
LIMDIR        WHEN "CA"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(01)                     FARF037
LIMDIR        WHEN "URB"                                                FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(02)                     FARF037
LIMDIR        WHEN "MZ"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(03)                     FARF037
LIMDIR        WHEN "BL"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(04)                     FARF037
LIMDIR        WHEN "AP"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(05)                     FARF037
LIMDIR        WHEN "KM"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(06)                     FARF037
LIMDIR        WHEN "FCA"                                                FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(07)                     FARF037
LIMDIR        WHEN "AUTOP"                                              FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(08)                     FARF037
LIMDIR        WHEN "VIA"                                                FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(09)                     FARF037
LIMDIR        WHEN "VDA"                                                FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(10)                     FARF037
LIMDIR        WHEN "VE"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(11)                     FARF037
LIMDIR        WHEN "CORRG"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(12)                     FARF037
LIMDIR        WHEN "BRR"                                                FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(13)                     FARF037
LIMDIR        WHEN "CONJ"                                               FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(14)                     FARF037
LIMDIR        WHEN "ED"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(15)                     FARF037
LIMDIR        WHEN "CIUD"                                               FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(16)                     FARF037
LIMDIR        WHEN "LT"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(17)                     FARF037
LIMDIR        WHEN "TO"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(18)                     FARF037
LIMDIR        WHEN "ET"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(19)                     FARF037
LIMDIR        WHEN "SEC"                                                FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(20)                     FARF037
LIMDIR        WHEN "LC"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(21)                     FARF037
LIMDIR        WHEN "PA"                                                 FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(22)                     FARF037
LIMDIR        WHEN "PLAN"                                               FARF037
LIMDIR           MOVE "1" TO TIP-NVA-DIR-BDLDIR(23)                     FARF037
LIMDIR        END-EVALUATE                                              FARF037
      *                                                                 
LIMDIR        ADD 1 TO M-BDLDIR                                         FARF037
LIMDIR     END-PERFORM .                                                FARF037
      *                     
      *    Si empieza con BRR y contiene MZ(03) y LT(17)
      *    Si empieza con BRR y contiene MZ(03) y SEC(20) 
      *    Si empieza con BRR y contiene MZ(03) y URB(02)
      *    Si empieza con BRR y contiene MZ(03) y BL(04)
      *
      *    SI Empieza por BRR y contiene CA(01)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "BRR"                                 FARF037
LIMDIR        IF TIP-NVA-DIR-BDLDIR(03) = "1"                           FARF037
LIMDIR           IF TIP-NVA-DIR-BDLDIR(17) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(20) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(02) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(04) = "1"                        FARF037
LIMDIR              MOVE 0 TO JJ-BDLDIR                                 FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037
      *
LIMDIR        IF TIP-NVA-DIR-BDLDIR(01) = "1"                           FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *                                                                
      *    si empieza por MZ y contiene CA(01)                             
      *    si empieza por MZ y contiene URB(02)     
      *    Si empieza por MZ y contiene ET(19) y BRR(13)
      *
      *    Si empieza por MZ y contiene LT(17) y AP(05) 
      *    Si empieza por MZ y contiene LT(17) y BRR(13)
      *    Si empieza por MZ y contiene LT(17) y ET(19) 
      *    Si empieza por MZ y contiene LT(17) y LC(21) 
      *    Si empieza por MZ y contiene LT(17) y PA(22) 
      *    Si empieza por MZ y contiene LT(17) y PLAN(23) 
      *    Si empieza por MZ y contiene LT(17) y VIA(09) 
      *    Si empieza por MZ y contiene LT(17) y SEC(20) 
LIMDIR     IF NVA-DIR-BDLDIR(1) = "MZ"                                  FARF037
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(01) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(02) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(19) = "1"                          FARF037
LIMDIR            AND TIP-NVA-DIR-BDLDIR(13) = "1")                     FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
      *
LIMDIR        IF TIP-NVA-DIR-BDLDIR(17) = "1"                           FARF037
LIMDIR           IF TIP-NVA-DIR-BDLDIR(05) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(13) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(19) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(21) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(22) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(23) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(09) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(20) = "1"                        FARF037
LIMDIR              MOVE 0 TO JJ-BDLDIR                                 FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037     
LIMDIR     END-IF.                                                      FARF037
      *                                                                
      *    si empieza por URB y contiene MZ(03)
      *
      *    si empieza con URB y contiene BL(04) y AP(05).        
      *    Si empieza por URB y contiene BL(04) y CA(01)
      *
      *    Si empieza por URB y contiene ET(19) y CA(01)
      *    Si empieza por URB y contiene SEC(20) y AP(05)
      *    
LIMDIR     IF NVA-DIR-BDLDIR(1) = "URB"                                 FARF037
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(03) = "1" ) OR                     FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(04) = "1"                          FARF037
LIMDIR            AND (TIP-NVA-DIR-BDLDIR(05) = "1"                     FARF037
LIMDIR                 OR TIP-NVA-DIR-BDLDIR(01) = "1")) OR             FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(19) = "1"                          FARF037
LIMDIR            AND TIP-NVA-DIR-BDLDIR(01) = "1") OR                  FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(20) = "1"                          FARF037
LIMDIR            AND TIP-NVA-DIR-BDLDIR(05) = "1")                     FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *                                                             
      *    si empieza con KM y contiene FCA(07) .                      
      *    si empieza con KM y contiene AUTOP(08)                      
      *    si empieza con Km y contiene VIA(09)                        
      *    si empieza con Km Y contiene VDA(10) o VE(11)                   
      *    Si empieza por KM y contiene CORRG(12) 
      *    si empieza con KM y contiene URB(02)   
      *      
      *    Si empieza con KM y contiene CA(01) y CONJ(14)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "KM"                                  FARF037
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(07) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(08) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(09) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(10) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(11) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(12) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(02) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(01) = "1"                          FARF037
LIMDIR            AND TIP-NVA-DIR-BDLDIR(14) = "1")                     FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *                                                              
      *    si empieza con BL y contiene AP(05) y URB(02)                     
      *    si empieza con BL y contiene AP(05) y BRR(13)                     
      *    si empieza con BL y contiene AP(05) y CONJ(14)                    
      *    si empieza con BL y contiene AP(05) y ED(15)                      
      *    si empieza con BL y contiene AP(05) y CIUD(16)
      *    Si empieza con BL y contiene AP(05) y ET(19)
      *    Si empieza con BL y contiene AP(05) y SEC(20)
      *    Si empieza con BL y contiene AP(05) Y MZ(03)(igual a MZ y AP)
      *
      *    Si empieza con BL y contiene CA(01) y MZ(03)(igual a MZ y CA)
      *    Si empieza con BL y contiene CA(01) y BRR(13)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "BL"                                  FARF037
LIMDIR        IF TIP-NVA-DIR-BDLDIR(05) = "1"                           FARF037
LIMDIR           IF TIP-NVA-DIR-BDLDIR(02) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(13) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(14) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(15) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(16) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(19) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(20) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(03) = "1"                        FARF037
LIMDIR              MOVE 0 TO JJ-BDLDIR                                 FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037
      *                                                                 FARF037
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(01) = "1") AND                       FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(03) = "1"                          FARF037
LIMDIR            OR TIP-NVA-DIR-BDLDIR(13) = "1")                      FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037                
LIMDIR     END-IF.                                                      FARF037
      *        
      *    si empieza con ET y contiene CA(01) y BRR(13) .                      
      *    si empieza con ET y contiene MZ(03) y LT(17) y BRR(13)                  
LIMDIR     IF NVA-DIR-BDLDIR(1) = "ET"                                  FARF037
LIMDIR        IF TIP-NVA-DIR-BDLDIR(13) = "1"                           FARF037
LIMDIR           IF (TIP-NVA-DIR-BDLDIR(01) = "1") OR                   FARF037
LIMDIR              (TIP-NVA-DIR-BDLDIR(03) = "1"                       FARF037
LIMDIR               AND TIP-NVA-DIR-BDLDIR(17) = "1")                  FARF037
LIMDIR              MOVE 0 TO JJ-BDLDIR                                 FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *                                                               
      *    si empieza con CA y contiene KM(06).                             
      *    si empieza con CA y contiene LT(17) y URB(02)                        
      *    si empieza con CA y contiene LT(17) y BRR(13)
      *
      *    Si empieza por CA y portiene MZ(03) y ET(19)
      *    Si empieza por CA y portiene MZ(03) y SEC(20)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "CA"                                  FARF037
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(06) = "1") OR                      FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(17) = "1"                          FARF037
LIMDIR            AND (TIP-NVA-DIR-BDLDIR(02) = "1"                     FARF037
LIMDIR                 OR TIP-NVA-DIR-BDLDIR(13) = "1"))                FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
      *
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(03) = "1"  AND                     FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(19) = "1"                          FARF037
LIMDIR            OR TIP-NVA-DIR-BDLDIR(20) = "1"))                     FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037      
LIMDIR     END-IF.                                                      FARF037
      *                                                                 
      *    si empieza con CONJ y contiene BL(04) y AP(05) .                     
      *    si empieza con CONJ y contiene TO(18) y AP(05) .                     
LIMDIR     IF NVA-DIR-BDLDIR(1) = "CONJ"                                FARF037
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(05) = "1" AND                      FARF037
LIMDIR            (TIP-NVA-DIR-BDLDIR(04) = "1"                         FARF037
LIMDIR             OR TIP-NVA-DIR-BDLDIR(18) = "1"))                     FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *    si empieza con LT y contiene MZ(03) y CA(01)    
      *    Si empieza por LT y portiene MZ(03) y BRR(13)
      *    Si empieza por LT y portiene MZ(03) y SEC(20)
      
LIMDIR     IF NVA-DIR-BDLDIR(1) = "LT" AND                              FARF037
LIMDIR        TIP-NVA-DIR-BDLDIR(03) = "1"                              FARF037
LIMDIR        IF TIP-NVA-DIR-BDLDIR(01) = "1" OR                        FARF037
LIMDIR           TIP-NVA-DIR-BDLDIR(13) = "1" OR                        FARF037
LIMDIR           TIP-NVA-DIR-BDLDIR(20) = "1"                           FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *     
      *    si empieza con SEC y contiene MZ(03) y LT(17).                      
      *    si empieza con SEC y contiene MZ(03) y CA(01).                
      *    Si empieza por SEC y contiene MZ(03) y ET(19)	
      
      *    si empieza con SEC y contiene TO(18) y AP(05).                      
      *    si empieza con SEC y contiene BL(04) y AP(05) .  
      *
      *    Si empieza por SEC y contiene CA(01) y ET(19)	
LIMDIR     IF NVA-DIR-BDLDIR(1) = "SEC"                                 FARF037
LIMDIR        IF TIP-NVA-DIR-BDLDIR(03) = "1"                           FARF037
LIMDIR           IF TIP-NVA-DIR-BDLDIR(17) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(01) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(19) = "1"                        FARF037
LIMDIR              MOVE 0 TO JJ-BDLDIR                                 FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037
      *
LIMDIR        IF TIP-NVA-DIR-BDLDIR(05) = "1"                           FARF037
LIMDIR           IF TIP-NVA-DIR-BDLDIR(18) = "1" OR                     FARF037
LIMDIR              TIP-NVA-DIR-BDLDIR(04) = "1"                        FARF037
LIMDIR              MOVE 0 TO JJ-BDLDIR                                 FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037
      *
LIMDIR        IF TIP-NVA-DIR-BDLDIR(01) = "1" AND                       FARF037
LIMDIR           TIP-NVA-DIR-BDLDIR(19) = "1"                           FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *
      *    Si empieza con ALTO y contiene KM(06) y LT(17)
      *    Si empieza con ALTO y contiene MZ(03) y LT(17)
      *    Si empieza con ALTO y contiene TO(18) y AP(05)
      *
LIMDIR     IF NVA-DIR-BDLDIR(1) = "ALTO"                                FARF037
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(06) = "1"                          FARF037
LIMDIR            AND TIP-NVA-DIR-BDLDIR(17) = "1") OR                  FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(03) = "1"                          FARF037
LIMDIR            AND TIP-NVA-DIR-BDLDIR(17) = "1")  OR                 FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(18) = "1"                          FARF037
LIMDIR            AND TIP-NVA-DIR-BDLDIR(05) = "1")                     FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *
      *    Si empieza por CIUD y contiene BL(04) y AP(05)
      *    Si empieza por CIUD y contiene BL(04) y CA(01)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "CIUD"                                FARF037
LIMDIR        IF (TIP-NVA-DIR-BDLDIR(04) = "1"  AND                     FARF037
LIMDIR           (TIP-NVA-DIR-BDLDIR(05) = "1"                          FARF037
LIMDIR            OR TIP-NVA-DIR-BDLDIR(01) = "1"))                     FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037      
LIMDIR     END-IF.                                                      FARF037
      *
      *    Si empieza por CRT y contiene KM(06)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "CRT" AND                             FARF037
LIMDIR        TIP-NVA-DIR-BDLDIR(06) = "1"                              FARF037
LIMDIR        MOVE 0 TO JJ-BDLDIR                                       FARF037
LIMDIR     END-IF.                                                      FARF037
      *
      *    Si empieza por SMZ y contiene MZ(03) y CA(01)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "SMZ"                                 FARF037
LIMDIR        IF TIP-NVA-DIR-BDLDIR(03) = "1"  AND                      FARF037
LIMDIR           TIP-NVA-DIR-BDLDIR(01) = "1"                           FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037      
LIMDIR     END-IF.                                                      FARF037      
      * 
      *    Si empieza con ED y contiene BL(04) y AP(05)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "ED"                                  FARF037
LIMDIR        IF TIP-NVA-DIR-BDLDIR(04) = "1"  AND                      FARF037
LIMDIR           TIP-NVA-DIR-BDLDIR(05) = "1"                           FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037      
LIMDIR     END-IF.                                                      FARF037
      *
      *    Si empieza por VIA y contiene KM(06)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "VIA" AND                             FARF037
LIMDIR        TIP-NVA-DIR-BDLDIR(06) = "1"                              FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR     END-IF.                                                      FARF037      
      *
      *    Si empieza por VDA y contiene KM(06)
LIMDIR     IF NVA-DIR-BDLDIR(1) = "VDA" AND                             FARF037
LIMDIR        TIP-NVA-DIR-BDLDIR(06) = "1"                              FARF037
LIMDIR           MOVE 0 TO JJ-BDLDIR                                    FARF037
LIMDIR     END-IF.                                                      FARF037      
      * 
PLNCHQ*                                                                 FARF032
PLNCHQ 6141-NUMEROS-LETRAS-BDLDIR.                                      FARF032
PLNCHQ     MOVE 0 TO HAY-NUMEROS-BDLDIR.                                FARF032
PLNCHQ     MOVE 0 TO HAY-LETRAS-BDLDIR.                                 FARF032
PLNCHQ     MOVE 1 TO M-BDLDIR.                                          FARF032
PLNCHQ     PERFORM UNTIL M-BDLDIR > 60                                  FARF032
PLNCHQ        IF DIRECCION-ESTANDARIZADA-BDLDIR(M-BDLDIR:1) NUMERIC     FARF032
PLNCHQ           ADD 1 TO HAY-NUMEROS-BDLDIR                            FARF032
PLNCHQ        ELSE                                                      FARF032
PLNCHQ           IF DIRECCION-ESTANDARIZADA-BDLDIR(M-BDLDIR:1) <> SPACESFARF032
PLNCHQ              ADD 1 TO HAY-LETRAS-BDLDIR                          FARF032
PLNCHQ           END-IF                                                 FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ        ADD 1 TO M-BDLDIR                                         FARF032
PLNCHQ     END-PERFORM.                                                 FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ 6141-VER-PART-IGUALES-BDLDIR.                                    FARF032
PLNCHQ     MOVE 0 TO HAY-MASDE3-REPETIDAS-BDLDIR.                       FARF032
PLNCHQ     MOVE 1 TO N-BDLDIR.                                          FARF032
PLNCHQ     PERFORM UNTIL NVA-DIR-BDLDIR(N-BDLDIR) = SPACES              FARF032
PLNCHQ                                OR N-BDLDIR > 60                  FARF032
PLNCHQ        MOVE 0 TO CONT-REPETIDAS-BDLDIR                           FARF032
PLNCHQ        MOVE 1 TO M-BDLDIR                                        FARF032
PLNCHQ        PERFORM UNTIL NVA-DIR-BDLDIR(M-BDLDIR) = SPACES OR        FARF032
PLNCHQ                                      M-BDLDIR > 60               FARF032
PLNCHQ           IF NVA-DIR-BDLDIR(N-BDLDIR) =                          FARF032
PLNCHQ              NVA-DIR-BDLDIR(M-BDLDIR)                            FARF032
PLNCHQ              ADD 1 TO CONT-REPETIDAS-BDLDIR                      FARF032
PLNCHQ           END-IF                                                 FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ           ADD 1 TO M-BDLDIR                                      FARF032
PLNCHQ        END-PERFORM                                               FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ        IF CONT-REPETIDAS-BDLDIR > 3                              FARF032
PLNCHQ           MOVE 1 TO HAY-MASDE3-REPETIDAS-BDLDIR                  FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ        ADD 1 TO N-BDLDIR                                         FARF032
PLNCHQ     END-PERFORM.                                                 FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ 6141-VER-PRIMERA-PART-BDLDIR.                                    FARF032
PLNCHQ     MOVE 0 TO HAY-PRIMERA-MALA-BDLDIR.                           FARF032
PLNCHQ     IF NVA-DIR-BDLDIR(1) = "AP" OR "OF"                          FARF032
PLNCHQ        MOVE 1 TO HAY-PRIMERA-MALA-BDLDIR                         FARF032
PLNCHQ     END-IF.                                                      FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ 6141-VER-NUM-AFTER-VIA-BDLDIR.                                   FARF032
PLNCHQ     MOVE 0 TO HAY-NUMEROS4-VIAS-BDLDIR  .                        FARF032
PLNCHQ     MOVE 1 TO N-BDLDIR.                                          FARF032
PLNCHQ     PERFORM UNTIL V-VIAS-PRIN-BDLDIR(N-BDLDIR) = SPACES          FARF032
PLNCHQ        MOVE 1 TO M-BDLDIR                                        FARF032
PLNCHQ        MOVE 0 TO CONT-REPETIDAS-BDLDIR                           FARF032
PLNCHQ        PERFORM UNTIL NVA-DIR-BDLDIR(M-BDLDIR) = SPACES           FARF032
PLNCHQ                                   OR M-BDLDIR > 60               FARF032
PLNCHQ           IF V-VIAS-PRIN-BDLDIR(N-BDLDIR) =                      FARF032
PLNCHQ              NVA-DIR-BDLDIR(M-BDLDIR)                            FARF032
PLNCHQ              IF NVA-DIR-BDLDIR(M-BDLDIR + 1)(1:4) NUMERIC        FARF032
PLNCHQ                 ADD 1 TO CONT-REPETIDAS-BDLDIR                   FARF032
PLNCHQ              END-IF                                              FARF032
PLNCHQ           END-IF                                                 FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ           ADD 1 TO M-BDLDIR                                      FARF032
PLNCHQ        END-PERFORM                                               FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ        IF CONT-REPETIDAS-BDLDIR > 0                              FARF032
PLNCHQ           MOVE 1 TO HAY-NUMEROS4-VIAS-BDLDIR                     FARF032
PLNCHQ        END-IF                                                    FARF032
PLNCHQ*                                                                 FARF032
PLNCHQ        ADD 1 TO N-BDLDIR                                         FARF032
PLNCHQ     END-PERFORM.                                                 FARF032
      *                                                                 FARF032
RCNCER*****                                                             RMB0010 
PYSPAR*RCNCER     IF CALIFICA-DIR-BDLDIR > 0                            HGO0021
PYSPAR*RCNCER        MOVE 0 TO M-BDLDIR                                 HGO0021
PYSPAR*RCNCER        INSPECT TIP-NUEVA-DIRECCION-BDLDIR  TALLYING M-BDLDHGO0021
PYSPAR*RCNCER                FOR ALL "S"                                HGO0021
PYSPAR*RCNCER        IF M-BDLDIR = 0 AND CALIFICA-DIR-BDLDIR < 25   *> MHGO0021
PYSPAR*RCNCER           MOVE 0 TO CALIFICA-DIR-BDLDIR                   HGO0021
PYSPAR*RCNCER        END-IF                                             HGO0021
PYSPAR*RCNCER     END-IF.                                               HGO0021
      *
REMARK******************************************************************
REMARK*6150-LIMPIA-DIR-ESTANDARIZADA                                         *
REMARK*    APLICA LAS REGLAS DE LIMPIEZA DEFINIDAS POR MERCADEO A LA 
      *    DIRECCION EXTANDARIZADA. TOMA COMO ENTRADA Y SALIDA LA 
      *    VARIABLE  
REMARK*    DIRECCION-ESTANDARIZADA-BDLDIR 
      *    USA EL VECTOR DE PARTICULAS Y EL CONTADOR DE PARTICULAS
      *     NUEVA-DIRECCION-BDLDIR, CON-PART-ESTANDARIZADA-BDLDIR
REMARK****************************************************************** 
LIMDIR 6150-LIMPIA-DIR-ESTANDARIZADA.                                   FARF037
LIMDIR*    Identificar y corregir aquellas direcciones donde se         FARF037
LIMDIR*    presentan dos partículas seguidas repetidas.                 FARF037
LIMDIR*                                                                 FARF037
LIMDIR     IF CON-PART-ESTANDARIZADA-BDLDIR >= 3                        FARF037
LIMDIR        PERFORM 6151-QUITA-DOS-REPETIDAS                          FARF037
LIMDIR     END-IF.                                                      FARF037
      *
      *    identificar y corregir aquellas direcciones donde se 
      *    encuentre duplicada la misma información dentro del mismo 
      *    campo
      *                                                                 FARF037
LIMDIR     PERFORM 6152-QUITA-DUPLICADA.                                FARF037
LIMDIR*                                                                 FARF037
LIMDIR*    Identificar y corregir aquellas direcciones donde se presentaFARF037
LIMDIR*    al interior adicionalmente un teléfono.                      FARF037
LIMDIR     PERFORM 6153-QUITA-PART-TEL.                                 FARF037
LIMDIR*                                                                 FARF037
LIMDIR*    se limpiaran los ceros de mas en las particulas              FARF037
LIMDIR     PERFORM 6154-QUITA-CEROS-PAR.                                FARF037
      *                                                                 FARF037
REMARK******************************************************************
REMARK*6151-QUITA-DOS-REPETIDAS. 
      *    TOMA DE ENTRADA Y DE SALIDA LA VARIABLE 
      *    DIRECCION-ESTANDARIZADA-BDLDIR, QUITA DOS PARTICULAS SEGUIDAS 
      *    REPETIDAS EJEMPLO SI LA DIRECCION ES : 
      *    KR 11 B BIS 118 32 CA 1 SANTA BARBARA SANTA BARBARA OCC
      *    QUEDA : 
      *    KR 11 B BIS 118 32 CA 1 SANTA BARBARA OCC
REMARK******************************************************************
LIMDIR     6151-QUITA-DOS-REPETIDAS.                                    FARF037
LIMDIR*    salvamos el contador de particulas y asignamos los topes del FARF037
LIMDIR*    ciclo                                                        FARF037
LIMDIR     MOVE CON-PART-ESTANDARIZADA-BDLDIR TO II-BDLDIR.             FARF037
LIMDIR     COMPUTE N-BDLDIR = CON-PART-ESTANDARIZADA-BDLDIR - 2.        FARF037
LIMDIR     MOVE 1 TO M-BDLDIR.                                          FARF037
LIMDIR     PERFORM UNTIL M-BDLDIR > N-BDLDIR                            FARF037
LIMDIR*       armamos las particulas a comparar                         FARF037
LIMDIR        STRING NVA-DIR-BDLDIR(M-BDLDIR) DELIMITED BY SPACES       FARF037
LIMDIR               " " DELIMITED BY SIZE                              FARF037
LIMDIR               NVA-DIR-BDLDIR(M-BDLDIR + 1) DELIMITED BY SIZE     FARF037
LIMDIR           INTO TIP-NUEVA-DIRECCION-BDLDIR                        FARF037
LIMDIR*                                                                 FARF037
LIMDIR        STRING NVA-DIR-BDLDIR(M-BDLDIR + 2) DELIMITED BY SPACES   FARF037
LIMDIR               " " DELIMITED BY SIZE                              FARF037
LIMDIR               NVA-DIR-BDLDIR(M-BDLDIR + 3) DELIMITED BY SIZE     FARF037
LIMDIR          INTO PART-ESTANDARIZADA-BDLDIR                          FARF037
LIMDIR*                                                                 FARF037
LIMDIR        IF TIP-NUEVA-DIRECCION-BDLDIR =                           FARF037
LIMDIR           PART-ESTANDARIZADA-BDLDIR                              FARF037
LIMDIR*          borramos la particula corriendo el vector              FARF037
LIMDIR           COMPUTE JJ-STA-BDLDIR = M-BDLDIR + 2                   FARF037
LIMDIR           PERFORM UNTIL JJ-STA-BDLDIR > N-BDLDIR                 FARF037
LIMDIR              MOVE NVA-DIR-BDLDIR(JJ-STA-BDLDIR + 2) TO           FARF037
LIMDIR                   NVA-DIR-BDLDIR(JJ-STA-BDLDIR)                  FARF037
LIMDIR              MOVE NVA-DIR-BDLDIR(JJ-STA-BDLDIR + 3) TO           FARF037
LIMDIR                   NVA-DIR-BDLDIR(JJ-STA-BDLDIR + 1)              FARF037
LIMDIR              ADD 2 TO JJ-STA-BDLDIR                              FARF037
LIMDIR           END-PERFORM                                            FARF037
LIMDIR*          actualizamos los contadores                            FARF037
LIMDIR           COMPUTE CON-PART-ESTANDARIZADA-BDLDIR =                FARF037
LIMDIR                   CON-PART-ESTANDARIZADA-BDLDIR - 2              FARF037
LIMDIR           COMPUTE N-BDLDIR =                                     FARF037
LIMDIR                  CON-PART-ESTANDARIZADA-BDLDIR - 2               FARF037
LIMDIR        ELSE                                                      FARF037
LIMDIR          ADD 1 TO M-BDLDIR                                       FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-PERFORM.                                                 FARF037
LIMDIR*    si cambio el contador actualizamos la direccion              FARF037
LIMDIR     IF II-BDLDIR <> CON-PART-ESTANDARIZADA-BDLDIR                FARF037
LIMDIR        MOVE SPACE TO TIP-NUEVA-DIRECCION-BDLDIR                  FARF037
LIMDIR        MOVE 1 TO JJ-BDLDIR *> Recorre la direccion final         FARF037
LIMDIR        MOVE 1 TO M-BDLDIR  *> Recorre vector de particulas       FARF037
LIMDIR        PERFORM UNTIL M-BDLDIR > CON-PART-ESTANDARIZADA-BDLDIR    FARF037
LIMDIR           MOVE 1 TO N-BDLDIR   *> Recorre elemento particulas    FARF037
LIMDIR           PERFORM UNTIL N-BDLDIR > 60                            FARF037
LIMDIR              IF NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1) <> SPACES   FARF037
LIMDIR                 MOVE NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1) TO     FARF037
LIMDIR                      TIP-NVA-DIR-BDLDIR(JJ-BDLDIR)               FARF037
LIMDIR                 ADD 1 TO N-BDLDIR                                FARF037
LIMDIR                 ADD 1 TO JJ-BDLDIR                               FARF037
LIMDIR              ELSE                                                FARF037
LIMDIR                 MOVE 61 TO N-BDLDIR                              FARF037
LIMDIR                 ADD 1 TO JJ-BDLDIR                               FARF037
LIMDIR              END-IF                                              FARF037
LIMDIR           END-PERFORM                                            FARF037
LIMDIR*                                                                 FARF037
LIMDIR           ADD 1 TO M-BDLDIR                                      FARF037
LIMDIR        END-PERFORM                                               FARF037
LIMDIR*                                                                 FARF037
LIMDIR        MOVE TIP-NUEVA-DIRECCION-BDLDIR TO                        FARF037
LIMDIR             DIRECCION-ESTANDARIZADA-BDLDIR                       FARF037
LIMDIR     END-IF.                                                      FARF037
      *
REMARK******************************************************************
REMARK*6152-QUITA-DUPLICADA. 
      *    TOMA DE ENTRADA Y DE SALIDA LA VARIABLE 
      *    DIRECCION-ESTANDARIZADA-BDLDIR, VERIFICA SI LA INFORMACION  
      *    ESTA REPETIDA DOS VECES Y DEJA SOLO UNO.EJEMPLO
      *    KR 25 29 B 49 KR 25 29 B 49  
      *    QUEDA : 
      *    KR 25 29 B 49
REMARK******************************************************************
LIMDIR 6152-QUITA-DUPLICADA.                                            FARF037
LIMDIR*    se verifica si el numero de particulas es par                FARF037
LIMDIR     DIVIDE CON-PART-ESTANDARIZADA-BDLDIR BY 2                    FARF037
LIMDIR            GIVING II-STA-BDLDIR REMAINDER JJ-STA-BDLDIR          FARF037
LIMDIR     IF JJ-STA-BDLDIR = 0                                         FARF037
LIMDIR*       verificamos si las dos particulas son iguales             FARF037
LIMDIR        ADD 1 TO II-STA-BDLDIR  *> encontramos mitad del vector   FARF037
LIMDIR        IF NVA-DIR-BDLDIR(1) = NVA-DIR-BDLDIR(II-STA-BDLDIR)      FARF037
LIMDIR*          unimos las particulas y comparamos                     FARF037
LIMDIR           MOVE SPACES TO TIP-NUEVA-DIRECCION-BDLDIR              FARF037
LIMDIR           MOVE SPACES TO PART-A-ESTANDARIZAR-BDLDIR              FARF037
LIMDIR           MOVE 1 TO M-BDLDIR  *> Recorre vector de particulas    FARF037
LIMDIR           MOVE 1 TO JJ-BDLDIR *> Recorre la direccion final      FARF037
LIMDIR           PERFORM UNTIL M-BDLDIR >= II-STA-BDLDIR                FARF037
LIMDIR              MOVE 1 TO N-BDLDIR   *> Recorre elemento particulas FARF037
LIMDIR              PERFORM UNTIL N-BDLDIR > 60                         FARF037
LIMDIR                 IF NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1) <>       FARF037
LIMDIR                    SPACES                                        FARF037
LIMDIR                    MOVE NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1) TO  FARF037
LIMDIR                         TIP-NVA-DIR-BDLDIR(JJ-BDLDIR)            FARF037
LIMDIR                    ADD 1 TO N-BDLDIR                             FARF037
LIMDIR                    ADD 1 TO JJ-BDLDIR                            FARF037
LIMDIR                 ELSE                                             FARF037
LIMDIR                    MOVE 61 TO N-BDLDIR                           FARF037
LIMDIR                    ADD 1 TO JJ-BDLDIR                            FARF037
LIMDIR                 END-IF                                           FARF037
LIMDIR              END-PERFORM                                         FARF037
LIMDIR*                                                                 FARF037
LIMDIR              ADD 1 TO M-BDLDIR                                   FARF037
LIMDIR           END-PERFORM                                            FARF037
LIMDIR*                                                                 FARF037
LIMDIR           MOVE II-STA-BDLDIR TO  M-BDLDIR                        FARF037
LIMDIR           MOVE 1 TO JJ-BDLDIR                                    FARF037
LIMDIR           PERFORM UNTIL M-BDLDIR > CON-PART-ESTANDARIZADA-BDLDIR FARF037
LIMDIR              MOVE 1 TO N-BDLDIR                                  FARF037
LIMDIR              PERFORM UNTIL N-BDLDIR > 60                         FARF037
LIMDIR                 IF NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1) <>       FARF037
LIMDIR                    SPACES                                        FARF037
LIMDIR                    MOVE NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1) TO  FARF037
LIMDIR                         PART-A-ESTAN-BDLDIR(JJ-BDLDIR)           FARF037
LIMDIR                    ADD 1 TO N-BDLDIR                             FARF037
LIMDIR                    ADD 1 TO JJ-BDLDIR                            FARF037
LIMDIR                 ELSE                                             FARF037
LIMDIR                    MOVE 61 TO N-BDLDIR                           FARF037
LIMDIR                    ADD 1 TO JJ-BDLDIR                            FARF037
LIMDIR                 END-IF                                           FARF037
LIMDIR              END-PERFORM                                         FARF037
LIMDIR*                                                                 FARF037
LIMDIR              ADD 1 TO M-BDLDIR                                   FARF037
LIMDIR           END-PERFORM                                            FARF037
LIMDIR*                                                                 FARF037
LIMDIR           IF TIP-NUEVA-DIRECCION-BDLDIR =                        FARF037
LIMDIR              PART-A-ESTANDARIZAR-BDLDIR                          FARF037
LIMDIR              MOVE TIP-NUEVA-DIRECCION-BDLDIR TO                  FARF037
LIMDIR                   DIRECCION-ESTANDARIZADA-BDLDIR                 FARF037
LIMDIR              COMPUTE CON-PART-ESTANDARIZADA-BDLDIR =             FARF037
LIMDIR                      CON-PART-ESTANDARIZADA-BDLDIR / 2           FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR     END-IF.                                                      FARF037
      *
REMARK******************************************************************
REMARK*6153-QUITA-PART-TEL. 
      *    TOMA DE ENTRADA Y DE SALIDA LA VARIABLE 
      *    DIRECCION-ESTANDARIZADA-BDLDIR, VERIFICA SI LA INFORMACION  
      *    TIENE LA PARTICULA TEL Y QUITA DE HAY HASTA EL FINAL EJEMPLO     
      *    KR 99 68 A 10 TEL 4360614 ALAMOS SUR 
      *    QUEDA : 
      *    KR 99 68 A 10
REMARK******************************************************************
LIMDIR 6153-QUITA-PART-TEL.                                             FARF037
LIMDIR*    buscamos is tiene la particula TEL                           FARF037
           MOVE 1 TO M-BDLDIR  *> Recorre vector de particulas          FARF037
           MOVE 0 TO II-STA-BDLDIR *> Indica poscicion si existe el datoFARF037
LIMDIR     PERFORM UNTIL M-BDLDIR > CON-PART-ESTANDARIZADA-BDLDIR       FARF037
LIMDIR        IF NVA-DIR-BDLDIR(M-BDLDIR) = "TEL"                       FARF037
LIMDIR           ADD M-BDLDIR TO II-STA-BDLDIR                          FARF037
LIMDIR           MOVE 61 TO M-BDLDIR                                    FARF037
LIMDIR        END-IF                                                    FARF037
      *                                                                 FARF037
              ADD 1 TO M-BDLDIR                                         FARF037
LIMDIR     END-PERFORM                                                  FARF037
      *                                                                 FARF037
LIMDIR     IF II-STA-BDLDIR > 0                                         FARF037
LIMDIR*       unimos la particula y remplazamos                         FARF037
LIMDIR        MOVE SPACES TO TIP-NUEVA-DIRECCION-BDLDIR                 FARF037
LIMDIR        MOVE 1 TO M-BDLDIR                                        FARF037
LIMDIR        MOVE 1 TO JJ-BDLDIR *> Recorre la direccion final         FARF037
LIMDIR        PERFORM UNTIL M-BDLDIR >= II-STA-BDLDIR                   FARF037
LIMDIR           MOVE 1 TO N-BDLDIR   *> Recorre elemento particulas    FARF037
LIMDIR           PERFORM UNTIL N-BDLDIR > 60                            FARF037
LIMDIR              IF NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1) <>          FARF037
LIMDIR                 SPACES                                           FARF037
LIMDIR                 MOVE NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1) TO     FARF037
LIMDIR                      TIP-NVA-DIR-BDLDIR(JJ-BDLDIR)               FARF037
LIMDIR                 ADD 1 TO N-BDLDIR                                FARF037
LIMDIR                 ADD 1 TO JJ-BDLDIR                               FARF037
LIMDIR              ELSE                                                FARF037
LIMDIR                 MOVE 61 TO N-BDLDIR                              FARF037
LIMDIR                 ADD 1 TO JJ-BDLDIR                               FARF037
LIMDIR              END-IF                                              FARF037
LIMDIR           END-PERFORM                                            FARF037
LIMDIR*                                                                 FARF037
LIMDIR           ADD 1 TO M-BDLDIR                                      FARF037
LIMDIR        END-PERFORM                                               FARF037
LIMDIR*                                                                 FARF037
LIMDIR        MOVE TIP-NUEVA-DIRECCION-BDLDIR TO                        FARF037
LIMDIR             DIRECCION-ESTANDARIZADA-BDLDIR                       FARF037
LIMDIR        COMPUTE CON-PART-ESTANDARIZADA-BDLDIR =                   FARF037
LIMDIR                II-STA-BDLDIR - 1                                 FARF037
LIMDIR     END-IF.                                                      FARF037
      *
      *
REMARK******************************************************************
REMARK*6154-QUITA-CEROS-PAR. 
      *    Si la partícula comienza con cero y contiene solo ceros  se 
      *    debe borrar EJ CASA 0000 (queda =>) CASA quita tambien ceros 
      *    al inicio  y mas de dos ceros conseutivos al final ejemplo
      *    000CASA 2000 (queda =>) CASA 20  
      
      *    N-BDLDIR recorre el vector de direccion estandar
      *    
REMARK******************************************************************
LIMDIR 6154-QUITA-CEROS-PAR.                                            FARF037
LIMDIR*    Quitamos primero los ceros finales que sean mas de 2, usamos FARF037
LIMDIR*    M-BDLDIR indica si el caracter anterior es un blanco 0-no    FARF037
LIMDIR*    1-si,  usamos. N-BDLDIR recorre el vector de direccion       FARF037
LIMDIR*    estandar, usamos JJ-BDLDIR para recorrer el vector           FARF037
LIMDIR*    resultante, usamos TIP-NUEVA-DIRECCION-BDLDIR para dejara la FARF037
LIMDIR*    direccion corregida, usamos II-BDLDIR para contar los ceros  FARF037
LIMDIR*    consecutivos.                                                FARF037
LIMDIR*                                                                 FARF037
LIMDIR     MOVE 1 TO M-BDLDIR.                                          FARF037
LIMDIR     MOVE 60 TO N-BDLDIR.                                         FARF037
LIMDIR     MOVE 60 TO JJ-BDLDIR                                         FARF037
LIMDIR     MOVE 0 TO II-BDLDIR.                                         FARF037
LIMDIR     MOVE SPACES TO TIP-NUEVA-DIRECCION-BDLDIR.                   FARF037
LIMDIR                                                                  FARF037
LIMDIR     PERFORM UNTIL N-BDLDIR < 1                                   FARF037
LIMDIR*       Si es cero y van menos de dos los movemos                 FARF037
LIMDIR        IF DIRECCION-ESTANDARIZADA-BDLDIR(N-BDLDIR:1) = "0"       FARF037
LIMDIR           IF II-BDLDIR < 2                                       FARF037
LIMDIR              MOVE DIRECCION-ESTANDARIZADA-BDLDIR(N-BDLDIR:1) TO  FARF037
LIMDIR                   TIP-NVA-DIR-BDLDIR(JJ-BDLDIR)                  FARF037
LIMDIR              SUBTRACT 1 FROM JJ-BDLDIR                           FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR*                                                                 FARF037
LIMDIR*          si no es un cero intermedio lo contamos                FARF037
LIMDIR           IF M-BDLDIR = 1                                        FARF037
LIMDIR              ADD 1 TO II-BDLDIR                                  FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        ELSE                                                      FARF037
LIMDIR           MOVE DIRECCION-ESTANDARIZADA-BDLDIR(N-BDLDIR:1) TO     FARF037
LIMDIR                 TIP-NVA-DIR-BDLDIR(JJ-BDLDIR)                    FARF037
LIMDIR           SUBTRACT 1 FROM JJ-BDLDIR                              FARF037
LIMDIR           MOVE 0 TO II-BDLDIR                                    FARF037
LIMDIR*          si es blanco reiniciamos las banderas                  FARF037
LIMDIR           IF DIRECCION-ESTANDARIZADA-BDLDIR(N-BDLDIR:1) = " "    FARF037
LIMDIR              MOVE 1 TO M-BDLDIR                                  FARF037
LIMDIR           ELSE                                                   FARF037
LIMDIR              MOVE 0 TO  M-BDLDIR                                 FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR*                                                                 FARF037
LIMDIR        SUBTRACT 1 FROM N-BDLDIR                                  FARF037
LIMDIR     END-PERFORM.                                                 FARF037
LIMDIR*                                                                 FARF037
LIMDIR*    Quitamos los espacios y ceros iniciales usamos               FARF037
LIMDIR*    DIRECCION-60-BDLDIR para dejar la direccion corregida        FARF037
LIMDIR*                                                                 FARF037
LIMDIR     MOVE 1 TO M-BDLDIR.                                          FARF037
LIMDIR     MOVE 1 TO N-BDLDIR.                                          FARF037
LIMDIR     MOVE 1 TO JJ-BDLDIR.                                         FARF037
LIMDIR     MOVE SPACES TO DIRECCION-60-BDLDIR.                          FARF037
LIMDIR     PERFORM UNTIL N-BDLDIR > 60                                  FARF037
LIMDIR*       Si no es un cero inicial lo movemos                       FARF037
LIMDIR        IF TIP-NVA-DIR-BDLDIR(N-BDLDIR) = "0"                     FARF037
LIMDIR           IF M-BDLDIR = 0                                        FARF037
LIMDIR              MOVE TIP-NVA-DIR-BDLDIR(N-BDLDIR) TO                FARF037
LIMDIR                   DIRECCION-60-BDLDIR(JJ-BDLDIR:1)               FARF037
LIMDIR              ADD 1 TO JJ-BDLDIR                                  FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        ELSE                                                      FARF037
LIMDIR*                                                                 FARF037
LIMDIR*          Si no es blanco repetido se mueve                      FARF037
LIMDIR           IF TIP-NVA-DIR-BDLDIR(N-BDLDIR) = " "                  FARF037
LIMDIR              IF M-BDLDIR = 0                                     FARF037
LIMDIR                 MOVE TIP-NVA-DIR-BDLDIR(N-BDLDIR) TO             FARF037
LIMDIR                      DIRECCION-60-BDLDIR(JJ-BDLDIR:1)            FARF037
LIMDIR                 ADD 1 TO JJ-BDLDIR                               FARF037
LIMDIR                 MOVE 1 TO M-BDLDIR                               FARF037
LIMDIR              END-IF                                              FARF037
LIMDIR           ELSE                                                   FARF037
LIMDIR              MOVE TIP-NVA-DIR-BDLDIR(N-BDLDIR) TO                FARF037
LIMDIR                   DIRECCION-60-BDLDIR(JJ-BDLDIR:1)               FARF037
LIMDIR              ADD 1 TO JJ-BDLDIR                                  FARF037
LIMDIR              MOVE 0 TO M-BDLDIR                                  FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR*                                                                 FARF037
LIMDIR        ADD 1 TO N-BDLDIR                                         FARF037
LIMDIR     END-PERFORM.                                                 FARF037
LIMDIR*                                                                 FARF037
LIMDIR*    Si el resultado final no es igual al inicial se calculan las FARF037
LIMDIR*    particulas nuevamente. usamos II-BDLDIR para Recorrer la     FARF037
LIMDIR*    direccion inicial, usamos M-BDLDIR para Recorrer el vector deFARF037
LIMDIR*    particulas, usamos N-BDLDIR para Recorrer el elemento vector FARF037
LIMDIR*    particulas                                                   FARF037
LIMDIR*                                                                 FARF037
LIMDIR     IF DIRECCION-ESTANDARIZADA-BDLDIR NOT = DIRECCION-60-BDLDIR  FARF037
LIMDIR        MOVE DIRECCION-60-BDLDIR TO DIRECCION-ESTANDARIZADA-BDLDIRFARF037
LIMDIR        MOVE 1 TO II-BDLDIR                                       FARF037
LIMDIR        MOVE 1 TO M-BDLDIR                                        FARF037
LIMDIR        MOVE 1 TO N-BDLDIR                                        FARF037
LIMDIR        MOVE 0 TO CON-PART-ESTANDARIZADA-BDLDIR                   FARF037
LIMDIR        INITIALIZE NUEVA-DIRECCION-BDLDIR                         FARF037
LIMDIR        PERFORM UNTIL II-BDLDIR > 60                              FARF037
LIMDIR*          si no es blanco movemos al vector de particulas        FARF037
LIMDIR           IF DIRECCION-ESTANDARIZADA-BDLDIR(II-BDLDIR:1) <>      FARF037
LIMDIR               SPACES                                             FARF037
LIMDIR              MOVE DIRECCION-ESTANDARIZADA-BDLDIR(II-BDLDIR:1) TO FARF037
LIMDIR                   NVA-DIR-BDLDIR(M-BDLDIR)(N-BDLDIR:1)           FARF037
LIMDIR              ADD 1 TO N-BDLDIR                                   FARF037
LIMDIR           ELSE                                                   FARF037
LIMDIR*             verificamos si la particula debe cambiar            FARF037
LIMDIR              IF NVA-DIR-BDLDIR(M-BDLDIR) <> SPACES               FARF037
LIMDIR                 ADD 1 TO M-BDLDIR                                FARF037
LIMDIR                 MOVE 1 TO N-BDLDIR                               FARF037
LIMDIR                 ADD 1 TO CON-PART-ESTANDARIZADA-BDLDIR           FARF037
LIMDIR              END-IF                                              FARF037
LIMDIR           END-IF                                                 FARF037
LIMDIR*                                                                 FARF037
LIMDIR           ADD 1 TO II-BDLDIR                                     FARF037
LIMDIR        END-PERFORM                                               FARF037
LIMDIR*                                                                 FARF037
LIMDIR*       si la ultima particula no es vacia la cuento              FARF037
LIMDIR        IF NVA-DIR-BDLDIR(M-BDLDIR) <> SPACES                     FARF037
LIMDIR           ADD 1 TO CON-PART-ESTANDARIZADA-BDLDIR                 FARF037
LIMDIR        END-IF                                                    FARF037
LIMDIR*                                                                 FARF037
LIMDIR*       movemos la primera y segunda particula                    FARF037
LIMDIR        MOVE NVA-DIR-BDLDIR(1) TO PRIPART-ESTANDARIZADA-BDLDIR    FARF037
LIMDIR        MOVE NVA-DIR-BDLDIR(2) TO SEGPART-ESTANDARIZADA-BDLDIR    FARF037
LIMDIR     END-IF.                                                      FARF037
      *
DIRACC 2000-U-VALIDAR-ACCDIR.                                           RMB0003 
REMARK******************************************************************
REMARK* RUTINA CREADA PARA MANEJAR LOS ALGORITMOS DE NOMBRES. HAY VARIAS
REMARK* RUTINAS QUE MANEJAN LO NECESARIO PARA ESTANDARIZAR Y ORDENAR.    
REMARK* ENTRADAS 
REMARK*         ABIERTO EL ICBSUS
REMARK*         ABIERTO EL BDLCI
REMARK*         ABIERTO EL ICMCRE
REMARK*         ABIERTO EL ICMCHK
REMARK*         LLAVE-DIRECC     LLAVE NORMAL DEL ARCHIVO DE DIRECCIONES
REMARK*         PRIVILEGIO-INPUT VALOR DE PRIVILEGIO-BDLCI DEL CONSULTANTE
REMARK*         NIT-CONSULTANTE-INPUT
REMARK* SALIDAS
REMARK*         VALIDACION-DIR-OUT 0: NO TOMAR EL REGISTRO,1 SI TOMARLO
REMARK*******************************************************************
RCNCER     MOVE 0 TO VALIDACION-DIR-OUT-BDLDIR.                         RMB0010 
DIRACC     MOVE COD-SUS-DIRECC TO COD-SUSCRIP-ABD02.                    RMB0003 
DIRACC     READ SUSCRIPTOR IGNORE LOCK                                  RMB0003 
DIRACC        INVALID KEY                                               RMB0003 
RCNCER           MOVE 0 TO VALIDACION-DIR-OUT-BDLDIR                    RMB0010 
DIRACC        NOT INVALID KEY                                           RMB0003 
VALPRI           MOVE NIT-SUSCRIP-S-ABD02 TO NIT-ID-BDLCLI              RMB0007 
VALPRI           READ BDLCLI IGNORE LOCK                                RMB0007 
VALPRI                INVALID KEY MOVE 0 TO INDICADOR-BDLCLI            RMB0007 
VALPRI                            MOVE " " TO VALIDAR-DB-BDLCLI         RMB0007 
BLOQ01                            MOVE " " TO IND-BLOQUEO-INF-BDLCLI    RMB0029 
VALPRI           END-READ                                               RMB0007 
RCNCER           IF PRIVILEGIO-INPUT-BDLDIR = 2                         RMB0010 
VALPRI              MOVE 1 TO INDICADOR-BDLCLI                          RMB0007 
VALPRI           END-IF                                                 RMB0007 
VALPRI           IF INDICADOR-BDLCLI = 1                                RMB0007 
BLOQ01              AND IND-BLOQUEO-INF-BDLCLI <> "B"                   RMB0029 
VALPRI              IF VALIDAR-DB-BDLCLI = "N"                          RMB0007 
AJCONT                 PERFORM 2590-EXAMINAR-ESTABAN-VACIOS             FARF035
RCNCER                 MOVE 1 TO VALIDACION-DIR-OUT-BDLDIR              RMB0010 
VALPRI              ELSE                                                RMB0007 
RCNCER                 MOVE 0 TO VALIDACION-DIR-OUT-BDLDIR              RMB0010 
VALPRI                 PERFORM 2100-U-VALIDAR-MAESTROS                  RMB0007 
VALPRI              END-IF                                              RMB0007 
VALPRI           END-IF                                                 RMB0007 
DIRACC     END-READ.                                                    RMB0003
      *
AJCONT     IF VALIDACION-DIR-OUT-BDLDIR = 1                             FARF035
AJCONT        PERFORM 2100-VALIDAR-CAMPOS-BDLDIR                        FARF035
AJCONT     END-IF.                                                      FARF035
      *
AJCONT 2100-VALIDAR-CAMPOS-BDLDIR.                                      FARF035
AJCONT     IF DIRRES-ABD02 = "N"                                        FARF035
AJCONT        MOVE SPACES TO DIRRES-DIRECC                              FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF TELRES-ABD02 = "N"                                        FARF035
AJCONT        MOVE ZEROS  TO TELRES-DIRECC                              FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF DIRLAB-ABD02 = "N"                                        FARF035
AJCONT        MOVE SPACES TO DIRLAB-DIRECC                              FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF TELLAB-ABD02 = "N"                                        FARF035
AJCONT        MOVE ZEROS  TO TELLAB-DIRECC                              FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF DIRCOR-ABD02 = "N"                                        FARF035
AJCONT        MOVE SPACES TO DIRLAB-DIRECC                              FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF TELCEL-ABD02 = "N"                                        FARF035
AJCONT        MOVE ZEROS  TO TELCEL-DIRECC                              FARF035
AJCONT     END-IF.                                                      FARF035
AJCONT*                                                                 FARF035
AJCONT     IF E-MAIL-ABD02 = "N"                                        FARF035
AJCONT        MOVE SPACES TO E-MAIL-DIRECC                              FARF035
AJCONT     END-IF.                                                      FARF035
      *
DIRACC 2100-U-VALIDAR-MAESTROS.                                         RMB0003 
REMARK******************************************************************
REMARK*4110-VALIDAR-MAESTROS.
REMARK*    SE VALIDA CONTRA LOS MAESTROS DE CARTERA Y CUENTAS CORRIENTE*
REMARK*    SI LA CUENTA EXISTE EN ELLOS                                *
REMARK******************************************************************
AMPDIR*    MOVE LLAVE-DIRECC TO LLAVE-MAES-CREDIT LLAVE-MAES-CHECK.     FAC0009 
AMPDIR     MOVE TIPO-ID-DIRECC TO TIPO-ID-ABD07 TIPO-ID-ABD06           FAC0009 
AMPDIR     MOVE NUM-ID-DIRECC  TO NUM-ID-ABD07  NUM-ID-ABD06            FAC0009 
AMPDIR     MOVE COD-SUS-DIRECC TO COD-SUS-ABD07 COD-SUS-ABD06           FAC0009 
AMPDIR     MOVE COD-CTA-DIRECC TO COD-CTA-ABD07 COD-CTA-ABD06           FAC0009 
AMPDIR     MOVE NUM-CTA-DIRECC TO NUM-CTA-ABD07 NUM-CTA-ABD06           FAC0009 
DIRACC     IF ESTADO-ABD02 = 1                                          RMB0003 
DIRACC        IF COD-CTA-DIRECC = 1                                     RMB0003 
UNLSUS           READ MAESTRO-CHECK WITH IGNORE LOCK   INVALID KEY      DLM0013 
RCNCER                MOVE 0 TO VALIDACION-DIR-OUT-BDLDIR               RMB0010 
DIRACC                NOT INVALID KEY                                   RMB0003 
MATCH1                    $IF HACERMATCH = "SI"                         RMB0013 
MATCH1                    PERFORM 8000-U-VER-CTAABD06-BDAMATCH          RMB0013 
MATCH1                    $END                                          RMB0013
      *                   Se hace el llamado a la rutina antes de 
      *                   independientemente del valor de 
      *                   VALIDACION-DIR-OUT ya que algunos programas no
      *                   usan el switche
FCRGCR                    PERFORM 2590-VER-ESTADO-CTA                   ABB0034
DIRACC                    IF IND-BLOQUEO-ABD06 = 0                      RMB0003 
RCNCER                       MOVE 1 TO VALIDACION-DIR-OUT-BDLDIR        RMB0010 
DIRACC                    END-IF                                        RMB0003 
DIRACC           END-READ                                               RMB0003 
DIRACC        ELSE                                                      RMB0003 
UNLSUS           READ MAESTRO-CREDIT  WITH IGNORE LOCK  INVALID KEY     DLM0013 
RCNCER                MOVE 0 TO VALIDACION-DIR-OUT-BDLDIR               RMB0010 
DIRACC                NOT INVALID KEY                                   RMB0003 
MATCH1                    $IF HACERMATCH = "SI"                         RMB0013 
MATCH1                    PERFORM 8000-U-VER-CTAABD07-BDAMATCH          RMB0013 
MATCH1                    $END                                          RMB0013 
FCRGCR                    PERFORM 2590-VER-ESTADO-CTA                   ABB0034
DIRACC                    IF IND-BLOQUEO-ABD07 = 0                      RMB0003 
RCNCER                       MOVE 1 TO VALIDACION-DIR-OUT-BDLDIR        RMB0010 
DIRACC                    END-IF                                        RMB0003 
DIRACC           END-READ                                               RMB0003 
DIRACC        END-IF                                                    RMB0003 
DIRACC     END-IF.                                                      RMB0003
      *
      ******************************************************************
      * 2590-VER-ESTADO-CTA                                            *
      *    SI LA CUENTA PADRE ESTA CERRADA SE CAMBIAN LAS FECHAS A LA  *
      *    FECHA DE CIERRE SI ESTA ES MENOR A LA REPORTADA EN LA       *
      *    DIRECCION.                                                  *
      ******************************************************************
      *
FCRGCR 2590-VER-ESTADO-CTA.                                             ABB0034
FCRGCR     MOVE 0 TO CTA-ACTIVA.                                        ABB0034
FCRGCR     IF COD-CTA-DIRECC = 1                                        ABB0034
FCRGCR        IF NOV-REPORT-ABD06 = 01 OR 06 OR 07                      ABB0034
FCRGCR           MOVE 1 TO CTA-ACTIVA                                   ABB0034
FCRGCR        ELSE                                                      ABB0034
FCRGCR           MOVE FEC-NOVEDAD-ABD06 TO FEC-MMAA-BDLDI2              ABB0034
FCRGCR        END-IF                                                    ABB0034
FCRGCR     ELSE                                                         ABB0034
FCRGCR        IF NOV-REPORT-ABD07 = 01 OR 45 OR 47 OR                   ABB0034
FCRGCR           (NOV-REPORT-ABD07 >= 13 AND NOV-REPORT-ABD07 <= 41)    ABB0034
FCRGCR           MOVE 1 TO CTA-ACTIVA                                   ABB0034
FCRGCR        ELSE                                                      ABB0034
FCRGCR           MOVE FEC-NOVEDAD-ABD07 TO FEC-MMAA-BDLDI2              ABB0034
FCRGCR        END-IF                                                    ABB0034
FCRGCR     END-IF.                                                      ABB0034
      *
FCRGCR     IF CTA-ACTIVA = 0                                            ABB0034
      *       SE CONVIERTE AL MILENIO PARA LA COMPARACION
FCRGCR        MOVE FEC-MMAA-BDLDI2(1:2) TO FEC-AAAAMM-BDLDI2(5:2)       ABB0034
FCRGCR        MOVE FEC-MMAA-BDLDI2(3:2) TO FEC-AAAAMM-BDLDI2(3:2)       ABB0034
FCRGCR        IF FEC-MMAA-BDLDI2(3:2) < "50"                            ABB0034
FCRGCR           MOVE "20"   TO FEC-AAAAMM-BDLDI2(1:2)                  ABB0034
FCRGCR        ELSE                                                      ABB0034
FCRGCR           MOVE "19"   TO FEC-AAAAMM-BDLDI2(1:2)                  ABB0034
FCRGCR        END-IF                                                    ABB0034
      *
FCRGCR        IF FEC-AAAAMM-BDLDI2 < FECRES-DIRECC                      ABB0034
FCRGCR           MOVE FEC-AAAAMM-BDLDI2 TO FECRES-DIRECC                ABB0034
FCRGCR        END-IF                                                    ABB0034
      *
FCRGCR        IF FEC-AAAAMM-BDLDI2 < FECLAB-DIRECC                      ABB0034
FCRGCR           MOVE FEC-AAAAMM-BDLDI2 TO FECLAB-DIRECC                ABB0034
FCRGCR        END-IF                                                    ABB0034
      *
FCRGCR        IF FEC-AAAAMM-BDLDI2 < FECCOR-DIRECC                      ABB0034
FCRGCR           MOVE FEC-AAAAMM-BDLDI2 TO FECCOR-DIRECC                ABB0034
FCRGCR        END-IF                                                    ABB0034
      *
FCRGCR        IF FEC-AAAAMM-BDLDI2 < FECCEL-DIRECC                      ABB0034
FCRGCR           MOVE FEC-AAAAMM-BDLDI2 TO FECCEL-DIRECC                ABB0034
FCRGCR        END-IF                                                    ABB0034
      *
FCRGCR        IF FEC-AAAAMM-BDLDI2 < FECTRES-DIRECC                     ABB0034
FCRGCR           MOVE FEC-AAAAMM-BDLDI2 TO FECTRES-DIRECC               ABB0034
FCRGCR        END-IF                                                    ABB0034
      *
FCRGCR        IF FEC-AAAAMM-BDLDI2 < FECTLAB-DIRECC                     ABB0034
FCRGCR           MOVE FEC-AAAAMM-BDLDI2 TO FECTLAB-DIRECC               ABB0034
FCRGCR        END-IF                                                    ABB0034
      *
FCRGCR        IF FEC-AAAAMM-BDLDI2 < FECMAIL-DIRECC                     ABB0034
FCRGCR           MOVE FEC-AAAAMM-BDLDI2 TO FECMAIL-DIRECC               ABB0034
FCRGCR        END-IF                                                    ABB0034
AJCONT     ELSE                                                         FARF035
AJCONT        PERFORM 2590-EXAMINAR-ESTABAN-VACIOS                      FARF035
FCRGCR     END-IF.                                                      ABB0034
      *
AJCONT 2590-EXAMINAR-ESTABAN-VACIOS.                                    FARF035
AJCONT     IF FLAG-DIRRES-DIRECC =  "V"                                 FARF035
AJCONT        AND FECDRES-DIRECC > 0                                    FARF035
AJCONT        MOVE FECAPE-DIRECC TO FECDRES-DIRECC                      FARF035
AJCONT     END-IF.                                                      FARF035
      *                                                                 FARF035
AJCONT     IF FLAG-TELRES-DIRECC =  "V"                                 FARF035
AJCONT        AND FECTRES-DIRECC > 0                                    FARF035
AJCONT        MOVE FECAPE-DIRECC TO FECTRES-DIRECC                      FARF035
AJCONT     END-IF.                                                      FARF035
      *                                                                 FARF035
AJCONT     IF FLAG-DIRLAB-DIRECC =  "V"                                 FARF035
AJCONT        AND FECDLAB-DIRECC > 0                                    FARF035
AJCONT        MOVE FECAPE-DIRECC TO FECDLAB-DIRECC                      FARF035
AJCONT     END-IF.                                                      FARF035
      *                                                                 FARF035
AJCONT     IF FLAG-TELLAB-DIRECC =  "V"                                 FARF035
AJCONT        AND FECTLAB-DIRECC > 0                                    FARF035
AJCONT        MOVE FECAPE-DIRECC TO FECTLAB-DIRECC                      FARF035
AJCONT     END-IF.                                                      FARF035
      *                                                                 FARF035
AJCONT     IF FLAG-DIRCOR-DIRECC =  "V"                                 FARF035
AJCONT        AND FECDCOR-DIRECC > 0                                    FARF035
AJCONT        MOVE FECAPE-DIRECC TO FECDCOR-DIRECC                      FARF035
AJCONT     END-IF.                                                      FARF035
      *                                                                 FARF035
AJCONT     IF FLAG-CELULAR-DIRECC =  "V"                                FARF035
AJCONT        AND FECCEL-DIRECC > 0                                     FARF035
AJCONT        MOVE FECAPE-DIRECC TO FECCEL-DIRECC                       FARF035
AJCONT     END-IF.                                                      FARF035
      *                                                                 FARF035
AJCONT     IF FLAG-EMAIL-DIRECC =  "V"                                  FARF035
AJCONT        AND FECMAIL-DIRECC > 0                                    FARF035
AJCONT        MOVE FECAPE-DIRECC TO FECMAIL-DIRECC                      FARF035
AJCONT     END-IF.                                                      FARF035
      *
NWDIRB 2590-NVA-DIRECC-BOGOTA.                                          GJC0011 
REMARK******************************************************************
REMARK*2590-NVA-DIRECC-BOGOTA
REMARK*    SI LA DIRECCION ES DE BOGOTA, BUSCA SI ESTA TIENE NUEVA NO- *
REMARK*    MENCLATURA                                                  *
REMARK******************************************************************
NWDIRB        IF CIUDAD-BTA-BDLDIR(1:5)  = "BOGOT"                      GJC0011 
NWDIRB           MOVE DIRECCION-BTA-BDLDIR TO T-CARMEJ-BDLDIR           GJC0011 
NWDIRB           PERFORM 1200-CALCULAR-LLAVE                            GJC0011 
DIRB02*          MOVE V-HASDIRFIN-BDLDIR (I-BDLDIR) TO                  RMB0012 
DIRB02*               LLAVE-BDLNEWDIRBOG                                RMB0012 
NWDIRB           PERFORM 8400-EXAMINE-BDLNEWDIRBOG                      GJC0011 
NWDIRB        ELSE                                                      GJC0011 
NWDIRB           MOVE 0 TO HAY-BDLNEWDIRBOG-BDLDIR                      GJC0011 
NWDIRB        END-IF.                                                   GJC0011 

NWDIRB 1200-CALCULAR-LLAVE.                                             GJC0011 
REMARK*********************************************************************
REMARK* 1200-CALCULAR-LLAVE.
REMARK* SE PROCEDE A CLACULAR LA LLAVE DEL ARCHIVO DE NUEVA NOMENCLATURA
REMARK* DE BOGOTA, LA CUAL SE COMPONE:
REMARK*      1: SIGLA DE LA "AVENIDA" (2 CARACTERES)
REMARK*      2: NUMEROS ORDENADOS     (5 CARACTERES 7 NUMEROS)
REMARK*      3: NUMEROS ORIGINALES    (5 CARACTERES 3 NUMEROS) ADICIONANDO
REMARK*         LOS VALORES ASCII POR POSICION A ESTOS
REMARK*********************************************************************
NWDIRB     MOVE 1 TO I-MEJ-BDLDIR.                                      GJC0011 
NWDIRB     MOVE 1 TO K-MEJ-BDLDIR.                                      GJC0011 
NWDIRB     MOVE 0 TO J-MEJ-BDLDIR.                                      GJC0011 
NWDIRB     MOVE " " TO CAR-ANT-BDLDIR.                                  GJC0011 
NWDIRB     INITIALIZE T-NUMMEJ-BDLDIR.                                  GJC0011 
CARTOT     PERFORM UNTIL I-MEJ-BDLDIR > 60 OR J-MEJ-BDLDIR >= 10        CAV0014 
NWDIRB       IF V-CARMEJ-BDLDIR(I-MEJ-BDLDIR) NUMERIC                   GJC0011 
NWDIRB          MOVE V-CARMEJ-BDLDIR(I-MEJ-BDLDIR) TO CAR-ACT-BDLDIR    GJC0011 
NWDIRB          IF CAR-ANT-BDLDIR NUMERIC                               GJC0011 
NWDIRB             COMPUTE V-NUMMEJ-BDLDIR(J-MEJ-BDLDIR) =              GJC0011 
NWDIRB                     V-NUMMEJ-BDLDIR(J-MEJ-BDLDIR) * 10 +         GJC0011 
NWDIRB                                       CAR-ACT-BDLDIR             GJC0011 
NWDIRB          ELSE                                                    GJC0011 
NWDIRB             ADD 1 TO J-MEJ-BDLDIR                                GJC0011 
NWDIRB             MOVE V-CARMEJ-BDLDIR(I-MEJ-BDLDIR) TO                GJC0011 
NWDIRB                  V-NUMMEJ-BDLDIR(J-MEJ-BDLDIR)                   GJC0011 
NWDIRB          END-IF                                                  GJC0011 
NWDIRB          MOVE "N"             TO V-LETRAS-BDLDIR(K-MEJ-BDLDIR)   GJC0011 
NWDIRB          ADD 1 TO K-MEJ-BDLDIR                                   GJC0011 
NWDIRB          MOVE "U"             TO V-LETRAS-BDLDIR(K-MEJ-BDLDIR)   GJC0011 
NWDIRB          ADD 1 TO K-MEJ-BDLDIR                                   GJC0011 
NWDIRB          MOVE " "             TO V-LETRAS-BDLDIR(K-MEJ-BDLDIR)   GJC0011 
NWDIRB          ADD 1 TO K-MEJ-BDLDIR                                   GJC0011 
NWDIRB       ELSE                                                       GJC0011 
NWDIRB          MOVE V-CARMEJ-BDLDIR(I-MEJ-BDLDIR) TO                   GJC0011 
NWDIRB               V-LETRAS-BDLDIR(K-MEJ-BDLDIR)                      GJC0011 
NWDIRB          ADD 1 TO K-MEJ-BDLDIR                                   GJC0011 
NWDIRB       END-IF                                                     GJC0011 
NWDIRB       MOVE V-CARMEJ-BDLDIR(I-MEJ-BDLDIR) TO CAR-ANT-BDLDIR       GJC0011 
NWDIRB       ADD 1 TO I-MEJ-BDLDIR                                      GJC0011 
NWDIRB     END-PERFORM.                                                 GJC0011 
NWDIRB     MOVE V-NUMMEJ-BDLDIR(01) TO NN8-BDLDIR                       GJC0011 
NWDIRB     MOVE V-NUMMEJ-BDLDIR(02) TO NN9-BDLDIR                       GJC0011 
NWDIRB     MOVE V-NUMMEJ-BDLDIR(03) TO NN10-BDLDIR                      GJC0011 
NWDIRB     SORT V-NUMMEJ-BDLDIR DESCENDING.                             GJC0011 
NWDIRB     MOVE NN8-BDLDIR  TO  V-NUMMEJ-BDLDIR(08).                    GJC0011 
NWDIRB     MOVE NN9-BDLDIR  TO  V-NUMMEJ-BDLDIR(09).                    GJC0011 
NWDIRB     MOVE NN10-BDLDIR TO  V-NUMMEJ-BDLDIR(10).                    GJC0011 
NWDIRB     INITIALIZE T-L-BDLDIR.                                       GJC0011 
NWDIRB     UNSTRING T-LETRAS-BDLDIR DELIMITED BY ALL " " INTO           GJC0011 
NWDIRB       L-BDLDIR(1)  L-BDLDIR(2)  L-BDLDIR(3)  L-BDLDIR(4)         GJC0011 
NWDIRB       L-BDLDIR(5)  L-BDLDIR(6)  L-BDLDIR(7)  L-BDLDIR(8)         GJC0011 
NWDIRB       L-BDLDIR(9)  L-BDLDIR(10) L-BDLDIR(11) L-BDLDIR(12)        GJC0011 
NWDIRB       L-BDLDIR(13) L-BDLDIR(14) L-BDLDIR(15) L-BDLDIR(16)        GJC0011 
NWDIRB       L-BDLDIR(17) L-BDLDIR(18) L-BDLDIR(19) L-BDLDIR(20)        GJC0011 
NWDIRB       L-BDLDIR(21) L-BDLDIR(22) L-BDLDIR(23) L-BDLDIR(24)        GJC0011 
NWDIRB       L-BDLDIR(25) L-BDLDIR(26) L-BDLDIR(27) L-BDLDIR(28)        GJC0011 
NWDIRB       L-BDLDIR(29) L-BDLDIR(30)                                  GJC0011 
NWDIRB     MOVE 2 TO I-MEJ-BDLDIR                                       GJC0011 
NWDIRB     MOVE 8 TO J-MEJ-BDLDIR                                       GJC0011 
NWDIRB     PERFORM UNTIL I-MEJ-BDLDIR > 30                              GJC0011 
NWDIRB       IF J-MEJ-BDLDIR > 10                                       GJC0011 
NWDIRB          MOVE 8 TO J-MEJ-BDLDIR                                  GJC0011 
NWDIRB       END-IF                                                     GJC0011 
NWDIRB       IF L-BDLDIR(I-MEJ-BDLDIR) <> SPACES                        GJC0011 
NWDIRB          IF L-BDLDIR(I-MEJ-BDLDIR)(2:1) = " "                    GJC0011 
NWDIRB             MOVE L-BDLDIR(I-MEJ-BDLDIR)(1:1) TO LETRA-BDLDIR     GJC0011 
NWDIRB             MOVE FUNCTION ORD(LETRA-BDLDIR) TO ORDEN-ASCII-BDLDIRGJC0011 
NWDIRB             COMPUTE ORDEN-ASCII-BDLDIR = ORDEN-ASCII-BDLDIR  *   GJC0011 
NWDIRB                     I-MEJ-BDLDIR                                 GJC0011 
NWDIRB             ADD ORDEN-ASCII-BDLDIR TO                            GJC0011 
NWDIRB                 V-NUMMEJ-BDLDIR(J-MEJ-BDLDIR)                    GJC0011 
NWDIRB             ADD 1 TO J-MEJ-BDLDIR                                GJC0011 
NWDIRB          ELSE                                                    GJC0011 
NWDIRB             IF L-BDLDIR(I-MEJ-BDLDIR) = "BIS" OR "MJ"            GJC0011 
NWDIRB                MOVE "W" TO LETRA-BDLDIR                          GJC0011 
NWDIRB                MOVE FUNCTION ORD(LETRA-BDLDIR) TO                GJC0011 
NWDIRB                     ORDEN-ASCII-BDLDIR                           GJC0011 
NWDIRB                ADD ORDEN-ASCII-BDLDIR TO                         GJC0011 
NWDIRB                    V-NUMMEJ-BDLDIR(J-MEJ-BDLDIR)                 GJC0011 
NWDIRB                ADD 1 TO J-MEJ-BDLDIR                             GJC0011 
NWDIRB             END-IF                                               GJC0011 
NWDIRB          END-IF                                                  GJC0011 
NWDIRB       END-IF                                                     GJC0011 
NWDIRB       ADD 1 TO I-MEJ-BDLDIR                                      GJC0011 
NWDIRB    END-PERFORM.                                                  GJC0011 
NWDIRB 8400-EXAMINE-BDLNEWDIRBOG.                                       GJC0011 
REMARK**************************************************************
REMARK*8400-EXAMINE-BDLNEWDIRBOG.
REMARK* CON ESTA RUTINA SE DETERMINA SI UNA DIRECCION DE BOGOTA TIENE
REMARK* NUEVA NOMENCLATURA O NO.
REMARK*************************************************************
NWDIRB     IF OPEN-BDLNEWDIRBOG-BDLDIR = 0                              GJC0011 
NWDIRB        MOVE 1 TO OPEN-BDLNEWDIRBOG-BDLDIR                        GJC0011 
NWDIRB        OPEN INPUT BDLNEWDIRBOG                                   GJC0011 
NWDIRB     END-IF.                                                      GJC0011 
NWDIRB     MOVE T-NUMMEJ-BDLDIR TO NUMEROS-BDLNEWDIRBOG                 GJC0011 
NWDIRB     IF L-BDLDIR(1) NOT = SPACES                                  GJC0011 
NWDIRB        MOVE L-BDLDIR(1) TO AVENIDA-BDLNEWDIRBOG                  GJC0011 
NWDIRB     ELSE                                                         GJC0011 
NWDIRB        MOVE L-BDLDIR(2) TO AVENIDA-BDLNEWDIRBOG                  GJC0011 
NWDIRB     END-IF.                                                      GJC0011 
NWDIRB     READ BDLNEWDIRBOG                                            GJC0011 
NWDIRB       INVALID KEY                                                GJC0011 
NWDIRB           MOVE 0 TO HAY-BDLNEWDIRBOG-BDLDIR                      GJC0011 
NWDIRB       NOT INVALID KEY                                            GJC0011 
NWDIRB           MOVE 1 TO HAY-BDLNEWDIRBOG-BDLDIR                      GJC0011 
NWDIRB     END-READ.                                                    GJC0011 
NCAM20                                                                  ABB0034 
NCAM20 8500-NUEVOS-CAMPOS-DIRECCION.                                    ABB0034 
NCAM20******************************************************************ABB0036
NCAM20*    CONVIERTE CODIGOS DE NUEVOS CAMPOS DE DIRECCION             *ABB0036
NCAM20*    EN DESCRIPCIONES                                            *ABB0036
NCAM20*       V-TIPODIFIN-BDLDIR() -> V-TDI-BDLDIR()                   *ABB0036
NCAM20*       V-ZONAFIN-BDLDIR  () -> V-ZON-BDLDIR()                   *ABB0036
NCAM20******************************************************************ABB0036
NCAM20     ACCEPT FECHA-VEC-BDLDIR FROM DATE YYYYMMDD                   ABB0036
NCAM20     INITIALIZE TABLA-VEC-BDLDIR                                  ABB0036
NCAM20     MOVE 24 TO K-TRA-BDLDIR                                      ABB0036
NCAM20     PERFORM 24 TIMES                                             ABB0036
NCAM20       SUBTRACT 1 FROM MES-VEC-BDLDIR                             ABB0036
NCAM20       IF MES-VEC-BDLDIR < 1                                      ABB0036
NCAM20          MOVE 12 TO MES-VEC-BDLDIR                               ABB0036
NCAM20          SUBTRACT 1 FROM ANO-VEC-BDLDIR                          ABB0036
NCAM20       END-IF                                                     ABB0036
NCAM20       MOVE ANOMES-VEC-BDLDIR TO T-MES-BDLDIR(K-TRA-BDLDIR)       ABB0036
NCAM20       SUBTRACT 1 FROM K-TRA-BDLDIR                               ABB0036
NCAM20     END-PERFORM                                                  ABB0036
NCAM20                                                                  ABB0036
NCAM20     MOVE 1 TO I-TRA-BDLDIR                                       ABB0036
NCAM20     PERFORM UNTIL V-FECFIN-BDLDIR(I-TRA-BDLDIR) = 0              ABB0036
NCAM20             OR    I-TRA-BDLDIR > 100                             ABB0036
NCAM20       IF V-ZONAFIN-BDLDIR(I-TRA-BDLDIR) = "U"                    ABB0036
NCAM20          MOVE "URB" TO V-ZON-BDLDIR(I-TRA-BDLDIR)                ABB0036
NCAM20       ELSE                                                       ABB0036
NCAM20          IF V-ZONAFIN-BDLDIR(I-TRA-BDLDIR) = "R"                 ABB0036
NCAM20             MOVE "RUR" TO V-ZON-BDLDIR(I-TRA-BDLDIR)             ABB0036
NCAM20          ELSE                                                    ABB0036
NCAM20             MOVE "OTR" TO V-ZON-BDLDIR(I-TRA-BDLDIR)             ABB0036
NCAM20          END-IF                                                  ABB0036
NCAM20       END-IF                                                     ABB0036
NCAM20       MOVE V-TIPODIFIN-BDLDIR(I-TRA-BDLDIR) TO J-TRA-BDLDIR      ABB0036
NCAM20                                                                  ABB0036
NCAM20       MOVE 1 TO K-TRA-BDLDIR                                     ABB0036
NCAM20       PERFORM UNTIL K-TRA-BDLDIR > 24                            ABB0036
NCAM20         IF V-FECCREFIN-BDLDIR(I-TRA-BDLDIR) =                    ABB0036
NCAM20            T-MES-BDLDIR(K-TRA-BDLDIR)                            ABB0036
NCAM20            EVALUATE J-TRA-BDLDIR                                 ABB0036
NCAM20              WHEN 1 MOVE "N" TO T-VRE-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20              WHEN 2 MOVE "N" TO T-VLA-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20              WHEN 3 MOVE "N" TO T-VRE-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20                     MOVE "N" TO T-VLA-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20              WHEN 4 MOVE "N" TO T-VCR-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20              WHEN 5 MOVE "N" TO T-VRE-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20                     MOVE "N" TO T-VCR-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20              WHEN 6 MOVE "N" TO T-VLA-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20                     MOVE "N" TO T-VCR-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20              WHEN 7 MOVE "N" TO T-VRE-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20                     MOVE "N" TO T-VLA-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20                     MOVE "N" TO T-VCR-BDLDIR(K-TRA-BDLDIR:1)     ABB0036
NCAM20            END-EVALUATE                                          ABB0036
NCAM20            MOVE 24 TO K-TRA-BDLDIR                               ABB0036
NCAM20         END-IF                                                   ABB0036
NCAM20         ADD 1 TO K-TRA-BDLDIR                                    ABB0036
NCAM20       END-PERFORM                                                ABB0036
NCAM20                                                                  ABB0036
NCAM20       IF TIPO-ID-DIRECC = 1 OR 4                                 ABB0036
NCAM20          EVALUATE J-TRA-BDLDIR                                   ABB0036
NCAM20           WHEN 1 MOVE "RES"         TO V-TDI-BDLDIR(I-TRA-BDLDIR)ABB0036
NCAM20                  MOVE 1             TO W-RES-BDLDIR              ABB0036
NCAM20           WHEN 2 MOVE "LAB"         TO V-TDI-BDLDIR(I-TRA-BDLDIR)ABB0036
NCAM20                  MOVE 1             TO W-LAB-BDLDIR              ABB0036
NCAM20           WHEN 3 MOVE "RES-LAB"     TO V-TDI-BDLDIR(I-TRA-BDLDIR)ABB0036
NCAM20                  MOVE 1             TO W-RES-BDLDIR              ABB0036
NCAM20                  MOVE 1             TO W-LAB-BDLDIR              ABB0036
NCAM20           WHEN 4 MOVE "CRR"         TO V-TDI-BDLDIR(I-TRA-BDLDIR)ABB0036
NCAM20                  MOVE 1             TO W-CRR-BDLDIR              ABB0036
NCAM20           WHEN 5 MOVE "RES-CRR"     TO V-TDI-BDLDIR(I-TRA-BDLDIR)ABB0036
NCAM20                  MOVE 1             TO W-RES-BDLDIR              ABB0036
NCAM20                  MOVE 1             TO W-CRR-BDLDIR              ABB0036
NCAM20           WHEN 6 MOVE "LAB-CRR"     TO V-TDI-BDLDIR(I-TRA-BDLDIR)ABB0036
NCAM20                  MOVE 1             TO W-LAB-BDLDIR              ABB0036
NCAM20                  MOVE 1             TO W-CRR-BDLDIR              ABB0036
NCAM20           WHEN 7 MOVE "RES-LAB-CRR" TO V-TDI-BDLDIR(I-TRA-BDLDIR)ABB0036
NCAM20                  MOVE 1             TO W-RES-BDLDIR              ABB0036
NCAM20                  MOVE 1             TO W-LAB-BDLDIR              ABB0036
NCAM20                  MOVE 1             TO W-CRR-BDLDIR              ABB0036
NCAM20           WHEN ANY MOVE "    "      TO V-TDI-BDLDIR(I-TRA-BDLDIR)ABB0036
NCAM20          END-EVALUATE                                            ABB0036
NCAM20       ELSE                                                       ABB0036
NCAM20          EVALUATE J-TRA-BDLDIR                                   ABB0036
NCAM20           WHEN 1   MOVE "CCL"     TO V-TDI-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20                    MOVE 1         TO W-RES-BDLDIR                ABB0036
NCAM20           WHEN 2   MOVE "CCL"     TO V-TDI-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20                    MOVE 1         TO W-RES-BDLDIR                ABB0036
NCAM20           WHEN 3   MOVE "CCL"     TO V-TDI-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20                    MOVE 1         TO W-RES-BDLDIR                ABB0036
NCAM20           WHEN 4   MOVE "CRR"     TO V-TDI-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20                    MOVE 1         TO W-CRR-BDLDIR                ABB0036
NCAM20           WHEN 5   MOVE "CCL-CRR" TO V-TDI-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20                    MOVE 1         TO W-RES-BDLDIR                ABB0036
NCAM20                    MOVE 1         TO W-CRR-BDLDIR                ABB0036
NCAM20           WHEN 6   MOVE "CCL-CRR" TO V-TDI-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20                    MOVE 1         TO W-RES-BDLDIR                ABB0036
NCAM20                    MOVE 1         TO W-CRR-BDLDIR                ABB0036
NCAM20           WHEN 7   MOVE "CCL-CRR" TO V-TDI-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20                    MOVE 1         TO W-RES-BDLDIR                ABB0036
NCAM20                    MOVE 1         TO W-CRR-BDLDIR                ABB0036
NCAM20           WHEN ANY MOVE "    "    TO V-TDI-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20          END-EVALUATE                                            ABB0036
NCAM20       END-IF                                                     ABB0036
NCAM20       ADD 1 TO I-TRA-BDLDIR                                      ABB0036
NCAM20     END-PERFORM                                                  ABB0036
NCAM20                                                                  ABB0036
NCAM20     IF W-RES-BDLDIR = 1                                          ABB0036
NCAM20        INSPECT T-VRE-BDLDIR REPLACING ALL " " BY "I"             ABB0036
NCAM20     END-IF                                                       ABB0036
NCAM20     IF W-LAB-BDLDIR = 1                                          ABB0036
NCAM20        INSPECT T-VLA-BDLDIR REPLACING ALL " " BY "I"             ABB0036
NCAM20     END-IF                                                       ABB0036
NCAM20     IF W-CRR-BDLDIR = 1                                          ABB0036
NCAM20        INSPECT T-VCR-BDLDIR REPLACING ALL " " BY "I"             ABB0036
NCAM20     END-IF.                                                      ABB0036
NCAM20                                                                  ABB0036
NCAM20 8550-NUEVOS-CAMPOS-TELEFONO.                                     ABB0036
NCAM20******************************************************************ABB0036
NCAM20*    CONVIERTE CODIGOS DE NUEVOS CAMPOS DE TELEFONOS             *ABB0036
NCAM20*    EN DESCRIPCIONES                                            *ABB0036
NCAM20*       V-TIPOTEFIN-BDLDIR() -> V-TTE-BDLDIR()                   *ABB0036
NCAM20******************************************************************ABB0036
NCAM20     MOVE 1 TO I-TRA-BDLDIR                                       ABB0036
NCAM20     PERFORM UNTIL V-FECTELFIN-BDLDIR(I-TRA-BDLDIR) = 0           ABB0036
NCAM20             OR    I-TRA-BDLDIR > 100                             ABB0036
NCAM20       MOVE V-TIPOTEFIN-BDLDIR(I-TRA-BDLDIR) TO J-TRA-BDLDIR      ABB0036
NCAM20       IF TIPO-ID-DIRECC = 1 OR 4                                 ABB0036
NCAM20          EVALUATE J-TRA-BDLDIR                                   ABB0036
NCAM20           WHEN 1   MOVE "RES"     TO V-TTE-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20           WHEN 2   MOVE "LAB"     TO V-TTE-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20           WHEN 3   MOVE "RES-LAB" TO V-TTE-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20           WHEN ANY MOVE "    "    TO V-TTE-BDLDIR(I-TRA-BDLDIR)  ABB0036
NCAM20          END-EVALUATE                                            ABB0036
NCAM20       ELSE                                                       ABB0036
NCAM20          EVALUATE J-TRA-BDLDIR                                   ABB0036
NCAM20           WHEN 1   MOVE "CCL"   TO V-TTE-BDLDIR(I-TRA-BDLDIR)    ABB0036
NCAM20           WHEN 2   MOVE "CCL"   TO V-TTE-BDLDIR(I-TRA-BDLDIR)    ABB0036
NCAM20           WHEN 3   MOVE "CCL"   TO V-TTE-BDLDIR(I-TRA-BDLDIR)    ABB0036
NCAM20           WHEN ANY MOVE "    "  TO V-TTE-BDLDIR(I-TRA-BDLDIR)    ABB0036
NCAM20          END-EVALUATE                                            ABB0036
NCAM20       END-IF                                                     ABB0036
NCAM20       ADD 1 TO I-TRA-BDLDIR                                      ABB0036
NCAM20     END-PERFORM.                                                 ABB0036
NCAM20                                                                  ABB0036
