REMARK*CARACT-PROC.0014.
REMARK******************************************************************
REMARK* FUNCIONES QUE CALCULA LAS CARACTERISTICAS PARA UN INDIVIDUO    *
REMARK* PARAMETROS DE ENTRADA:                                         *
REMARK*   TIPO-ID-CARACT   (TIPO IDENTIFICAION )                       *
REMARK*   NRO-ID-CARACT    (NUMERO IDENTIFICAION )                     *
REMARK*   FECHA-RUN-CARACT (FECHA DE LA RECOGIDA DE BD )               *
ACIEAA*   NIT-RELACION-CARACT (NIT DE QUIEN PIDE EL SERVICIO)           RMB0012
REMARK*   GEN-NUM-CARACT   (0-NO GENERA, 1-GENERA NUM NIVEL 00,01,02   *
REMARK*   GEN-INQ-CARACT   (0-NO GENERA, 1-GENERA INQ NIVEL 00,01,02   *
REMARK*   GEN-MOR-CARACT   (0-NO GENERA, 1-GENERA MOR NIVEL 00,01      *
REMARK*   GEN-EXP-CARACT   (0-NO GENERA, 1-GENERA EXP NIVEL 00,01,02   *
REMARK*   GEN-DEM-CARACT   (0-NO GENERA, 1-GENERA DEM NIVEL 00,01      *
REMARK*   GEN-ACP-CARACT   (0-NO GENERA, 1-GENERA ACP NIVEL 00,01,02   *
REMARK*   GEN-END-CARACT   (0-NO GENERA, 1-GENERA END NIVEL 00,01,02   *
REMARK******************************************************************
REMARK* HGO0002     * ICMVLR - SE AJUSTA EL PROCESO PARA EL MANEJO DE  *
REMARK* H. GARCIA   *          ARCHIVOS DE VALORES ICMVLR              *
REMARK* JUN/17/09   *                                                  *
REMARK* INTERSCHEMES*                                                  *
REMARK******************************************************************
REMARK* RMB0003     * RUNDAT - SE AJUSTA EL PROCESO PARA CONTEMPLAR    *
REMARK* R. MARTINEZ *          LA DESACTUALIZACION QUE EXISTE AL       *
REMARK* AGO/17/09   *          USAR LA RUTINA EN LINEA Y BATCH         *
REMARK*             * ERM104   SE ARREGLA PROBLEMA DE 00MOR104 EN BLANC*
REMARK*             *          PARA PORTAFOLIO CO                      *
REMARK* DATACREDITO * INICAR - SE LLAMA LA RUTINA DE INICIAR EXTERNOS  *
REMARK*             * EREN01 - SE CORRIGE INICIO VECTOR VALORES        *
REMARK******************************************************************
REMARK* GJC0004     * SALMIN - CUANDO NO ENCUENTRA EN LA TABLA EL SALA-*
REMARK* G. JIMENEZ  *          RIO MINIMO EL DEL ANO QUE BUSCA ASUME EL*
REMARK* SEPT/2009   *          SALARIO DEL AÑO MAS ANTIGUO (POSICION 1)*
REMARK******************************************************************
REMARK* RMB0005     * EMB001 - SE CORRIGE PROBLEMA DE LA CARACTERISTICA*
REMARK* R. MARTINEZ *          00NUM022XX QUE SOLO DEBE TOMAR LAS CTAS *
REMARK* JUN-30-2010 *          ACTUALMENTE EN EMBARGO (06)             *
REMARK******************************************************************
REMARK* RMB0006     * CARA01 - SE IMPLEMENTAN LAS CARACTERISTICAS      *
REMARK* R. MARTINEZ *          00DEM026 - ESTRATO SOCIOECONOMICO       *
REMARK* SEP-30-2010 *          00DEM030 - ACTIVIDAD ECONOMICA          *
REMARK******************************************************************
REMARK* GJC0007     * FEBR01 - CUANDO EL CURRENT DATE ESTA EN FEBRERO  *
REMARK* G.JIMENEZ   *          SE DEBE MOVER LA INFORMACION A DICIEMBRE*
REMARK* FEB-04-2010 *          DEL AÑO ANTERIOR Y NO A DOS AÑOS ATRAS  *
REMARK******************************************************************
REMARK* RMB0008     * MORDIA - CUANDO LA CUENTA NO TIENE MORA LAS      *
REMARK* G.JIMENEZ   *          CARACTERISTICAS MOR DEBEN QUEDAR EN CERO*
REMARK* ABR-26-2010 *          Y NO EN VALORES NEGATIVOS               *
REMARK*             * FEBR02   SE MANEJA CUANDO ES ENERO Y 2 MESES ATRA*
REMARK******************************************************************
REMARK* GJC0009     * IGN001 - SE HACE LA LECTURA DEL ARCHIVODE HUELLAS*
REMARK* G.JIMENEZ   *          DE CONSULTA CON IGNORE LOCK PARA EVITAR *
REMARK* JUNIO/2011  *          CONFLICTOS DE LECTURAS ENTRE PROGRAMAS  * 
REMARK******************************************************************
REMARK* DLM0010     * CQ3078 - SE HA COLOCADO DE ULTIMO EL CALCULO DE  *
REMARK* DARIO LASSO *   LAS CARACTERISTICAS DE CARTERA POR TENER EN ES-*
REMARK* 22-SEP-2011 *   TAS LAS PERSONALIZADAS. REQ. CQ 3078.          *
REMARK*             * GNT001 - SE CORRIGE INSTRUCCIONES QUE DAN MAL    *
REMARK*             *          RESULTADO POR CAMBIO VERSION COBOL      *
REMARK*             * SUP001 - SE ADICIONA LLAMADO A RUTINA PARA       *
REMARK*             *          CALCULAR CARACTERISTICAS DE END-GLOBAL  *
REMARK*             *          EL PROGRAMA QUE LA NECESITE DEBE        *
REMARK*             *          COLOCAR $SET CONSTANT CARACTSUP"SI"     *
REMARK*             *          Y ENSAMBLAR LA CARACTSUP.WS Y .PROC     *
REMARK******************************************************************
REMARK* GJC0011     * MICR01 - SE INCLUYE EL CODIGO 49 DE MICROCREDITO *
REMARK* G.JIMENEZ   *          EN LA SELECCION DEL PORTAFOLIO          *
REMARK* RMB0011     * VAL001 - SE REALIZA AJUSTE EN LIMITE DE BORRADO  *
REMARK* R.MARTINEZ  *          DEL VECTOR DE VALORES DADO QUE BORRABA  *
REMARK* MAYO/2012   *          SIEMPRE LA ULTIMA POSICION              *
REMARK******************************************************************
REMARK* RMB0012     * ACIEAA - SE IMPLEMENTAN LAS CARACTERISTICAS      *
REMARK* R. MARTINEZ *          PARA ACIERTA A .                        *
REMARK* JUN-01-2012 *          00DEM,01DEM,01END,00INQ,01INQ           *
REMARK******************************************************************
REMARK* RMB0013     * ACIEA1 - SE IMPLEMENTAN LAS CARACTERISTICAS      *
REMARK* R. MARTINEZ *          FALTANTES DE ACIERTAAA                  *
REMARK* AGO-20-2012 * DECI01 - SE HABILTA OPCION PARA DECISOR QUE NO   *
REMARK*             *          SE INCLUYAN LAS CUENTAS FRENADAS        *
REMARK******************************************************************
REMARK* RMB0014     * PORT01 - SE IMPLEMENTAN UN NUEVA CLASIFICACION DE*
REMARK* R. MARTINEZ *          PORTAFOLIO PARA MICROCREDITO            *
REMARK* MAR-20-2013 * FALL01 - PARA LA CARACTERISTICA DEM02 SE CONTROLA*
REMARK*             *          QUE NO APLIQUE SI ES CODEUDOR           *
REMARK******************************************************************
SUP001$SET CONSTANT CARACTSUP"NO"                                       DLM0010
       1000-CALCULAR-CARACTERISTICAS.
REMARK******************************************************************
RUNDAT     IF FUNCTION CURRENT-DATE(1:8) <> CURRENT-DATE-CARACT         RMB0003
RUNDAT        MOVE 0 TO SW-RUN-DATE-CARACT                              RMB0003
RUNDAT     END-IF.                                                      RMB0003
           IF SW-RUN-DATE-CARACT = 0
              PERFORM 1050-CALCULA-RUN-DATE
              PERFORM 1100-CARGA-SAL-MINIMO
RUNDAT        MOVE RUN-DATE-CARACT   TO RUN-DATE-AUX-CARACT             RMB0003
              MOVE 1 TO SW-RUN-DATE-CARACT
           END-IF
           IF GEN-MOR-CARACT = 1
             IF OPEN-ICMCRE-HIST-CARACT = 0
              IF FECHA-RUN-CARACT < 200801
                 IF FECHA-RUN-CARACT > 200112
                    MOVE FECHA-RUN-CARACT TO FECHA-RUN-SANATA-CARACT
                    PERFORM 1150-CARGA-SANATA
                    PERFORM 1160-BUSCA-SANATA
                    IF OPEN-ICMCRE-HIST-CARACT = 0
                       OPEN INPUT MAESTRO-CREDIT-2
                       MOVE 1 TO OPEN-ICMCRE-HIST-CARACT
                    END-IF
                 ELSE
                    MOVE 3 TO OPEN-ICMCRE-HIST-CARACT
                 END-IF
              ELSE
                 MOVE 2 TO OPEN-ICMCRE-HIST-CARACT
              END-IF
             END-IF
           END-IF
INICAR     PERFORM 0000-INICIALIZAR-CARAC-EXTERNAS.
SUP001$    IF CARACTSUP = "SI"                                          DLM0010
SUP001     IF GEN-SUP-CARACT = 1                                        DLM0010
SUP001        PERFORM 1000-RECORRER-MSUP                                DLM0010
SUP001     END-IF                                                       DLM0010
SUP001$    END                                                          DLM0010
ACIEAA     MOVE ZEROS TO FLAG-END090-093-CARACT.                        RMB0012
ACIEAA     INITIALIZE VAR-ENDV090-093-CARACT.                           RMB0012
           INITIALIZE VAR-TMP-CARACT VAR-00NUM VAR-00INQ 
                      VAR-00ACP VAR-00EXP VAR-00DEM
                      VAR-01INQ VAR-01ACP VAR-01EXP VAR-01DEM
           INITIALIZE VAR-02EXP VAR-02INQ
           IF GEN-NUM-CARACT = 1
              INITIALIZE VAR-02MUN
           END-IF
           PERFORM VARYING I-CARACT FROM 1 BY  1 UNTIL I-CARACT > 9
              MOVE ZEROS TO TABLA-PORTAFOLIOS-01NUM(I-CARACT)
              IF GEN-MOR-CARACT = 1
                 MOVE ZEROS TO TABLA-PORTAFOLIOS-01MOR(I-CARACT)
                 MOVE 999   TO 01MOR008(I-CARACT) 01MOR009(I-CARACT)
                               01MOR039(I-CARACT) 01MOR046(I-CARACT)
                               01MOR053(I-CARACT) 01MOR060(I-CARACT)
                               01MOR067(I-CARACT) 01MOR074(I-CARACT)
                               01MOR075(I-CARACT) 01MOR076(I-CARACT)
                               01MOR077(I-CARACT) 01MOR078(I-CARACT)
                               01MOR079(I-CARACT) 
              END-IF
              MOVE ZEROS TO TABLA-PORTAFOLIOS-01ACP(I-CARACT)
              MOVE 999   TO 01ACP017(I-CARACT) 01ACP026(I-CARACT)
              MOVE ZEROS TO TABLA-PORTAFOLIOS-01EXP(I-CARACT)
              MOVE 999   TO 01EXP001(I-CARACT) 01EXP002(I-CARACT)
                            01EXP003(I-CARACT) 01EXP004(I-CARACT)
                            01EXP005(I-CARACT) 01EXP006(I-CARACT)
              MOVE ZEROS TO TABLA-PORTAFOLIOS-02EXP(I-CARACT)
              IF GEN-END-CARACT = 1
                 INITIALIZE VAR-00END
                 MOVE ZEROS TO TABLA-PORTAFOLIOS-01END(I-CARACT)
                 INITIALIZE VAR-02END
              END-IF
           END-PERFORM
           MOVE 999 TO 01INQ005 01INQ010 01INQ015
           MOVE ZEROS TO 02ACPPTF
           MOVE 999 TO 02ACP001 02ACP002
           MOVE 999 TO 02EXP002TO 02EXP003TO 02EXP004TO 02EXP005TO
                       02EXP006TO
           IF GEN-MOR-CARACT = 1
            INITIALIZE VAR-00MOR
            PERFORM VARYING I-CARACT FROM 1 BY  1 UNTIL I-CARACT > 9
             PERFORM VARYING R-CARACT FROM 1 BY  1 UNTIL R-CARACT > 24
              MOVE 0 TO SW-CMP-CARACT(I-CARACT,R-CARACT)
              PERFORM VARYING Z-CARACT FROM 1 BY  1 UNTIL Z-CARACT > 25
                MOVE " " TO 
                     VCT-MMAX-CARACT(I-CARACT,R-CARACT,Z-CARACT)(1:1)
              END-PERFORM
             END-PERFORM
            END-PERFORM
           END-IF
           MOVE 99999999999 TO TAB-00DEM027(1)
           MOVE 1 TO IND-S-CARACT

      *****CONSULTA MAESTRO CARTERA *****
           PERFORM 2000-PROCESA-REG-ICMCRE

           IF GEN-MOR-CARACT = 1
              PERFORM 2350-1-CALCULA-CARACT-01MOR
           END-IF
           IF GEN-END-CARACT = 1
              PERFORM 2750-1-CALCULA-CARACT-01END
           END-IF

      *****CONSULTA MAESTRO CUENTAS CORRIENTES *****
           PERFORM 3000-PROCESA-REG-ICMCHK

      *****CONSULTA CARACTERISTICAS AGRUPADAS POR IDENTIFICACION *****
           IF GEN-EXP-CARACT = 1
              PERFORM 2550-1-CALCULA-CARACT-01EXP
              PERFORM 2580-1-CALCULA-CARACT-02EXP
           END-IF
CQ3078*    IF GEN-DEM-CARACT = 1                                        DLM0010
CQ3078*       PERFORM 2600-1-CALCULA-CARACT-00DEM                       DLM0010
CQ3078*       PERFORM 2649-PROCESE-CARACT-00DEM                         DLM0010
CQ3078*CAV002 PERFORM 2650-CALCULA-CARACT-01DEM                         DLM0010
CQ3078*    END-IF                                                       DLM0010
  
      *****CONSULTA MAESTRO CONSULTAS ******
ACIEA1        MOVE "  -1"         TO 01INQ016(1:4)                      RMB0013
ACIEA1        MOVE "  -1"         TO 01INQ017(1:4)                      RMB0013
ACIEA1        MOVE "  -1"         TO 01INQ018(1:4)                      RMB0013
ACIEA1        MOVE "  -1"         TO 01INQ025(1:4)                      RMB0013
ACIEA1        MOVE "  -1"         TO 01INQ026(1:4)                      RMB0013
ACIEA1        MOVE "  -1"         TO 01INQ027(1:4)                      RMB0013
ACIEA1        MOVE "  -1"         TO 01INQ028(1:4)                      RMB0013
           IF GEN-INQ-CARACT = 1
              PERFORM 4000-PROCESA-REG-CONSULTAS
              PERFORM 4500-CALCULA-CARACT-02INQ
           END-IF

      *****CARACTERITICAS NIVEL 02
           IF GEN-NUM-CARACT = 1
              PERFORM 2280-CALCULA-CARACT-02NUM
           END-IF 
           IF GEN-END-CARACT = 1
              PERFORM 2780-CALCULA-CARACT-02END
           END-IF.
      *****SE INICIALIZAN LAS CARACTRISTICAS NIVEL 01 Y 02 
      *****PARA LOS PORTAFOLIOS QUE NO TIENEN INFORMACION
           PERFORM 1040-INICIALIZA-CARACT-01-02.
CQ3078     IF GEN-DEM-CARACT = 1                                        DLM0010
CQ3078        PERFORM 2600-1-CALCULA-CARACT-00DEM                       DLM0010
CQ3078        PERFORM 2649-PROCESE-CARACT-00DEM                         DLM0010
CQ3078        PERFORM 2650-CALCULA-CARACT-01DEM                         DLM0010
CQ3078     END-IF.                                                      DLM0010
DECI01     MOVE 0 TO SIN-FRENADAS-CARACT .                              RMB0013 


       1030-INICIALIZA-CARACT-00.
REMARK******************************************************************
REMARK*1030-INICIALIZA-CARACT-00.
REMARK******************************************************************
******* INICIALIZA CARACTERISTICAS NIVEL 00
           MOVE INICIAR-3-CARACT TO VAR-00NUMRO
           MOVE INICIAR-3-CARACT TO VAR-00NUMIN
           MOVE INICIAR-3-CARACT TO VAR-00NUMVE
           MOVE INICIAR-3-CARACT TO VAR-00NUMHP
           MOVE INICIAR-3-CARACT TO VAR-00NUMOT
           MOVE INICIAR-3-CARACT TO VAR-00NUMCC
           MOVE INICIAR-3-CARACT TO VAR-00NUMCO
           MOVE INICIAR-3-CARACT TO VAR-00NUMAH
           MOVE INICIAR-3-CARACT TO VAR-00NUMCT

           MOVE INICIAR-3-CARACT TO VAR-00MORRO(1:237)
           MOVE INICIAR-6-CARACT TO VAR-00MORRO(238:382)
           MOVE INICIAR-3-CARACT TO VAR-00MORIN(1:237)
           MOVE INICIAR-6-CARACT TO VAR-00MORIN(238:382)
           MOVE INICIAR-3-CARACT TO VAR-00MORVE(1:237)
           MOVE INICIAR-6-CARACT TO VAR-00MORVE(238:382)
           MOVE INICIAR-3-CARACT TO VAR-00MORHP(1:237)
           MOVE INICIAR-6-CARACT TO VAR-00MORHP(238:382)
           MOVE INICIAR-3-CARACT TO VAR-00MOROT(1:237)
           MOVE INICIAR-6-CARACT TO VAR-00MOROT(238:382)
           MOVE INICIAR-3-CARACT TO VAR-00MORCC(1:237)
           MOVE INICIAR-6-CARACT TO VAR-00MORCC(238:382)
           MOVE INICIAR-3-CARACT TO VAR-00MORCO(1:237)
           MOVE INICIAR-6-CARACT TO VAR-00MORCO(238:382)

           MOVE INICIAR-3-CARACT TO VAR-00ACPRO
           MOVE INICIAR-3-CARACT TO VAR-00ACPIN
           MOVE INICIAR-3-CARACT TO VAR-00ACPVE
           MOVE INICIAR-3-CARACT TO VAR-00ACPHP
           MOVE INICIAR-3-CARACT TO VAR-00ACPOT
           MOVE INICIAR-3-CARACT TO VAR-00ACPCC
           MOVE INICIAR-3-CARACT TO VAR-00ACPCO
           MOVE INICIAR-3-CARACT TO VAR-00ACPAH
           MOVE INICIAR-3-CARACT TO VAR-00ACPCT

           MOVE INICIAR-3-CARACT TO VAR-00EXPRO
           MOVE INICIAR-3-CARACT TO VAR-00EXPIN
           MOVE INICIAR-3-CARACT TO VAR-00EXPVE
           MOVE INICIAR-3-CARACT TO VAR-00EXPHP
           MOVE INICIAR-3-CARACT TO VAR-00EXPOT
           MOVE INICIAR-3-CARACT TO VAR-00EXPCC
           MOVE INICIAR-3-CARACT TO VAR-00EXPCO
           MOVE INICIAR-3-CARACT TO VAR-00EXPAH
           MOVE INICIAR-3-CARACT TO VAR-00EXPCT

           MOVE INICIAR-11-CARACT TO VAR-00ENDRO(573:)
           MOVE INICIAR-11-CARACT TO VAR-00ENDIN(573:)
           MOVE INICIAR-11-CARACT TO VAR-00ENDVE(573:)
           MOVE INICIAR-11-CARACT TO VAR-00ENDHP(573:)
           MOVE INICIAR-11-CARACT TO VAR-00ENDOT(573:)
           MOVE INICIAR-11-CARACT TO VAR-00ENDCC(573:)
           MOVE INICIAR-11-CARACT TO VAR-00ENDCO(573:).

       1040-INICIALIZA-CARACT-01-02.
REMARK******************************************************************
REMARK*1040-INICIALIZA-CARACT-01-02.
REMARK******************************************************************
******* INICIALIZA CARACTERISTICAS NIVEL 01 Y 02
           MOVE 1 TO I-CARACT
           PERFORM UNTIL I-CARACT > 9
            IF 01NUMPTF(I-CARACT) = ZEROS
             MOVE INICIAR-4-CARACT TO 
                                 TABLA-PORTAFOLIOS-01NUM(I-CARACT)(3:)
            END-IF
            IF 01MORPTF(I-CARACT) = ZEROS
             MOVE INICIAR-4-CARACT TO 01MOR-EDITADOS(I-CARACT)(3:316)
             MOVE INICIAR-6-CARACT TO 01MOR-EDITADOS(I-CARACT)(319:144)
            END-IF
            IF 01ACPPTF(I-CARACT) = ZEROS
             MOVE INICIAR-4-CARACT TO 
                                TABLA-PORTAFOLIOS-01ACP(I-CARACT)(3:)
            END-IF
            IF 01EXPPTF(I-CARACT) = ZEROS
             MOVE INICIAR-3-CARACT TO 
                                TABLA-PORTAFOLIOS-01EXP(I-CARACT)(3:18)
             MOVE INICIAR-4-CARACT TO 
                               TABLA-PORTAFOLIOS-01EXP(I-CARACT)(21:28)
            END-IF
            IF 01ENDPTF(I-CARACT) = ZEROS
             MOVE INICIAR-11-CARACT TO 01END-EDITADOS(I-CARACT)(3:)
            END-IF
            IF 01NUMPTF(I-CARACT) = ZEROS
             MOVE INICIAR-6-CARACT TO TABLA-02NUM(I-CARACT)(1:)
            END-IF
            IF 02EXPPTF(I-CARACT) = ZEROS OR I-CARACT = 7
             MOVE INICIAR-3-CARACT TO 
                               TABLA-PORTAFOLIOS-02EXP(I-CARACT)(3:18)
             MOVE INICIAR-8-CARACT TO 
                               TABLA-PORTAFOLIOS-02EXP(I-CARACT)(21:)
            END-IF
            IF 02ENDPTF(I-CARACT) = ZEROS
             MOVE INICIAR-11-CARACT TO TABLA-02END(I-CARACT)(3:)
            END-IF
             ADD 1 TO I-CARACT
           END-PERFORM 
           IF 01INQNRO = ZEROS
              MOVE INICIAR-4-CARACT  TO VAR-01INQ(13:)
           END-IF
     ***   MOVE "-1"              TO VAR-01DEM(13:2)
     ***   MOVE INICIAR-4-CARACT  TO VAR-02NUM-TO
     ***   MOVE INICIAR-6-CARACT  TO VAR-02NUM-CB
     ***   MOVE INICIAR-6-CARACT  TO VAR-02NUM-MX
           IF 02ACPPTF  = ZEROS
              MOVE INICIAR-4-CARACT  TO VAR-02ACP(3:)
           END-IF.
     ***   MOVE "    -1"          TO VAR-02INQ(3:)
     ***   MOVE INICIAR-3-CARACT  TO VAR-02EXP-TOTAL(3:18)
     ***   MOVE INICIAR-8-CARACT  TO VAR-02EXP-TOTAL(21:)
     ***   MOVE INICIAR-11-CARACT TO VAR-02END-CB(3:).

       1050-CALCULA-RUN-DATE.
REMARK******************************************************************
REMARK*1050-CALCULA-RUN-DATE.
REMARK******************************************************************
           ACCEPT CURRENT-DATE-CARACT FROM DATE YYYYMMDD
           IF ANO-CURRENT-DATE-CARACT = ANO-RUN-CARACT AND
              MES-CURRENT-DATE-CARACT = MES-RUN-CARACT AND
              DIA-CURRENT-DATE-CARACT > 0 AND < 11
FEBR02        IF MES-RUN-CARACT = 02 OR 01                              RMB0008
FEBR02           IF MES-RUN-CARACT = 02                                 RMB0008
FEBR02              MOVE 12 TO MES-RUN-DATE-CARACT                      RMB0008
FEBR02           ELSE                                                   RMB0008
FEBR02              MOVE 11 TO MES-RUN-DATE-CARACT                      RMB0008
FEBR02           END-IF                                                 RMB0008
FEBR01           COMPUTE ANO-RUN-DATE-CARACT = ANO-RUN-CARACT - 1       GJC0007
              ELSE
                 COMPUTE MES-RUN-DATE-CARACT = MES-RUN-CARACT - 2
                 MOVE ANO-RUN-CARACT TO ANO-RUN-DATE-CARACT
              END-IF
           ELSE
              IF MES-RUN-CARACT = 01
                 MOVE 12 TO MES-RUN-DATE-CARACT
                 COMPUTE ANO-RUN-DATE-CARACT = ANO-RUN-CARACT - 1
              ELSE
                 COMPUTE MES-RUN-DATE-CARACT = MES-RUN-CARACT - 1
                 MOVE ANO-RUN-CARACT TO ANO-RUN-DATE-CARACT
              END-IF
           END-IF.

       1100-CARGA-SAL-MINIMO.
REMARK******************************************************************
REMARK*1100-CARGA-SAL-MINIMO.
REMARK******************************************************************
           OPEN INPUT ICSALMIN
           MOVE 1 TO J-C-CARACT
ICMVLR     MOVE 0 TO FIN-ICSALMIN-CARACT                                HGO0002
ICMVLR     PERFORM 1101-LEER-ICSALMIN VARYING J-C-CARACT FROM 1 BY 1    HGO0002
ICMVLR      UNTIL J-C-CARACT > 99                                       HGO0002

ICMVLR*           READ ICSALMIN AT END MOVE 1 TO FIN-ICSALMIN-CARACT    HGO0002
ICMVLR*           END-READ                                              HGO0002
ICMVLR*           PERFORM UNTIL FIN-ICSALMIN-CARACT = 1                 HGO0002
ICMVLR*              MOVE FECHA-ICSALMIN TO ANO-SMLMV-CARACT(J-C-CARACT)HGO0002
ICMVLR*              MOVE VALOR-ICSALMIN TO VLR-SMLMV-CARACT(J-C-CARACT)HGO0002
ICMVLR*              ADD 1 TO J-C-CARACT                                HGO0002
ICMVLR*              READ ICSALMIN AT END MOVE 1 TO FIN-ICSALMIN-CARACT HGO0002
ICMVLR*              END-READ                                           HGO0002
ICMVLR*           END-PERFORM                                           HGO0002
           IF J-C-CARACT < 100
              PERFORM VARYING X-C-CARACT FROM J-C-CARACT BY 1 UNTIL
                                              X-C-CARACT >= 100
                 MOVE 9999     TO ANO-SMLMV-CARACT(X-C-CARACT)
                 MOVE 99999999 TO VLR-SMLMV-CARACT(X-C-CARACT)
              END-PERFORM
           END-IF
           CLOSE ICSALMIN.

ICMVLR 1101-LEER-ICSALMIN.                                              HGO0002
REMARK*========================================================*
REMARK*1101-LEER-ICSALMIN.
REMARK*Lectura de archivo salario minimo
REMARK*========================================================*
ICMVLR    IF FIN-ICSALMIN-CARACT = 0                                    HGO0002
ICMVLR       READ ICSALMIN AT END MOVE 1 TO FIN-ICSALMIN-CARACT         HGO0002
ICMVLR       NOT AT END                                                 HGO0002
ICMVLR        MOVE FECHA-ICSALMIN TO ANO-SMLMV-CARACT(J-C-CARACT)       HGO0002
ICMVLR        MOVE VALOR-ICSALMIN TO VLR-SMLMV-CARACT(J-C-CARACT)       HGO0002
ICMVLR       END-READ                                                   HGO0002
ICMVLR    END-IF                                                        HGO0002
ICMVLR    IF FIN-ICSALMIN-CARACT = 1 AND J-C-CARACT <= 999              HGO0002
ICMVLR       MOVE 9999 TO ANO-SMLMV-CARACT(J-C-CARACT)                  HGO0002
ICMVLR    END-IF.                                                       HGO0002

       1150-CARGA-SANATA.
REMARK******************************************************************
REMARK*1150-CARGA-SANATA.
REMARK******************************************************************
           OPEN INPUT ICSANATA
           MOVE 1 TO J-C-CARACT
           READ ICSANATA AT END MOVE 1 TO FIN-ICSANATA-CARACT
           END-READ
           PERFORM UNTIL FIN-ICSANATA-CARACT = 1
              MOVE FECHA-ICSANATA TO FCH-SANATA-CARACT(J-C-CARACT)
              MOVE DIREC-ICSANATA TO NOM-SANATA-CARACT(J-C-CARACT)
              ADD 1 TO J-C-CARACT
              READ ICSANATA AT END MOVE 1 TO FIN-ICSANATA-CARACT
              END-READ
           END-PERFORM
           IF J-C-CARACT < 500
              PERFORM VARYING X-C-CARACT FROM J-C-CARACT BY 1 UNTIL
                                              X-C-CARACT >= 500
                 MOVE 999999   TO FCH-SANATA-CARACT(X-C-CARACT)
                 MOVE SPACES   TO NOM-SANATA-CARACT(X-C-CARACT)
              END-PERFORM
           END-IF
           CLOSE ICSANATA.

       1160-BUSCA-SANATA.
REMARK******************************************************************
REMARK*1160-BUSCA-SANATA.
REMARK* TOMA LA FECHA DE LA RECOGIDA DE LA BASE DE DATOS Y LE RESTA
REMARK* 22 MESES PARA TOMAR LA INFORMACION DE LOS VECTORES 3 Y 4
REMARK******************************************************************
           PERFORM VARYING J-C-CARACT FROM 1 BY 1 UNTIL J-C-CARACT > 22
              IF MES-RUN-SANATA-CARACT = 01
                 MOVE 12 TO MES-RUN-SANATA-CARACT
                 COMPUTE ANO-RUN-SANATA-CARACT = 
                         ANO-RUN-SANATA-CARACT - 1
              ELSE
                 COMPUTE MES-RUN-SANATA-CARACT = 
                         MES-RUN-SANATA-CARACT - 1
              END-IF
           END-PERFORM
           MOVE 1 TO J-C-CARACT
           PERFORM UNTIL FCH-SANATA-CARACT(J-C-CARACT) = 999999 OR
              FCH-SANATA-CARACT(J-C-CARACT) = FECHA-RUN-SANATA-CARACT
              ADD 1 TO J-C-CARACT
           END-PERFORM
           IF FCH-SANATA-CARACT(J-C-CARACT) <> 999999
              STRING NOM-SANATA-CARACT(J-C-CARACT) DELIMITED BY SPACES
                     "ICMCRE"  DELIMITED BY SIZE
                     INTO W-NOM-ICMCRE2
              END-STRING
              DISPLAY "SAN_ATA : " W-NOM-ICMCRE2
           ELSE
              DISPLAY "ERROR BUSCANDO SAN_ATA HISTORICO "
                      FECHA-RUN-SANATA-CARACT
              MOVE 4 TO OPEN-ICMCRE-HIST-CARACT
           END-IF.

       2000-PROCESA-REG-ICMCRE.
REMARK******************************************************************
REMARK*2000-PROCESA-REG-ICMCRE.
REMARK******************************************************************
           MOVE 0 TO SW-LECTURA-CARACT SW-LEESUSC-CARACT
           INITIALIZE LLAVE-MAES-CREDIT
           MOVE TIPO-ID-CARACT TO TIPO-ID-ABD07
           MOVE NRO-ID-CARACT  TO NUM-ID-ABD07
           PERFORM 0500-ASIGNA-ID-ICMCRE-START *> ojo ESTA FALTABA
           START MAESTRO-CREDIT KEY NOT < LLAVE-MAES-CREDIT
                 INVALID KEY
                         MOVE 1 TO SW-LECTURA-CARACT
                 NOT INVALID KEY
LEY001               PERFORM  1000-LEE-ICMCRE-SECUENCIAL
LEY001               IF SW-LECTURA-MAESTROS  =  1
LEY001                  MOVE 1 TO SW-LECTURA-CARACT
LEY001               END-IF
           END-START
           PERFORM UNTIL TIPO-ID-ABD07 <> TIPO-ID-CARACT OR
                         NUM-ID-ABD07  <> NRO-ID-CARACT  OR
                         SW-LECTURA-CARACT = 1
RUNDAT      MOVE RUN-DATE-AUX-CARACT   TO RUN-DATE-CARACT               RMB0003
            INITIALIZE VAR-00NUM VAR-00MOR VAR-00ACP VAR-00EXP
                       VAR-00END
            MOVE COD-SUS-ABD07 TO COD-SUSCRIP-ABD02
            READ SUSCRIPTOR WITH IGNORE LOCK
                 INVALID KEY MOVE 1 TO SW-LEESUSC-CARACT
                 NOT INVALID KEY MOVE 0 TO SW-LEESUSC-CARACT
            END-READ
DECI01      IF  IND-BLOQUEO-ABD07 = 7 AND SIN-FRENADAS-CARACT = 1       RMB0013 
DECI01          MOVE 1 TO IND-BLOQUEO-ABD07                             RMB0013 
DECI01      END-IF                                                      RMB0013 
            IF SW-LEESUSC-CARACT = 0 AND ESTADO-ABD02 = 1 AND
               (IND-BLOQUEO-ABD07 = 0 OR 7)
               IF (ART15-ABD07 <> 5 AND <> 6) AND
                  (IND-RECLAMO-ABD07 <> 1 AND <> 2 AND <> 3)
                  PERFORM 2050-INICIALIZA-VEC-00END
PORT01            EVALUATE RUTINA-PORTAFOLIO-CARACT                     RMB0014
PORT01              WHEN "MIC"                                          RMB0014
PORT01                PERFORM 2100-CALCULA-PORTAFOLIO-MIC               RMB0014
PORT01              WHEN ANY                                            RMB0014
PORT01                PERFORM 2100-CALCULA-PORTAFOLIO                   RMB0014
PORT01            END-EVALUATE                                          RMB0014
                  PERFORM 2110-CAL-ABIERTO-CERRADO
                  PERFORM 2111-CAL-FECHA-ESTADO
                  PERFORM 2112-CAL-VALORES-COMUNES
                  IF GEN-NUM-CARACT = 1 OR GEN-END-CARACT = 1
                     PERFORM 2205-NORMALIZAR-VECTOR-VALORES
                  END-IF
                  IF GEN-NUM-CARACT = 1
                     PERFORM 2200-CALCULA-CARACT-00NUM
                     PERFORM 2250-CALCULA-CARACT-01NUM
                     PERFORM 2249-PROCESE-CARCT-00NUM
                  END-IF
                  IF GEN-MOR-CARACT = 1
                     PERFORM 2300-CALCULA-CARACT-00MOR
                     PERFORM 2350-CALCULA-CARACT-01MOR
                     PERFORM 2349-PROCESE-CARCT-00MOR
                  END-IF
                  IF GEN-ACP-CARACT = 1
                     MOVE LLAVE-MAES-CREDIT TO 00ACPLLV
                     PERFORM 2400-CALCULA-CARACT-00ACP
                     PERFORM 2450-CALCULA-CARACT-01ACP
                     PERFORM 2480-CALCULA-CARACT-02ACP
                     PERFORM 2449-PROCESE-CARCT-00ACP
                  END-IF
                  IF GEN-EXP-CARACT = 1
                     MOVE LLAVE-MAES-CREDIT TO 00EXPLLV
                     PERFORM 2500-CALCULA-CARACT-00EXP
                     PERFORM 2550-CALCULA-CARACT-01EXP
                     PERFORM 2549-PROCESE-CARCT-00EXP
                  END-IF
                  IF GEN-DEM-CARACT = 1
FALL01               MOVE GARANTE-ABD07 TO GARANTE-CARACT               RMB0014
                     IF ADJETIVO1-ABD07 = 1 OR ADJETIVO2-ABD07 = 1 OR
                        ADJETIVO3-ABD07 = 1
                        MOVE 1 TO ADJETIVO-CARACT
                     ELSE
                        MOVE ZEROS TO ADJETIVO-CARACT
                     END-IF
                     PERFORM 2600-CALCULA-CARACT-00DEM
                  END-IF
                  IF GEN-END-CARACT = 1
                     PERFORM 2700-CALCULA-CARACT-00END
                     PERFORM 2750-CALCULA-CARACT-01END
                     PERFORM 2749-PROCESE-CARCT-00END
                  END-IF
                  PERFORM 1030-INICIALIZA-CARACT-00
                  PERFORM 5000-MOVER-CARACT-NIVEL00
      *           DISPLAY VAR-00NUM
               END-IF
            END-IF
LEY001      PERFORM  1000-LEE-ICMCRE-SECUENCIAL
LEY001        IF SW-LECTURA-MAESTROS  =  1
LEY001           MOVE 1 TO SW-LECTURA-CARACT
LEY001        END-IF
           END-PERFORM.
RUNDAT     MOVE RUN-DATE-AUX-CARACT   TO RUN-DATE-CARACT.               RMB0003

       2050-INICIALIZA-VEC-00END.
REMARK******************************************************************
REMARK*2050-INICIALIZA-VEC-00END.
REMARK******************************************************************
           PERFORM VARYING J-C-CARACT FROM 1 BY  1 UNTIL J-C-CARACT > 13
              MOVE ZEROS TO VEC-CUOTA-CARACT(J-C-CARACT)
                            VEC-SALDO-CARACT(J-C-CARACT)
                            VEC-SALDOMOR-CARACT(J-C-CARACT)
                            VEC-INICIAL-CARACT(J-C-CARACT)
                            VEC-DISPON-CARACT(J-C-CARACT)
                            VEC-SMLMV-CARACT(J-C-CARACT)
                 MOVE 1 TO VEC-IND-CUO-CARACT(J-C-CARACT)
                           VEC-IND-SLD-CARACT(J-C-CARACT)
                           VEC-IND-SLDM-CARACT(J-C-CARACT)
                           VEC-IND-INI-CARACT(J-C-CARACT)
                           VEC-IND-DSP-CARACT(J-C-CARACT)
           END-PERFORM.

       2100-CALCULA-PORTAFOLIO.
REMARK******************************************************************
REMARK*2100-CALCULA-PORTAFOLIO.
REMARK******************************************************************
           IF GARANTE-ABD07 > 0 AND COD-CTA-ABD07 <> 02
              MOVE "CO" TO COD-PORTAF-CARACT
              MOVE  7   TO IND-PORTAF-CARACT
           ELSE
            IF (COD-CTA-ABD07 = 02 OR 03) OR
MICR01*        ((COD-CTA-ABD07 = 05 OR 06 OR 27 ) AND                   GJC0011
MICR01         ((COD-CTA-ABD07 = 05 OR 06 OR 27 OR 49) AND              GJC0011
                (TIPO-OBLIGACION-ABD07 = 2 AND 
                 TOTAL-CUOTAS-ABD07 = 0 AND
                 TIPO-GARANTIA-ABD07 <> 1)) OR
               (COD-CTA-ABD07 = 18 AND (TIPO-OBLIGACION-ABD07 = 2 AND
                (TOTAL-CUOTAS-ABD07 = 0 OR TIPO-GARANTIA-ABD07 <> 1)))
               MOVE "RO" TO COD-PORTAF-CARACT
               MOVE  1   TO IND-PORTAF-CARACT
            ELSE
MICR01*      IF (((COD-CTA-ABD07 = 05 OR 06 OR 07 OR 08 OR 18 OR 27) ANDGJC0011
MICR01       IF (((COD-CTA-ABD07 = 05 OR 06 OR 07 OR 08 OR 18 OR 27     GJC0011
MICR01             OR 49) AND TIPO-OBLIGACION-ABD07 = 2) OR             GJC0011
                 (COD-CTA-ABD07 = 18 AND TIPO-OBLIGACION-ABD07 = 1)) AND
                  TOTAL-CUOTAS-ABD07 > 0  AND 
                  TOTAL-CUOTAS-ABD07 <= 60 AND
                  TIPO-GARANTIA-ABD07 = 1
                MOVE "VE" TO COD-PORTAF-CARACT
                MOVE  3   TO IND-PORTAF-CARACT
             ELSE
              IF COD-CTA-ABD07 = 13 OR
MICR01*          ((COD-CTA-ABD07 = 05 OR 06 OR 07 OR 08 OR 27) AND      GJC0011
MICR01          ((COD-CTA-ABD07 = 05 OR 06 OR 07 OR 08 OR 27 OR 49) AND GJC0011
                  (TIPO-OBLIGACION-ABD07 = 3 OR 
                   (TOTAL-CUOTAS-ABD07 > 60 AND 
                    TIPO-GARANTIA-ABD07 = 1)))
                 MOVE "HP" TO COD-PORTAF-CARACT
                 MOVE  4   TO IND-PORTAF-CARACT
              ELSE
               IF COD-CTA-ABD07 = 05 OR 06 OR 07 OR 08 OR 14 OR 18 OR
MICR01*                           27 OR 33 OR 46                        GJC0011
MICR01                            27 OR 33 OR 46 OR 49                  GJC0011
                  MOVE "IN" TO COD-PORTAF-CARACT
                  MOVE  2   TO IND-PORTAF-CARACT
               ELSE
                IF ((COD-CTA-ABD07 = 04 OR 09 OR 10 OR 11 OR 15 OR 16 OR
                       19 OR 20 OR 21 OR 22 OR 26 OR 28 OR 29 OR 34 OR
                       35 OR 36 OR 43 OR 44 OR 45 AND
                    (TIPO-OBLIGACION-ABD07 = 2)) OR
                    (COD-CTA-ABD07 = 15 OR 16 AND 
                     TIPO-OBLIGACION-ABD07 = 3)) OR
                   (((COD-CTA-ABD07 = 04 OR 09 OR 10 OR 11 OR 
                         19 OR 20 OR 21 OR 22 OR 26 OR 28 OR 29 OR
                         34 OR 35 OR 36 OR 43 OR 44 OR 45) AND 
                     TIPO-OBLIGACION-ABD07 <> 2) OR
                     ((COD-CTA-ABD07 = 15 OR 16 AND 
                      TIPO-OBLIGACION-ABD07 <> 3 AND <> 2) OR
                      COD-CTA-ABD07 = 30 OR 31 OR 32 OR 37 OR 38 OR
                                      39 OR 41 OR 42))
                   MOVE "OT" TO COD-PORTAF-CARACT
                   MOVE  5   TO IND-PORTAF-CARACT
                ELSE
                 IF COD-CTA-ABD07 = 23 OR 24
                    MOVE "CC" TO COD-PORTAF-CARACT
                    MOVE  6   TO IND-PORTAF-CARACT
                 ELSE
                    MOVE "OT" TO COD-PORTAF-CARACT
                    MOVE  5   TO IND-PORTAF-CARACT
                 END-IF
                END-IF
               END-IF
              END-IF
             END-IF
            END-IF
           END-IF.
           IF IND-PORTAF-CARACT > 0 AND < 10
              MOVE 1 TO 00NUM001
              MOVE COD-PORTAF-CARACT TO 00NUMPTF
           END-IF.
PORT01 2100-CALCULA-PORTAFOLIO-MIC.                                     RMB0014
REMARK******************************************************************
REMARK*2100-CALCULA-PORTAFOLIO-MIC.
REMARK*    SE UTILIZA PARA LOS SCORES DE MICROCREDITO DONDE SE UTILIZA
REMARK*    EL PORTAFOLIO "VE" PAR CONTAR LO DE MOCROCREDITO
REMARK******************************************************************
PORT01     IF GARANTE-ABD07 > 0 AND COD-CTA-ABD07 <> 02                 RMB0014
PORT01        MOVE "CO" TO COD-PORTAF-CARACT                            RMB0014
PORT01        MOVE  7   TO IND-PORTAF-CARACT                            RMB0014
PORT01     ELSE                                                         RMB0014
PORT01      IF (TIPO-OBLIGACION-ABD07 = 5)  AND                         RMB0014
PORT01         ((COD-CTA-ABD07 = 49 ) OR                                RMB0014
PORT01          ((COD-CTA-ABD07 =  05 OR 11 OR 06 OR 27) AND            RMB0014
PORT01           TOTAL-CUOTAS-ABD07 > 0  AND                            RMB0014
PORT01           TOTAL-CUOTAS-ABD07 <= 60 ))                            RMB0014
PORT01         MOVE "VE" TO COD-PORTAF-CARACT                           RMB0014
PORT01         MOVE  3   TO IND-PORTAF-CARACT                           RMB0014
PORT01      ELSE                                                        RMB0014
PORT01       IF (COD-CTA-ABD07 = 02 OR 03) OR                           RMB0014
PORT01           ((COD-CTA-ABD07 = 05 OR 06 OR 27 ) AND                 RMB0014
PORT01            (TIPO-OBLIGACION-ABD07 = 2 AND                        RMB0014
PORT01             TOTAL-CUOTAS-ABD07 = 0 AND                           RMB0014
PORT01             TIPO-GARANTIA-ABD07 <> 1)) OR                        RMB0014
PORT01           (COD-CTA-ABD07 = 18 AND (TIPO-OBLIGACION-ABD07 = 2 AND RMB0014
PORT01            (TOTAL-CUOTAS-ABD07 = 0 OR TIPO-GARANTIA-ABD07 <> 1)))RMB0014
PORT01           MOVE "RO" TO COD-PORTAF-CARACT                         RMB0014
PORT01           MOVE  1   TO IND-PORTAF-CARACT                         RMB0014
PORT01       ELSE                                                       RMB0014
PORT01        IF COD-CTA-ABD07 = 13 OR                                  RMB0014
PORT01          ((COD-CTA-ABD07 = 05 OR 06 OR 07 OR 08 OR 27 ) AND      RMB0014
PORT01            (TIPO-OBLIGACION-ABD07 = 3 OR                         RMB0014
PORT01             (TOTAL-CUOTAS-ABD07 > 60 AND                         RMB0014
PORT01              TIPO-GARANTIA-ABD07 = 1)))                          RMB0014
PORT01           MOVE "HP" TO COD-PORTAF-CARACT                         RMB0014
PORT01           MOVE  4   TO IND-PORTAF-CARACT                         RMB0014
PORT01        ELSE                                                      RMB0014
PORT01         IF COD-CTA-ABD07 = 05 OR 06 OR 07 OR 08 OR 14 OR 18 OR   RMB0014
PORT01                            27 OR 33 OR 46                        RMB0014
PORT01            MOVE "IN" TO COD-PORTAF-CARACT                        RMB0014
PORT01            MOVE  2   TO IND-PORTAF-CARACT                        RMB0014
PORT01         ELSE                                                     RMB0014
PORT01          IF COD-CTA-ABD07 = 23 OR 24                             RMB0014
PORT01             MOVE "CC" TO COD-PORTAF-CARACT                       RMB0014
PORT01             MOVE  6   TO IND-PORTAF-CARACT                       RMB0014
PORT01          ELSE                                                    RMB0014
PORT01             MOVE "OT" TO COD-PORTAF-CARACT                       RMB0014
PORT01             MOVE  5   TO IND-PORTAF-CARACT                       RMB0014
PORT01          END-IF                                                  RMB0014
PORT01         END-IF                                                   RMB0014
PORT01        END-IF                                                    RMB0014
PORT01       END-IF                                                     RMB0014
PORT01      END-IF                                                      RMB0014
PORT01     END-IF.                                                      RMB0014
PORT01     IF IND-PORTAF-CARACT > 0 AND < 10                            RMB0014
PORT01        MOVE 1 TO 00NUM001                                        RMB0014
PORT01        MOVE COD-PORTAF-CARACT TO 00NUMPTF                        RMB0014
PORT01     END-IF.                                                      RMB0014
       2110-CAL-ABIERTO-CERRADO.
REMARK******************************************************************
REMARK*2110-CAL-ABIERTO-CERRADO.
REMARK******************************************************************
           MOVE 0 TO REG-ABIERTO-CARACT REG-CERRADO-CARACT
                     REG-POSITIVO-CARACT REG-NEGATIVO-CARACT
           IF NOV-REPORT-ABD07 = 01 OR 45 OR 47 OR
               (NOV-REPORT-ABD07 > 12 AND < 42)
              MOVE 1 TO REG-ABIERTO-CARACT
           ELSE
              IF (NOV-REPORT-ABD07 > 01 AND < 13) OR
                 NOV-REPORT-ABD07 = 46 OR 49
                 MOVE 1 TO REG-CERRADO-CARACT
           END-IF
           IF NOV-REPORT-ABD07 = 05 OR 06 OR 08 OR 09 OR 10 OR 11 OR 12
              MOVE 1 TO REG-POSITIVO-CARACT
           END-IF
           IF NOV-REPORT-ABD07 = 03 OR 04 OR 07 OR 49 OR 
              ADJETIVO1-ABD07 = 2 OR 3 OR 
              ADJETIVO2-ABD07 = 2 OR 3 OR 
              ADJETIVO3-ABD07 = 2 OR 3 
              MOVE 1 TO REG-NEGATIVO-CARACT
           END-IF.

       2111-CAL-FECHA-ESTADO.
REMARK******************************************************************
REMARK*2111-CAL-FECHA-ESTADO.
REMARK******************************************************************
           MOVE FEC-NOVEDAD-ABD07  TO FECHA-NOV-CARACT
           MOVE FECHA-NOV-CARACT(1:2) TO MES-NOV-CARACT
           MOVE FECHA-NOV-CARACT(3:2) TO ANO-NOV-CARACT
           IF ANO-NOV-CARACT < 60
              MOVE 20          TO SIG-NOV-CARACT
           ELSE
              MOVE 19          TO SIG-NOV-CARACT
           END-IF
           IF NOV-REPORT-ABD07 = 45 OR 47
              MOVE FECHA-SITUACION-ABD07 TO FECHA-AUX-CARACT
              MOVE MES-AUX-CARACT TO MES-SIT-CARACT
              MOVE ANO-AUX-CARACT TO ANO-SIT-CARACT
              MOVE FECHA-ACTUALIZ-VALOR-ABD07 TO FECHA-AUX-CARACT
              MOVE MES-AUX-CARACT TO MES-VAL-CARACT
              MOVE ANO-AUX-CARACT TO ANO-VAL-CARACT
              IF FECHA-VAL-CARACT > FECHA-ESTADO-CARACT
                 MOVE FECHA-VAL-CARACT TO FECHA-ESTADO-CARACT
              END-IF
              IF FECHA-SIT-CARACT > FECHA-ESTADO-CARACT
                 MOVE FECHA-SIT-CARACT TO FECHA-ESTADO-CARACT
              END-IF
           END-IF.
RUNDAT     MOVE 49 TO I49                                               RMB0003
RUNDAT     MOVE 13 TO I13                                               RMB0003
RUNDAT     MOVE 12 TO I12                                               RMB0003
RUNDAT     MOVE 10 TO I10                                               RMB0003
RUNDAT     MOVE RUN-DATE-CARACT     TO ACT-DATE-CARACT                  RMB0003
RUNDAT     IF REG-ABIERTO-CARACT = 1                                    RMB0003
RUNDAT        MOVE ZEROS TO MESES-DESAC-CARACT                          RMB0003
RUNDAT        IF RUN-DATE-CARACT > ZEROS AND FECHA-ESTADO-CARACT > ZEROSRMB0003
RUNDAT           COMPUTE MESES-DESAC-CARACT =                           RMB0003
RUNDAT             ((ANO-RUN-DATE-CARACT * 12)+ MES-RUN-DATE-CARACT) -  RMB0003
RUNDAT             ((SIG-ANO-NOV-CARACT * 12) + MES-NOV-CARACT)         RMB0003
RUNDAT           IF MESES-DESAC-CARACT <= 3                             RMB0003
RUNDAT              MOVE FECHA-ESTADO-CARACT TO ACT-DATE-CARACT         RMB0003
RUNDAT              IF MESES-DESAC-CARACT >= 0                          RMB0003
RUNDAT                 COMPUTE I49 = 49 - MESES-DESAC-CARACT            RMB0003
RUNDAT                 COMPUTE I13 = 13 - MESES-DESAC-CARACT            RMB0003
RUNDAT                 COMPUTE I12 = 12 - MESES-DESAC-CARACT            RMB0003
RUNDAT                 COMPUTE I10 = 10 - MESES-DESAC-CARACT            RMB0003
RUNDAT              ELSE                                                RMB0003
RUNDAT                 MOVE FECHA-ESTADO-CARACT TO RUN-DATE-CARACT      RMB0003
RUNDAT              END-IF                                              RMB0003
RUNDAT           ELSE                                                   RMB0003
RUNDAT              MOVE RUN-DATE-CARACT     TO ACT-DATE-CARACT         RMB0003
RUNDAT           END-IF                                                 RMB0003
RUNDAT        END-IF                                                    RMB0003
RUNDAT     ELSE                                                         RMB0003 
RUNDAT        IF RUN-DATE-CARACT > ZEROS AND FECHA-ESTADO-CARACT > ZEROSRMB0003
RUNDAT           COMPUTE MESES-DESAC-CARACT =                           RMB0003
RUNDAT             ((ANO-RUN-DATE-CARACT * 12)+ MES-RUN-DATE-CARACT) -  RMB0003
RUNDAT             ((SIG-ANO-NOV-CARACT * 12) + MES-NOV-CARACT)         RMB0003
RUNDAT           IF MESES-DESAC-CARACT <  0  *> SOBREACTUALIZADO        RMB0003
RUNDAT              MOVE FECHA-ESTADO-CARACT TO ACT-DATE-CARACT         RMB0003
RUNDAT              MOVE FECHA-ESTADO-CARACT TO RUN-DATE-CARACT         RMB0003
RUNDAT           ELSE                                                   RMB0003
RUNDAT              MOVE RUN-DATE-CARACT     TO ACT-DATE-CARACT         RMB0003
RUNDAT           END-IF                                                 RMB0003
RUNDAT        END-IF                                                    RMB0003
RUNDAT     END-IF.                                                      RMB0003
       2112-CAL-VALORES-COMUNES.
REMARK******************************************************************
REMARK*2112-CAL-VALORES-COMUNES.
REMARK******************************************************************
          MOVE ZEROS TO MESES-DESAC-CARACT MESES-VENCE-CARACT
                        MESES-VENAP-CARACT VAL-MADUR-CARACT
          IF RUN-DATE-CARACT > ZEROS AND FECHA-ESTADO-CARACT > ZEROS
             COMPUTE MESES-DESAC-CARACT =
                  ((ANO-RUN-DATE-CARACT * 12)+ MES-RUN-DATE-CARACT) -
                  ((SIG-ANO-NOV-CARACT * 12) + MES-NOV-CARACT)
RUNDAT       COMPUTE ACT-MESES-DESAC-CARACT =                           RMB0003
RUNDAT            ((ANO-ACT-DATE-CARACT * 12)+ MES-ACT-DATE-CARACT) -   RMB0003
RUNDAT            ((SIG-ANO-NOV-CARACT * 12) + MES-NOV-CARACT)          RMB0003
          END-IF
          MOVE ZEROS TO MESES-MADUR-CARACT MESES-NOVAP-CARACT
          MOVE FECHA-APERT-ABD07 TO FECHA-APE-CARACT
          MOVE FECHA-APE-CARACT(1:2) TO MES-APE-CARACT
          MOVE FECHA-APE-CARACT(3:2) TO ANO-APE-CARACT
          IF ANO-APE-CARACT < 60
             MOVE 20          TO SIG-APE-CARACT
          ELSE
             MOVE 19          TO SIG-APE-CARACT
          END-IF
          IF SIG-ANO-APE-CARACT = ZEROS OR 
             MES-APE-CARACT < 1 OR MES-APE-CARACT > 12
             MOVE ZEROS TO FECHA-APERT-CARACT
          END-IF
          IF RUN-DATE-CARACT > ZEROS AND FECHA-APERT-CARACT > ZEROS
             COMPUTE MESES-MADUR-CARACT =
                  ((ANO-RUN-DATE-CARACT * 12)+ MES-RUN-DATE-CARACT) -
                  ((SIG-ANO-APE-CARACT * 12) + MES-APE-CARACT)
          END-IF
          IF FECHA-ESTADO-CARACT > FECHA-APERT-CARACT
             COMPUTE MESES-NOVAP-CARACT =
                 ((SIG-ANO-NOV-CARACT * 12) + MES-NOV-CARACT) -
                 ((SIG-ANO-APE-CARACT * 12) + MES-APE-CARACT) 
          END-IF
          MOVE FECHA-VENC-ABD07 TO FECHA-VENC-CARACT
          MOVE FECHA-VENC-CARACT(1:2) TO MES-VENC-CARACT
          MOVE FECHA-VENC-CARACT(3:2) TO ANO-VENC-CARACT
          IF ANO-VENC-CARACT < 60
             MOVE 20          TO SIG-VENC-CARACT
          ELSE
             MOVE 19          TO SIG-VENC-CARACT
          END-IF
          IF FECHA-VENCE-CARACT > RUN-DATE-CARACT
             COMPUTE MESES-VENCE-CARACT =
                 ((SIG-ANO-VENC-CARACT * 12) + MES-VENC-CARACT) -
                 ((ANO-RUN-DATE-CARACT * 12) + MES-RUN-DATE-CARACT) 
          END-IF
          IF FECHA-VENCE-CARACT > ZEROS AND FECHA-APERT-CARACT > ZEROS
             COMPUTE MESES-VENAP-CARACT =
                 ((SIG-ANO-VENC-CARACT * 12) + MES-VENC-CARACT) -
                 ((SIG-ANO-APE-CARACT * 12) + MES-APE-CARACT)
          END-IF
          IF MESES-MADUR-CARACT > 0 AND MESES-VENAP-CARACT > 0
             COMPUTE VAL-MADUR-CARACT ROUNDED =
                  (MESES-MADUR-CARACT / MESES-VENAP-CARACT)
          END-IF.

       2200-CALCULA-CARACT-00NUM.
REMARK******************************************************************
REMARK*2200-CALCULA-CARACT-00NUM.
REMARK******************************************************************
           PERFORM 2210-INICIALIZA-00NUM
           MOVE LLAVE-MAES-CREDIT TO 00NUMLLV
      *** 00NUM002 *** PRODUCTO ABIERTO 
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR 
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              MOVE ZEROS TO 00NUM002
              IF REG-ABIERTO-CARACT = 1
                 MOVE 1 TO 00NUM002
              END-IF     
           END-IF.
      *** 00NUM003 *** PRODUCTO ABIERTO ACTUALIZADO A LA FECHA
      *** 00NUM004 *** PRODUCTO ABIERTO DESACTUALIZADO A LA FECHA
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR 
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              MOVE ZEROS TO 00NUM003 00NUM004
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS AND 
                    RUN-DATE-CARACT > ZEROS
                    IF FECHA-ESTADO-CARACT - RUN-DATE-CARACT >= 0
                       MOVE 1 TO 00NUM003
                    END-IF
                    IF FECHA-ESTADO-CARACT - RUN-DATE-CARACT < 0
                       MOVE 1 TO 00NUM004
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM003(1:3)
                     MOVE " -3" TO 00NUM004(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM003(1:3)
                 MOVE " -2" TO 00NUM004(1:3)
              END-IF     
           END-IF.
      *** 00NUM005 *** PRODUCTO CERRADO
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR 
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              MOVE ZEROS TO 00NUM005
              IF REG-CERRADO-CARACT = 1
                 MOVE 1 TO 00NUM005
              END-IF
           END-IF.
      *** 00NUM007 *** PRODUCTO CON RECLAMO
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR 
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              MOVE ZEROS TO 00NUM007
              IF IND-RECLAMO-ABD07 = 1 OR 2 OR 3
                 MOVE 1 TO 00NUM007
              END-IF
           END-IF.
      *** 00NUM008 *** PRODUCTO NO ENTRAGADO 
      *** 00NUM009 *** PRODUCTO NO RENOVADO
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00NUM008 00NUM009
              IF NOV-REPORT-ABD07 = 02 AND COD-CTA-ABD07 = 02 
                 MOVE 1 TO 00NUM008
              END-IF
              IF NOV-REPORT-ABD07 = 49 AND COD-CTA-ABD07 = 02 
                 MOVE 1 TO 00NUM009
              END-IF
           END-IF.
      *** 00NUM010 *** PRODUCTO BLOQUEADO
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR 
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              MOVE ZEROS TO 00NUM010
              IF IND-BLOQUEO-ABD07 = 3 OR 4 OR 5 OR 8 OR 9
                 MOVE 1 TO 00NUM010
              END-IF
           END-IF.
      *** 00NUM017 *** PRODUCTO ILOCALIZABLE
      *** 00NUM018 *** PRODUCTO CASTIGADO
      *** 00NUM019 *** PRODUCTO RECUPERADO
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR 
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00NUM017 00NUM018 00NUM019
              IF ADJETIVO1-ABD07 = 3 OR ADJETIVO2-ABD07 = 3 OR
                 ADJETIVO3-ABD07 = 3
                 MOVE 1 TO 00NUM017
              END-IF
              IF NOV-REPORT-ABD07 = 45 
                 MOVE 1 TO 00NUM018
              END-IF
              IF NOV-REPORT-ABD07 = 46 
                 MOVE 1 TO 00NUM019
              END-IF
           END-IF.
      *** 00NUM022 *** PRODUCTO EMBARGADO
           IF COD-PORTAF-CARACT = "AH" OR  "CT"
              MOVE ZEROS TO 00NUM022
           END-IF.
      *** 00NUM023 *** PRODUCTO EXTRAVIADO 
      *** 00NUM024 *** PRODUCTO ROBADO 
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00NUM023 00NUM024
              IF NOV-REPORT-ABD07 = 07 AND COD-CTA-ABD07 = 02 
                 MOVE 1 TO 00NUM023
              END-IF
              IF NOV-REPORT-ABD07 = 04 AND COD-CTA-ABD07 = 02 
                 MOVE 1 TO 00NUM024
              END-IF
           END-IF.
      *** 00NUM028 *** PRODUCTO DESACTUALIZADO HASTA EN 6 MESES
      *** 00NUM029 *** PRODUCTO DESACTUALIZADO ENTRE 7 y 12 MESES
      *** 00NUM030 *** PRODUCTO DESACTUALIZADO EN 13 MESES O MAS
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR 
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              MOVE ZEROS TO 00NUM028 00NUM029 00NUM030
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS  
                    IF MESES-DESAC-CARACT >= 0 AND <= 6 
                       MOVE 1 TO 00NUM028
                    END-IF
                    IF MESES-DESAC-CARACT >= 7 AND <= 12 
                       MOVE 1 TO 00NUM029
                    END-IF
                    IF MESES-DESAC-CARACT >= 13 
                       MOVE 1 TO 00NUM030
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM028(1:3)
                     MOVE " -3" TO 00NUM029(1:3)
                     MOVE " -3" TO 00NUM030(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM028(1:3)
                 MOVE " -2" TO 00NUM029(1:3)
                 MOVE " -2" TO 00NUM030(1:3)
              END-IF     
           END-IF.

      *** 00NUM031 *** PRODUCTO CON VECTOR DE SALDO ELEGIBLE
      *** 00NUM032 *** PRODUCTO CON VECTOR DE SALDO MORA ELEGIBLE
      *** 00NUM033 *** PRODUCTO CON VECTOR DE CUPO ELEGIBLE
      *** 00NUM034 *** PRODUCTO CON VECTOR DE CUOTA ELEGIBLE
      *** 00NUM035 *** PRODUCTO CON VECTOR DE CUOTA/SALDO ELEGIBLE
      *** 00NUM036 *** PRODUCTO CON VECTOR DE UTILIZACIONES ELEGIBLE
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00NUM031 00NUM032 00NUM033 
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00NUM034 00NUM035
              END-IF
              IF COD-PORTAF-CARACT = "RO"
                 MOVE ZEROS TO 00NUM036
              END-IF
ICMVLR*              IF END-ERR-CARACT = 0
ICMVLR        IF SW-LECTURA-LEEICMVLR = 1
               IF SW-NORMALIZ-VECTVAL = 0
                  PERFORM VARYING J-C-CARACT FROM 1 BY 1 UNTIL
                                                       J-C-CARACT > 13
                    IF VEC-IND-SLD-CARACT(J-C-CARACT) = 0
                       MOVE 1 TO 00NUM031
                    END-IF
                    IF VEC-IND-SLDM-CARACT(J-C-CARACT) = 0
                       MOVE 1 TO 00NUM032
                    END-IF
                    IF VEC-IND-INI-CARACT(J-C-CARACT) = 0
                       MOVE 1 TO 00NUM033
                    END-IF
                    IF COD-PORTAF-CARACT NOT = "CC"
                       IF VEC-IND-CUO-CARACT(J-C-CARACT) = 0
                          MOVE 1 TO 00NUM034
                       END-IF
                       IF VEC-IND-CUO-CARACT(J-C-CARACT) = 0 AND
                          VEC-IND-SLD-CARACT(J-C-CARACT) = 0 AND
                          VEC-SALDO-CARACT(J-C-CARACT) > ZEROS
                          MOVE 1 TO 00NUM035
                       END-IF
                    END-IF
                    IF COD-PORTAF-CARACT = "RO"
                       IF VEC-IND-SLD-CARACT(J-C-CARACT) = 0 AND
                          VEC-IND-INI-CARACT(J-C-CARACT) = 0 AND
                          VEC-INICIAL-CARACT(J-C-CARACT) > ZEROS
                          MOVE 1 TO 00NUM036
                       END-IF
                    ELSE
                        MOVE "-99" TO 00NUM036(1:3)
                    END-IF
                  END-PERFORM
               END-IF
              END-IF
           END-IF.

      *** 00NUM037 *** PRODUCTO CON TERMINO ENTRE  1 Y  6 MESES
      *** 00NUM038 *** PRODUCTO CON TERMINO ENTRE  7 Y 12 MESES
      *** 00NUM039 *** PRODUCTO CON TERMINO ENTRE 12 Y 24 MESES
      *** 00NUM040 *** PRODUCTO CON TERMINO ENTRE 25 Y 36 MESES
      *** 00NUM041 *** PRODUCTO CON TERMINO ENTRE 37 Y 48 MESES
      *** 00NUM042 *** PRODUCTO CON TERMINO ENTRE 49 Y 60 MESES
      *** 00NUM043 *** PRODUCTO CON TERMINO SUPERIOR A 60 MESES
           IF COD-PORTAF-CARACT = "IN" OR "VE" OR "HP" OR "OT" 
              MOVE ZEROS TO 00NUM037 00NUM038 00NUM039 00NUM040
                            00NUM041 00NUM042 00NUM043
              IF REG-ABIERTO-CARACT = 1
                 IF MESES-VENAP-CARACT >= ZEROS  
                    IF MESES-VENAP-CARACT >= 1 AND <= 6
                       MOVE 1 TO 00NUM037
                    END-IF
                    IF MESES-VENAP-CARACT >= 7 AND <= 12
                       MOVE 1 TO 00NUM038
                    END-IF
                    IF MESES-VENAP-CARACT >= 13 AND <= 24
                       MOVE 1 TO 00NUM039
                    END-IF
                    IF MESES-VENAP-CARACT >= 25 AND <= 36
                       MOVE 1 TO 00NUM040
                    END-IF
                    IF MESES-VENAP-CARACT >= 37 AND <= 48
                       MOVE 1 TO 00NUM041
                    END-IF
                    IF MESES-VENAP-CARACT >= 49 AND <= 60
                       MOVE 1 TO 00NUM042
                    END-IF
                    IF MESES-VENAP-CARACT > 60
                       MOVE 1 TO 00NUM043
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM037(1:3)
                     MOVE " -3" TO 00NUM038(1:3)
                     MOVE " -3" TO 00NUM039(1:3)
                     MOVE " -3" TO 00NUM040(1:3)
                     MOVE " -3" TO 00NUM041(1:3)
                     MOVE " -3" TO 00NUM042(1:3)
                     MOVE " -3" TO 00NUM043(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM037(1:3)
                 MOVE " -2" TO 00NUM038(1:3)
                 MOVE " -2" TO 00NUM039(1:3)
                 MOVE " -2" TO 00NUM040(1:3)
                 MOVE " -2" TO 00NUM041(1:3)
                 MOVE " -2" TO 00NUM042(1:3)
                 MOVE " -2" TO 00NUM043(1:3)
              END-IF     
           END-IF.

      *** 00NUM044 *** PRODUCTO CON MADURACION ENTRE  0% y  25%
      *** 00NUM045 *** PRODUCTO CON MADURACION ENTRE 26% y  50%
      *** 00NUM046 *** PRODUCTO CON MADURACION ENTRE 51% y  75%
      *** 00NUM047 *** PRODUCTO CON MADURACION ENTRE 76% y 100%
      *** 00NUM048 *** PRODUCTO CON MADURACION SUPERIOR AL 100%
           IF COD-PORTAF-CARACT = "IN" OR "VE" OR "HP" OR "OT" 
              MOVE ZEROS TO 00NUM044 00NUM045 00NUM046 00NUM047 
                            00NUM048
              IF REG-ABIERTO-CARACT = 1
                 IF MESES-VENAP-CARACT > ZEROS  AND
                    FECHA-APERT-CARACT > ZEROS
                    IF VAL-MADUR-CARACT >= 0 AND <= 0.25
                       MOVE 1 TO 00NUM044
                    END-IF
                    IF VAL-MADUR-CARACT >= 0.26 AND <= 0.50
                       MOVE 1 TO 00NUM045
                    END-IF
                    IF VAL-MADUR-CARACT >= 0.51 AND <= 0.75
                       MOVE 1 TO 00NUM046
                    END-IF
                    IF VAL-MADUR-CARACT >= 0.76 AND <= 1
                       MOVE 1 TO 00NUM047
                    END-IF
                    IF VAL-MADUR-CARACT > 1
                       MOVE 1 TO 00NUM048
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM044(1:3)
                     MOVE " -3" TO 00NUM045(1:3)
                     MOVE " -3" TO 00NUM046(1:3)
                     MOVE " -3" TO 00NUM047(1:3)
                     MOVE " -3" TO 00NUM048(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM044(1:3)
                 MOVE " -2" TO 00NUM045(1:3)
                 MOVE " -2" TO 00NUM046(1:3)
                 MOVE " -2" TO 00NUM047(1:3)
                 MOVE " -2" TO 00NUM048(1:3)
              END-IF     
           END-IF.

      *** 00NUM049 *** PRODUCTO CON ESTADO NEGATIVO
      *** 00NUM050 *** PRODUCTO CON ESTADO POSITIVO
      *** 00NUM066 *** PRODUCTO IDENTIFICADO COMO FALLECIDO
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR 
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              MOVE ZEROS TO 00NUM049 00NUM050 00NUM066
              IF NOV-REPORT-ABD07 = 03 OR 04 OR 07 OR 47 OR 49 OR
                 ADJETIVO1-ABD07 = 2 OR 3 OR 
                 ADJETIVO2-ABD07 = 2 OR 3 OR 
                 ADJETIVO3-ABD07 = 2 OR 3  
                 MOVE 1 TO 00NUM049
              END-IF
              IF NOV-REPORT-ABD07 = 05 OR 06 OR 08 OR 09 OR 10 OR
                                    11 OR 12
                 MOVE 1 TO 00NUM050
              END-IF
              IF ADJETIVO1-ABD07 = 1 OR 
                 ADJETIVO2-ABD07 = 1 OR
                 ADJETIVO3-ABD07 = 1
                 MOVE 1 TO 00NUM066
              END-IF
           END-IF.
     
       2205-NORMALIZAR-VECTOR-VALORES.
REMARK******************************************************************
REMARK*2205-NORMALIZAR-VECTOR-VALORES.
REMARK******************************************************************
ICMVLR     INITIALIZE SW-NORMALIZ-VECTVAL                               HGO0002
                      FECHA-ICMVAL-CARACT  FECHA-SMLMV-CARACT
ICMVLR     MOVE 1 TO IND-ARCHIVO-LEEICMVLR                              HGO0002
ICMVLR     PERFORM 1000-LEE-VALORES-LEEICMVLR                           HGO0002
           
ICMVLR     IF SW-LECTURA-LEEICMVLR = 1                                  HGO0002
ICMVLR      MOVE FEC-NOVEDAD-LEEICMVLR TO FECHA-ICMVAL-CARACT           HGO0002
ICMVLR                                 FECHA-SMLMV-CARACT               HGO0002
ICMVLR      PERFORM VARYING J-C-CARACT FROM 1 BY 1 UNTIL J-C-CARACT > 13HGO0002
ICMVLR         MOVE CUOTA-NV-LEEICMVLR(J-C-CARACT) TO                   HGO0002
ICMVLR              VEC-CUOTA-CARACT(14 - J-C-CARACT)                   HGO0002
ICMVLR         MOVE SALDO-NV-LEEICMVLR(J-C-CARACT) TO                   HGO0002
ICMVLR              VEC-SALDO-CARACT(14 - J-C-CARACT)                   HGO0002
ICMVLR         MOVE SALDO-MORA-NV-LEEICMVLR(J-C-CARACT) TO              HGO0002
ICMVLR              VEC-SALDOMOR-CARACT(14 - J-C-CARACT)                HGO0002
ICMVLR         MOVE VAL-INICIAL-NV-LEEICMVLR(J-C-CARACT) TO             HGO0002
ICMVLR              VEC-INICIAL-CARACT(14 - J-C-CARACT)                 HGO0002
ICMVLR         MOVE SALDO-DISP-NV-LEEICMVLR(J-C-CARACT) TO              HGO0002
ICMVLR              VEC-DISPON-CARACT(14 - J-C-CARACT)                  HGO0002
ICMVLR         MOVE IND-CUOTA-NV-LEEICMVLR(J-C-CARACT) TO               HGO0002
ICMVLR              VEC-IND-CUO-CARACT(14 - J-C-CARACT)                 HGO0002
ICMVLR         MOVE IND-SALDO-NV-LEEICMVLR(J-C-CARACT) TO               HGO0002
ICMVLR              VEC-IND-SLD-CARACT(14 - J-C-CARACT)                 HGO0002
ICMVLR         MOVE IND-SALDO-MORA-NV-LEEICMVLR(J-C-CARACT) TO          HGO0002
ICMVLR              VEC-IND-SLDM-CARACT(14 - J-C-CARACT)                HGO0002
ICMVLR         MOVE IND-VAL-INIC-NV-LEEICMVLR(J-C-CARACT) TO            HGO0002
ICMVLR              VEC-IND-INI-CARACT(14 - J-C-CARACT)                 HGO0002
ICMVLR         MOVE IND-SALDO-DISP-NV-LEEICMVLR(J-C-CARACT) TO          HGO0002
ICMVLR              VEC-IND-DSP-CARACT(14 - J-C-CARACT)                 HGO0002
ICMVLR        PERFORM 2206-BUSCAR-SMLMV                                 HGO0002
SALMIN*             IF ANO-SMLMV-CARACT(J-SMLMV-CARACT) <> 9999         GJC0004
SALMIN        IF IND-E-CARACT = 0                                       GJC0004
                 COMPUTE VEC-SMLMV-CARACT(14 - J-C-CARACT) =
ICMVLR                         (VLR-SMLMV-CARACT(J-SMLMV-CARACT) / 1000)HGO0002
              ELSE
SALMIN           COMPUTE VEC-SMLMV-CARACT(14 - J-C-CARACT) =            GJC0004
SALMIN                         (VLR-SMLMV-CARACT(1) / 1000)             GJC0004
SALMIN           DISPLAY "ERROR BUSCANDO SALARIO MINIMO PARA ANO "      GJC0004
SALMIN            ANO-NOV-SMLMV-CARACT "DE LLAVE CRE " LLAVE-MAES-CREDITGJC0004
              END-IF
              IF MES-NOV-SMLMV-CARACT = 1
                COMPUTE ANO-NOV-SMLMV-CARACT = ANO-NOV-SMLMV-CARACT - 1
                MOVE 12 TO MES-NOV-SMLMV-CARACT
              ELSE
                COMPUTE MES-NOV-SMLMV-CARACT = MES-NOV-SMLMV-CARACT - 1
              END-IF
            END-PERFORM
            MOVE FECHA-ING-ABD02  TO FECHA-SUSC-CARACT
            MOVE FECHA-SUSC-CARACT(1:2) TO MES-INGSUS-CARACT
            MOVE FECHA-SUSC-CARACT(3:2) TO ANO-INGSUS-CARACT
            IF ANO-INGSUS-CARACT < 50
               MOVE 20   TO  SIG-INGSUS-CARACT
            ELSE
               MOVE 19   TO  SIG-INGSUS-CARACT
            END-IF
            IF FECHA-APERT-CARACT > FECHA-INGSUS-CARACT
               MOVE FECHA-APERT-CARACT TO FECHA-INGSUS-CARACT
            END-IF
            IF FECHA-ICMVAL-CARACT > FECHA-INGSUS-CARACT
               COMPUTE J-C-CARACT =
                  (SIG-ANO-ICMVAL-CARACT * 12 + MES-ICMVAL-CARACT) -
                  (SIG-ANO-INGSUS-CARACT * 12 + MES-INGSUS-CARACT)
            ELSE
               MOVE 0 TO J-C-CARACT
            END-IF
VAL001      IF J-C-CARACT < 12                                          RMB0011
VAL001*     IF J-C-CARACT < 13                                          RMB0011
VAL001         COMPUTE J-C-CARACT = 12 - J-C-CARACT                     RMB0011
VAL001*        COMPUTE J-C-CARACT = 13 - J-C-CARACT                     RMB0011
            ELSE
               MOVE 0 TO J-C-CARACT
            END-IF
VAL001      IF FECHA-ICMVAL-CARACT < FECHA-INGSUS-CARACT                RMB0011
VAL001      *> BORRAR TODO EL VECTOR DE POSIBLES VALORES CADUCOS        RMB0011
VAL001         MOVE 13 TO J-C-CARACT                                    RMB0011
VAL001      END-IF                                                      RMB0011
            PERFORM UNTIL J-C-CARACT = 0
              MOVE ZEROS TO VEC-CUOTA-CARACT(J-C-CARACT) 
                            VEC-SALDO-CARACT(J-C-CARACT)
                            VEC-SALDOMOR-CARACT(J-C-CARACT)
                            VEC-INICIAL-CARACT(J-C-CARACT)
                            VEC-DISPON-CARACT(J-C-CARACT)  
                            VEC-SMLMV-CARACT(J-C-CARACT)
              MOVE 9 TO VEC-IND-CUO-CARACT(J-C-CARACT) 
                        VEC-IND-SLD-CARACT(J-C-CARACT)
                        VEC-IND-SLDM-CARACT(J-C-CARACT)
                        VEC-IND-INI-CARACT(J-C-CARACT)
                        VEC-IND-DSP-CARACT(J-C-CARACT)
               SUBTRACT 1 FROM J-C-CARACT
            END-PERFORM
            IF RUN-DATE-CARACT >= FECHA-ICMVAL-CARACT
               COMPUTE J-C-CARACT =
                 ((ANO-RUN-DATE-CARACT * 12) + MES-RUN-DATE-CARACT) -
                 ((SIG-ANO-ICMVAL-CARACT * 12) + MES-ICMVAL-CARACT)
               IF J-C-CARACT < 14
                  PERFORM UNTIL J-C-CARACT = 0
                     PERFORM VARYING X-C-CARACT FROM 2 BY 1 UNTIL
                                                       X-C-CARACT > 13
                        MOVE VEC-CUOTA-CARACT(X-C-CARACT) TO
                             VEC-CUOTA-CARACT(X-C-CARACT - 1)
                        MOVE VEC-IND-CUO-CARACT(X-C-CARACT) TO
                             VEC-IND-CUO-CARACT(X-C-CARACT - 1)
                        MOVE VEC-SALDO-CARACT(X-C-CARACT) TO
                             VEC-SALDO-CARACT(X-C-CARACT - 1)
                        MOVE VEC-IND-SLD-CARACT(X-C-CARACT) TO
                             VEC-IND-SLD-CARACT(X-C-CARACT - 1)
                        MOVE VEC-SALDOMOR-CARACT(X-C-CARACT) TO
                             VEC-SALDOMOR-CARACT(X-C-CARACT - 1)
                        MOVE VEC-IND-SLDM-CARACT(X-C-CARACT) TO
                             VEC-IND-SLDM-CARACT(X-C-CARACT - 1)
                        MOVE VEC-INICIAL-CARACT(X-C-CARACT) TO
                             VEC-INICIAL-CARACT(X-C-CARACT - 1)
                        MOVE VEC-IND-INI-CARACT(X-C-CARACT) TO
                             VEC-IND-INI-CARACT(X-C-CARACT - 1)
                        MOVE VEC-DISPON-CARACT(X-C-CARACT) TO
                             VEC-DISPON-CARACT(X-C-CARACT - 1)
                        MOVE VEC-IND-DSP-CARACT(X-C-CARACT) TO
                             VEC-IND-DSP-CARACT(X-C-CARACT - 1)
                        MOVE VEC-SMLMV-CARACT(X-C-CARACT) TO
                             VEC-SMLMV-CARACT(X-C-CARACT - 1)
                     END-PERFORM
                     MOVE ZEROS TO VEC-CUOTA-CARACT(13)
                                   VEC-SALDO-CARACT(13)
                                   VEC-SALDOMOR-CARACT(13)
                                   VEC-INICIAL-CARACT(13)
                                   VEC-DISPON-CARACT(13)
                                   VEC-SMLMV-CARACT(13)
                     MOVE 9 TO VEC-IND-CUO-CARACT(13)
                               VEC-IND-SLD-CARACT(13)
                               VEC-IND-SLDM-CARACT(13)
                               VEC-IND-INI-CARACT(13)
                               VEC-IND-DSP-CARACT(13)
                     SUBTRACT 1 FROM J-C-CARACT
                  END-PERFORM
               ELSE
                  MOVE 1 TO SW-NORMALIZ-VECTVAL
               END-IF
            ELSE
               COMPUTE J-C-CARACT =
                 ((SIG-ANO-ICMVAL-CARACT * 12) + MES-ICMVAL-CARACT) -
                 ((ANO-RUN-DATE-CARACT * 12) + MES-RUN-DATE-CARACT)
               IF J-C-CARACT < 14
                  PERFORM UNTIL J-C-CARACT = 0
                     PERFORM VARYING X-C-CARACT FROM 12 BY -1 UNTIL 
                                                        X-C-CARACT = 0
                        MOVE VEC-CUOTA-CARACT(X-C-CARACT) TO
                             VEC-CUOTA-CARACT(X-C-CARACT + 1)
                        MOVE VEC-IND-CUO-CARACT(X-C-CARACT) TO
                             VEC-IND-CUO-CARACT(X-C-CARACT + 1)
                        MOVE VEC-SALDO-CARACT(X-C-CARACT) TO
                             VEC-SALDO-CARACT(X-C-CARACT + 1)
                        MOVE VEC-IND-SLD-CARACT(X-C-CARACT) TO
                             VEC-IND-SLD-CARACT(X-C-CARACT + 1)
                        MOVE VEC-SALDOMOR-CARACT(X-C-CARACT) TO
                             VEC-SALDOMOR-CARACT(X-C-CARACT + 1)
                        MOVE VEC-IND-SLDM-CARACT(X-C-CARACT) TO
                             VEC-IND-SLDM-CARACT(X-C-CARACT + 1)
                        MOVE VEC-INICIAL-CARACT(X-C-CARACT) TO
                             VEC-INICIAL-CARACT(X-C-CARACT + 1)
                        MOVE VEC-IND-INI-CARACT(X-C-CARACT) TO
                             VEC-IND-INI-CARACT(X-C-CARACT + 1)
                        MOVE VEC-DISPON-CARACT(X-C-CARACT) TO
                             VEC-DISPON-CARACT(X-C-CARACT + 1)
                        MOVE VEC-IND-DSP-CARACT(X-C-CARACT) TO
                             VEC-IND-DSP-CARACT(X-C-CARACT + 1)
                        MOVE VEC-SMLMV-CARACT(X-C-CARACT) TO
                             VEC-SMLMV-CARACT(X-C-CARACT + 1)
                     END-PERFORM
                        MOVE ZEROS TO VEC-CUOTA-CARACT(1)
                                      VEC-SALDO-CARACT(1)
                                      VEC-SALDOMOR-CARACT(1)
                                      VEC-INICIAL-CARACT(1)
                                      VEC-DISPON-CARACT(1)
                                      VEC-SMLMV-CARACT(1)
                        MOVE 9 TO VEC-IND-CUO-CARACT(1)
                                  VEC-IND-SLD-CARACT(1)
                                  VEC-IND-SLDM-CARACT(1)
                                  VEC-IND-INI-CARACT(1)
                                  VEC-IND-DSP-CARACT(1)
                     SUBTRACT 1 FROM J-C-CARACT
                  END-PERFORM
               ELSE
                  MOVE 1 TO SW-NORMALIZ-VECTVAL
               END-IF
            END-IF
EREN01     ELSE                                                         RMB0003 
EREN01      MOVE 1 TO SW-NORMALIZ-VECTVAL                               RMB0003 
           END-IF
           PERFORM VARYING J-C-CARACT FROM 1 BY 1 UNTIL J-C-CARACT > 13
            IF SW-NORMALIZ-VECTVAL = 1
               MOVE "          -" TO VEC-CUOTA-CARACT(J-C-CARACT)(1:11)
               MOVE "          -" TO VEC-SALDO-CARACT(J-C-CARACT)(1:11)
               MOVE "          -" TO 
                                  VEC-SALDOMOR-CARACT(J-C-CARACT)(1:11)
               MOVE "          -" TO 
                                   VEC-INICIAL-CARACT(J-C-CARACT)(1:11)
               MOVE "          -" TO VEC-DISPON-CARACT(J-C-CARACT)(1:11)
               MOVE 9 TO VEC-IND-CUO-CARACT(J-C-CARACT)
                         VEC-IND-SLD-CARACT(J-C-CARACT)
                         VEC-IND-SLDM-CARACT(J-C-CARACT)
                         VEC-IND-INI-CARACT(J-C-CARACT)
                         VEC-IND-DSP-CARACT(J-C-CARACT)
            ELSE 
              IF VEC-IND-CUO-CARACT(J-C-CARACT) NOT = 0
                MOVE "          -" TO VEC-CUOTA-CARACT(J-C-CARACT)(1:11)
              END-IF
              IF VEC-IND-SLD-CARACT(J-C-CARACT) NOT = 0
                MOVE "          -" TO VEC-SALDO-CARACT(J-C-CARACT)(1:11)
              END-IF
              IF VEC-IND-SLDM-CARACT(J-C-CARACT) NOT = 0
                 MOVE "          -" TO 
                                   VEC-SALDOMOR-CARACT(J-C-CARACT)(1:11)
              END-IF
              IF VEC-IND-INI-CARACT(J-C-CARACT) NOT = 0
                 MOVE "          -" TO 
                                    VEC-INICIAL-CARACT(J-C-CARACT)(1:11)
              END-IF
              IF VEC-IND-DSP-CARACT(J-C-CARACT) NOT = 0
                 MOVE "          -" TO 
                                    VEC-DISPON-CARACT(J-C-CARACT)(1:11)
              END-IF
            END-IF
           END-PERFORM.
  
ICMVLR 2206-BUSCAR-SMLMV.                                               HGO0002
REMARK******************************************************************
REMARK*2206-BUSCAR-SMLMV.
REMARK******************************************************************
ICMVLR     SET J-SMLMV-CARACT TO 1.                                     HGO0002
SALMIN     MOVE 0 TO IND-E-CARACT                                       GJC0004
ICMVLR     SEARCH ALL VCT-SMLMV-CARACT AT END                           HGO0002
ICMVLR       ADD 1 TO IND-E-CARACT                                      HGO0002
ICMVLR       WHEN ANO-SMLMV-CARACT(J-SMLMV-CARACT) =                    HGO0002
ICMVLR            ANO-NOV-SMLMV-CARACT                                  HGO0002
ICMVLR     END-SEARCH.                                                  HGO0002
           
       2210-INICIALIZA-00NUM.
REMARK******************************************************************
REMARK*2210-INICIALIZA-00NUM.
REMARK******************************************************************
           MOVE "-99" TO 
                00NUM002(1:3) 00NUM003(1:3) 00NUM004(1:3)
                00NUM005(1:3) 00NUM007(1:3) 00NUM008(1:3) 00NUM009(1:3)
                00NUM010(1:3) 00NUM017(1:3) 00NUM018(1:3) 00NUM019(1:3)
                00NUM022(1:3) 00NUM023(1:3) 00NUM024(1:3) 00NUM028(1:3)
                00NUM029(1:3) 00NUM030(1:3) 00NUM031(1:3) 00NUM032(1:3)
                00NUM033(1:3) 00NUM034(1:3) 00NUM035(1:3) 00NUM036(1:3)
                00NUM037(1:3) 00NUM038(1:3) 00NUM039(1:3) 00NUM040(1:3)
                00NUM041(1:3) 00NUM042(1:3) 00NUM043(1:3) 00NUM044(1:3)
                00NUM045(1:3) 00NUM046(1:3) 00NUM047(1:3) 00NUM048(1:3)
                00NUM049(1:3) 00NUM050(1:3) 00NUM066(1:3).

       2250-CALCULA-CARACT-01NUM.
REMARK******************************************************************
REMARK*2250-CALCULA-CARACT-01NUM.
REMARK******************************************************************
           ADD  1 TO 01NUM001(IND-PORTAF-CARACT)
           MOVE COD-PORTAF-CARACT TO 01NUMPTF(IND-PORTAF-CARACT).
      *** 01NUM002 *** NUMERO DE PRODUCTOS ABIERTOS
           IF 00NUM002 > 0
             IF 01NUM002(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01NUM002(IND-PORTAF-CARACT)
             END-IF
             ADD  1 TO 01NUM002(IND-PORTAF-CARACT)
           ELSE
             IF 01NUM002(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00NUM002(1:3)) < 
                  FUNCTION NUMVAL(01NUM002(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM002(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM002(1:3) TO 01NUM002(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01NUM003 *** NUMERO DE PRODUCTOS ABIERTO ACTUALIZADO A LA FECHA
           IF 00NUM003 > 0
             IF 01NUM003(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01NUM003(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01NUM003(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM003(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM003(1:3)) < 
                 FUNCTION NUMVAL(01NUM003(IND-PORTAF-CARACT)(2:3))
                MOVE " " TO 01NUM003(IND-PORTAF-CARACT)(1:1)
                MOVE 00NUM003(1:3) TO 01NUM003(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM004 *** NUMERO DE PRODUCTOS ABIERTO DESACTUALIZADO A LA FECHA
           IF 00NUM004 > 0
             IF 01NUM004(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01NUM004(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01NUM004(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM004(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM004(1:3)) < 
                 FUNCTION NUMVAL(01NUM004(IND-PORTAF-CARACT)(2:3))
                MOVE " " TO 01NUM004(IND-PORTAF-CARACT)(1:1)
                MOVE 00NUM004(1:3) TO 01NUM004(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM005 *** NUMERO DE PRODUCTO CERRADO
           IF 00NUM005 > 0
             IF 01NUM005(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01NUM005(IND-PORTAF-CARACT)
             END-IF
             ADD  1 TO 01NUM005(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM005(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM005(1:3)) < 
                 FUNCTION NUMVAL(01NUM005(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM005(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM005(1:3) TO 01NUM005(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM007 *** NUMERO DE PRODUCTOS CON RECLAMO
           IF 00NUM007 > 0
             IF 01NUM007(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01NUM007(IND-PORTAF-CARACT)
             END-IF
             ADD  1 TO 01NUM007(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM007(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM007(1:3)) < 
                 FUNCTION NUMVAL(01NUM007(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM007(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM007(1:3) TO 01NUM007(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM018 *** NUMERO DE PRODUCTOS CASTIGADOS
           IF 00NUM018 > 0
             IF 01NUM018(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01NUM018(IND-PORTAF-CARACT)
             END-IF
             ADD  1 TO 01NUM018(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM018(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM018(1:3)) < 
                 FUNCTION NUMVAL(01NUM018(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM018(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM018(1:3) TO 01NUM018(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM019 *** NUMERO DE PRODUCTOS RECUPERADOS
           IF 00NUM019 > 0
              IF 01NUM019(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM019(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM019(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM019(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM019(1:3)) < 
                 FUNCTION NUMVAL(01NUM019(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM019(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM019(1:3) TO 01NUM019(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM022 *** NUMERO DE PRODUCTOS EMBARGADO
           IF 00NUM022 > 0
              IF 01NUM022(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM022(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM022(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM022(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM022(1:3)) < 
                 FUNCTION NUMVAL(01NUM022(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM022(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM022(1:3) TO 01NUM022(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM037 *** NUMERO DE PRODUCTOS CON TERMINO ENTRE 1 Y 6 MESES
           IF 00NUM037 > 0
              IF 01NUM037(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM037(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM037(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM037(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM037(1:3)) < 
                 FUNCTION NUMVAL(01NUM037(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM037(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM037(1:3) TO 01NUM037(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM038 *** NUMERO DE PRODUCTOS CON TERMINO ENTRE  7 Y 12 MESES
           IF 00NUM038 > 0
              IF 01NUM038(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM038(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM038(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM038(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM038(1:3)) < 
                 FUNCTION NUMVAL(01NUM038(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM038(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM038(1:3) TO 01NUM038(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM039 *** NUMERO DE PRODUCTOS CON TERMINO ENTRE 12 Y 24 MESES
           IF 00NUM039 > 0
              IF 01NUM039(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM039(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM039(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM039(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM039(1:3)) < 
                 FUNCTION NUMVAL(01NUM039(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM039(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM039(1:3) TO 01NUM039(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM040 *** NUMERO DE PRODUCTOS CON TERMINO ENTRE 25 Y 36 MESES
           IF 00NUM040 > 0
              IF 01NUM040(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM040(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM040(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM040(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM040(1:3)) < 
                 FUNCTION NUMVAL(01NUM040(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM040(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM040(1:3) TO 01NUM040(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM041 *** NUMERO DE PRODUCTOS CON TERMINO ENTRE 37 Y 48 MESES
           IF 00NUM041 > 0
              IF 01NUM041(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM041(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM041(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM041(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM041(1:3)) < 
                 FUNCTION NUMVAL(01NUM041(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM041(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM041(1:3) TO 01NUM041(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM042 *** NUMERO DE PRODUCTOS CON TERMINO ENTRE 49 Y 60 MESES
           IF 00NUM042 > 0
              IF 01NUM042(IND-PORTAF-CARACT) < 0
                 MOVE  ZEROS TO 01NUM042(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM042(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM042(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM042(1:3)) < 
                 FUNCTION NUMVAL(01NUM042(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM042(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM042(1:3) TO 01NUM042(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM043 *** NUMERO DE PRODUCTOS CON TERMINO SUPERIOR A 60 MESES
           IF 00NUM043 > 0
              IF 01NUM043(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM043(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM043(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM043(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM043(1:3)) < 
                 FUNCTION NUMVAL(01NUM043(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM043(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM043(1:3) TO 01NUM043(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM044 *** NUMERO DE PRODUCTOS CON MADURACION ENTRE  0% y  25%
           IF 00NUM044 > 0
              IF 01NUM044(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM044(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM044(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM044(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM044(1:3)) < 
                 FUNCTION NUMVAL(01NUM044(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM044(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM044(1:3) TO 01NUM044(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM045 *** NUMERO DE PRODUCTOS CON MADURACION ENTRE 26% y  50%
           IF 00NUM045 > 0
              IF 01NUM045(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM045(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM045(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM045(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM045(1:3)) < 
                 FUNCTION NUMVAL(01NUM045(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM045(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM045(1:3) TO 01NUM045(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM046 *** NUMERO DE PRODUCTOS CON MADURACION ENTRE 51% y  75%
           IF 00NUM046 > 0
              IF 01NUM046(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM046(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM046(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM046(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM046(1:3)) < 
                 FUNCTION NUMVAL(01NUM046(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM046(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM046(1:3) TO 01NUM046(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM047 *** NUMERO DE PRODUCTOS CON MADURACION ENTRE 76% y 100%
           IF 00NUM047 > 0
              IF 01NUM047(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM047(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM047(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM047(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM047(1:3)) < 
                 FUNCTION NUMVAL(01NUM047(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM047(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM047(1:3) TO 01NUM047(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 001UM048 *** NUMERO DE PRODUCTOS CON MADURACION SUPERIOR AL 100%
           IF 00NUM048 > 0
              IF 01NUM048(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM048(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM048(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM048(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM048(1:3)) < 
                 FUNCTION NUMVAL(01NUM048(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM048(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM048(1:3) TO 01NUM048(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM049 *** NUMERO DE PRODUCTOS CON ESTADO NEGATIVO
           IF 00NUM049 > 0
              IF 01NUM049(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM049(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM049(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM049(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00NUM049(1:3)) < 
                 FUNCTION NUMVAL(01NUM049(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM049(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM049(1:3) TO 01NUM049(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.
      *** 01NUM050 *** NUMERO DE PRODUCTOS CON ESTADO POSITIVO
           IF 00NUM050 > 0
              IF 01NUM050(IND-PORTAF-CARACT) < 0
                 MOVE ZEROS TO 01NUM050(IND-PORTAF-CARACT)
              END-IF
              ADD  1 TO 01NUM050(IND-PORTAF-CARACT)
           ELSE
            IF 01NUM050(IND-PORTAF-CARACT) <= 0
              IF FUNCTION NUMVAL(00NUM050(1:3)) < 
                 FUNCTION NUMVAL(01NUM050(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01NUM050(IND-PORTAF-CARACT)(1:1)
                 MOVE 00NUM050(1:3) TO 01NUM050(IND-PORTAF-CARACT)(2:3)
              END-IF
            END-IF
           END-IF.

       2280-CALCULA-CARACT-02NUM.
REMARK******************************************************************
REMARK*2280-CALCULA-CARACT-02NUM.
REMARK******************************************************************
           PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL I-CARACT > 9
            IF 01NUMPTF(I-CARACT) NOT = ZEROS
      *** 02NUM001TO *** TOTAL PRODUCTOS
             IF 01NUM001(I-CARACT) >= 0
                IF 02NUM001TO < 0
                   MOVE ZEROS TO 02NUM001TO
                END-IF
                COMPUTE 02NUM001TO = 02NUM001TO + 01NUM001(I-CARACT)
                MOVE 1 TO 02NUMF01TO
             ELSE
              IF 02NUMF01TO = 0
                IF FUNCTION NUMVAL(01NUM001(I-CARACT)(1:4)) < 
                   FUNCTION NUMVAL(02NUM001TO(1:4))
                   MOVE 01NUM001(I-CARACT) TO 02NUM001TO
                END-IF
              END-IF
             END-IF
      *** 02NUM002TO *** TOTAL PRODUCTOS ABIERTOS
             IF 01NUM002(I-CARACT) >= 0
                IF 02NUM002TO < 0
                   MOVE ZEROS TO 02NUM002TO
                END-IF
                COMPUTE 02NUM002TO = 02NUM002TO + 01NUM002(I-CARACT)
                MOVE 1 TO 02NUMF02TO
             ELSE
              IF 02NUMF02TO = 0
                IF FUNCTION NUMVAL(01NUM002(I-CARACT)(1:4)) < 
                   FUNCTION NUMVAL(02NUM002TO(1:4))
                   MOVE 01NUM002(I-CARACT) TO 02NUM002TO
                END-IF
              END-IF
             END-IF
      *** 02NUM003TO *** TOTAL PRODUCTOS ABIERTO ACTUALIZADO A LA FECHA
             IF 01NUM003(I-CARACT) >= 0
                IF 02NUM003TO < 0
                   MOVE ZEROS TO 02NUM003TO
                END-IF
                COMPUTE 02NUM003TO = 02NUM003TO + 01NUM003(I-CARACT)
                MOVE 1 TO 02NUMF03TO
             ELSE
              IF 02NUMF03TO = 0
                IF FUNCTION NUMVAL(01NUM003(I-CARACT)(1:4)) < 
                   FUNCTION NUMVAL(02NUM003TO(1:4))
                   MOVE 01NUM003(I-CARACT) TO 02NUM003TO
                END-IF
              END-IF
             END-IF
      *** 02NUM004TO *** TOTAL PRODUCTOS ABIERTO DESACTUALIZADO A LA FECHA
             IF 01NUM004(I-CARACT) >= 0
                IF 02NUM004TO < 0
                   MOVE ZEROS TO 02NUM004TO
                END-IF
                COMPUTE 02NUM004TO = 02NUM004TO + 01NUM004(I-CARACT)
                MOVE 1 TO 02NUMF04TO
             ELSE
              IF 02NUMF04TO = 0
                IF FUNCTION NUMVAL(01NUM004(I-CARACT)(1:4)) < 
                   FUNCTION NUMVAL(02NUM004TO(1:4))
                   MOVE 01NUM004(I-CARACT) TO 02NUM004TO
                END-IF
              END-IF
             END-IF
      *** 02NUM005TO *** TOTAL PRODUCTOS CERRADOS
             IF 01NUM005(I-CARACT) >= 0
                IF 02NUM005TO < 0
                   MOVE ZEROs TO 02NUM005TO
                END-IF
                COMPUTE 02NUM005TO = 02NUM005TO + 01NUM005(I-CARACT)
                MOVE 1 TO 02NUMF05TO
             ELSE
              IF 02NUMF05TO = 0
                IF FUNCTION NUMVAL(01NUM005(I-CARACT)(1:4)) < 
                   FUNCTION NUMVAL(02NUM005TO(1:4))
                   MOVE 01NUM005(I-CARACT) TO 02NUM005TO
                END-IF
              END-IF
             END-IF
      *** 02NUM007TO *** TOTAL PRODUCTOS CON RECLAMO
             IF 01NUM007(I-CARACT) >= 0
                IF 02NUM007TO < 0
                   MOVE ZEROS TO 02NUM007TO
                END-IF
                COMPUTE 02NUM007TO = 02NUM007TO + 01NUM007(I-CARACT)
                MOVE 1 TO 02NUMF07TO
             ELSE
              IF 02NUMF07TO = 0
                IF FUNCTION NUMVAL(01NUM007(I-CARACT)(1:4)) < 
                   FUNCTION NUMVAL(02NUM007TO(1:4))
                   MOVE 01NUM007(I-CARACT) TO 02NUM007TO
                END-IF
              END-IF
             END-IF
      *** 02NUM018TO *** TOTAL PRODUCTOS CASTIGADOS
             IF I-CARACT NOT = 8 AND NOT = 9
              IF 01NUM018(I-CARACT) >= 0
                 IF 02NUM018TO < 0
                    MOVE ZEROS TO 02NUM018TO
                 END-IF
                 COMPUTE 02NUM018TO = 02NUM018TO + 01NUM018(I-CARACT)
                 MOVE 1 TO 02NUMF18TO
              ELSE
               IF 02NUMF18TO = 0
                 IF FUNCTION NUMVAL(01NUM018(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM018TO(1:4))
                    MOVE 01NUM018(I-CARACT) TO 02NUM018TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF18TO = 0 AND 02NUM018TO = ZEROS
                  MOVE "  -1" TO 02NUM018TO(1:4)
               END-IF
             END-IF
      *** 02NUM019TO *** TOTAL PRODUCTOS RECUPERADOS
             IF I-CARACT NOT = 8 AND NOT = 9
              IF 01NUM019(I-CARACT) >= 0
                 IF 02NUM019TO < 0
                    MOVE ZEROS TO 02NUM019TO
                 END-IF
                 COMPUTE 02NUM019TO = 02NUM019TO + 01NUM019(I-CARACT)
                 MOVE 1 TO 02NUMF19TO
              ELSE
               IF 02NUMF19TO = 0
                 IF FUNCTION NUMVAL(01NUM019(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM019TO(1:4))
                    MOVE 01NUM019(I-CARACT) TO 02NUM019TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF19TO = 0 AND 02NUM019TO = ZEROS
                  MOVE "  -1" TO 02NUM019TO(1:4)
               END-IF
             END-IF
      *** 02NUM022TO *** TOTAL PRODUCTOS EMBARGADOS
             IF I-CARACT = 8 OR = 9
              IF 01NUM022(I-CARACT) >= 0
                 IF 02NUM022TO < 0
                    MOVE ZEROS TO 02NUM022TO
                 END-IF
                 COMPUTE 02NUM022TO = 02NUM022TO + 01NUM022(I-CARACT)
                 MOVE 1 TO 02NUMF22TO
              ELSE
               IF 02NUMF22TO = 0
                 IF FUNCTION NUMVAL(01NUM022(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM022TO(1:4))
                    MOVE 01NUM022(I-CARACT) TO 02NUM022TO
                 END-IF
               END-IF
              END-IF
             ELSE 
               IF 02NUMF22TO = 0 AND 02NUM022TO = ZEROS
                  MOVE "  -1" TO 02NUM022TO(1:4)
               END-IF
             END-IF
      *** 02NUM028TO *** TOTAL OBLIGACIONES CON ESTADO NEGATIVO
             IF 01NUM049(I-CARACT) >= 0
                IF 02NUM028TO < 0
                   MOVE ZEROS TO 02NUM028TO
                END-IF
                COMPUTE 02NUM028TO = 02NUM028TO + 01NUM049(I-CARACT)
                MOVE 1 TO 02NUMF28TO
             ELSE
              IF 02NUMF28TO = 0
                IF FUNCTION NUMVAL(01NUM049(I-CARACT)(1:4)) < 
                   FUNCTION NUMVAL(02NUM028TO(1:4))
                   MOVE 01NUM049(I-CARACT) TO 02NUM028TO
                END-IF
              END-IF
             END-IF
      *** 02NUM029TO *** TOTAL OBLIGACIONES CON ESTADO POSITIVO
             IF 01NUM050(I-CARACT) >= 0
                IF 02NUM029TO < 0
                   MOVE ZEROS TO 02NUM029TO
                END-IF
                COMPUTE 02NUM029TO = 02NUM029TO + 01NUM050(I-CARACT)
                MOVE 1 TO 02NUMF29TO
             ELSE
              IF 02NUMF29TO = 0
                IF FUNCTION NUMVAL(01NUM050(I-CARACT)(1:4)) < 
                   FUNCTION NUMVAL(02NUM029TO(1:4))
                   MOVE 01NUM050(I-CARACT) TO 02NUM029TO
                END-IF
              END-IF
             END-IF
      *** 02NUM030TO *** TOTAL PRODUCTOS CON TERMINO ENTRE 1 Y 6 MESES
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM037(I-CARACT) >= 0
                 IF 02NUM030TO < 0
                    MOVE ZEROS TO 02NUM030TO
                 END-IF
                 COMPUTE 02NUM030TO = 02NUM030TO + 01NUM037(I-CARACT)
                 MOVE 1 TO 02NUMF30TO
              ELSE
               IF 02NUMF30TO = 0
                 IF FUNCTION NUMVAL(01NUM037(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM030TO(1:4))
                    MOVE 01NUM037(I-CARACT) TO 02NUM030TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF30TO = 0 AND 02NUM030TO = ZEROS
                  MOVE "  -1" TO 02NUM030TO(1:4)
               END-IF
             END-IF
      *** 02NUM031TO *** TOTAL PRODUCTOS CON TERMINO ENTRE  7 Y 12 MESES
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM038(I-CARACT) >= 0
                 IF 02NUM031TO < 0
                    MOVE ZEROS TO 02NUM031TO
                 END-IF
                 COMPUTE 02NUM031TO = 02NUM031TO + 01NUM038(I-CARACT)
                 MOVE 1 TO 02NUMF31TO
              ELSE
               IF 02NUMF31TO = 0
                 IF FUNCTION NUMVAL(01NUM038(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM031TO(1:4))
                    MOVE 01NUM038(I-CARACT) TO 02NUM031TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF31TO = 0 AND 02NUM031TO = ZEROS
                  MOVE "  -1" TO 02NUM031TO(1:4)
               END-IF
             END-IF
      *** 02NUM032TO*** TOATAL PRODUCTOS CON TERMINO ENTRE 12 Y 24 MESES
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM039(I-CARACT) >= 0
                 IF 02NUM032TO < 0
                    MOVE ZEROS TO 02NUM032TO
                 END-IF
                 COMPUTE 02NUM032TO = 02NUM032TO + 01NUM039(I-CARACT)
                 MOVE 1 TO 02NUMF32TO
              ELSE
               IF 02NUMF32TO = 0
                 IF FUNCTION NUMVAL(01NUM039(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM032TO(1:4))
                    MOVE 01NUM039(I-CARACT) TO 02NUM032TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF32TO = 0 AND 02NUM032TO = ZEROS
                  MOVE "  -1" TO 02NUM032TO(1:4)
               END-IF
             END-IF
      *** 02NUM033TO *** TOTAL PRODUCTOS CON TERMINO ENTRE 25 Y 36 MESES
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM040(I-CARACT) >= 0
                 IF 02NUM033TO < 0
                    MOVE ZEROS TO 02NUM033TO
                 END-IF
                 COMPUTE 02NUM033TO = 02NUM033TO + 01NUM040(I-CARACT)
                 MOVE 1 TO 02NUMF33TO
              ELSE
               IF 02NUMF33TO = 0
                 IF FUNCTION NUMVAL(01NUM040(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM033TO(1:4))
                    MOVE 01NUM040(I-CARACT) TO 02NUM033TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF33TO = 0 AND 02NUM033TO = ZEROS
                  MOVE "  -1" TO 02NUM033TO(1:4)
               END-IF
             END-IF
      *** 02NUM034TO *** TOTAL PRODUCTOS CON TERMINO ENTRE 37 Y 48 MESES
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM041(I-CARACT) >= 0
                 IF 02NUM034TO < 0
                    MOVE ZEROS TO 02NUM034TO
                 END-IF
                 COMPUTE 02NUM034TO = 02NUM034TO + 01NUM041(I-CARACT)
                 MOVE 1 TO 02NUMF34TO
              ELSE
               IF 02NUMF34TO = 0
                 IF FUNCTION NUMVAL(01NUM041(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM034TO(1:4))
                    MOVE 01NUM041(I-CARACT) TO 02NUM034TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF34TO = 0 AND 02NUM034TO = ZEROS
                  MOVE "  -1" TO 02NUM034TO(1:4)
               END-IF
             END-IF
      *** 02NUM035TO *** TOTAL PRODUCTOS CON TERMINO ENTRE 49 Y 60 MESES
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM042(I-CARACT) >= 0
                 IF 02NUM035TO < 0
                    MOVE ZEROS TO 02NUM035TO
                 END-IF
                 COMPUTE 02NUM035TO = 02NUM035TO + 01NUM042(I-CARACT)
                 MOVE 1 TO 02NUMF35TO
              ELSE
               IF 02NUMF35TO = 0
                 IF FUNCTION NUMVAL(01NUM042(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM035TO(1:4))
                    MOVE 01NUM042(I-CARACT) TO 02NUM035TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF35TO = 0 AND 02NUM035TO = ZEROS
                  MOVE "  -1" TO 02NUM035TO(1:4)
               END-IF
             END-IF
      *** 02NUM036TO *** TOTAL PRODUCTOS CON TERMINO SUPERIOR A 60 MESES
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM043(I-CARACT) >= 0
                 IF 02NUM036TO < 0
                    MOVE ZEROS TO 02NUM036TO
                 END-IF
                 COMPUTE 02NUM036TO = 02NUM036TO + 01NUM043(I-CARACT)
                 MOVE 1 TO 02NUMF36TO
              ELSE
               IF 02NUMF36TO = 0
                 IF FUNCTION NUMVAL(01NUM043(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM036TO(1:4))
                    MOVE 01NUM043(I-CARACT) TO 02NUM036TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF36TO = 0 AND 02NUM036TO = ZEROS
                  MOVE "  -1" TO 02NUM036TO(1:4)
               END-IF
             END-IF
      *** 02NUM037TO *** TOTAL PRODUCTOS CON MADURACION ENTRE  0% y  25%
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM044(I-CARACT) >= 0
                 IF 02NUM037TO < 0
                    MOVE ZEROS TO 02NUM037TO
                 END-IF
                 COMPUTE 02NUM037TO = 02NUM037TO + 01NUM044(I-CARACT)
                 MOVE 1 TO 02NUMF37TO
              ELSE
               IF 02NUMF37TO = 0
                 IF FUNCTION NUMVAL(01NUM044(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM037TO(1:4))
                    MOVE 01NUM044(I-CARACT) TO 02NUM037TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF37TO = 0 AND 02NUM037TO = ZEROS
                  MOVE "  -1" TO 02NUM037TO(1:4)
               END-IF
             END-IF
      *** 02NUM038TO *** TOTAL PRODUCTOS CON MADURACION ENTRE 26% y  50%
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM045(I-CARACT) >= 0
                 IF 02NUM038TO < 0
                    MOVE ZEROS TO 02NUM038TO
                 END-IF 
                 COMPUTE 02NUM038TO = 02NUM038TO + 01NUM045(I-CARACT)
                 MOVE 1 TO 02NUMF38TO
              ELSE
               IF 02NUMF38TO = 0
                 IF FUNCTION NUMVAL(01NUM045(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM038TO(1:4))
                    MOVE 01NUM045(I-CARACT) TO 02NUM038TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF38TO = 0 AND 02NUM038TO = ZEROS
                  MOVE "  -1" TO 02NUM038TO(1:4)
               END-IF
             END-IF
      *** 02NUM039TO *** TOTAL PRODUCTOS CON MADURACION ENTRE 51% y  75%
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM046(I-CARACT) >= 0
                 IF 02NUM039TO < 0
                    MOVE ZEROS TO 02NUM039TO
                 END-IF
                 COMPUTE 02NUM039TO = 02NUM039TO + 01NUM046(I-CARACT)
                 MOVE 1 TO 02NUMF39TO
              ELSE
               IF 02NUMF39TO = 0
                 IF FUNCTION NUMVAL(01NUM046(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM039TO(1:4))
                    MOVE 01NUM046(I-CARACT) TO 02NUM039TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF39TO = 0 AND 02NUM039TO = ZEROS
                  MOVE "  -1" TO 02NUM039TO(1:4)
               END-IF
             END-IF
      *** 02NUM040TO *** TOTAL PRODUCTOS CON MADURACION ENTRE 76% y 100%
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM047(I-CARACT) >= 0
                 IF 02NUM040TO < 0
                    MOVE ZEROS TO 02NUM040TO
                 END-IF
                 COMPUTE 02NUM040TO = 02NUM040TO + 01NUM047(I-CARACT)
                 MOVE 1 TO 02NUMF40TO
              ELSE
               IF 02NUMF40TO = 0
                 IF FUNCTION NUMVAL(01NUM047(I-CARACT)(1:4)) <
                    FUNCTION NUMVAL(02NUM040TO(1:4))
                    MOVE 01NUM047(I-CARACT) TO 02NUM040TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF40TO = 0 AND 02NUM040TO = ZEROS
                  MOVE "  -1" TO 02NUM040TO(1:4)
               END-IF
             END-IF
      *** 02NUM041TO *** TOTAL PRODUCTOS CON MADURACION SUPERIOR AL 100%
             IF I-CARACT = 2 OR 3 OR 4 OR 5 
              IF 01NUM048(I-CARACT) >= 0
                 IF 02NUM041TO < 0
                    MOVE ZEROs TO 02NUM041TO
                 END-IF
                 COMPUTE 02NUM041TO = 02NUM041TO + 01NUM048(I-CARACT)
                 MOVE 1 TO 02NUMF41TO
              ELSE
               IF 02NUMF41TO = 0
                 IF FUNCTION NUMVAL(01NUM048(I-CARACT)(1:4)) < 
                    FUNCTION NUMVAL(02NUM041TO(1:4))
                    MOVE 01NUM048(I-CARACT) TO 02NUM041TO
                 END-IF
               END-IF
              END-IF
             ELSE
               IF 02NUMF41TO = 0 AND 02NUM041TO = ZEROS
                  MOVE "  -1" TO 02NUM041TO(1:4)
               END-IF
             END-IF
      *** 02NUM042 *** PORCENTAJE DE PRODUCTOS ABIERTOS DEL TOTAL
             IF 01NUM001(I-CARACT) > 0 AND 01NUM002(I-CARACT) >= 0
                COMPUTE 02NUM042(I-CARACT) ROUNDED =
                  ((01NUM002(I-CARACT) / 01NUM001(I-CARACT)) * 100)
                COMPUTE 02NUM042T = 02NUM042T + 01NUM001(I-CARACT)
                COMPUTE 02NUM042V = 02NUM042V + 01NUM002(I-CARACT)
             ELSE
                MOVE "    -1" TO 02NUM042(I-CARACT)(1:6)
             END-IF
      *** 02NUM043 *** PORCENTAJE DE PRODUCTOS CERRADOS DEL TOTAL
             IF 01NUM001(I-CARACT) > 0 AND 01NUM005(I-CARACT) >= 0
                COMPUTE 02NUM043(I-CARACT) ROUNDED =
                  ((01NUM005(I-CARACT) / 01NUM001(I-CARACT)) * 100)
                COMPUTE 02NUM043T = 02NUM043T + 01NUM001(I-CARACT)
                COMPUTE 02NUM043V = 02NUM043V + 01NUM005(I-CARACT)
             ELSE
                MOVE "    -1" TO 02NUM043(I-CARACT)(1:6)
             END-IF
      *** 02NUM045 *** PORCENTAJE DE PRODUCTOS CON RECLAMO DEL TOTAL
             IF 01NUM001(I-CARACT) > 0 AND 01NUM007(I-CARACT) >= 0
                COMPUTE 02NUM045(I-CARACT) ROUNDED =
                  ((01NUM007(I-CARACT) / 01NUM001(I-CARACT)) * 100)
                COMPUTE 02NUM045T = 02NUM045T + 01NUM001(I-CARACT)
                COMPUTE 02NUM045V = 02NUM045V + 01NUM007(I-CARACT)
             ELSE
                MOVE "    -1" TO 02NUM045(I-CARACT)(1:6)
             END-IF
      *** 02NUM056 *** PORCENTAJE DE PRODUCTOS CASTIGADOS DEL TOTAL
             IF I-CARACT NOT = 8 AND NOT = 9
              IF 01NUM001(I-CARACT) > 0 AND 01NUM018(I-CARACT) >= 0
                 COMPUTE 02NUM056(I-CARACT) ROUNDED =
                   ((01NUM018(I-CARACT) / 01NUM001(I-CARACT)) * 100)
                 COMPUTE 02NUM056T = 02NUM056T + 01NUM001(I-CARACT)
                 COMPUTE 02NUM056V = 02NUM056V + 01NUM018(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM056(I-CARACT)(1:6)
              END-IF
             ELSE 
                MOVE "   -99" TO 02NUM056(I-CARACT)(1:6)
             END-IF
      *** 02NUM057 *** PORCENTAJE DE PRODUCTOS RECUPERADOS DEL TOTAL
             IF I-CARACT NOT = 8 AND NOT = 9
              IF 01NUM001(I-CARACT) > 0 AND 01NUM019(I-CARACT) >= 0
                 COMPUTE 02NUM057(I-CARACT) ROUNDED =
                   ((01NUM019(I-CARACT) / 01NUM001(I-CARACT)) * 100)
                 COMPUTE 02NUM057T = 02NUM057T + 01NUM001(I-CARACT)
                 COMPUTE 02NUM057V = 02NUM057V + 01NUM019(I-CARACT)
              ELSE
                MOVE "    -1" TO 02NUM057(I-CARACT)(1:6)
              END-IF
             ELSE 
                MOVE "   -99" TO 02NUM057(I-CARACT)(1:6)
             END-IF
      *** 02NUM060 *** PORCENTAJE DE PRODUCTOS EMBARGADOS DEL TOTAL
             IF I-CARACT = 8 OR = 9
              IF 01NUM001(I-CARACT) > 0 AND 01NUM022(I-CARACT) >= 0
                 COMPUTE 02NUM060(I-CARACT) ROUNDED =
                   ((01NUM022(I-CARACT) / 01NUM001(I-CARACT)) * 100)
                 COMPUTE 02NUM060T = 02NUM060T + 01NUM001(I-CARACT)
                 COMPUTE 02NUM060V = 02NUM060V + 01NUM022(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM060(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM060(I-CARACT)(1:6)
             END-IF
      *** 02NUM066 *** PORCENTAJE PRODUCTOS CON TERMINO ENTRE 1 y 6 MESES
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM037(I-CARACT) >= 0
                 COMPUTE 02NUM066(I-CARACT) ROUNDED =
                   ((01NUM037(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM066T = 02NUM066T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM066V = 02NUM066V + 01NUM037(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM066(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM066(I-CARACT)(1:6)
             END-IF
      *** 02NUM067 *** PORCENTAJE PRODUCTOS CON TERMINO ENTRE 7 y 12 MESES
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM038(I-CARACT) >= 0
                 COMPUTE 02NUM067(I-CARACT) ROUNDED =
                   ((01NUM038(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM067T = 02NUM067T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM067V = 02NUM067V + 01NUM038(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM067(I-CARACT)(1:6)
              END-IF
             ELSE 
                MOVE "   -99" TO 02NUM067(I-CARACT)(1:6)
             END-IF
      *** 02NUM068 *** PORCENTAJE PRODUCTOS CON TERMINO ENTRE 12 y 24 MESES
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM039(I-CARACT) >= 0
                 COMPUTE 02NUM068(I-CARACT) ROUNDED =
                   ((01NUM039(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM068T = 02NUM068T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM068V = 02NUM068V + 01NUM039(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM068(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM068(I-CARACT)(1:6)
             END-IF
      *** 02NUM069 *** PORCENTAJE PRODUCTOS CON TERMINO ENTRE 25 y 36 MESES
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM040(I-CARACT) >= 0
                 COMPUTE 02NUM069(I-CARACT) ROUNDED =
                   ((01NUM040(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM069T = 02NUM069T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM069V = 02NUM069V + 01NUM040(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM069(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM069(I-CARACT)(1:6)
             END-IF
      *** 02NUM070 *** PORCENTAJE PRODUCTOS CON TERMINO ENTRE 37 y 48 MESES
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM041(I-CARACT) >= 0
                 COMPUTE 02NUM070(I-CARACT) ROUNDED =
                   ((01NUM041(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM070T = 02NUM070T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM070V = 02NUM070V + 01NUM041(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM070(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM070(I-CARACT)(1:6)
             END-IF
      *** 02NUM071 *** PORCENTAJE PRODUCTOS CON TERMINO ENTRE 49 y 60 MESES
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM042(I-CARACT) >= 0
                 COMPUTE 02NUM071(I-CARACT) ROUNDED =
                   ((01NUM042(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM071T = 02NUM071T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM071V = 02NUM071V + 01NUM042(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM071(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM071(I-CARACT)(1:6)
             END-IF
      *** 02NUM072 *** PORCENTAJE PRODUCTOS CON TERMINO SUPERIOR A 60 MESES
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM043(I-CARACT) >= 0
                 COMPUTE 02NUM072(I-CARACT) ROUNDED =
                   ((01NUM043(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM072T = 02NUM072T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM072V = 02NUM072V + 01NUM043(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM072(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM072(I-CARACT)(1:6)
             END-IF
      *** 02NUM073 *** PORCENTAJE PRODUCTOS CON TERMINO SUPERIOR A 60 MESES
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM044(I-CARACT) >= 0
                 COMPUTE 02NUM073(I-CARACT) ROUNDED =
                   ((01NUM044(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM073T = 02NUM073T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM073V = 02NUM073V + 01NUM044(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM073(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM073(I-CARACT)(1:6)
             END-IF
      *** 02NUM074 *** PORCENTAJE PRODUCTOS CON MADURACION ENTRE 25% y 50%
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM045(I-CARACT) >= 0
                 COMPUTE 02NUM074(I-CARACT) ROUNDED =
                   ((01NUM045(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM074T = 02NUM074T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM074V = 02NUM074V + 01NUM045(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM074(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM074(I-CARACT)(1:6)
             END-IF
      *** 02NUM075 *** PORCENTAJE PRODUCTOS CON MADURACION ENTRE 51% y 75%
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM046(I-CARACT) >= 0
                 COMPUTE 02NUM075(I-CARACT) ROUNDED =
                   ((01NUM046(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM075T = 02NUM075T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM075V = 02NUM075V + 01NUM046(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM075(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM075(I-CARACT)(1:6)
             END-IF
      *** 02NUM076 *** PORCENTAJE PRODUCTOS CON MADURACION ENTRE 76% y 100%
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM047(I-CARACT) >= 0
                 COMPUTE 02NUM076(I-CARACT) ROUNDED =
                   ((01NUM047(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM076T = 02NUM076T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM076V = 02NUM076V + 01NUM047(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM076(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM076(I-CARACT)(1:6)
             END-IF
      *** 02NUM077 *** PORCENTAJE PRODUCTOS CON MADURACION SUPERIOR A 100%
             IF I-CARACT NOT = 1 AND NOT = 6 AND NOT = 8 AND NOT = 9
              IF 01NUM002(I-CARACT) > 0 AND 01NUM048(I-CARACT) >= 0
                 COMPUTE 02NUM077(I-CARACT) ROUNDED =
                   ((01NUM048(I-CARACT) / 01NUM002(I-CARACT)) * 100)
                 COMPUTE 02NUM077T = 02NUM077T + 01NUM002(I-CARACT)
                 COMPUTE 02NUM077V = 02NUM077V + 01NUM048(I-CARACT)
              ELSE
                 MOVE "    -1" TO 02NUM077(I-CARACT)(1:6)
              END-IF
             ELSE
                MOVE "   -99" TO 02NUM077(I-CARACT)(1:6)
             END-IF
      *** 02NUM079 *** PARTICIPACION DEL PORTAFOLIO 1 EN EL TOTAL
      *** 02NUM080 *** PARTICIPACION DEL PORTAFOLIO 2 EN EL TOTAL
      *** 02NUM081 *** PARTICIPACION DEL PORTAFOLIO 3 EN EL TOTAL
      *** 02NUM082 *** PARTICIPACION DEL PORTAFOLIO 4 EN EL TOTAL
      *** 02NUM083 *** PARTICIPACION DEL PORTAFOLIO 5 EN EL TOTAL
      *** 02NUM084 *** PARTICIPACION DEL PORTAFOLIO 6 EN EL TOTAL
      *** 02NUM085 *** PARTICIPACION DEL PORTAFOLIO 7 EN EL TOTAL
      *** 02NUM086 *** PARTICIPACION DEL PORTAFOLIO 8 EN EL TOTAL
      *** 02NUM087 *** PARTICIPACION DEL PORTAFOLIO 9 EN EL TOTAL
             IF 01NUM002(I-CARACT) > 0 
                COMPUTE 02NUM7987 = 02NUM7987 + 01NUM002(I-CARACT)
                IF I-CARACT = 1
                   COMPUTE 02NUM079V = 02NUM079V + 01NUM002(I-CARACT)
                END-IF
                IF I-CARACT = 2
                   COMPUTE 02NUM080V = 02NUM080V + 01NUM002(I-CARACT)
                END-IF
                IF I-CARACT = 3
                   COMPUTE 02NUM081V = 02NUM081V + 01NUM002(I-CARACT)
                END-IF
                IF I-CARACT = 4
                   COMPUTE 02NUM082V = 02NUM082V + 01NUM002(I-CARACT)
                END-IF
                IF I-CARACT = 5
                   COMPUTE 02NUM083V = 02NUM083V + 01NUM002(I-CARACT)
                END-IF
                IF I-CARACT = 6
                   COMPUTE 02NUM084V = 02NUM084V + 01NUM002(I-CARACT)
                END-IF
                IF I-CARACT = 7
                   COMPUTE 02NUM085V = 02NUM085V + 01NUM002(I-CARACT)
                END-IF
                IF I-CARACT = 8
                   COMPUTE 02NUM086V = 02NUM086V + 01NUM002(I-CARACT)
                END-IF
                IF I-CARACT = 9
                   COMPUTE 02NUM087V = 02NUM087V + 01NUM002(I-CARACT)
                END-IF
             END-IF
            END-IF
           END-PERFORM 
      *** CALCULO DE CARACTERISTICAS 02NUM042 A 02NUM077
           IF 02NUM042T > 0
            COMPUTE 02NUM042CB ROUNDED = ((02NUM042V / 02NUM042T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM042CB(1:6)
           END-IF
           IF 02NUM043T > 0
            COMPUTE 02NUM043CB ROUNDED = ((02NUM043V / 02NUM043T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM043CB(1:6)
           END-IF
           IF 02NUM045T > 0
            COMPUTE 02NUM045CB ROUNDED = ((02NUM045V / 02NUM045T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM045CB(1:6)
           END-IF
           IF 02NUM056T > 0
            COMPUTE 02NUM056CB ROUNDED = ((02NUM056V / 02NUM056T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM056CB(1:6)
           END-IF
           IF 02NUM057T > 0
            COMPUTE 02NUM057CB ROUNDED = ((02NUM057V / 02NUM057T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM057CB(1:6)
           END-IF
           IF 02NUM060T > 0
            COMPUTE 02NUM060CB ROUNDED = ((02NUM060V / 02NUM060T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM060CB(1:6)
           END-IF
           IF 02NUM066T > 0
            COMPUTE 02NUM066CB ROUNDED = ((02NUM066V / 02NUM066T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM066CB(1:6)
           END-IF
           IF 02NUM067T > 0
            COMPUTE 02NUM067CB ROUNDED = ((02NUM067V / 02NUM067T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM067CB(1:6)
           END-IF
           IF 02NUM068T > 0
            COMPUTE 02NUM068CB ROUNDED = ((02NUM068V / 02NUM068T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM068CB(1:6)
           END-IF
           IF 02NUM069T > 0
            COMPUTE 02NUM069CB ROUNDED = ((02NUM069V / 02NUM069T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM069CB(1:6)
           END-IF
           IF 02NUM070T > 0
            COMPUTE 02NUM070CB ROUNDED = ((02NUM070V / 02NUM070T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM070CB(1:6)
           END-IF
           IF 02NUM071T > 0
            COMPUTE 02NUM071CB ROUNDED = ((02NUM071V / 02NUM071T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM071CB(1:6)
           END-IF
           IF 02NUM072T > 0
            COMPUTE 02NUM072CB ROUNDED = ((02NUM072V / 02NUM072T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM072CB(1:6)
           END-IF
           IF 02NUM073T > 0
            COMPUTE 02NUM073CB ROUNDED = ((02NUM073V / 02NUM073T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM073CB(1:6)
           END-IF
           IF 02NUM074T > 0
            COMPUTE 02NUM074CB ROUNDED = ((02NUM074V / 02NUM074T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM074CB(1:6)
           END-IF
           IF 02NUM075T > 0
            COMPUTE 02NUM075CB ROUNDED = ((02NUM075V / 02NUM075T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM075CB(1:6)
           END-IF
           IF 02NUM076T > 0
            COMPUTE 02NUM076CB ROUNDED = ((02NUM076V / 02NUM076T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM076CB(1:6)
           END-IF
           IF 02NUM077T > 0
            COMPUTE 02NUM077CB ROUNDED = ((02NUM077V / 02NUM077T) * 100)
           ELSE
            MOVE "    -1" TO 02NUM077CB(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM079V > 0
            COMPUTE 02NUM079MX ROUNDED = ((02NUM079V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM079MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM079MX(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM080V > 0
            COMPUTE 02NUM080MX ROUNDED = ((02NUM080V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM080MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM080MX(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM081V > 0
            COMPUTE 02NUM081MX ROUNDED = ((02NUM081V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM081MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM081MX(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM082V > 0
            COMPUTE 02NUM082MX ROUNDED = ((02NUM082V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM082MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM082MX(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM083V > 0
            COMPUTE 02NUM083MX ROUNDED = ((02NUM083V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM083MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM083MX(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM084V > 0
            COMPUTE 02NUM084MX ROUNDED = ((02NUM084V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM084MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM084MX(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM085V > 0
            COMPUTE 02NUM085MX ROUNDED = ((02NUM085V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM085MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM085MX(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM086V > 0
            COMPUTE 02NUM086MX ROUNDED = ((02NUM086V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM086MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM086MX(1:6)
           END-IF
           IF 02NUM7987 > 0
            IF 02NUM087V > 0
            COMPUTE 02NUM087MX ROUNDED = ((02NUM087V / 02NUM7987) * 100)
            ELSE
               MOVE "    -2" TO 02NUM087MX(1:6)
            END-IF
           ELSE
               MOVE "    -1" TO 02NUM087MX(1:6)
           END-IF.

       2550-1-CALCULA-CARACT-01EXP.
REMARK******************************************************************
REMARK*2550-1-CALCULA-CARACT-01EXP.
REMARK******************************************************************
           PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL J-CARACT > 9
              IF 01EXPTOT(J-CARACT) > 0
                 COMPUTE 01EXP006(J-CARACT) ROUNDED =
                        (01EXPSUM(J-CARACT) / 01EXPTOT(J-CARACT))
              END-IF
           END-PERFORM.

       2300-CALCULA-CARACT-00MOR.
REMARK******************************************************************
REMARK*2300-CALCULA-CARACT-00MOR.
REMARK******************************************************************
           PERFORM 2310-INICIALIZA-00MOR
           MOVE LLAVE-MAES-CREDIT TO 00MORLLV
           MOVE COD-PORTAF-CARACT TO 00MORPTF
           MOVE RUN-DATE-CARACT TO FECHA-TAG-N-CARACT
           MOVE FECHA-APERT-CARACT TO FECHA-APERTURA07-N-CARACT
           PERFORM 2330-NORMALIZA-VECTOR-49
CAVS  ***  DISPLAY "PRU-VEC : " LLAVE-MAES-CREDIT " " V-NOR-CARACT 
      *** 00MOR001 *** PRODUCTO AL DIA A LA FECHA 
      *** 00MOR002 *** PRODUCTO EN MORA DE 30 DIAS A LA FECHA 
      *** 00MOR003 *** PRODUCTO EN MORA DE 60 DIAS A LA FECHA 
      *** 00MOR004 *** PRODUCTO EN MORA DE 90 DIAS A LA FECHA 
      *** 00MOR005 *** PRODUCTO EN MORA DE 120 DIAS O MAS A LA FECHA 
      *** 00MOR006 *** PRODUCTO CASTIGADO A LA FECHA 
      *** 00MOR007 *** PRODUCTO RECUPERADO A LA FECHA 
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO" 
              MOVE ZEROS TO 00MOR001 00MOR002 00MOR003 00MOR004
                            00MOR005 00MOR006 00MOR007
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS AND
RUNDAT              ACT-DATE-CARACT > ZEROS                             RMB0003
RUNDAT              IF FECHA-ESTADO-CARACT - ACT-DATE-CARACT >= 0       RMB0003
RUNDAT                 IF V-NOR-CARACT(I49:1) = 0                       RMB0003
                          MOVE 1 TO 00MOR001
                       END-IF
RUNDAT                 IF V-NOR-CARACT(I49:1) = 1                       RMB0003
                          MOVE 1 TO 00MOR002
                       END-IF
RUNDAT                 IF V-NOR-CARACT(I49:1) = 2                       RMB0003
                          MOVE 1 TO 00MOR003
                       END-IF
RUNDAT                 IF V-NOR-CARACT(I49:1) = 3                       RMB0003
                          MOVE 1 TO 00MOR004
                       END-IF
RUNDAT                 IF V-NOR-CARACT(I49:1) >= 4                      RMB0003
                          MOVE 1 TO 00MOR005
                       END-IF
RUNDAT                 IF V-NOR-CARACT(I49:1) = 7                       RMB0003
                          MOVE 1 TO 00MOR006
                       END-IF
RUNDAT                 IF V-NOR-CARACT(I49:1) = 8                       RMB0003
                          MOVE 1 TO 00MOR007
                       END-IF
                    ELSE
                       MOVE " -4" TO 00MOR001(1:3)
                       MOVE " -4" TO 00MOR002(1:3)
                       MOVE " -4" TO 00MOR003(1:3)
                       MOVE " -4" TO 00MOR004(1:3)
                       MOVE " -4" TO 00MOR005(1:3)
                       MOVE " -4" TO 00MOR006(1:3)
                       MOVE " -4" TO 00MOR007(1:3)
                    END-IF
                 ELSE
                     MOVE " -3" TO 00MOR001(1:3)
                     MOVE " -3" TO 00MOR002(1:3)
                     MOVE " -3" TO 00MOR003(1:3)
                     MOVE " -3" TO 00MOR004(1:3)
                     MOVE " -3" TO 00MOR005(1:3)
                     MOVE " -3" TO 00MOR006(1:3)
                     MOVE " -3" TO 00MOR007(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00MOR001(1:3)
                 MOVE " -2" TO 00MOR002(1:3)
                 MOVE " -2" TO 00MOR003(1:3)
                 MOVE " -2" TO 00MOR004(1:3)
                 MOVE " -2" TO 00MOR005(1:3)
                 MOVE " -2" TO 00MOR006(1:3)
                 MOVE " -2" TO 00MOR007(1:3)
              END-IF
           END-IF.
      *** 00MOR008 *** MORA DEL PRODUCTO A LA FECHA 
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00MOR008
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS AND
RUNDAT              ACT-DATE-CARACT > ZEROS                             RMB0003
RUNDAT              IF FECHA-ESTADO-CARACT - ACT-DATE-CARACT >= 0       RMB0003
RUNDAT                 IF V-NOR-CARACT(I49:1) NUMERIC                   RMB0003
RUNDAT                    MOVE V-NOR-CARACT(I49:1) TO 00MOR008          RMB0003
                       ELSE
                          MOVE "-88" TO 00MOR008(1:3)
                       END-IF
                    ELSE
                       MOVE " -4" TO 00MOR008(1:3)
                    END-IF
                 ELSE
                     MOVE " -3" TO 00MOR008(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00MOR008(1:3)
              END-IF
           END-IF.
      *** 00MOR009 *** MORA MAXIMA HISTORICA DEL PRODUCTO
           MOVE ZEROS TO MORA-CARACT NONUM-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00MOR009
              PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL J-CARACT > 49
                IF V-NOR-CARACT(J-CARACT:1) NUMERIC
                   IF V-NOR-CARACT(J-CARACT:1) > MORA-CARACT
                      MOVE V-NOR-CARACT(J-CARACT:1) TO MORA-CARACT
                   END-IF
                ELSE
                 ADD 1 TO NONUM-CARACT
                END-IF
              END-PERFORM
              IF MORA-CARACT > 0
                 MOVE MORA-CARACT TO 00MOR009 
              ELSE
                IF NONUM-CARACT = 49
                   MOVE  "-88" TO 00MOR009(1:3)
                END-IF
              END-IF
           END-IF.
      *** VALORES PARA CARACTERISTICAS 00MOR0010 A 00MOR014
          MOVE 3 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR010 *** PROD CON APERTURA < 24 MESES Y 3 MESES SIG AL DIA
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" 
            MOVE ZEROS TO 00MOR010
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) >= P-CARACT AND < 24
              IF (MESES-NOVAP-CARACT + 1) >= TOLERANCIA-CARACT
                 COMPUTE I-CARACT = (49 - (MESES-MADUR-CARACT + 1)) + 1
                  IF (I-CARACT + P-CARACT - 1 ) <= 49
                     PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL 
                             J-CARACT > P-CARACT
                       IF V-NOR-CARACT(I-CARACT:1) = 0
                          ADD 1 TO MFLAG-CARACT
                       ELSE
                         IF V-NOR-CARACT(I-CARACT:1) = "."
                           ADD 1 TO NFLAG-CARACT
                         END-IF
                       END-IF
                       ADD 1 TO I-CARACT
                     END-PERFORM
                     IF MFLAG-CARACT > 0 AND
                        MFLAG-CARACT + NFLAG-CARACT = P-CARACT AND
                        NFLAG-CARACT <= TOLERANCIA-CARACT
                        MOVE 1 TO 00MOR010
                     END-IF
                  END-IF
              ELSE
               MOVE " -4" TO 00MOR010(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR010(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR010(1:3)
            END-IF
           END-IF.
      *** 00MOR011 *** PROD CON APERTURA < 24 MESES Y 3 MESES SIG MRA 30
      *** 00MOR012 *** PROD CON APERTURA < 24 MESES Y 3 MESES SIG MRA 60
      *** 00MOR013 *** PROD CON APERTURA < 24 MESES Y 3 MESES SIG MRA 90
      *** 00MOR014 *** PROD CON APERTURA < 24 MESES Y 3 MESES SIG CASTIG 
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR011 00MOR012 00MOR013 00MOR014
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) >= P-CARACT AND < 24
              IF (MESES-NOVAP-CARACT + 1) >= TOLERANCIA-CARACT
                 COMPUTE I-CARACT = (49 - (MESES-MADUR-CARACT + 1)) + 1
                  IF (I-CARACT + P-CARACT - 1 ) <= 49
                     PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                             J-CARACT > P-CARACT 
                       IF V-NOR-CARACT(I-CARACT:1) >= 1
                           MOVE 1 TO 00MOR011
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 2
                           MOVE 1 TO 00MOR012
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 3
                           MOVE 1 TO 00MOR013
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) = 7
                           MOVE 1 TO 00MOR014
                       END-IF
                       ADD 1 TO I-CARACT
                     END-PERFORM
                  END-IF
              ELSE
               MOVE " -4" TO 00MOR011(1:3)
               MOVE " -4" TO 00MOR012(1:3)
               MOVE " -4" TO 00MOR013(1:3)
               MOVE " -4" TO 00MOR014(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR011(1:3)
              MOVE " -3" TO 00MOR012(1:3)
              MOVE " -3" TO 00MOR013(1:3)
              MOVE " -3" TO 00MOR014(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR011(1:3)
             MOVE " -2" TO 00MOR012(1:3)
             MOVE " -2" TO 00MOR013(1:3)
             MOVE " -2" TO 00MOR014(1:3)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0015 A 00MOR020
          MOVE 6 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR015 *** PROD CON APERTURA < 24 MESES Y 6 MESES SIG AL DIA
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR015
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) >= P-CARACT AND < 24
              IF (MESES-NOVAP-CARACT + 1) >= TOLERANCIA-CARACT
                 COMPUTE I-CARACT = (49 - (MESES-MADUR-CARACT + 1)) + 1
                  IF (I-CARACT + P-CARACT - 1 ) <= 49
                     PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                             J-CARACT > P-CARACT
                       IF V-NOR-CARACT(I-CARACT:1) = 0
                          ADD 1 TO MFLAG-CARACT
                       ELSE
                         IF V-NOR-CARACT(I-CARACT:1) = "."
                           ADD 1 TO NFLAG-CARACT
                         END-IF
                       END-IF
                       ADD 1 TO I-CARACT
                     END-PERFORM
                     IF MFLAG-CARACT > 0 AND
                        MFLAG-CARACT + NFLAG-CARACT = P-CARACT AND
                        NFLAG-CARACT <= TOLERANCIA-CARACT
                        MOVE 1 TO 00MOR015
                     END-IF
                  END-IF
              ELSE
               MOVE " -4" TO 00MOR015(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR015(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR015(1:3)
            END-IF
           END-IF.
      *** 00MOR016 *** PROD CON APERTURA < 24 MESES Y 6 MESES SIG MRA 30
      *** 00MOR017 *** PROD CON APERTURA < 24 MESES Y 6 MESES SIG MRA 60
      *** 00MOR018 *** PROD CON APERTURA < 24 MESES Y 6 MESES SIG MRA 90
      *** 00MOR019 *** PROD CON APERTURA < 24 MESES Y 6 MESES SIG MRA 120
      *** 00MOR020 *** PROD CON APERTURA < 24 MESES Y 6 MESES SIG CASTIG
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR016 00MOR017 00MOR018 00MOR019 00MOR020
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) >= P-CARACT AND < 24
              IF (MESES-NOVAP-CARACT + 1) >= TOLERANCIA-CARACT
                 COMPUTE I-CARACT = (49 - (MESES-MADUR-CARACT + 1)) + 1
                  IF (I-CARACT + P-CARACT - 1 ) <= 49
                     PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                             J-CARACT > P-CARACT 
                       IF V-NOR-CARACT(I-CARACT:1) >= 1
                           MOVE 1 TO 00MOR016
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 2
                           MOVE 1 TO 00MOR017
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 3
                           MOVE 1 TO 00MOR018
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 4
                           MOVE 1 TO 00MOR019
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) = 7
                           MOVE 1 TO 00MOR020
                       END-IF
                       ADD 1 TO I-CARACT
                     END-PERFORM
                  END-IF
              ELSE
               MOVE " -4" TO 00MOR016(1:3)
               MOVE " -4" TO 00MOR017(1:3)
               MOVE " -4" TO 00MOR018(1:3)
               MOVE " -4" TO 00MOR019(1:3)
               MOVE " -4" TO 00MOR020(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR016(1:3)
              MOVE " -3" TO 00MOR017(1:3)
              MOVE " -3" TO 00MOR018(1:3)
              MOVE " -3" TO 00MOR019(1:3)
              MOVE " -3" TO 00MOR020(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR016(1:3)
             MOVE " -2" TO 00MOR017(1:3)
             MOVE " -2" TO 00MOR018(1:3)
             MOVE " -2" TO 00MOR019(1:3)
             MOVE " -2" TO 00MOR020(1:3)
            END-IF
           END-IF.
      *** VALORES PARA CARACTERISTICAS 00MOR0021 A 00MOR026
          MOVE 9 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR021 *** PROD CON APERTURA < 24 MESES Y 9 MESES SIG AL DIA
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR021
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) >= P-CARACT AND < 24
              IF (MESES-NOVAP-CARACT + 1) >= TOLERANCIA-CARACT
                 COMPUTE I-CARACT = (49 - (MESES-MADUR-CARACT + 1)) + 1
                  IF (I-CARACT + P-CARACT - 1 ) <= 49
                     PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                             J-CARACT > P-CARACT
                       IF V-NOR-CARACT(I-CARACT:1) = 0
                          ADD 1 TO MFLAG-CARACT
                       ELSE
                         IF V-NOR-CARACT(I-CARACT:1) = "."
                           ADD 1 TO NFLAG-CARACT
                         END-IF
                       END-IF
                       ADD 1 TO I-CARACT
                     END-PERFORM
                     IF MFLAG-CARACT > 0 AND
                        MFLAG-CARACT + NFLAG-CARACT = P-CARACT AND
                        NFLAG-CARACT <= TOLERANCIA-CARACT
                        MOVE 1 TO 00MOR021
                     END-IF
                  END-IF
              ELSE
               MOVE " -4" TO 00MOR021(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR021(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR021(1:3)
            END-IF
           END-IF.
      *** 00MOR022 *** PROD CON APERTURA < 24 MESES Y 9 MESES SIG MRA 30
      *** 00MOR023 *** PROD CON APERTURA < 24 MESES Y 9 MESES SIG MRA 60
      *** 00MOR024 *** PROD CON APERTURA < 24 MESES Y 9 MESES SIG MRA 90
      *** 00MOR025 *** PROD CON APERTURA < 24 MESES Y 9 MESES SIG MRA 120
      *** 00MOR026 *** PROD CON APERTURA < 24 MESES Y 9 MESES SIG CASTIG
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR022 00MOR023 00MOR024 00MOR025 00MOR026
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) >= P-CARACT AND < 24
              IF (MESES-NOVAP-CARACT + 1) >= TOLERANCIA-CARACT
                 COMPUTE I-CARACT = (49 - (MESES-MADUR-CARACT + 1)) + 1
                  IF (I-CARACT + P-CARACT - 1 ) <= 49
                     PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                             J-CARACT > P-CARACT 
                       IF V-NOR-CARACT(I-CARACT:1) >= 1
                           MOVE 1 TO 00MOR022
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 2
                           MOVE 1 TO 00MOR023
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 3
                           MOVE 1 TO 00MOR024
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 4
                           MOVE 1 TO 00MOR025
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) = 7
                           MOVE 1 TO 00MOR026
                       END-IF
                       ADD 1 TO I-CARACT
                     END-PERFORM
                  END-IF
              ELSE
               MOVE " -4" TO 00MOR022(1:3)
               MOVE " -4" TO 00MOR023(1:3)
               MOVE " -4" TO 00MOR024(1:3)
               MOVE " -4" TO 00MOR025(1:3)
               MOVE " -4" TO 00MOR026(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR022(1:3)
              MOVE " -3" TO 00MOR023(1:3)
              MOVE " -3" TO 00MOR024(1:3)
              MOVE " -3" TO 00MOR025(1:3)
              MOVE " -3" TO 00MOR026(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR022(1:3)
             MOVE " -2" TO 00MOR023(1:3)
             MOVE " -2" TO 00MOR024(1:3)
             MOVE " -2" TO 00MOR025(1:3)
             MOVE " -2" TO 00MOR026(1:3)
            END-IF
           END-IF.
      *** VALORES PARA CARACTERISTICAS 00MOR0027 A 00MOR032
          MOVE 12 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR027 *** PROD CON APERTURA < 24 MESES Y 12 MESES SIG AL DIA
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR027
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) >= P-CARACT AND < 24
              IF (MESES-NOVAP-CARACT + 1) >= TOLERANCIA-CARACT
                 COMPUTE I-CARACT = (49 - (MESES-MADUR-CARACT + 1)) + 1
                  IF (I-CARACT + P-CARACT - 1 ) <= 49
                     PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                             J-CARACT > P-CARACT
                       IF V-NOR-CARACT(I-CARACT:1) = 0
                          ADD 1 TO MFLAG-CARACT
                       ELSE
                         IF V-NOR-CARACT(I-CARACT:1) = "."
                           ADD 1 TO NFLAG-CARACT
                         END-IF
                       END-IF
                       ADD 1 TO I-CARACT
                     END-PERFORM
                     IF MFLAG-CARACT > 0 AND
                        MFLAG-CARACT + NFLAG-CARACT = P-CARACT AND
                        NFLAG-CARACT <= TOLERANCIA-CARACT
                        MOVE 1 TO 00MOR027
                     END-IF
                  END-IF
              ELSE
               MOVE " -4" TO 00MOR027(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR027(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR027(1:3)
            END-IF
           END-IF.
      *** 00MOR028 *** PROD CON APERTURA < 24 MESES Y 12 MESES SIG MRA 30
      *** 00MOR029 *** PROD CON APERTURA < 24 MESES Y 12 MESES SIG MRA 60
      *** 00MOR030 *** PROD CON APERTURA < 24 MESES Y 12 MESES SIG MRA 90
      *** 00MOR031 *** PROD CON APERTURA < 24 MESES Y 12 MESES SIG MRA 120
      *** 00MOR032 *** PROD CON APERTURA < 24 MESES Y 12 MESES SIG CASTIG
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR028 00MOR029 00MOR030 00MOR031 00MOR032
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) >= P-CARACT AND < 24
              IF (MESES-NOVAP-CARACT + 1) >= TOLERANCIA-CARACT
                 COMPUTE I-CARACT = (49 - (MESES-MADUR-CARACT + 1)) + 1
                  IF (I-CARACT + P-CARACT - 1 ) <= 49
                     PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                             J-CARACT > P-CARACT 
                       IF V-NOR-CARACT(I-CARACT:1) >= 1
                           MOVE 1 TO 00MOR028
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 2
                           MOVE 1 TO 00MOR029
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 3
                           MOVE 1 TO 00MOR030
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) >= 4
                           MOVE 1 TO 00MOR031
                       END-IF
                       IF V-NOR-CARACT(I-CARACT:1) = 7
                           MOVE 1 TO 00MOR032
                       END-IF
                       ADD 1 TO I-CARACT
                     END-PERFORM
                  END-IF
              ELSE
               MOVE " -4" TO 00MOR028(1:3)
               MOVE " -4" TO 00MOR029(1:3)
               MOVE " -4" TO 00MOR030(1:3)
               MOVE " -4" TO 00MOR031(1:3)
               MOVE " -4" TO 00MOR032(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR028(1:3)
              MOVE " -3" TO 00MOR029(1:3)
              MOVE " -3" TO 00MOR030(1:3)
              MOVE " -3" TO 00MOR031(1:3)
              MOVE " -3" TO 00MOR032(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR028(1:3)
             MOVE " -2" TO 00MOR029(1:3)
             MOVE " -2" TO 00MOR030(1:3)
             MOVE " -2" TO 00MOR031(1:3)
             MOVE " -2" TO 00MOR032(1:3)
            END-IF
           END-IF.
      *** VALORES PARA CARACTERISTICAS 00MOR0033 A 00MOR039
          MOVE 6 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR033 *** PRODUCTO SIEMPRE AL DIA EN LOS ULTIMOS 6 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR033
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) = 0
                       ADD 1 TO MFLAG-CARACT
                    ELSE
                       IF V-NOR-CARACT(I-CARACT:1) = "."
                          ADD 1 TO NFLAG-CARACT
                       END-IF
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MFLAG-CARACT > 0 AND
                     (MFLAG-CARACT + NFLAG-CARACT) = P-CARACT AND
                     NFLAG-CARACT <= TOLERANCIA-CARACT
                     MOVE 1 TO 00MOR033
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR033(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR033(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR033(1:3)
            END-IF
           END-IF.
      *** 00MOR034 *** PRODUCTO CON MORA   30  EN LOS ULTIMOS 6 MESES    
      *** 00MOR035 *** PRODUCTO CON MORA   60  EN LOS ULTIMOS 6 MESES    
      *** 00MOR036 *** PRODUCTO CON MORA   90  EN LOS ULTIMOS 6 MESES    
      *** 00MOR037 *** PRODUCTO CON MORA  120  EN LOS ULTIMOS 6 MESES    
      *** 00MOR038 *** PRODUCTO CASTIGADO      EN LOS ULTIMOS 6 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR034 00MOR035 00MOR036 00MOR037 00MOR038 
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT 
                    IF V-NOR-CARACT(I-CARACT:1) >= 1
                       MOVE 1 TO 00MOR034
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 2
                       MOVE 1 TO 00MOR035
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 3
                       MOVE 1 TO 00MOR036
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 4
                       MOVE 1 TO 00MOR037
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) = 7
                       MOVE 1 TO 00MOR038
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
              ELSE
                MOVE " -4" TO 00MOR034(1:3)
                MOVE " -4" TO 00MOR035(1:3)
                MOVE " -4" TO 00MOR036(1:3)
                MOVE " -4" TO 00MOR037(1:3)
                MOVE " -4" TO 00MOR038(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR034(1:3)
              MOVE " -3" TO 00MOR035(1:3)
              MOVE " -3" TO 00MOR036(1:3)
              MOVE " -3" TO 00MOR037(1:3)
              MOVE " -3" TO 00MOR038(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR034(1:3)
             MOVE " -2" TO 00MOR035(1:3)
             MOVE " -2" TO 00MOR036(1:3)
             MOVE " -2" TO 00MOR037(1:3)
             MOVE " -2" TO 00MOR038(1:3)
            END-IF
           END-IF.
      *** 00MOR039 *** MORA MAXIMA DEL PRODUCT EN LOS ULTIMOS 6 MESES
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT 
                         NONUM-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
            MOVE ZEROS TO 00MOR039
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                   IF V-NOR-CARACT(I-CARACT:1) NUMERIC
                    IF V-NOR-CARACT(I-CARACT:1) > MORA-CARACT
                       MOVE V-NOR-CARACT(I-CARACT:1) TO MORA-CARACT
                    END-IF
                   ELSE
                     ADD 1 TO NONUM-CARACT
                   END-IF
                   ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MORA-CARACT > 0
                     MOVE MORA-CARACT TO 00MOR039
                  ELSE
                    IF NONUM-CARACT = P-CARACT
                       MOVE "-88" TO 00MOR039(1:3)
                    END-IF
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR039(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR039(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR039(1:3)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0040 A 00MOR046
          MOVE 12 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3. 
      *** 00MOR040 *** PRODUCTO SIEMPRE AL DIA EN LOS ULTIMOS 12 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR040
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) = 0
                       ADD 1 TO MFLAG-CARACT
                    ELSE
                       IF V-NOR-CARACT(I-CARACT:1) = "."
                          ADD 1 TO NFLAG-CARACT
                       END-IF
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MFLAG-CARACT > 0 AND
                     (MFLAG-CARACT + NFLAG-CARACT) = P-CARACT AND
                     NFLAG-CARACT <= TOLERANCIA-CARACT
                     MOVE 1 TO 00MOR040
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR040(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR040(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR040(1:3)
            END-IF
           END-IF.
      *** 00MOR041 *** PRODUCTO CON MORA   30  EN LOS ULTIMOS 12 MESES    
      *** 00MOR042 *** PRODUCTO CON MORA   60  EN LOS ULTIMOS 12 MESES    
      *** 00MOR043 *** PRODUCTO CON MORA   90  EN LOS ULTIMOS 12 MESES    
      *** 00MOR044 *** PRODUCTO CON MORA  120  EN LOS ULTIMOS 12 MESES    
      *** 00MOR045 *** PRODUCTO CASTIGADO      EN LOS ULTIMOS 12 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR041 00MOR042 00MOR043 00MOR044 00MOR045 
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) >= 1
                       MOVE 1 TO 00MOR041
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 2
                       MOVE 1 TO 00MOR042
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 3
                       MOVE 1 TO 00MOR043
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 4
                       MOVE 1 TO 00MOR044
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) = 7
                       MOVE 1 TO 00MOR045
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
              ELSE
                MOVE " -4" TO 00MOR041(1:3)
                MOVE " -4" TO 00MOR042(1:3)
                MOVE " -4" TO 00MOR043(1:3)
                MOVE " -4" TO 00MOR044(1:3)
                MOVE " -4" TO 00MOR045(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR041(1:3)
              MOVE " -3" TO 00MOR042(1:3)
              MOVE " -3" TO 00MOR043(1:3)
              MOVE " -3" TO 00MOR044(1:3)
              MOVE " -3" TO 00MOR045(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR041(1:3)
             MOVE " -2" TO 00MOR042(1:3)
             MOVE " -2" TO 00MOR043(1:3)
             MOVE " -2" TO 00MOR044(1:3)
             MOVE " -2" TO 00MOR045(1:3)
            END-IF
           END-IF.
      *** 00MOR046 *** MORA MAXIMA DEL PRODUCT EN LOS ULTIMOS 12 MESES
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
                         NONUM-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
            MOVE ZEROS TO 00MOR046
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                   IF V-NOR-CARACT(I-CARACT:1) NUMERIC
                    IF V-NOR-CARACT(I-CARACT:1) > MORA-CARACT
                       MOVE V-NOR-CARACT(I-CARACT:1) TO MORA-CARACT
                    END-IF
                   ELSE
                     ADD 1 TO NONUM-CARACT
                   END-IF
                   ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MORA-CARACT > 0
                     MOVE MORA-CARACT TO 00MOR046
                  ELSE
                    IF NONUM-CARACT = P-CARACT
                       MOVE  "-88" TO 00MOR046(1:3)
                    END-IF
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR046(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR046(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR046(1:3)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0047 A 00MOR053
          MOVE 18 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR047 *** PRODUCTO SIEMPRE AL DIA EN LOS ULTIMOS 18 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR047
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) = 0
                       ADD 1 TO MFLAG-CARACT
                    ELSE
                       IF V-NOR-CARACT(I-CARACT:1) = "."
                          ADD 1 TO NFLAG-CARACT
                       END-IF
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MFLAG-CARACT > 0 AND
                     (MFLAG-CARACT + NFLAG-CARACT) = P-CARACT AND
                     NFLAG-CARACT <= TOLERANCIA-CARACT
                     MOVE 1 TO 00MOR047
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR047(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR047(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR047(1:3)
            END-IF
           END-IF.
      *** 00MOR048 *** PRODUCTO CON MORA   30  EN LOS ULTIMOS 18 MESES    
      *** 00MOR049 *** PRODUCTO CON MORA   60  EN LOS ULTIMOS 18 MESES    
      *** 00MOR050 *** PRODUCTO CON MORA   90  EN LOS ULTIMOS 18 MESES    
      *** 00MOR051 *** PRODUCTO CON MORA  120  EN LOS ULTIMOS 18 MESES    
      *** 00MOR052 *** PRODUCTO CASTIGADO      EN LOS ULTIMOS 18 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR048 00MOR049 00MOR050 00MOR051 00MOR052 
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) >= 1
                       MOVE 1 TO 00MOR048
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 2
                       MOVE 1 TO 00MOR049
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 3
                       MOVE 1 TO 00MOR050
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 4
                       MOVE 1 TO 00MOR051
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) = 7
                       MOVE 1 TO 00MOR052
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
              ELSE
                MOVE " -4" TO 00MOR048(1:3)
                MOVE " -4" TO 00MOR049(1:3)
                MOVE " -4" TO 00MOR050(1:3)
                MOVE " -4" TO 00MOR051(1:3)
                MOVE " -4" TO 00MOR052(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR048(1:3)
              MOVE " -3" TO 00MOR049(1:3)
              MOVE " -3" TO 00MOR050(1:3)
              MOVE " -3" TO 00MOR051(1:3)
              MOVE " -3" TO 00MOR052(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR048(1:3)
             MOVE " -2" TO 00MOR049(1:3)
             MOVE " -2" TO 00MOR050(1:3)
             MOVE " -2" TO 00MOR051(1:3)
             MOVE " -2" TO 00MOR052(1:3)
            END-IF
           END-IF.
      *** 00MOR053 *** MORA MAXIMA DEL PRODUCT EN LOS ULTIMOS 18 MESES
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
                         NONUM-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
            MOVE ZEROS TO 00MOR053
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                   IF V-NOR-CARACT(I-CARACT:1) NUMERIC
                    IF V-NOR-CARACT(I-CARACT:1) > MORA-CARACT
                       MOVE V-NOR-CARACT(I-CARACT:1) TO MORA-CARACT
                    END-IF
                   ELSE
                      ADD 1 TO NONUM-CARACT
                   END-IF
                   ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MORA-CARACT > 0
                     MOVE MORA-CARACT TO 00MOR053
                  ELSE
                    IF NONUM-CARACT = P-CARACT
                       MOVE "-88" TO 00MOR053(1:3)
                    END-IF
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR053(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR053(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR053(1:3)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0054 A 00MOR060
          MOVE 24 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR054 *** PRODUCTO SIEMPRE AL DIA EN LOS ULTIMOS 24 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR054
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) = 0
                       ADD 1 TO MFLAG-CARACT
                    ELSE
                       IF V-NOR-CARACT(I-CARACT:1) = "."
                          ADD 1 TO NFLAG-CARACT
                       END-IF
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MFLAG-CARACT > 0 AND
                     (MFLAG-CARACT + NFLAG-CARACT) = P-CARACT AND
                     NFLAG-CARACT <= TOLERANCIA-CARACT
                     MOVE 1 TO 00MOR054
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR054(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR054(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR054(1:3)
            END-IF
           END-IF.
      *** 00MOR055 *** PRODUCTO CON MORA   30  EN LOS ULTIMOS 24 MESES    
      *** 00MOR056 *** PRODUCTO CON MORA   60  EN LOS ULTIMOS 24 MESES    
      *** 00MOR057 *** PRODUCTO CON MORA   90  EN LOS ULTIMOS 24 MESES    
      *** 00MOR058 *** PRODUCTO CON MORA  120  EN LOS ULTIMOS 24 MESES    
      *** 00MOR059 *** PRODUCTO CASTIGADO      EN LOS ULTIMOS 24 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR055 00MOR056 00MOR057 00MOR058 00MOR059
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) >= 1
                       MOVE 1 TO 00MOR055
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 2
                       MOVE 1 TO 00MOR056
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 3
                       MOVE 1 TO 00MOR057
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 4
                       MOVE 1 TO 00MOR058
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) = 7
                       MOVE 1 TO 00MOR059
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
              ELSE
                MOVE " -4" TO 00MOR055(1:3)
                MOVE " -4" TO 00MOR056(1:3)
                MOVE " -4" TO 00MOR057(1:3)
                MOVE " -4" TO 00MOR058(1:3)
                MOVE " -4" TO 00MOR059(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR055(1:3)
              MOVE " -3" TO 00MOR056(1:3)
              MOVE " -3" TO 00MOR057(1:3)
              MOVE " -3" TO 00MOR058(1:3)
              MOVE " -3" TO 00MOR059(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR055(1:3)
             MOVE " -2" TO 00MOR056(1:3)
             MOVE " -2" TO 00MOR057(1:3)
             MOVE " -2" TO 00MOR058(1:3)
             MOVE " -2" TO 00MOR059(1:3)
            END-IF
           END-IF.
      *** 00MOR060 *** MORA MAXIMA DEL PRODUCT EN LOS ULTIMOS 24 MESES
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
                         NONUM-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
            MOVE ZEROS TO 00MOR060
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                   IF V-NOR-CARACT(I-CARACT:1) NUMERIC
                    IF V-NOR-CARACT(I-CARACT:1) > MORA-CARACT
                       MOVE V-NOR-CARACT(I-CARACT:1) TO MORA-CARACT
                    END-IF
                   ELSE
                     ADD 1 TO NONUM-CARACT
                   END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MORA-CARACT > 0
                     MOVE MORA-CARACT TO 00MOR060
                  ELSE
                    IF NONUM-CARACT = P-CARACT
                       MOVE "-88" TO 00MOR060(1:3)
                    END-IF
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR060(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR060(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR060(1:3)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0061 A 00MOR067
          MOVE 36 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR061 *** PRODUCTO SIEMPRE AL DIA EN LOS ULTIMOS 36 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR061
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) = 0
                       ADD 1 TO MFLAG-CARACT
                    ELSE
                       IF V-NOR-CARACT(I-CARACT:1) = "."
                          ADD 1 TO NFLAG-CARACT
                       END-IF
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MFLAG-CARACT > 0 AND
                     (MFLAG-CARACT + NFLAG-CARACT) = P-CARACT AND
                     NFLAG-CARACT <= TOLERANCIA-CARACT
                     MOVE 1 TO 00MOR061
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR061(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR061(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR061(1:3)
            END-IF
           END-IF.
      *** 00MOR062 *** PRODUCTO CON MORA   30  EN LOS ULTIMOS 36 MESES    
      *** 00MOR063 *** PRODUCTO CON MORA   60  EN LOS ULTIMOS 36 MESES    
      *** 00MOR064 *** PRODUCTO CON MORA   90  EN LOS ULTIMOS 36 MESES    
      *** 00MOR065 *** PRODUCTO CON MORA  120  EN LOS ULTIMOS 36 MESES    
      *** 00MOR066 *** PRODUCTO CASTIGADO      EN LOS ULTIMOS 36 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR062 00MOR063 00MOR064 00MOR065 00MOR066
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) >= 1
                       MOVE 1 TO 00MOR062
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 2
                       MOVE 1 TO 00MOR063
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 3
                       MOVE 1 TO 00MOR064
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 4
                       MOVE 1 TO 00MOR065
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) = 7
                       MOVE 1 TO 00MOR066
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
              ELSE
                MOVE " -4" TO 00MOR062(1:3)
                MOVE " -4" TO 00MOR063(1:3)
                MOVE " -4" TO 00MOR064(1:3)
                MOVE " -4" TO 00MOR065(1:3)
                MOVE " -4" TO 00MOR066(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR062(1:3)
              MOVE " -3" TO 00MOR063(1:3)
              MOVE " -3" TO 00MOR064(1:3)
              MOVE " -3" TO 00MOR065(1:3)
              MOVE " -3" TO 00MOR066(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR062(1:3)
             MOVE " -2" TO 00MOR063(1:3)
             MOVE " -2" TO 00MOR064(1:3)
             MOVE " -2" TO 00MOR065(1:3)
             MOVE " -2" TO 00MOR066(1:3)
            END-IF
           END-IF.
      *** 00MOR067 *** MORA MAXIMA DEL PRODUCT EN LOS ULTIMOS 36 MESES
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
                         NONUM-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
            MOVE ZEROS TO 00MOR067
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                   IF V-NOR-CARACT(I-CARACT:1) NUMERIC
                    IF V-NOR-CARACT(I-CARACT:1) > MORA-CARACT
                       MOVE V-NOR-CARACT(I-CARACT:1) TO MORA-CARACT
                    END-IF
                   ELSE
                     ADD 1 TO NONUM-CARACT
                   END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MORA-CARACT > 0
                     MOVE MORA-CARACT TO 00MOR067
                  ELSE
                    IF NONUM-CARACT = P-CARACT
                       MOVE "-88" TO 00MOR067(1:3)
                    END-IF
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR067(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR067(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR067(1:3)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0068 A 00MOR074
          MOVE 48 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3.
      *** 00MOR068 *** PRODUCTO SIEMPRE AL DIA EN LOS ULTIMOS 48 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR068
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) = 0
                       ADD 1 TO MFLAG-CARACT
                    ELSE
                       IF V-NOR-CARACT(I-CARACT:1) = "."
                          ADD 1 TO NFLAG-CARACT
                       END-IF
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MFLAG-CARACT > 0 AND
                     (MFLAG-CARACT + NFLAG-CARACT) = P-CARACT AND
                     NFLAG-CARACT <= TOLERANCIA-CARACT
                     MOVE 1 TO 00MOR068
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR068(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR068(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR068(1:3)
            END-IF
           END-IF.
      *** 00MOR069 *** PRODUCTO CON MORA   30  EN LOS ULTIMOS 48 MESES    
      *** 00MOR070 *** PRODUCTO CON MORA   60  EN LOS ULTIMOS 48 MESES    
      *** 00MOR071 *** PRODUCTO CON MORA   90  EN LOS ULTIMOS 48 MESES    
      *** 00MOR072 *** PRODUCTO CON MORA  120  EN LOS ULTIMOS 48 MESES    
      *** 00MOR073 *** PRODUCTO CASTIGADO      EN LOS ULTIMOS 48 MESES    
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR069 00MOR070 00MOR071 00MOR072 00MOR073
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                    IF V-NOR-CARACT(I-CARACT:1) >= 1
                       MOVE 1 TO 00MOR069
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 2
                       MOVE 1 TO 00MOR070
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 3
                       MOVE 1 TO 00MOR071
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) >= 4
                       MOVE 1 TO 00MOR072
                    END-IF
                    IF V-NOR-CARACT(I-CARACT:1) = 7
                       MOVE 1 TO 00MOR073
                    END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
              ELSE
                MOVE " -4" TO 00MOR069(1:3)
                MOVE " -4" TO 00MOR070(1:3)
                MOVE " -4" TO 00MOR071(1:3)
                MOVE " -4" TO 00MOR072(1:3)
                MOVE " -4" TO 00MOR073(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR069(1:3)
              MOVE " -3" TO 00MOR070(1:3)
              MOVE " -3" TO 00MOR071(1:3)
              MOVE " -3" TO 00MOR072(1:3)
              MOVE " -3" TO 00MOR073(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR069(1:3)
             MOVE " -2" TO 00MOR070(1:3)
             MOVE " -2" TO 00MOR071(1:3)
             MOVE " -2" TO 00MOR072(1:3)
             MOVE " -2" TO 00MOR073(1:3)
            END-IF
           END-IF.
      *** 00MOR074 *** MORA MAXIMA DEL PRODUCT EN LOS ULTIMOS 48 MESES
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT MORA-CARACT
                         NONUM-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
            MOVE ZEROS TO 00MOR074
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                  COMPUTE I-CARACT = (48 - P-CARACT) + 1
                  PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                          J-CARACT > P-CARACT
                   IF V-NOR-CARACT(I-CARACT:1) NUMERIC
                    IF V-NOR-CARACT(I-CARACT:1) > MORA-CARACT
                       MOVE V-NOR-CARACT(I-CARACT:1) TO MORA-CARACT
                    END-IF
                   ELSE
                     ADD 1 TO NONUM-CARACT
                   END-IF
                    ADD 1 TO I-CARACT
                  END-PERFORM
                  IF MORA-CARACT > 0
                     MOVE MORA-CARACT TO 00MOR074
                  ELSE
                     IF NONUM-CARACT = P-CARACT
                        MOVE "-88" TO 00MOR074(1:3)
                     END-IF
                  END-IF
              ELSE
                MOVE " -4" TO 00MOR074(1:3)
              END-IF
             ELSE
              MOVE " -3" TO 00MOR074(1:3)
             END-IF
            ELSE
             MOVE " -2" TO 00MOR074(1:3)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0075 A 00MOR079
          MOVE  48 TO P-CARACT
          MOVE 999 TO 00MOR075 00MOR076 00MOR077 00MOR078 00MOR079
      *** 00MOR075 *** MESES DESDE LA MORA  30 MAS RECIENTE EN EL PRODUCTO   
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE 999 TO 00MOR075
              IF MESES-DESAC-CARACT + 1 <= P-CARACT
                  PERFORM VARYING I-CARACT FROM 49 BY -1 UNTIL 
                                  I-CARACT = 0
                    IF V-NOR-CARACT(I-CARACT:1) = 1
                       COMPUTE 00MOR075 = 49 - I-CARACT
                       MOVE 1 TO I-CARACT
                    END-IF
                  END-PERFORM 
              ELSE
                 MOVE " -2" TO 00MOR075(1:3)
              END-IF
           END-IF.
      *** 00MOR076 *** MESES DESDE LA MORA  60 MAS RECIENTE EN EL PRODUCTO   
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE 999 TO 00MOR076
              IF MESES-DESAC-CARACT + 1 <= P-CARACT
                  PERFORM VARYING I-CARACT FROM 49 BY -1 UNTIL
                                  I-CARACT = 0
                    IF V-NOR-CARACT(I-CARACT:1) = 2
                       COMPUTE 00MOR076 = 49 - I-CARACT
                       MOVE 1 TO I-CARACT
                    END-IF
                  END-PERFORM
              ELSE
                 MOVE " -2" TO 00MOR076(1:3)
              END-IF
           END-IF.
      *** 00MOR077 *** MESES DESDE LA MORA  90 MAS RECIENTE EN EL PRODUCTO   
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE 999 TO 00MOR077
              IF MESES-DESAC-CARACT + 1 <= P-CARACT
                  PERFORM VARYING I-CARACT FROM 49 BY -1 UNTIL
                                  I-CARACT = 0
                    IF V-NOR-CARACT(I-CARACT:1) = 3
                       COMPUTE 00MOR077 = 49 - I-CARACT
                       MOVE 1 TO I-CARACT
                    END-IF
                  END-PERFORM
              ELSE
                 MOVE " -2" TO 00MOR077(1:3)
              END-IF
           END-IF.
      *** 00MOR078 *** MESES DESDE LA MORA 120 MAS RECIENTE EN EL PRODUCTO   
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE 999 TO 00MOR078
              IF MESES-DESAC-CARACT + 1 <= P-CARACT
                  PERFORM VARYING I-CARACT FROM 49 BY -1 UNTIL
                                  I-CARACT = 0
                    IF V-NOR-CARACT(I-CARACT:1) = 4 OR 6 OR 7
                       COMPUTE 00MOR078 = 49 - I-CARACT
                       MOVE 1 TO I-CARACT
                    END-IF
                  END-PERFORM
              ELSE
                 MOVE " -2" TO 00MOR078(1:3)
              END-IF
           END-IF.
      *** 00MOR079 *** MESES DESDE EL CASTIGO  MAS RECIENTE EN EL PRODUCTO   
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE 999 TO 00MOR079
              IF MESES-DESAC-CARACT + 1 <= P-CARACT
                  PERFORM VARYING I-CARACT FROM 49 BY -1 UNTIL
                                  I-CARACT = 0
                    IF V-NOR-CARACT(I-CARACT:1) = 7
                       COMPUTE 00MOR079 = 49 - I-CARACT
                       MOVE 1 TO I-CARACT
                    END-IF
                  END-PERFORM
              ELSE
                 MOVE " -2" TO 00MOR079(1:3)
              END-IF
           END-IF.
      *** VALORES PARA CARACTERISTICAS 00MOR0080 A 00MOR085
          MOVE 6 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3
          MOVE 5.217031 TO MAX-CARACT.
      *** 00MOR080 *** PONDERACION DE REPORTE AL DIA EN ULTIMOS 6 MESES   
      *** 00MOR081 *** PONDERACION MORAS  30 O PEOR  EN ULTIMOS 6 MESES 
      *** 00MOR082 *** PONDERACION MORAS  60 O PEOR  EN ULTIMOS 6 MESES 
      *** 00MOR083 *** PONDERACION MORAS  90 O PEOR  EN ULTIMOS 6 MESES 
      *** 00MOR084 *** PONDERACION MORAS 120 O PEOR  EN ULTIMOS 6 MESES 
      *** 00MOR085 *** PONDERACION DE CASTIGOS       EN ULTIMOS 6 MESES 
           PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL 
                   I-CARACT > 49
              MOVE 0 TO V-PONDER-CARACT(I-CARACT)
           END-PERFORM
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT I-CARACT J-CARACT
                         K-CARACT Z-CARACT EXP-CARACT SUMA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" 
            MOVE ZEROS TO 00MOR080 00MOR081 00MOR082 00MOR083
                          00MOR084 00MOR085
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                 COMPUTE I-CARACT = (48 - P-CARACT) + 1
      **** 00MOR080
                 MOVE ZEROS TO K-CARACT Z-CARACT
                            EXP-CARACT SUMA-CARACT
                 PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                   ADD 1 TO K-CARACT
                   IF V-NOR-CARACT(J-CARACT:1) = 0
                      MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                   ELSE
                      MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                      IF V-NOR-CARACT(J-CARACT:1) = "."
                         ADD 1 TO NFLAG-CARACT
                      END-IF
                   END-IF
                 END-PERFORM
                 IF NFLAG-CARACT <= TOLERANCIA-CARACT
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR080
      *             DISPLAY "00MOR080 : " 00MOR080 " " VAL-00MOR-CARACT
      **** 00MOR081
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 1
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR081
      **** 00MOR082
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 2
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR082
      **** 00MOR083
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 3
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR083
      **** 00MOR084
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 4
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR084
      **** 00MOR085
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) = 7
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR085
                 ELSE
                    MOVE "    -4" TO 00MOR080(1:6)
                    MOVE "    -4" TO 00MOR081(1:6)
                    MOVE "    -4" TO 00MOR082(1:6)
                    MOVE "    -4" TO 00MOR083(1:6)
                    MOVE "    -4" TO 00MOR084(1:6)
                    MOVE "    -4" TO 00MOR085(1:6)
                 END-IF
              ELSE
                MOVE "    -4" TO 00MOR080(1:6)
                MOVE "    -4" TO 00MOR081(1:6)
                MOVE "    -4" TO 00MOR082(1:6)
                MOVE "    -4" TO 00MOR083(1:6)
                MOVE "    -4" TO 00MOR084(1:6)
                MOVE "    -4" TO 00MOR085(1:6)
              END-IF
             ELSE
              MOVE "    -3" TO 00MOR080(1:6)
              MOVE "    -3" TO 00MOR081(1:6)
              MOVE "    -3" TO 00MOR082(1:6)
              MOVE "    -3" TO 00MOR083(1:6)
              MOVE "    -3" TO 00MOR084(1:6)
              MOVE "    -3" TO 00MOR085(1:6)
             END-IF
            ELSE
             MOVE "    -2" TO 00MOR080(1:6)
             MOVE "    -2" TO 00MOR081(1:6)
             MOVE "    -2" TO 00MOR082(1:6)
             MOVE "    -2" TO 00MOR083(1:6)
             MOVE "    -2" TO 00MOR084(1:6)
             MOVE "    -2" TO 00MOR085(1:6)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0086 A 00MOR091
          MOVE 12 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3
          MOVE 7.458134171671 TO MAX-CARACT.
      *** 00MOR086 *** PONDERACION DE REPORTE AL DIA EN ULTIMOS 12 MESES   
      *** 00MOR087 *** PONDERACION MORAS  30 O PEOR  EN ULTIMOS 12 MESES 
      *** 00MOR088 *** PONDERACION MORAS  60 O PEOR  EN ULTIMOS 12 MESES 
      *** 00MOR089 *** PONDERACION MORAS  90 O PEOR  EN ULTIMOS 12 MESES 
      *** 00MOR090 *** PONDERACION MORAS 120 O PEOR  EN ULTIMOS 12 MESES 
      *** 00MOR091 *** PONDERACION DE CASTIGOS       EN ULTIMOS 12 MESES 
           PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL
                   I-CARACT > 49
              MOVE 0 TO V-PONDER-CARACT(I-CARACT)
           END-PERFORM
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT I-CARACT J-CARACT
                         K-CARACT Z-CARACT EXP-CARACT SUMA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR086 00MOR087 00MOR088 00MOR089
                          00MOR090 00MOR091
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                 COMPUTE I-CARACT = (48 - P-CARACT) + 1
      **** 00MOR086
                 PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                   ADD 1 TO K-CARACT
                   IF V-NOR-CARACT(J-CARACT:1) = 0
                      MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                   ELSE
                      MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                      IF V-NOR-CARACT(J-CARACT:1) = "."
                         ADD 1 TO NFLAG-CARACT
                      END-IF
                   END-IF
                 END-PERFORM
                 IF NFLAG-CARACT <= TOLERANCIA-CARACT
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR086
      **** 00MOR087
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 1
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR087
      **** 00MOR088
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 2
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR088
      **** 00MOR089
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 3
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR089
      **** 00MOR090
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 4
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR090
      **** 00MOR091
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) = 7
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR091
                 ELSE
                    MOVE "    -4" TO 00MOR086(1:6)
                    MOVE "    -4" TO 00MOR087(1:6)
                    MOVE "    -4" TO 00MOR088(1:6)
                    MOVE "    -4" TO 00MOR089(1:6)
                    MOVE "    -4" TO 00MOR090(1:6)
                    MOVE "    -4" TO 00MOR091(1:6)
                 END-IF
              ELSE
                MOVE "    -4" TO 00MOR086(1:6)
                MOVE "    -4" TO 00MOR087(1:6)
                MOVE "    -4" TO 00MOR088(1:6)
                MOVE "    -4" TO 00MOR089(1:6)
                MOVE "    -4" TO 00MOR090(1:6)
                MOVE "    -4" TO 00MOR091(1:6)
              END-IF
             ELSE
              MOVE "    -3" TO 00MOR086(1:6)
              MOVE "    -3" TO 00MOR087(1:6)
              MOVE "    -3" TO 00MOR088(1:6)
              MOVE "    -3" TO 00MOR089(1:6)
              MOVE "    -3" TO 00MOR090(1:6)
              MOVE "    -3" TO 00MOR091(1:6)
             END-IF
            ELSE
             MOVE "    -2" TO 00MOR086(1:6)
             MOVE "    -2" TO 00MOR087(1:6)
             MOVE "    -2" TO 00MOR088(1:6)
             MOVE "    -2" TO 00MOR089(1:6)
             MOVE "    -2" TO 00MOR090(1:6)
             MOVE "    -2" TO 00MOR091(1:6)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0092 A 00MOR097
          MOVE 18 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3
          MOVE 8.64914828232701 TO MAX-CARACT.
      *** 00MOR092 *** PONDERACION DE REPORTE AL DIA EN ULTIMOS 18 MESES   
      *** 00MOR093 *** PONDERACION MORAS  30 O PEOR  EN ULTIMOS 18 MESES 
      *** 00MOR094 *** PONDERACION MORAS  60 O PEOR  EN ULTIMOS 18 MESES 
      *** 00MOR095 *** PONDERACION MORAS  90 O PEOR  EN ULTIMOS 18 MESES 
      *** 00MOR096 *** PONDERACION MORAS 120 O PEOR  EN ULTIMOS 18 MESES 
      *** 00MOR097 *** PONDERACION DE CASTIGOS       EN ULTIMOS 18 MESES 
           PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL
                   I-CARACT > 49
              MOVE 0 TO V-PONDER-CARACT(I-CARACT)
           END-PERFORM
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT I-CARACT J-CARACT
                         K-CARACT Z-CARACT EXP-CARACT SUMA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR092 00MOR093 00MOR094 00MOR095
                          00MOR096 00MOR097
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                 COMPUTE I-CARACT = (48 - P-CARACT) + 1
      **** 00MOR092
                 PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                   ADD 1 TO K-CARACT
                   IF V-NOR-CARACT(J-CARACT:1) = 0
                      MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                   ELSE
                      MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                      IF V-NOR-CARACT(J-CARACT:1) = "."
                         ADD 1 TO NFLAG-CARACT
                      END-IF
                   END-IF
                 END-PERFORM
                 IF NFLAG-CARACT <= TOLERANCIA-CARACT
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR092
      **** 00MOR093
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 1
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR093
      **** 00MOR094
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 2
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR094
      **** 00MOR095
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 3
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR095
      **** 00MOR096
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 4
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR096
      **** 00MOR097
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) = 7
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR097
                 ELSE
                    MOVE "    -4" TO 00MOR092(1:6)
                    MOVE "    -4" TO 00MOR093(1:6)
                    MOVE "    -4" TO 00MOR094(1:6)
                    MOVE "    -4" TO 00MOR095(1:6)
                    MOVE "    -4" TO 00MOR096(1:6)
                    MOVE "    -4" TO 00MOR097(1:6)
                 END-IF
              ELSE
                MOVE "    -4" TO 00MOR092(1:6)
                MOVE "    -4" TO 00MOR093(1:6)
                MOVE "    -4" TO 00MOR094(1:6)
                MOVE "    -4" TO 00MOR095(1:6)
                MOVE "    -4" TO 00MOR096(1:6)
                MOVE "    -4" TO 00MOR097(1:6)
              END-IF
             ELSE
              MOVE "    -3" TO 00MOR092(1:6)
              MOVE "    -3" TO 00MOR093(1:6)
              MOVE "    -3" TO 00MOR094(1:6)
              MOVE "    -3" TO 00MOR095(1:6)
              MOVE "    -3" TO 00MOR096(1:6)
              MOVE "    -3" TO 00MOR097(1:6)
             END-IF
            ELSE
             MOVE "    -2" TO 00MOR092(1:6)
             MOVE "    -2" TO 00MOR093(1:6)
             MOVE "    -2" TO 00MOR094(1:6)
             MOVE "    -2" TO 00MOR095(1:6)
             MOVE "    -2" TO 00MOR096(1:6)
             MOVE "    -2" TO 00MOR097(1:6)
            END-IF
           END-IF.

      *** VALORES PARA CARACTERISTICAS 00MOR0098 A 00MOR103
          MOVE 24 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3
          MOVE 9.28210201230815 TO MAX-CARACT.
      *** 00MOR098 *** PONDERACION DE REPORTE AL DIA EN ULTIMOS 24 MESES   
      *** 00MOR099 *** PONDERACION MORAS  30 O PEOR  EN ULTIMOS 24 MESES 
      *** 00MOR100 *** PONDERACION MORAS  60 O PEOR  EN ULTIMOS 24 MESES 
      *** 00MOR101 *** PONDERACION MORAS  90 O PEOR  EN ULTIMOS 24 MESES 
      *** 00MOR102 *** PONDERACION MORAS 120 O PEOR  EN ULTIMOS 24 MESES 
      *** 00MOR103 *** PONDERACION DE CASTIGOS       EN ULTIMOS 24 MESES 
           PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL
                   I-CARACT > 49
              MOVE 0 TO V-PONDER-CARACT(I-CARACT)
           END-PERFORM
           MOVE ZEROS TO MFLAG-CARACT NFLAG-CARACT I-CARACT J-CARACT
                         K-CARACT Z-CARACT EXP-CARACT SUMA-CARACT
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
            MOVE ZEROS TO 00MOR098 00MOR099 00MOR100 00MOR101
                          00MOR102 00MOR103
            IF FECHA-APERT-CARACT > ZEROS
             IF (MESES-MADUR-CARACT + 1) > TOLERANCIA-CARACT
              IF MESES-DESAC-CARACT <= P-CARACT
                 COMPUTE I-CARACT = (48 - P-CARACT) + 1
      **** 00MOR098
                 PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                   ADD 1 TO K-CARACT
                   IF V-NOR-CARACT(J-CARACT:1) = 0
                      MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                   ELSE
                      MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                      IF V-NOR-CARACT(J-CARACT:1) = "."
                         ADD 1 TO NFLAG-CARACT
                      END-IF
                   END-IF
                 END-PERFORM
                 IF NFLAG-CARACT <= TOLERANCIA-CARACT
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR098
      **** 00MOR099
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 1
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR099
      **** 00MOR100
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 2
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR100
      **** 00MOR101
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 3
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR101
      **** 00MOR102
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) >= 4
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR102
      **** 00MOR103
                    MOVE ZEROS TO K-CARACT Z-CARACT
                         EXP-CARACT SUMA-CARACT
                    PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                            J-CARACT > 49
                       ADD 1 TO K-CARACT
                       IF V-NOR-CARACT(J-CARACT:1) = 7
                          MOVE 1 TO V-PONDER-CARACT(K-CARACT)
                       ELSE
                          MOVE 0 TO V-PONDER-CARACT(K-CARACT)
                       END-IF
                    END-PERFORM
                    PERFORM 2410-CALCULO-PONDERAC-00MOR
                    MOVE VAL-00MOR-CARACT TO 00MOR103
                 ELSE
                    MOVE "    -4" TO 00MOR098(1:6)
                    MOVE "    -4" TO 00MOR099(1:6)
                    MOVE "    -4" TO 00MOR100(1:6)
                    MOVE "    -4" TO 00MOR101(1:6)
                    MOVE "    -4" TO 00MOR102(1:6)
                    MOVE "    -4" TO 00MOR103(1:6)
                 END-IF
              ELSE
                MOVE "    -4" TO 00MOR098(1:6)
                MOVE "    -4" TO 00MOR099(1:6)
                MOVE "    -4" TO 00MOR100(1:6)
                MOVE "    -4" TO 00MOR101(1:6)
                MOVE "    -4" TO 00MOR102(1:6)
                MOVE "    -4" TO 00MOR103(1:6)
              END-IF
             ELSE
              MOVE "    -3" TO 00MOR098(1:6)
              MOVE "    -3" TO 00MOR099(1:6)
              MOVE "    -3" TO 00MOR100(1:6)
              MOVE "    -3" TO 00MOR101(1:6)
              MOVE "    -3" TO 00MOR102(1:6)
              MOVE "    -3" TO 00MOR103(1:6)
             END-IF
            ELSE
             MOVE "    -2" TO 00MOR098(1:6)
             MOVE "    -2" TO 00MOR099(1:6)
             MOVE "    -2" TO 00MOR100(1:6)
             MOVE "    -2" TO 00MOR101(1:6)
             MOVE "    -2" TO 00MOR102(1:6)
             MOVE "    -2" TO 00MOR103(1:6)
            END-IF
           END-IF.

      *** 00MOR104 *** VECTOR NORMALIZADO DE COMPORTMIENTO 49 POSICIONES
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
ERM104                            "CC" OR "OT" OR "CO"                  RMB0003 
              MOVE V-NOR-CARACT TO 00MOR104 
           END-IF.

       2410-CALCULO-PONDERAC-00MOR.
REMARK******************************************************************
REMARK*2410-CALCULO-PONDERAC-00MOR.
REMARK******************************************************************
           MOVE ZEROS TO VAL-00MOR-CARACT
           PERFORM VARYING L-CARACT FROM 1 BY 1 UNTIL
                          L-CARACT > (P-CARACT + 1)
              COMPUTE Z-CARACT = (P-CARACT + 1) - L-CARACT
              COMPUTE EXP-CARACT = (1 - 0.1 ) ** Z-CARACT
              COMPUTE SUMA-CARACT = SUMA-CARACT +
                      (V-PONDER-CARACT(L-CARACT) * EXP-CARACT)
           END-PERFORM
           IF SUMA-CARACT > 0
              COMPUTE VAL-00MOR-CARACT
                      ROUNDED = ((SUMA-CARACT * 100) / MAX-CARACT )
           END-IF.

       2310-INICIALIZA-00MOR.
REMARK******************************************************************
REMARK*2310-INICIALIZA-00MOR.
REMARK******************************************************************
           MOVE "-99" TO
                00MOR001(1:3) 00MOR002(1:3) 00MOR003(1:3) 00MOR004(1:3)
                00MOR005(1:3) 00MOR006(1:3) 00MOR007(1:3) 00MOR008(1:3)
                00MOR009(1:3) 00MOR010(1:3) 00MOR011(1:3) 00MOR012(1:3)
                00MOR013(1:3) 00MOR014(1:3) 00MOR015(1:3) 00MOR016(1:3)
                00MOR017(1:3) 00MOR018(1:3) 00MOR019(1:3) 00MOR020(1:3)
                00MOR021(1:3) 00MOR022(1:3) 00MOR023(1:3) 00MOR024(1:3)
                00MOR025(1:3) 00MOR026(1:3) 00MOR027(1:3) 00MOR028(1:3)
                00MOR029(1:3) 00MOR030(1:3) 00MOR031(1:3) 00MOR032(1:3)
                00MOR033(1:3) 00MOR034(1:3) 00MOR035(1:3) 00MOR036(1:3)
                00MOR037(1:3) 00MOR038(1:3) 00MOR039(1:3) 00MOR040(1:3)
                00MOR041(1:3) 00MOR042(1:3) 00MOR043(1:3) 00MOR044(1:3)
                00MOR045(1:3) 00MOR046(1:3) 00MOR047(1:3) 00MOR048(1:3)
                00MOR049(1:3) 00MOR050(1:3) 00MOR051(1:3) 00MOR052(1:3)
                00MOR053(1:3) 00MOR054(1:3) 00MOR055(1:3) 00MOR056(1:3)
                00MOR057(1:3) 00MOR058(1:3) 00MOR059(1:3) 00MOR060(1:3)
                00MOR061(1:3) 00MOR062(1:3) 00MOR063(1:3) 00MOR064(1:3)
                00MOR065(1:3) 00MOR066(1:3) 00MOR067(1:3) 00MOR068(1:3)
                00MOR069(1:3) 00MOR070(1:3) 00MOR071(1:3) 00MOR072(1:3)
                00MOR073(1:3) 00MOR074(1:3) 00MOR075(1:3) 00MOR076(1:3)
                00MOR077(1:3) 00MOR078(1:3) 00MOR079(1:3)
           MOVE "   -99" TO
                00MOR080(1:6) 00MOR081(1:6) 00MOR082(1:6) 00MOR083(1:6)
                00MOR084(1:6) 00MOR085(1:6) 00MOR086(1:6) 00MOR087(1:6)
                00MOR088(1:6) 00MOR089(1:6) 00MOR090(1:6) 00MOR091(1:6)
                00MOR092(1:6) 00MOR093(1:6) 00MOR094(1:6) 00MOR095(1:6)
                00MOR096(1:6) 00MOR097(1:6) 00MOR098(1:6) 00MOR099(1:6)
                00MOR100(1:6) 00MOR101(1:6) 00MOR102(1:6) 00MOR103(1:6).

       2330-NORMALIZA-VECTOR-49.
REMARK******************************************************************
REMARK*2330-NORMALIZA-VECTOR-49.
REMARK******************************************************************
           MOVE FEC-NOVEDAD-ABD07 TO FECHA-AUX-N-CARACT
           MOVE FECHA-AUX-N-CARACT(1:2) TO MES-NOV-N-CARACT
           MOVE FECHA-AUX-N-CARACT(3:2) TO ANO-NOV-N-CARACT
           IF ANO-NOV-N-CARACT < 50
              MOVE 20          TO SIG-NOV-N-CARACT
           ELSE
              MOVE 19          TO SIG-NOV-N-CARACT
           END-IF
           MOVE FECHA-ING-ABD02      TO FECHA-AUX-N-CARACT
           MOVE FECHA-AUX-N-CARACT(1:2) TO MES-ING-N-CARACT
           MOVE FECHA-AUX-N-CARACT(3:2) TO ANO-ING-N-CARACT
           IF ANO-ING-N-CARACT < 50
              MOVE 20          TO SIG-ING-N-CARACT
           ELSE
              MOVE 19          TO SIG-ING-N-CARACT
           END-IF
           INITIALIZE V-NOR-CARACT
           MOVE ESTADO-MES-ABD07   TO V-NOR4-CARACT
           MOVE VECTOR-2-ABD07     TO V-NOR3-CARACT
REMARK*REGISTRO CON APERTURA POSTERIOR A ICMCRE DE SAN_ATA O
REMARK*CERRADO ANTES DE FECHA SAN_ATA 
           IF OPEN-ICMCRE-HIST-CARACT = 1  *> VECTORES NO EMPALMADOS AUN
              IF (FECHA-APERT-CARACT > FECHA-RUN-SANATA-CARACT) OR
                 (REG-CERRADO-CARACT = 1 AND
                  FECHA-ESTADO-CARACT <= FECHA-RUN-SANATA-CARACT)
                  MOVE ZEROS TO V-NOR2-CARACT
                  MOVE ZEROS TO V-NOR1-CARACT
              ELSE
                 PERFORM 2335-EMPALMA-VECTOR-49
CAVS  *         IF SW-EMPALMA-VEC-CAR = 0
CAVS  *          DISPLAY "PRU-VEC1: " LLAVE-MAES-CREDIT " " V-NOR-CARACT 
CAVS  *         END-IF
              END-IF
           ELSE
              IF OPEN-ICMCRE-HIST-CARACT = 2  *> VECTORES EMPALMADOS
                 MOVE VECTOR-HIS-3-ABD07 TO V-NOR2-CARACT
                 MOVE VECTOR-HIS-4-ABD07 TO V-NOR1-CARACT
              ELSE                     *> VECTOR SIN HISTORIA O ERROR 
                 MOVE ZEROS TO V-NOR2-CARACT
                 MOVE ZEROS TO V-NOR1-CARACT
              END-IF
           END-IF
REMARK***************************************************************
REMARK* Se calcula si es necesario borrar información inválida      *
REMARK***************************************************************
           IF FECHA-APERTURA07-N-CARACT > FECHA-INGRESO-N-CARACT
              MOVE FECHA-APERTURA07-N-CARACT TO FECHA-INGRESO-N-CARACT
           END-IF
           IF FECHA-NOVEDAD07-N-CARACT > FECHA-INGRESO-N-CARACT
              COMPUTE J-N-CARACT = ( SIG-ANO-NOV-N-CARACT * 12 +
                            MES-NOV-N-CARACT ) - 
                    ( SIG-ANO-ING-N-CARACT * 12 + MES-ING-N-CARACT )
           ELSE
              MOVE 0 TO J-N-CARACT
           END-IF
           IF J-N-CARACT < 48
              COMPUTE J-N-CARACT = 48 - J-N-CARACT
           ELSE
              MOVE 0 TO J-N-CARACT
           END-IF
           PERFORM UNTIL J-N-CARACT = 0
              MOVE "0" TO V-NOR-CARACT(J-N-CARACT:1)
              SUBTRACT 1 FROM J-N-CARACT
           END-PERFORM
REMARK*    CASTIGADAS Y DUDOSO RECAUDO
           IF NOV-REPORT-ABD07 = 45 OR 47                               RMB0110
              IF NOV-REPORT-ABD07 = 47
                 MOVE ALL "D" TO RELLENO-N-CARACT
              ELSE
                 MOVE ALL "C" TO RELLENO-N-CARACT
              END-IF
              MOVE FECHA-SITUACION-ABD07 TO FECHA-SITMMAAAA-ORI-CARACT
              MOVE FECHA-SITAAAA-ORI-CARACT TO FECHA-SITAAAA-CARACT
              MOVE FECHA-SITMM-ORI-CARACT   TO FECHA-SITMM-CARACT
              MOVE FECHA-ACTUALIZ-VALOR-ABD07 TO 
                   FECHA-SITMMAAAA-ORI-CARACT
              MOVE FECHA-SITAAAA-ORI-CARACT  TO FECHA-VALAAAA-CARACT
              MOVE FECHA-SITMM-ORI-CARACT    TO FECHA-VALMM-CARACT
              IF FECHA-VALAAAAMM-CARACT > FECHA-SITAAAAMM-CARACT
                 MOVE FECHA-VALAAAAMM-CARACT TO FECHA-SITAAAAMM-CARACT
              END-IF
              IF FECHA-SITAAAAMM-CARACT  > FECHA-NOVEDAD07-N-CARACT
                 COMPUTE J-N-CARACT = 
                  ( FECHA-SITAAAA-CARACT * 12 + FECHA-SITMM-CARACT ) -
                  ( SIG-ANO-NOV-N-CARACT * 12 + MES-NOV-N-CARACT )
                 IF J-N-CARACT < 48
                    PERFORM UNTIL J-N-CARACT = 0
                       MOVE V-NOR-CARACT(2:47) TO V-NOR-CARACT(1:47)
                       MOVE RELLENO-N-CARACT(1:1) TO V-NOR-CARACT(48:1)
                       SUBTRACT 1 FROM J-N-CARACT
                    END-PERFORM
                 ELSE
                    MOVE RELLENO-N-CARACT TO V-NOR-CARACT(1:48)
                 END-IF
                 MOVE FECHA-SITAAAAMM-CARACT  TO 
                      FECHA-NOVEDAD07-N-CARACT
              END-IF                                                    RMB0110
           END-IF.                                                      RMB0110
REMARK*    ADICIONAR NOVEDAD
           MOVE V-MORA-CARACT(NOV-REPORT-ABD07) TO 
                V-NOV-ACT-CARACT(1:1)
REMARK*    NORMALIZAR
           IF FECHA-TAG-N-CARACT >= FECHA-NOVEDAD07-N-CARACT
              COMPUTE J-N-CARACT = 
                   ( SIG-ANO-TAG-N-CARACT * 12 + MES-TAG-N-CARACT ) -
                   ( SIG-ANO-NOV-N-CARACT * 12 + MES-NOV-N-CARACT )
              IF J-N-CARACT < 49
                 PERFORM UNTIL J-N-CARACT = 0
                   MOVE V-NOR-CARACT(2:48) TO V-NOR-CARACT(1:48)
                   MOVE "0"         TO V-NOR-CARACT(49:1)
                   SUBTRACT 1 FROM J-N-CARACT
                 END-PERFORM
              ELSE
                 MOVE ALL "0"        TO V-NOR-CARACT
              END-IF
           ELSE
              COMPUTE J-N-CARACT = ( SIG-ANO-NOV-N-CARACT * 12 + 
                      MES-NOV-N-CARACT ) - 
                      ( SIG-ANO-TAG-N-CARACT * 12 + MES-TAG-N-CARACT )
              IF J-N-CARACT < 49
                 PERFORM UNTIL J-N-CARACT = 0
                   PERFORM VARYING K-N-CARACT FROM 48 BY -1 UNTIL 
                                                   K-N-CARACT = 0
                     MOVE V-NOR-CARACT(K-N-CARACT:1) TO
                          V-NOR-CARACT(K-N-CARACT + 1:1)
                   END-PERFORM
                   MOVE "0"         TO V-NOR-CARACT(1:1)
                   SUBTRACT 1 FROM J-N-CARACT
                 END-PERFORM
              ELSE
                 MOVE ALL "0" TO V-NOR-CARACT
              END-IF
           END-IF.
REMARK*    REEMPLAZOS
           INSPECT V-NOR-CARACT REPLACING ALL "0" BY "."
           INSPECT V-NOR-CARACT REPLACING ALL "5" BY "0"   *> AL DIA
           INSPECT V-NOR-CARACT REPLACING ALL "P" BY "0"   *> PAGO TOTAL
           INSPECT V-NOR-CARACT REPLACING ALL "7" BY "."
           INSPECT V-NOR-CARACT REPLACING ALL "8" BY "."
           INSPECT V-NOR-CARACT REPLACING ALL "9" BY "."
           INSPECT V-NOR-CARACT REPLACING ALL "M" BY "5"   *> CANCELADA MM
           INSPECT V-NOR-CARACT REPLACING ALL "D" BY "6"   *> DUDOSO RECAUDO
           INSPECT V-NOR-CARACT REPLACING ALL "C" BY "7"   *> CASTIGADA
           INSPECT V-NOR-CARACT REPLACING ALL "R" BY "8".  *> RECUPERADA

       2335-EMPALMA-VECTOR-49.
REMARK******************************************************************
REMARK*2335-EMPALMA-VECTOR-49.
REMARK* TOMA VECTOR 3 Y 4 DE LA BASE DE HISTORICOS 
REMARK******************************************************************
           INITIALIZE LLAVE-MAES-CREDIT-2 SW-EMPALMA-VEC-CAR 
                      FECHA-NOV24-CARACT FECHA-NOV48-CARACT
                      VEC-24-HIST-CARACT
           MOVE FECHA-NOVEDAD07-N-CARACT TO FECHA-NOV24-CARACT
           COMPUTE ANO-NOV24-CARACT = ANO-NOV24-CARACT - 2
           MOVE FECHA-NOVEDAD07-N-CARACT TO FECHA-NOV48-CARACT
           COMPUTE ANO-NOV48-CARACT = ANO-NOV48-CARACT - 4
           IF FECHA-NOVEDAD07-N-CARACT > FECHA-RUN-SANATA-CARACT
              MOVE LLAVE-MAES-CREDIT TO LLAVE-MAES-CREDIT-2
              READ MAESTRO-CREDIT-2 INVALID KEY
                   MOVE 1 TO SW-EMPALMA-VEC-CAR
              END-READ
              IF SW-EMPALMA-VEC-CAR = 0
                 MOVE FEC-NOVEDAD-ABD07-2 TO FECHA-AUX-N-CARACT
                 MOVE FECHA-AUX-N-CARACT(1:2) TO MES-NOV-HIS-CARACT
                 MOVE FECHA-AUX-N-CARACT(3:2) TO ANO-NOV-HIS-CARACT
                 IF ANO-NOV-HIS-CARACT < 50
                    MOVE 20          TO SIG-NOV-HIS-CARACT
                 ELSE
                    MOVE 19          TO SIG-NOV-HIS-CARACT
                 END-IF 
                 IF FECHA-NOVEDAD07-HIS-CARACT <
                    FECHA-NOVEDAD07-N-CARACT AND
                   (ESTADO-MES-ABD07-2 NOT = ZEROS OR 
                    VECTOR-HIS-2-ABD07-2 NOT = ZEROS)
                   IF FECHA-NOVEDAD07-HIS-CARACT > FECHA-NOV48-CARACT
                    MOVE ESTADO-MES-ABD07-2 TO V-NOR2-HIST-CARACT
                    MOVE VECTOR-2-ABD07-2   TO V-NOR1-HIST-CARACT
                    IF FECHA-NOVEDAD07-HIS-CARACT >= FECHA-NOV24-CARACT
                     COMPUTE K-N-CARACT = 
                        (SIG-ANO-NOV-HIS-CARACT * 12 + 
                         MES-NOV-HIS-CARACT) -
                        (ANO-NOV24-CARACT * 12 + MES-NOV24-CARACT)
                     PERFORM UNTIL K-N-CARACT = 0
                       PERFORM VARYING L-N-CARACT FROM 23 BY -1 UNTIL
                                                       L-N-CARACT = 0
                         MOVE VEC-24-HIST-CARACT(L-N-CARACT:1) TO 
                              VEC-24-HIST-CARACT(L-N-CARACT + 1:1)
                       END-PERFORM
                       MOVE 0 TO VEC-24-HIST-CARACT(1:1)
                       SUBTRACT 1 FROM K-N-CARACT
                     END-PERFORM
                     MOVE V-NOR2-HIST-CARACT  TO V-NOR2-CARACT
                     MOVE V-NOR1-HIST-CARACT  TO V-NOR1-CARACT
                    ELSE
                     COMPUTE K-N-CARACT = 
                        (ANO-NOV24-CARACT * 12 + MES-NOV24-CARACT) -
                        (SIG-ANO-NOV-HIS-CARACT * 12 +
                         MES-NOV-HIS-CARACT) 
                     PERFORM UNTIL K-N-CARACT = 0
                       PERFORM VARYING L-N-CARACT FROM 2 BY 1 UNTIL
                                                       L-N-CARACT > 24
                         MOVE VEC-24-HIST-CARACT(L-N-CARACT:1) TO 
                              VEC-24-HIST-CARACT(L-N-CARACT - 1:1)
                       END-PERFORM
                       MOVE 9 TO VEC-24-HIST-CARACT(24:1)
                       SUBTRACT 1 FROM K-N-CARACT
                     END-PERFORM
                       MOVE V-NOR2-HIST-CARACT  TO V-NOR2-CARACT
                       MOVE V-NOR1-HIST-CARACT  TO V-NOR1-CARACT
                    END-IF
                   ELSE
                    MOVE 1 TO SW-EMPALMA-VEC-CAR
                   END-IF
                 ELSE
                   MOVE 1 TO SW-EMPALMA-VEC-CAR
                 END-IF
              END-IF
           ELSE
              MOVE 1 TO SW-EMPALMA-VEC-CAR
           END-IF 
           IF SW-EMPALMA-VEC-CAR = 1
              MOVE ZEROS TO V-NOR2-CARACT
              MOVE ZEROS TO V-NOR1-CARACT
           END-IF.

       2350-CALCULA-CARACT-01MOR.
REMARK******************************************************************
REMARK*2350-CALCULA-CARACT-01MOR.
REMARK******************************************************************
MORDIA*    MOVE COD-PORTAF-CARACT TO 01MORPTF(IND-PORTAF-CARACT).       RMB0008
      *** 01MOR001 *** NUMERO DE PRODUCTOS AL DIA
           IF 00MOR001 > 0
             IF 01MOR001(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR001(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR001(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR001 = 0 OR                                         RMB0008
MORDIA          (01MOR001(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR001(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR001(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR001(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR001(1:3)) < 
                  FUNCTION NUMVAL(01MOR001(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR001(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR001(1:3) TO 01MOR001(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR002 *** NUMERO DE PRODUCTOS EN MORA 30 DIAS A LA FECHA
           IF 00MOR002 > 0
             IF 01MOR002(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR002(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR002(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR002 = 0 OR                                         RMB0008
MORDIA          (01MOR002(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR002(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR002(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR002(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR002(1:3)) < 
                  FUNCTION NUMVAL(01MOR002(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR002(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR002(1:3) TO 01MOR002(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR003 *** NUMERO DE PRODUCTOS EN MORA 60 DIAS A LA FECHA
           IF 00MOR003 > 0
             IF 01MOR003(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR003(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR003(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR003 = 0 OR                                         RMB0008
MORDIA          (01MOR003(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR003(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR003(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR003(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR003(1:3)) < 
                  FUNCTION NUMVAL(01MOR003(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR003(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR003(1:3) TO 01MOR003(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR004 *** NUMERO DE PRODUCTOS EN MORA 90 DIAS A LA FECHA
           IF 00MOR004 > 0
             IF 01MOR004(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR004(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR004(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR004 = 0 OR                                         RMB0008
MORDIA          (01MOR004(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR004(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR004(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR004(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR004(1:3)) < 
                  FUNCTION NUMVAL(01MOR004(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR004(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR004(1:3) TO 01MOR004(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR005 *** NUMERO DE PRODUCTOS EN MORA 120 DIAS O MAS A LA FECHA
           IF 00MOR005 > 0
             IF 01MOR005(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR005(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR005(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR005 = 0 OR                                         RMB0008
MORDIA          (01MOR005(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR005(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR005(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR005(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR005(1:3)) < 
                  FUNCTION NUMVAL(01MOR005(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR005(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR005(1:3) TO 01MOR005(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR006 *** NUMERO DE PRODUCTOS CASTIGADOS A LA FECHA
           IF 00MOR006 > 0
             IF 01MOR006(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR006(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR006(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR006 = 0 OR                                         RMB0008
MORDIA          (01MOR006(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR006(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR006(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR006(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR006(1:3)) < 
                  FUNCTION NUMVAL(01MOR006(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR006(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR006(1:3) TO 01MOR006(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR007 *** NUMERO DE PRODUCTOS RECUPERADOS A LA FECHA
           IF 00MOR007 > 0
             IF 01MOR007(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR007(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR007(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR007 = 0 OR                                         RMB0008
MORDIA          (01MOR007(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR007(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR007(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR007(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR007(1:3)) < 
                  FUNCTION NUMVAL(01MOR007(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR007(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR007(1:3) TO 01MOR007(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR008 *** MORA MAXIMA A LA FECHA
           IF 00MOR008 >= 0
GNT001       IF 01MOR008(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
                MOVE ZEROS TO 01MOR008(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR008 > 01MOR008(IND-PORTAF-CARACT)
                MOVE 00MOR008 TO 01MOR008(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01MOR008(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00MOR008(1:3)) < 
                  FUNCTION NUMVAL(01MOR008(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR008(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR008(1:3) TO 01MOR008(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR009 *** MORA MAXIMA HISTORICA
           IF 00MOR009 >= 0
GNT001       IF 01MOR009(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
                MOVE ZEROS TO 01MOR009(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR009 > 01MOR009(IND-PORTAF-CARACT)
                MOVE 00MOR009 TO 01MOR009(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01MOR009(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00MOR009(1:3)) < 
                  FUNCTION NUMVAL(01MOR009(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR009(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR009(1:3) TO 01MOR009(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR010 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 3 MESES SIGUIENTES ESTEN AL DIA
           IF 00MOR010 > 0
             IF 01MOR010(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR010(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR010(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR010 = 0 OR                                         RMB0008
MORDIA          (01MOR010(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR010(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR010(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR010(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR010(1:3)) < 
                  FUNCTION NUMVAL(01MOR010(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR010(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR010(1:3) TO 01MOR010(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR011 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 3 MESES SIGUIENTES SEA MORA 30
           IF 00MOR011 > 0
             IF 01MOR011(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR011(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR011(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR011 = 0 OR                                         RMB0008
MORDIA          (01MOR011(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR011(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR011(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR011(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR011(1:3)) < 
                  FUNCTION NUMVAL(01MOR011(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR011(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR011(1:3) TO 01MOR011(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR012 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 3 MESES SIGUIENTES SEA MORA 60
           IF 00MOR012 > 0
             IF 01MOR012(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR012(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR012(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR012 = 0 OR                                         RMB0008
MORDIA          (01MOR012(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR012(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR012(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR012(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR012(1:3)) < 
                  FUNCTION NUMVAL(01MOR012(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR012(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR012(1:3) TO 01MOR012(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR013 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 3 MESES SIGUIENTES SEA MORA 90
           IF 00MOR013 > 0
             IF 01MOR013(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR013(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR013(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR013 = 0 OR                                         RMB0008
MORDIA          (01MOR013(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR013(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR013(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR013(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR013(1:3)) < 
                  FUNCTION NUMVAL(01MOR013(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR013(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR013(1:3) TO 01MOR013(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR014 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 3 MESES SIGUIENTES SEA CASTIGADOS
           IF 00MOR014 > 0
             IF 01MOR014(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR014(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR014(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR014 = 0 OR                                         RMB0008
MORDIA          (01MOR014(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR014(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR014(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR014(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR014(1:3)) < 
                  FUNCTION NUMVAL(01MOR014(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR014(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR014(1:3) TO 01MOR014(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR015 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 6 MESES SIGUIENTES ESTE AL DIA   
           IF 00MOR015 > 0
             IF 01MOR015(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR015(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR015(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR015 = 0 OR                                         RMB0008
MORDIA          (01MOR015(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR015(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR015(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR015(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR015(1:3)) < 
                  FUNCTION NUMVAL(01MOR015(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR015(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR015(1:3) TO 01MOR015(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR016 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 6 MESES SIGUIENTES SEA MORA 30   
           IF 00MOR016 > 0
             IF 01MOR016(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR016(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR016(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR016 = 0 OR                                         RMB0008
MORDIA          (01MOR016(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR016(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR016(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR016(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR016(1:3)) < 
                  FUNCTION NUMVAL(01MOR016(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR016(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR016(1:3) TO 01MOR016(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR017 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 6 MESES SIGUIENTES SEA MORA 60   
           IF 00MOR017 > 0
             IF 01MOR017(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR017(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR017(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR017 = 0 OR                                         RMB0008
MORDIA          (01MOR017(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR017(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR017(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR017(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR017(1:3)) < 
                  FUNCTION NUMVAL(01MOR017(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR017(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR017(1:3) TO 01MOR017(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR018 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 6 MESES SIGUIENTES SEA MORA 90   
           IF 00MOR018 > 0
             IF 01MOR018(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR018(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR018(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR018 = 0 OR                                         RMB0008
MORDIA          (01MOR018(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR018(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR018(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR018(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR018(1:3)) < 
                  FUNCTION NUMVAL(01MOR018(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR018(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR018(1:3) TO 01MOR018(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR019 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 6 MESES SIGUIENTES SEA MORA 120+ 
           IF 00MOR019 > 0
             IF 01MOR019(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR019(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR019(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR019 = 0 OR                                         RMB0008
MORDIA          (01MOR019(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR019(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR019(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR019(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR019(1:3)) < 
                  FUNCTION NUMVAL(01MOR019(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR019(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR019(1:3) TO 01MOR019(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR020 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 6 MESES SIGUIENTES SEA MORA CASTIGADO
           IF 00MOR020 > 0
             IF 01MOR020(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR020(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR020(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR020 = 0 OR                                         RMB0008
MORDIA          (01MOR020(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR020(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR020(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR020(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR020(1:3)) < 
                  FUNCTION NUMVAL(01MOR020(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR020(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR020(1:3) TO 01MOR020(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR021 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 9 MESES SIGUIENTES ESTE AL DIA       
           IF 00MOR021 > 0
             IF 01MOR021(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR021(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR021(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR021 = 0 OR                                         RMB0008
MORDIA          (01MOR021(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR021(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR021(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR021(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR021(1:3)) < 
                  FUNCTION NUMVAL(01MOR021(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR021(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR021(1:3) TO 01MOR021(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR022 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 9 MESES SIGUIENTES SEA MORA 30       
           IF 00MOR022 > 0
             IF 01MOR022(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR022(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR022(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR022 = 0 OR                                         RMB0008
MORDIA          (01MOR022(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR022(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR022(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR022(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR022(1:3)) < 
                  FUNCTION NUMVAL(01MOR022(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR022(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR022(1:3) TO 01MOR022(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR023 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 9 MESES SIGUIENTES SEA MORA 60       
           IF 00MOR023 > 0
             IF 01MOR023(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR023(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR023(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR023 = 0 OR                                         RMB0008
MORDIA          (01MOR023(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR023(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR023(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR023(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR023(1:3)) < 
                  FUNCTION NUMVAL(01MOR023(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR023(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR023(1:3) TO 01MOR023(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR024 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 9 MESES SIGUIENTES SEA MORA 90       
           IF 00MOR024 > 0
             IF 01MOR024(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR024(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR024(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR024 = 0 OR                                         RMB0008
MORDIA          (01MOR024(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR024(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR024(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR024(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR024(1:3)) < 
                  FUNCTION NUMVAL(01MOR024(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR024(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR024(1:3) TO 01MOR024(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR025 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 9 MESES SIGUIENTES SEA MORA 120+       
           IF 00MOR025 > 0
             IF 01MOR025(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR025(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR025(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR025 = 0 OR                                         RMB0008
MORDIA          (01MOR025(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR025(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR025(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR025(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR025(1:3)) < 
                  FUNCTION NUMVAL(01MOR025(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR025(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR025(1:3) TO 01MOR025(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR026 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 9 MESES SIGUIENTES SEA CASTIGADO       
           IF 00MOR026 > 0
             IF 01MOR026(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR026(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR026(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR026 = 0 OR                                         RMB0008
MORDIA          (01MOR026(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR026(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR026(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR026(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR026(1:3)) < 
                  FUNCTION NUMVAL(01MOR026(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR026(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR026(1:3) TO 01MOR026(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR027 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 12 MESES SIGUIENTES ESTE AL DIA       
           IF 00MOR027 > 0
             IF 01MOR027(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR027(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR027(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR027 = 0 OR                                         RMB0008
MORDIA          (01MOR027(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR027(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR027(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR027(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR027(1:3)) < 
                  FUNCTION NUMVAL(01MOR027(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR027(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR027(1:3) TO 01MOR027(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR028 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 12 MESES SIGUIENTES SEA MORA 30       
           IF 00MOR028 > 0
             IF 01MOR028(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR028(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR028(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR028 = 0 OR                                         RMB0008
MORDIA          (01MOR028(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR028(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR028(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR028(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR028(1:3)) < 
                  FUNCTION NUMVAL(01MOR028(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR028(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR028(1:3) TO 01MOR028(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR029 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 12 MESES SIGUIENTES SEA MORA 60       
           IF 00MOR029 > 0
             IF 01MOR029(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR029(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR029(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR029 = 0 OR                                         RMB0008
MORDIA          (01MOR029(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR029(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR029(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR029(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR029(1:3)) < 
                  FUNCTION NUMVAL(01MOR029(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR029(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR029(1:3) TO 01MOR029(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR030 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 12 MESES SIGUIENTES SEA MORA 90       
           IF 00MOR030 > 0
             IF 01MOR030(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR030(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR030(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR030 = 0 OR                                         RMB0008
MORDIA          (01MOR030(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR030(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR030(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR030(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR030(1:3)) < 
                  FUNCTION NUMVAL(01MOR030(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR030(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR030(1:3) TO 01MOR030(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR031 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 12 MESES SIGUIENTES SEA MORA 120+       
           IF 00MOR031 > 0
             IF 01MOR031(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR031(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR031(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR031 = 0 OR                                         RMB0008
MORDIA          (01MOR031(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR031(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR031(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR031(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR031(1:3)) < 
                  FUNCTION NUMVAL(01MOR031(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR031(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR031(1:3) TO 01MOR031(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR032 *** NUMERO DE PRODUCTOS CON APERTUA INFERIOS A 24 MESES
      ***              Y DURANTE LOS 12 MESES SIGUIENTES SEA CASTIGADO       
           IF 00MOR032 > 0
             IF 01MOR032(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR032(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR032(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR032 = 0 OR                                         RMB0008
MORDIA          (01MOR032(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR032(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR032(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR032(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR032(1:3)) < 
                  FUNCTION NUMVAL(01MOR032(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR032(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR032(1:3) TO 01MOR032(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR033 *** NUMERO PRODUCTOS SIEMPRE AL DIA  ULTIMOS 6 MESES
           IF 00MOR033 > 0
             IF 01MOR033(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR033(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR033(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR033 = 0 OR                                         RMB0008
MORDIA          (01MOR033(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR033(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR033(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR033(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR033(1:3)) < 
                  FUNCTION NUMVAL(01MOR033(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR033(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR033(1:3) TO 01MOR033(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR034 *** NUMERO PRODUCTOS CON MORA 30 EN ULTIMOS 6 MESES
           IF 00MOR034 > 0
             IF 01MOR034(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR034(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR034(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR034 = 0 OR                                         RMB0008
MORDIA          (01MOR034(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR034(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR034(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR034(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR034(1:3)) < 
                  FUNCTION NUMVAL(01MOR034(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR034(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR034(1:3) TO 01MOR034(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR035 *** NUMERO PRODUCTOS CON MORA 60 EN ULTIMOS 6 MESES
           IF 00MOR035 > 0
             IF 01MOR035(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR035(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR035(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR035 = 0 OR                                         RMB0008
MORDIA          (01MOR035(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR035(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR035(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR035(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR035(1:3)) < 
                  FUNCTION NUMVAL(01MOR035(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR035(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR035(1:3) TO 01MOR035(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR036 *** NUMERO PRODUCTOS CON MORA 90 EN ULTIMOS 6 MESES
           IF 00MOR036 > 0
             IF 01MOR036(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR036(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR036(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR036 = 0 OR                                         RMB0008
MORDIA          (01MOR036(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR036(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR036(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR036(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR036(1:3)) < 
                  FUNCTION NUMVAL(01MOR036(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR036(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR036(1:3) TO 01MOR036(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR037 *** NUMERO PRODUCTOS CON MORA 120 EN ULTIMOS 6 MESES
           IF 00MOR037 > 0
             IF 01MOR037(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR037(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR037(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR037 = 0 OR                                         RMB0008
MORDIA          (01MOR037(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR037(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR037(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR037(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR037(1:3)) < 
                  FUNCTION NUMVAL(01MOR037(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR037(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR037(1:3) TO 01MOR037(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR038 *** NUMERO PRODUCTOS CASTIGADOS   EN ULTIMOS 6 MESES
           IF 00MOR038 > 0
             IF 01MOR038(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR038(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR038(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR038 = 0 OR                                         RMB0008
MORDIA          (01MOR038(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR038(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR038(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR038(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR038(1:3)) < 
                  FUNCTION NUMVAL(01MOR038(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR038(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR038(1:3) TO 01MOR038(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR039 *** MORA MAXIMA EN LOS ULTIMOS 6 MESES
           IF 00MOR039 >= 0
GNT001       IF 01MOR039(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
                MOVE ZEROS TO 01MOR039(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR039 > 01MOR039(IND-PORTAF-CARACT)
                MOVE 00MOR039 TO 01MOR039(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01MOR039(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00MOR039(1:3)) < 
                  FUNCTION NUMVAL(01MOR039(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR039(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR039(1:3) TO 01MOR039(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR040 *** NUMERO PRODUCTOS SIEMPRE AL DIA ULTIMOS 12 MESES
           IF 00MOR040 > 0
             IF 01MOR040(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR040(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR040(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR040 = 0 OR                                         RMB0008
MORDIA          (01MOR040(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR040(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR040(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR040(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR040(1:3)) < 
                  FUNCTION NUMVAL(01MOR040(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR040(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR040(1:3) TO 01MOR040(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR041 *** NUMERO PRODUCTOS COM MORA 30 EN ULTIMOS 12 MESES
           IF 00MOR041 > 0
             IF 01MOR041(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR041(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR041(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR041 = 0 OR                                         RMB0008
MORDIA          (01MOR041(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR041(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR041(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR041(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR041(1:3)) < 
                  FUNCTION NUMVAL(01MOR041(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR041(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR041(1:3) TO 01MOR041(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR042 *** NUMERO PRODUCTOS COM MORA 60 EN ULTIMOS 12 MESES
           IF 00MOR042 > 0
             IF 01MOR042(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR042(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR042(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR042 = 0 OR                                         RMB0008
MORDIA          (01MOR042(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR042(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR042(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR042(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR042(1:3)) < 
                  FUNCTION NUMVAL(01MOR042(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR042(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR042(1:3) TO 01MOR042(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR043 *** NUMERO PRODUCTOS COM MORA 90 EN ULTIMOS 12 MESES
           IF 00MOR043 > 0
             IF 01MOR043(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR043(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR043(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR043 = 0 OR                                         RMB0008
MORDIA          (01MOR043(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR043(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR043(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR043(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR043(1:3)) < 
                  FUNCTION NUMVAL(01MOR043(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR043(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR043(1:3) TO 01MOR043(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR044 *** NUMERO PRODUCTOS CON MORA 120 EN ULTIMOS 12 MESES
           IF 00MOR044 > 0
             IF 01MOR044(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR044(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR044(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR044 = 0 OR                                         RMB0008
MORDIA          (01MOR044(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR044(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR044(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR044(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR044(1:3)) < 
                  FUNCTION NUMVAL(01MOR044(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR044(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR044(1:3) TO 01MOR044(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR045 *** NUMERO PRODUCTOS CASTIGADOS  EN ULTIMOS 12 MESES
           IF 00MOR045 > 0
             IF 01MOR045(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR045(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR045(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR045 = 0 OR                                         RMB0008
MORDIA          (01MOR045(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR045(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR045(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR045(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR045(1:3)) < 
                  FUNCTION NUMVAL(01MOR045(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR045(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR045(1:3) TO 01MOR045(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR046 *** MORA MAXIMA EN LOS ULTIMOS 12 MESES
           IF 00MOR046 >= 0
GNT001       IF 01MOR046(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
                MOVE ZEROS TO 01MOR046(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR046 > 01MOR046(IND-PORTAF-CARACT)
                MOVE 00MOR046 TO 01MOR046(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01MOR046(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00MOR046(1:3)) < 
                  FUNCTION NUMVAL(01MOR046(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR046(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR046(1:3) TO 01MOR046(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR047 *** NUMERO PRODUCTOS SIEMPRE AL DIA ULTIMOS 18 MESES
           IF 00MOR047 > 0
             IF 01MOR047(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR047(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR047(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR047 = 0 OR                                         RMB0008
MORDIA          (01MOR047(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR047(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR047(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR047(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR047(1:3)) < 
                  FUNCTION NUMVAL(01MOR047(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR047(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR047(1:3) TO 01MOR047(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR048 *** NUMERO PRODUCTOS COM MORA 30 ULTIMOS 18 MESES
           IF 00MOR048 > 0
             IF 01MOR048(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR048(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR048(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR048 = 0 OR                                         RMB0008
MORDIA          (01MOR048(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR048(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR048(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR048(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR048(1:3)) < 
                  FUNCTION NUMVAL(01MOR048(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR048(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR048(1:3) TO 01MOR048(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR049*** NUMERO PRODUCTOS COM MORA 60 ULTIMOS 18 MESES
           IF 00MOR049 > 0
             IF 01MOR049(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR049(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR049(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR049 = 0 OR                                         RMB0008
MORDIA          (01MOR049(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR049(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR049(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR049(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR049(1:3)) < 
                  FUNCTION NUMVAL(01MOR049(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR049(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR049(1:3) TO 01MOR049(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR050*** NUMERO PRODUCTOS COM MORA 90 ULTIMOS 18 MESES
           IF 00MOR050 > 0
             IF 01MOR050(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR050(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR050(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR050 = 0 OR                                         RMB0008
MORDIA          (01MOR050(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR050(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR050(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR050(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR050(1:3)) < 
                  FUNCTION NUMVAL(01MOR050(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR050(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR050(1:3) TO 01MOR050(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR051*** NUMERO PRODUCTOS COM MORA 120 ULTIMOS 18 MESES
           IF 00MOR051 > 0
             IF 01MOR051(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR051(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR051(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR051 = 0 OR                                         RMB0008
MORDIA          (01MOR051(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR051(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR051(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR051(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR051(1:3)) < 
                  FUNCTION NUMVAL(01MOR051(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR051(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR051(1:3) TO 01MOR051(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR052*** NUMERO PRODUCTOS CASTIGADOS ULTIMOS 18 MESES
           IF 00MOR052 > 0
             IF 01MOR052(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR052(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR052(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR052 = 0 OR                                         RMB0008
MORDIA          (01MOR052(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR052(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR052(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR052(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR052(1:3)) < 
                  FUNCTION NUMVAL(01MOR052(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR052(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR052(1:3) TO 01MOR052(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR053 *** MORA MAXIMA EN LOS ULTIMOS 18 MESES
           IF 00MOR053 >= 0
GNT001       IF 01MOR053(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
                MOVE ZEROS TO 01MOR053(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR053 > 01MOR053(IND-PORTAF-CARACT)
                MOVE 00MOR053 TO 01MOR053(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01MOR053(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00MOR053(1:3)) < 
                  FUNCTION NUMVAL(01MOR053(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR053(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR053(1:3) TO 01MOR053(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR054*** NUMERO PRODUCTOS SIEMPRE AL DIA ULTIMOS 24 MESES
           IF 00MOR054 > 0
             IF 01MOR054(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR054(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR054(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR054 = 0 OR                                         RMB0008
MORDIA          (01MOR054(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR054(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR054(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR054(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR054(1:3)) < 
                  FUNCTION NUMVAL(01MOR054(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR054(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR054(1:3) TO 01MOR054(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR055*** NUMERO PRODUCTOS COM MORA 30 ULTIMOS 24 MESES
           IF 00MOR055 > 0
             IF 01MOR055(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR055(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR055(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR055 = 0 OR                                         RMB0008
MORDIA          (01MOR055(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR055(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR055(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR055(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR055(1:3)) < 
                  FUNCTION NUMVAL(01MOR055(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR055(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR055(1:3) TO 01MOR055(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR056*** NUMERO PRODUCTOS COM MORA 60 ULTIMOS 24 MESES
           IF 00MOR056 > 0
             IF 01MOR056(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR056(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR056(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR056 = 0 OR                                         RMB0008
MORDIA          (01MOR056(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR056(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR056(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR056(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR056(1:3)) < 
                  FUNCTION NUMVAL(01MOR056(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR056(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR056(1:3) TO 01MOR056(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR057*** NUMERO PRODUCTOS COM MORA 90 ULTIMOS 24 MESES
           IF 00MOR057 > 0
             IF 01MOR057(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR057(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR057(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR057 = 0 OR                                         RMB0008
MORDIA          (01MOR057(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR057(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR057(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR057(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR057(1:3)) < 
                  FUNCTION NUMVAL(01MOR057(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR057(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR057(1:3) TO 01MOR057(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR058*** NUMERO PRODUCTOS COM MORA 120 ULTIMOS 24 MESES
           IF 00MOR058 > 0
             IF 01MOR058(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR058(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR058(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR058 = 0 OR                                         RMB0008
MORDIA          (01MOR058(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR058(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR058(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR058(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR058(1:3)) < 
                  FUNCTION NUMVAL(01MOR058(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR058(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR058(1:3) TO 01MOR058(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR059*** NUMERO PRODUCTOS CASTIGADOS  ULTIMOS 24 MESES
           IF 00MOR059 > 0
             IF 01MOR059(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR059(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR059(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR059 = 0 OR                                         RMB0008
MORDIA          (01MOR059(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR059(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR059(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR059(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR059(1:3)) < 
                  FUNCTION NUMVAL(01MOR059(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR059(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR059(1:3) TO 01MOR059(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR060 *** MORA MAXIMA EN LOS ULTIMOS 24 MESES
           IF 00MOR060 >= 0
GNT001       IF 01MOR060(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
                MOVE ZEROS TO 01MOR060(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR060 > 01MOR060(IND-PORTAF-CARACT)
                MOVE 00MOR060 TO 01MOR060(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01MOR060(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00MOR060(1:3)) < 
                  FUNCTION NUMVAL(01MOR060(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR060(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR060(1:3) TO 01MOR060(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR061*** NUMERO PRODUCTOS SIEMPRE AL DIA ULTIMOS 36 MESES
           IF 00MOR061 > 0
             IF 01MOR061(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR061(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR061(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR061 = 0 OR                                         RMB0008
MORDIA          (01MOR061(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR061(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR061(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR061(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR061(1:3)) < 
                  FUNCTION NUMVAL(01MOR061(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR061(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR061(1:3) TO 01MOR061(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR062*** NUMERO PRODUCTOS CON MORA 30 ULTIMOS 36 MESES
           IF 00MOR062 > 0
             IF 01MOR062(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR062(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR062(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR062 = 0 OR                                         RMB0008
MORDIA          (01MOR062(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR062(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR062(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR062(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR062(1:3)) < 
                  FUNCTION NUMVAL(01MOR062(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR062(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR062(1:3) TO 01MOR062(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR063*** NUMERO PRODUCTOS CON MORA 60 ULTIMOS 36 MESES
           IF 00MOR063 > 0
             IF 01MOR063(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR063(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR063(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR063 = 0 OR                                         RMB0008
MORDIA          (01MOR063(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR063(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR063(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR063(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR063(1:3)) < 
                  FUNCTION NUMVAL(01MOR063(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR063(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR063(1:3) TO 01MOR063(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR064*** NUMERO PRODUCTOS CON MORA 90 ULTIMOS 36 MESES
           IF 00MOR064 > 0
             IF 01MOR064(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR064(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR064(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR064 = 0 OR                                         RMB0008
MORDIA          (01MOR064(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR064(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR064(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR064(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR064(1:3)) < 
                  FUNCTION NUMVAL(01MOR064(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR064(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR064(1:3) TO 01MOR064(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR065*** NUMERO PRODUCTOS CON MORA 120 ULTIMOS 36 MESES
           IF 00MOR065 > 0
             IF 01MOR065(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR065(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR065(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR065 = 0 OR                                         RMB0008
MORDIA          (01MOR065(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR065(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR065(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR065(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR065(1:3)) < 
                  FUNCTION NUMVAL(01MOR065(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR065(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR065(1:3) TO 01MOR065(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR066*** NUMERO PRODUCTOS CASTIGADOS ULTIMOS 36 MESES
           IF 00MOR066 > 0
             IF 01MOR066(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR066(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR066(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR066 = 0 OR                                         RMB0008
MORDIA          (01MOR066(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR066(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR066(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR066(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR066(1:3)) < 
                  FUNCTION NUMVAL(01MOR066(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR066(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR066(1:3) TO 01MOR066(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR067 *** MORA MAXIMA EN LOS ULTIMOS 36 MESES
           IF 00MOR067 >= 0
GNT001       IF 01MOR067(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
                MOVE ZEROS TO 01MOR067(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR067 > 01MOR067(IND-PORTAF-CARACT)
                MOVE 00MOR067 TO 01MOR067(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01MOR067(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00MOR067(1:3)) < 
                  FUNCTION NUMVAL(01MOR067(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR067(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR067(1:3) TO 01MOR067(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR068*** NUMERO PRODUCTOS SIEMPRE AL DIA ULTIMOS 48 MESES
           IF 00MOR068 > 0
             IF 01MOR068(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR068(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR068(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR068 = 0 OR                                         RMB0008
MORDIA          (01MOR068(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR068(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR068(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR068(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR068(1:3)) < 
                  FUNCTION NUMVAL(01MOR068(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR068(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR068(1:3) TO 01MOR068(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR069*** NUMERO PRODUCTOS COM MORA 30 ULTIMOS 48 MESES
           IF 00MOR069 > 0
             IF 01MOR069(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR069(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR069(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR069 = 0 OR                                         RMB0008
MORDIA          (01MOR069(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR069(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR069(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR069(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR069(1:3)) < 
                  FUNCTION NUMVAL(01MOR069(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR069(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR069(1:3) TO 01MOR069(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR070*** NUMERO PRODUCTOS COM MORA 60 ULTIMOS 48 MESES
           IF 00MOR070 > 0
             IF 01MOR070(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR070(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR070(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR070 = 0 OR                                         RMB0008
MORDIA          (01MOR070(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR070(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR070(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR070(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR070(1:3)) < 
                  FUNCTION NUMVAL(01MOR070(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR070(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR070(1:3) TO 01MOR070(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR071*** NUMERO PRODUCTOS COM MORA 90 ULTIMOS 48 MESES
           IF 00MOR071 > 0
             IF 01MOR071(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR071(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR071(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR071 = 0 OR                                         RMB0008
MORDIA          (01MOR071(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR071(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR071(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR071(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR071(1:3)) < 
                  FUNCTION NUMVAL(01MOR071(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR071(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR071(1:3) TO 01MOR071(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR072*** NUMERO PRODUCTOS COM MORA 120 ULTIMOS 48 MESES
           IF 00MOR072 > 0
             IF 01MOR072(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR072(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR072(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR072 = 0 OR                                         RMB0008
MORDIA          (01MOR072(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR072(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR072(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR072(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR072(1:3)) < 
                  FUNCTION NUMVAL(01MOR072(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR072(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR072(1:3) TO 01MOR072(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR073*** NUMERO PRODUCTOS CASTIGADOS ULTIMOS 48 MESES
           IF 00MOR073 > 0
             IF 01MOR073(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01MOR073(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01MOR073(IND-PORTAF-CARACT)
           ELSE
MORDIA       IF 00MOR073 = 0 OR                                         RMB0008
MORDIA          (01MOR073(IND-PORTAF-CARACT) = ZEROS AND                RMB0008
MORDIA           01MORPTF(IND-PORTAF-CARACT) <> ZEROS )                 RMB0008
MORDIA         IF 01MOR073(IND-PORTAF-CARACT) < 0                       RMB0008
MORDIA            MOVE ZEROS TO 01MOR073(IND-PORTAF-CARACT)             RMB0008
MORDIA         END-IF                                                   RMB0008
MORDIA       ELSE                                                       RMB0008
             IF 01MOR073(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR073(1:3)) < 
                  FUNCTION NUMVAL(01MOR073(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR073(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR073(1:3) TO 01MOR073(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR074 *** MORA MAXIMA EN LOS ULTIMOS 48 MESES
           IF 00MOR074 >= 0
GNT001       IF 01MOR074(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
                MOVE ZEROS TO 01MOR074(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR074 > 01MOR074(IND-PORTAF-CARACT)
                MOVE 00MOR074 TO 01MOR074(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01MOR074(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00MOR074(1:3)) < 
                  FUNCTION NUMVAL(01MOR074(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR074(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR074(1:3) TO 01MOR074(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR075 *** MESES DESDE LA MORA 30 DIAS MAS RECIENTE
           IF 00MOR075 >= 0
             MOVE 1 TO 01MORF75(IND-PORTAF-CARACT)
             IF 01MOR075(IND-PORTAF-CARACT) < 0 
                MOVE 999 TO 01MOR075(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR075 < 01MOR075(IND-PORTAF-CARACT)
                MOVE 00MOR075 TO 01MOR075(IND-PORTAF-CARACT)
             END-IF
           ELSE
             IF 01MORF75(IND-PORTAF-CARACT) = 0
               IF FUNCTION NUMVAL(00MOR075(1:3)) < 
                  FUNCTION NUMVAL(01MOR075(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01MOR075(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR075(1:3) TO 01MOR075(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR076 *** MESES DESDE LA MORA 60 DIAS MAS RECIENTE
           IF 00MOR076 >= 0
             MOVE 1 TO 01MORF76(IND-PORTAF-CARACT)
             IF 01MOR076(IND-PORTAF-CARACT) < 0
                MOVE 999 TO 01MOR076(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR076 < 01MOR076(IND-PORTAF-CARACT)
                MOVE 00MOR076 TO 01MOR076(IND-PORTAF-CARACT)
             END-IF
           ELSE
             IF 01MORF76(IND-PORTAF-CARACT) = 0
               IF FUNCTION NUMVAL(00MOR076(1:3)) < 
                  FUNCTION NUMVAL(01MOR076(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR076(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR076(1:3) TO 01MOR076(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR077 *** MESES DESDE LA MORA 90 DIAS MAS RECIENTE
           IF 00MOR077 >= 0
             MOVE 1 TO 01MORF77(IND-PORTAF-CARACT)
             IF 01MOR077(IND-PORTAF-CARACT) < 0
                MOVE 999 TO 01MOR077(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR077 < 01MOR077(IND-PORTAF-CARACT)
                MOVE 00MOR077 TO 01MOR077(IND-PORTAF-CARACT)
             END-IF
           ELSE
             IF 01MORF77(IND-PORTAF-CARACT) = 0
               IF FUNCTION NUMVAL(00MOR077(1:3)) < 
                  FUNCTION NUMVAL(01MOR077(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR077(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR077(1:3) TO 01MOR077(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR078 *** MESES DESDE LA MORA 120 DIAS MAS RECIENTE
           IF 00MOR078 >= 0
             MOVE 1 TO 01MORF78(IND-PORTAF-CARACT)
             IF 01MOR078(IND-PORTAF-CARACT) < 0
                MOVE 999 TO 01MOR078(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR078 < 01MOR078(IND-PORTAF-CARACT)
                MOVE 00MOR078 TO 01MOR078(IND-PORTAF-CARACT)
             END-IF
           ELSE
             IF 01MORF78(IND-PORTAF-CARACT) = 0 
               IF FUNCTION NUMVAL(00MOR078(1:3)) < 
                  FUNCTION NUMVAL(01MOR078(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR078(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR078(1:3) TO 01MOR078(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01MOR079 *** MESES DESDE EL CASTIGO MAS RECIENTE
           IF 00MOR079 >= 0
             MOVE 1 TO 01MORF79(IND-PORTAF-CARACT)
             IF 01MOR079(IND-PORTAF-CARACT) < 0
                MOVE 999 TO 01MOR079(IND-PORTAF-CARACT)
             END-IF
             IF 00MOR079 < 01MOR079(IND-PORTAF-CARACT)
                MOVE 00MOR079 TO 01MOR079(IND-PORTAF-CARACT)
             END-IF
           ELSE
             IF 01MORF79(IND-PORTAF-CARACT) = 0 
               IF FUNCTION NUMVAL(00MOR079(1:3)) < 
                  FUNCTION NUMVAL(01MOR079(IND-PORTAF-CARACT)(2:3))
                 MOVE " " TO 01MOR079(IND-PORTAF-CARACT)(1:1)
                 MOVE 00MOR079(1:3) TO 01MOR079(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** CALCULO PARA CARACTERISITICAS 01MOR080 A 01MOR085
           MOVE 6 TO P-CARACT
           COMPUTE I-CARACT = (48 - P-CARACT ) + 1
      *** 01MOR080 *** PONDERACION REPORTE AL DIA ULTIMOS 6 MESES
           IF 00MOR080 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,1)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,1,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,1,K-CARACT)
                 END-IF   
              END-PERFORM
           ELSE
             IF 01MOR080(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR080(1:6)) < 
                  FUNCTION NUMVAL(01MOR080(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR080(1:6) TO 01MOR080(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR081 *** PONDERACION MORAS 30 O PEOR EN ULTIMOS 6 MESES
           IF 00MOR081 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,2)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,2,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,2,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR081(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR081(1:6)) < 
                  FUNCTION NUMVAL(01MOR081(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR081(1:6) TO 01MOR081(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR082 *** PONDERACION MORAS 60 O PEOR EN ULTIMOS 6 MESES
           IF 00MOR082 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,3)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,3,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,3,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR082(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR082(1:6)) < 
                  FUNCTION NUMVAL(01MOR082(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR082(1:6) TO 01MOR082(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR083 *** PONDERACION MORAS 90 O PEOR EN ULTIMOS 6 MESES
           IF 00MOR083 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,4)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,4,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,4,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR083(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR083(1:6)) < 
                  FUNCTION NUMVAL(01MOR083(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR083(1:6) TO 01MOR083(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR084 *** PONDERACION MORAS 120 O PEOR EN ULTIMOS 6 MESES
           IF 00MOR084 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,5)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,5,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,5,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR084(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR084(1:6)) < 
                  FUNCTION NUMVAL(01MOR084(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR084(1:6) TO 01MOR084(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR085 *** PONDERACION DE CASTIGOD EN ULTIMOS 6 MESES
           IF 00MOR085 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,6)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,6,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,6,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR085(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR085(1:6)) < 
                  FUNCTION NUMVAL(01MOR085(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR085(1:6) TO 01MOR085(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** CALCULO PARA CARACTERISITICAS 01MOR086 A 01MOR091
           MOVE 12 TO P-CARACT
           COMPUTE I-CARACT = (48 - P-CARACT ) + 1
      *** 01MOR086 *** PONDERACION REPORTE AL DIA ULTIMOS 12 MESES
           IF 00MOR086 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,7)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,7,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,7,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR086(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR086(1:6) )< 
                  FUNCTION NUMVAL(01MOR086(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR086(1:6) TO 01MOR086(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR087 *** PONDERACION MORA 30 O PEOR EN ULTIMOS 12 MESES
           IF 00MOR087 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,8)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,8,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,8,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR087(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR087(1:6)) < 
                  FUNCTION NUMVAL(01MOR087(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR087(1:6) TO 01MOR087(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR088 *** PONDERACION MORA 60 O PEOR EN ULTIMOS 12 MESES
           IF 00MOR088 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,9)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,9,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,9,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR088(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR088(1:6)) < 
                  FUNCTION NUMVAL(01MOR088(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR088(1:6) TO 01MOR088(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR089 *** PONDERACION MORA 90 O PEOR EN ULTIMOS 12 MESES
           IF 00MOR089 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,10)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,10,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,10,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR089(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR089(1:6)) < 
                  FUNCTION NUMVAL(01MOR089(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR089(1:6) TO 01MOR089(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR090 *** PONDERACION MORA 120 O PEOR EN ULTIMOS 12 MESES
           IF 00MOR090 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,11)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,11,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,11,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR090(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR090(1:6)) < 
                  FUNCTION NUMVAL(01MOR090(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR090(1:6) TO 01MOR090(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR091 *** PONDERACION CASTIGOS EN ULTIMOS 12 MESES
           IF 00MOR091 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,12)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,12,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,12,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR091(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR091(1:6)) < 
                  FUNCTION NUMVAL(01MOR091(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR091(1:6) TO 01MOR091(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** CALCULO PARA CARACTERISITICAS 01MOR092 A 01MOR097
           MOVE 18 TO P-CARACT
           COMPUTE I-CARACT = (48 - P-CARACT ) + 1
      *** 01MOR092 *** PONDERACION REPORTE AL DIA ULTIMOS 18 MESES
           IF 00MOR092 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,13)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,13,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,13,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR092(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR092(1:6)) < 
                  FUNCTION NUMVAL(01MOR092(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR092(1:6) TO 01MOR092(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR093 *** PONDERACION DE MORA 30 DIAS ULTIMOS 18 MESES
           IF 00MOR093 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,14)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,14,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,14,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR093(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR093(1:6)) < 
                  FUNCTION NUMVAL(01MOR093(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR093(1:6) TO 01MOR093(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR094 *** PONDERACION DE MORA 60 DIAS ULTIMOS 18 MESES
           IF 00MOR094 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,15)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,15,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,15,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR094(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR094(1:6)) < 
                  FUNCTION NUMVAL(01MOR094(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR094(1:6) TO 01MOR094(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR095 *** PONDERACION DE MORA 90 DIAS ULTIMOS 18 MESES
           IF 00MOR095 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,16)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,16,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,16,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR095(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR095(1:6)) < 
                  FUNCTION NUMVAL(01MOR095(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR095(1:6) TO 01MOR095(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR096 *** PONDERACION DE MORA 120 DIAS ULTIMOS 18 MESES
           IF 00MOR096 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,17)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,17,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,17,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR096(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR096(1:6)) < 
                  FUNCTION NUMVAL(01MOR096(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR096(1:6) TO 01MOR096(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR097 *** PONDERACION DE CASTIGOS ULTIMOS 18 MESES
           IF 00MOR097 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,18)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,18,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,18,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR097(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR097(1:6)) < 
                  FUNCTION NUMVAL(01MOR097(IND-PORTAF-CARACT)(4:6))
                 MOVE 00MOR097(1:6) TO 01MOR097(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** CALCULO PARA CARACTERISITICAS 01MOR098 A 01MOR103
           MOVE 24 TO P-CARACT
           COMPUTE I-CARACT = (48 - P-CARACT ) + 1
      *** 01MOR098 *** PONDERACION REPORTE AL DIA ULTIMOS 24 MESES
           IF 00MOR098 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,19)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,19,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,19,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR098(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR098(1:6)) < 
                  FUNCTION NUMVAL(01MOR098(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR098(1:6) TO 01MOR098(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR099 *** PONDERACION DE MORA 30 DIAS ULTIMOS 24 MESES
           IF 00MOR099 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,20)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,20,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,20,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR099(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR099(1:6)) < 
                  FUNCTION NUMVAL(01MOR099(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR099(1:6) TO 01MOR099(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR100 *** PONDERACION DE MORA 60 DIAS ULTIMOS 24 MESES
           IF 00MOR100 >= 0
              MOVE 0 TO K-CARACT
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,21)
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,21,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,21,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR100(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR100(1:6)) < 
                  FUNCTION NUMVAL(01MOR100(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR100(1:6) TO 01MOR100(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR101 *** PONDERACION DE MORA 90 DIAS ULTIMOS 24 MESES
           IF 00MOR101 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,22)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,22,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,22,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR101(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR101(1:6)) < 
                  FUNCTION NUMVAL(01MOR101(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR101(1:6) TO 01MOR101(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR102 *** PONDERACION DE MORA 120 DIAS ULTIMOS 24 MESES
           IF 00MOR102 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,23)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,23,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,23,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR102(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR102(1:6)) < 
                  FUNCTION NUMVAL(01MOR102(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR102(1:6) TO 01MOR102(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF
      *** 01MOR103 *** PONDERACION DE CASTIGOS ULTIMOS 24 MESES
           IF 00MOR103 >= 0
              MOVE 1 TO SW-CMP-CARACT(IND-PORTAF-CARACT,24)
              MOVE 0 TO K-CARACT
              PERFORM VARYING J-CARACT FROM I-CARACT BY 1 UNTIL
                         J-CARACT > 49
                 ADD 1 TO K-CARACT
                 IF V-NOR-CARACT(J-CARACT:1) >
                    VCT-MMAX-CARACT(IND-PORTAF-CARACT,24,K-CARACT)
                    MOVE V-NOR-CARACT(J-CARACT:1) TO
                         VCT-MMAX-CARACT(IND-PORTAF-CARACT,24,K-CARACT)
                 END-IF
              END-PERFORM
           ELSE
             IF 01MOR103(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00MOR103(1:6)) < 
                  FUNCTION NUMVAL(01MOR103(IND-PORTAF-CARACT)(1:6))
                 MOVE 00MOR103(1:6) TO 01MOR103(IND-PORTAF-CARACT)(1:6)
               END-IF
             END-IF
           END-IF.
MORDIA     MOVE COD-PORTAF-CARACT TO 01MORPTF(IND-PORTAF-CARACT).       RMB0008

       2350-1-CALCULA-CARACT-01MOR.
REMARK******************************************************************
REMARK*2350-1-CALCULA-CARACT-01MOR.
REMARK******************************************************************
      *** VALORES PARA CARACTERISTICAS 00MOR0080 A 00MOR085
          MOVE 6 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3
          MOVE 5.217031 TO MAX-CARACT.
          PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL
                  R-CARACT > 25
             MOVE 0 TO V-PON01M-CARACT(R-CARACT)
          END-PERFORM.
      *** 01MOR080 *** PONDERACION DE REPORTE AL DIA EN ULTIMOS 6 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,1) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,1,J-CARACT) = 0
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR080(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR081 *** PONDERACION DE MORAS 30 O PEOR EN ULTIMOS 6 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,2) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,2,J-CARACT) >= 1
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR081(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR082 *** PONDERACION DE MORAS 60 O PEOR EN ULTIMOS 6 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,3) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,3,J-CARACT) >= 2
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR082(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR083 *** PONDERACION DE MORAS 90 O PEOR EN ULTIMOS 6 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,4) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,4,J-CARACT) >= 3
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR083(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR084 *** PONDERACION DE MORAS 120 O PEOR EN ULTIMOS 6 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,5) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,5,J-CARACT) >= 4
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR084(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR085 *** PONDERACION DE CASTIGOS  EN ULTIMOS 6 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,6) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,6,J-CARACT) = 7
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR085(R-CARACT)
             END-IF
           END-PERFORM.
      *** VALORES PARA CARACTERISTICAS 00MOR0086 A 00MOR091
          MOVE 12 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3
          MOVE 7.458134171671 TO MAX-CARACT.
          PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL
                  R-CARACT > (P-CARACT + 1)
             MOVE 0 TO V-PON01M-CARACT(R-CARACT)
          END-PERFORM.
      *** 01MOR086 *** PONDERACION DE REPORTES AL DIA ULTIMOS 12 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,7) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,7,J-CARACT) = 0
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR086(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR087 *** PONDERACION DE MORAS 30 EN ULTIMOS 12 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,8) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,8,J-CARACT) >= 1
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR087(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR088 *** PONDERACION DE MORAS 60 EN ULTIMOS 12 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,9) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,9,J-CARACT) >= 2
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR088(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR089 *** PONDERACION DE MORAS 90 EN ULTIMOS 12 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,10) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,10,J-CARACT) >= 3
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR089(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR090 *** PONDERACION DE MORAS 120 EN ULTIMOS 12 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,11) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,11,J-CARACT) >= 4
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR090(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR091 *** PONDERACION DE CASTIGOD EN ULTIMOS 12 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,12) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,12,J-CARACT) = 7
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR091(R-CARACT)
             END-IF
           END-PERFORM.
      *** VALORES PARA CARACTERISTICAS 00MOR0092 A 00MOR097
          MOVE 18 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3
          MOVE 8.64914828232701 TO MAX-CARACT.
          PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL
                  R-CARACT > (P-CARACT + 1)
             MOVE 0 TO V-PON01M-CARACT(R-CARACT)
          END-PERFORM.
      *** 01MOR092 *** PONDERACION DE REPORTES AL DIA ULTIMOS 18 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,13) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,13,J-CARACT) = 0
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR092(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR093 *** PONDERACION DE MORAS 30 EN ULTIMOS 18 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,14) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,14,J-CARACT) >= 1
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR093(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR094 *** PONDERACION DE MORAS 60 EN ULTIMOS 18 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,15) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,15,J-CARACT) >= 2
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR094(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR095 *** PONDERACION DE MORAS 90 EN ULTIMOS 18 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,16) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,16,J-CARACT) >= 3
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR095(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR096 *** PONDERACION DE MORAS 120 EN ULTIMOS 18 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,17) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,17,J-CARACT) >= 4
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR096(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR097 *** PONDERACION DE CASTIGOS EN ULTIMOS 18 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,18) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,18,J-CARACT) = 7
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR097(R-CARACT)
             END-IF
           END-PERFORM.
      *** VALORES PARA CARACTERISTICAS 00MOR0098 A 00MOR103
          MOVE 24 TO P-CARACT
          COMPUTE TOLERANCIA-CARACT = P-CARACT / 3
          MOVE 9.28210201230815 TO MAX-CARACT.
          PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL
                  R-CARACT > (P-CARACT + 1)
             MOVE 0 TO V-PON01M-CARACT(R-CARACT)
          END-PERFORM.
      *** 01MOR098 *** PONDERACION DE REPORTES AL DIA ULTIMOS 24 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,19) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,19,J-CARACT) = 0
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR098(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR099 *** PONDERACION DE MORAS 30 EN ULTIMOS 24 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,20) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,20,J-CARACT) >= 1
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR099(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR100 *** PONDERACION DE MORAS 60 EN ULTIMOS 24 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,21) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,21,J-CARACT) >= 2
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR100(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR101 *** PONDERACION DE MORAS 90 EN ULTIMOS 24 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,22) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,22,J-CARACT) >= 3
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR101(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR102 *** PONDERACION DE MORAS 120 EN ULTIMOS 24 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,23) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,23,J-CARACT) >= 4
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR102(R-CARACT)
             END-IF
           END-PERFORM.
      *** 01MOR103 *** PONDERACION DE CASTIGOS EN ULTIMOS 24 MESES
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF SW-CMP-CARACT(R-CARACT,24) = 1
                PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL
                        J-CARACT > (P-CARACT + 1)
                  IF VCT-MMAX-CARACT(R-CARACT,24,J-CARACT) = 7
                     MOVE 1 TO V-PON01M-CARACT(J-CARACT)
                  ELSE
                     MOVE 0 TO V-PON01M-CARACT(J-CARACT)
                  END-IF
                END-PERFORM
                MOVE ZEROS TO VAL-01MOR-CARACT Z-CARACT
                              EXP-CARACT SUMA-CARACT
                PERFORM 2510-CALCULO-PONDERAC-01MOR
                MOVE VAL-01MOR-CARACT TO 01MOR103(R-CARACT)
             END-IF
           END-PERFORM.

       2510-CALCULO-PONDERAC-01MOR.
REMARK******************************************************************
REMARK*2510-CALCULO-PONDERAC-01MOR.
REMARK******************************************************************
           PERFORM VARYING L-CARACT FROM 1 BY 1 UNTIL
                          L-CARACT > (P-CARACT + 1)
              COMPUTE Z-CARACT = (P-CARACT + 1) - L-CARACT
              COMPUTE EXP-CARACT = (1 - 0.1 ) ** Z-CARACT
              COMPUTE SUMA-CARACT = SUMA-CARACT +
                      (V-PON01M-CARACT(L-CARACT) * EXP-CARACT)
           END-PERFORM
           IF SUMA-CARACT > 0
              COMPUTE VAL-01MOR-CARACT
                      ROUNDED = ((SUMA-CARACT * 100) / MAX-CARACT )
           END-IF.

       2400-CALCULA-CARACT-00ACP.
REMARK******************************************************************
REMARK*2400-CALCULA-CARACT-00ACP.
REMARK******************************************************************
           MOVE COD-PORTAF-CARACT TO 00ACPPTF
           MOVE "-99" TO 
                00ACP027(1:3) 00ACP028(1:3) 00ACP029(1:3) 00ACP030(1:3)
                00ACP031(1:3) 00ACP032(1:3) 00ACP033(1:3) 00ACP034(1:3)
                00ACP035(1:3) 00ACP036(1:3) 00ACP037(1:3) 00ACP038(1:3)
                00ACP039(1:3) 00ACP040(1:3) 00ACP041(1:3) 00ACP042(1:3)
      *** 00ACP001 *** PRODUCTO ABIERTO EN ULTIMOS  3 MESES
      *** 00ACP002 *** PRODUCTO ABIERTO EN ULTIMOS  6 MESES
      *** 00ACP003 *** PRODUCTO ABIERTO EN ULTIMOS 12 MESES
      *** 00ACP004 *** PRODUCTO ABIERTO EN ULTIMOS 18 MESES
      *** 00ACP005 *** PRODUCTO ABIERTO EN ULTIMOS 24 MESES
      *** 00ACP006 *** PRODUCTO ABIERTO EN ULTIMOS 36 MESES
      *** 00ACP007 *** PRODUCTO ABIERTO EN ULTIMOS 49 MESES
      *** 00ACP008 *** PRODUCTO ABIERTO HACE 49 MESES O MAS
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              IF FECHA-APERT-CARACT > ZEROS
                 IF FECHA-APERT-CARACT <= RUN-DATE-CARACT
                    IF MESES-MADUR-CARACT >= 0 AND <= 03
                       MOVE 1 TO 00ACP001
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 06
                       MOVE 1 TO 00ACP002
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 12
                       MOVE 1 TO 00ACP003
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 18
                       MOVE 1 TO 00ACP004
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 24
                       MOVE 1 TO 00ACP005
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 36
                       MOVE 1 TO 00ACP006
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 48
                       MOVE 1 TO 00ACP007
                    END-IF
                    IF MESES-MADUR-CARACT >= 49
                       MOVE 1 TO 00ACP008
                    END-IF
                 ELSE
                    MOVE " -3" TO 00ACP001(1:3)
                    MOVE " -3" TO 00ACP002(1:3)
                    MOVE " -3" TO 00ACP003(1:3)
                    MOVE " -3" TO 00ACP004(1:3)
                    MOVE " -3" TO 00ACP005(1:3)
                    MOVE " -3" TO 00ACP006(1:3)
                    MOVE " -3" TO 00ACP007(1:3)
                    MOVE " -3" TO 00ACP008(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00ACP001(1:3)
                 MOVE " -2" TO 00ACP002(1:3)
                 MOVE " -2" TO 00ACP003(1:3)
                 MOVE " -2" TO 00ACP004(1:3)
                 MOVE " -2" TO 00ACP005(1:3)
                 MOVE " -2" TO 00ACP006(1:3)
                 MOVE " -2" TO 00ACP007(1:3)
                 MOVE " -2" TO 00ACP008(1:3)
              END-IF
           ELSE
              MOVE " -1" TO 00ACP001(1:3)
              MOVE " -1" TO 00ACP002(1:3)
              MOVE " -1" TO 00ACP003(1:3)
              MOVE " -1" TO 00ACP004(1:3)
              MOVE " -1" TO 00ACP005(1:3)
              MOVE " -1" TO 00ACP006(1:3)
              MOVE " -1" TO 00ACP007(1:3)
              MOVE " -1" TO 00ACP008(1:3)
           END-IF.
      *** 00ACP009 *** PROD CON CANCELADCION POSITIVA ULTIMOS  3 MESES
      *** 00ACP010 *** PROD CON CANCELADCION POSITIVA ULTIMOS  6 MESES
      *** 00ACP011 *** PROD CON CANCELADCION POSITIVA ULTIMOS 12 MESES
      *** 00ACP012 *** PROD CON CANCELADCION POSITIVA ULTIMOS 18 MESES
      *** 00ACP013 *** PROD CON CANCELADCION POSITIVA ULTIMOS 24 MESES
      *** 00ACP014 *** PROD CON CANCELADCION POSITIVA ULTIMOS 36 MESES
      *** 00ACP015 *** PROD CON CANCELADCION POSITIVA ULTIMOS 48 MESES
      *** 00ACP016 *** PROD CON CANCELADCION POSITIVA 48 MESES O MAS
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              IF REG-CERRADO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS
                    IF FECHA-ESTADO-CARACT <= RUN-DATE-CARACT
                       IF MESES-DESAC-CARACT >=0 AND <= 3 AND
                          REG-POSITIVO-CARACT = 1
                          MOVE 1 TO 00ACP009
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 6 AND
                          REG-POSITIVO-CARACT = 1
                          MOVE 1 TO 00ACP010
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 12 AND
                          REG-POSITIVO-CARACT = 1
                          MOVE 1 TO 00ACP011
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 18 AND
                          REG-POSITIVO-CARACT = 1
                          MOVE 1 TO 00ACP012
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 24 AND
                          REG-POSITIVO-CARACT = 1
                          MOVE 1 TO 00ACP013
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 36 AND
                          REG-POSITIVO-CARACT = 1
                          MOVE 1 TO 00ACP014
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 48 AND
                          REG-POSITIVO-CARACT = 1
                          MOVE 1 TO 00ACP015
                       END-IF
                       IF MESES-DESAC-CARACT >= 49 AND
                          REG-POSITIVO-CARACT = 1
                          MOVE 1 TO 00ACP016
                       END-IF
                    ELSE
                       MOVE " -4" TO 00ACP009(1:3)
                       MOVE " -4" TO 00ACP010(1:3)
                       MOVE " -4" TO 00ACP011(1:3)
                       MOVE " -4" TO 00ACP012(1:3)
                       MOVE " -4" TO 00ACP013(1:3)
                       MOVE " -4" TO 00ACP014(1:3)
                       MOVE " -4" TO 00ACP015(1:3)
                       MOVE " -4" TO 00ACP016(1:3)
                    END-IF
                 ELSE
                    MOVE " -3" TO 00ACP009(1:3)
                    MOVE " -3" TO 00ACP010(1:3)
                    MOVE " -3" TO 00ACP011(1:3)
                    MOVE " -3" TO 00ACP012(1:3)
                    MOVE " -3" TO 00ACP013(1:3)
                    MOVE " -3" TO 00ACP014(1:3)
                    MOVE " -3" TO 00ACP015(1:3)
                    MOVE " -3" TO 00ACP016(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00ACP009(1:3)
                 MOVE " -2" TO 00ACP010(1:3)
                 MOVE " -2" TO 00ACP011(1:3)
                 MOVE " -2" TO 00ACP012(1:3)
                 MOVE " -2" TO 00ACP013(1:3)
                 MOVE " -2" TO 00ACP014(1:3)
                 MOVE " -2" TO 00ACP015(1:3)
                 MOVE " -2" TO 00ACP016(1:3)
              END-IF
           ELSE
              MOVE " -1" TO 00ACP009(1:3)
              MOVE " -1" TO 00ACP010(1:3)
              MOVE " -1" TO 00ACP011(1:3)
              MOVE " -1" TO 00ACP012(1:3)
              MOVE " -1" TO 00ACP013(1:3)
              MOVE " -1" TO 00ACP014(1:3)
              MOVE " -1" TO 00ACP015(1:3)
              MOVE " -1" TO 00ACP016(1:3)
           END-IF.
      *** 00ACP017 *** MESES DESDE LA CANCELACION POSITIVA
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              IF REG-CERRADO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS
                    IF FECHA-ESTADO-CARACT <= RUN-DATE-CARACT
                       IF REG-POSITIVO-CARACT = 1 
                          IF MESES-DESAC-CARACT >= 0
                             MOVE MESES-DESAC-CARACT TO 00ACP017
                          END-IF
                       ELSE
                          MOVE " -5" TO 00ACP017(1:3)
                       END-IF
                    ELSE
                       MOVE " -4" TO 00ACP017(1:3)
                    END-IF
                 ELSE
                    MOVE " -3" TO 00ACP017(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00ACP017(1:3)
              END-IF
           ELSE
              MOVE " -1" TO 00ACP017(1:3)
           END-IF.
      *** 00ACP018 *** PROD CON CANCELADCION NEGATIVA ULTIMOS  3 MESES
      *** 00ACP019 *** PROD CON CANCELADCION NEGATIVA ULTIMOS  6 MESES
      *** 00ACP020 *** PROD CON CANCELADCION NEGATIVA ULTIMOS 12 MESES
      *** 00ACP021 *** PROD CON CANCELADCION NEGATIVA ULTIMOS 18 MESES
      *** 00ACP022 *** PROD CON CANCELADCION NEGATIVA ULTIMOS 24 MESES
      *** 00ACP023 *** PROD CON CANCELADCION NEGATIVA ULTIMOS 36 MESES
      *** 00ACP024 *** PROD CON CANCELADCION NEGATIVA ULTIMOS 48 MESES
      *** 00ACP025 *** PROD CON CANCELADCION NEGATIVA 48 MESES O MAS
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              IF REG-CERRADO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS
                    IF FECHA-ESTADO-CARACT <= RUN-DATE-CARACT
                       IF MESES-DESAC-CARACT >=0 AND <= 3 AND
                          REG-NEGATIVO-CARACT = 1
                          MOVE 1 TO 00ACP018
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 6 AND
                          REG-NEGATIVO-CARACT = 1
                          MOVE 1 TO 00ACP019
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 12 AND
                          REG-NEGATIVO-CARACT = 1
                          MOVE 1 TO 00ACP020
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 18 AND
                          REG-NEGATIVO-CARACT = 1
                          MOVE 1 TO 00ACP021
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 24 AND
                          REG-NEGATIVO-CARACT = 1
                          MOVE 1 TO 00ACP022
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 36 AND
                          REG-NEGATIVO-CARACT = 1
                          MOVE 1 TO 00ACP023
                       END-IF
                       IF MESES-DESAC-CARACT >=0 AND <= 48 AND
                          REG-NEGATIVO-CARACT = 1
                          MOVE 1 TO 00ACP024
                       END-IF
                       IF MESES-DESAC-CARACT >= 49 AND
                          REG-NEGATIVO-CARACT = 1
                          MOVE 1 TO 00ACP025
                       END-IF
                    ELSE
                       MOVE " -4" TO 00ACP018(1:3)
                       MOVE " -4" TO 00ACP019(1:3)
                       MOVE " -4" TO 00ACP020(1:3)
                       MOVE " -4" TO 00ACP021(1:3)
                       MOVE " -4" TO 00ACP022(1:3)
                       MOVE " -4" TO 00ACP023(1:3)
                       MOVE " -4" TO 00ACP024(1:3)
                       MOVE " -4" TO 00ACP025(1:3)
                    END-IF
                 ELSE
                    MOVE " -3" TO 00ACP018(1:3)
                    MOVE " -3" TO 00ACP019(1:3)
                    MOVE " -3" TO 00ACP020(1:3)
                    MOVE " -3" TO 00ACP021(1:3)
                    MOVE " -3" TO 00ACP022(1:3)
                    MOVE " -3" TO 00ACP023(1:3)
                    MOVE " -3" TO 00ACP024(1:3)
                    MOVE " -3" TO 00ACP025(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00ACP018(1:3)
                 MOVE " -2" TO 00ACP019(1:3)
                 MOVE " -2" TO 00ACP020(1:3)
                 MOVE " -2" TO 00ACP021(1:3)
                 MOVE " -2" TO 00ACP022(1:3)
                 MOVE " -2" TO 00ACP023(1:3)
                 MOVE " -2" TO 00ACP024(1:3)
                 MOVE " -2" TO 00ACP025(1:3)
              END-IF
           ELSE
              MOVE " -1" TO 00ACP018(1:3)
              MOVE " -1" TO 00ACP019(1:3)
              MOVE " -1" TO 00ACP020(1:3)
              MOVE " -1" TO 00ACP021(1:3)
              MOVE " -1" TO 00ACP022(1:3)
              MOVE " -1" TO 00ACP023(1:3)
              MOVE " -1" TO 00ACP024(1:3)
              MOVE " -1" TO 00ACP025(1:3)
           END-IF.
      *** 00ACP026 *** MESES DESDE LA CANCELACION NEGATIVA
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              IF REG-CERRADO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS
                    IF FECHA-ESTADO-CARACT <= RUN-DATE-CARACT
                       IF REG-NEGATIVO-CARACT = 1
                          IF MESES-DESAC-CARACT >= 0
                             MOVE MESES-DESAC-CARACT TO 00ACP026
                          END-IF
                       ELSE
                          MOVE " -5" TO 00ACP026(1:3)
                       END-IF
                    ELSE
                       MOVE " -4" TO 00ACP026(1:3)
                    END-IF
                 ELSE
                    MOVE " -3" TO 00ACP026(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00ACP026(1:3)
              END-IF
           ELSE
              MOVE " -1" TO 00ACP026(1:3)
           END-IF.
      *** 00ACP027 *** PRODUCTO ABIERTO CON VENCE DENTRO PROX 3 MESES
      *** 00ACP028 *** PRODUCTO ABIERTO CON VENCE DENTRO PROX 6 MESES
      *** 00ACP029 *** PRODUCTO ABIERTO CON VENCE DENTRO PROX 12 MESES
      *** 00ACP030 *** PRODUCTO ABIERTO CON VENCE DENTRO PROX 18 MESES
      *** 00ACP031 *** PRODUCTO ABIERTO CON VENCE DENTRO PROX 24 MESES
      *** 00ACP032 *** PRODUCTO ABIERTO CON VENCE DENTRO PROX 36 MESES
      *** 00ACP033 *** PRODUCTO ABIERTO CON VENCE DENTRO PROX 48 MESES
      *** 00ACP034 *** PRODUCTO ABIERTO CON VENCE DENTRO DE 48 MESES +
           IF COD-PORTAF-CARACT = "IN" OR "VE" OR "HP" OR "OT"
              MOVE ZEROS TO 00ACP027 00ACP028 00ACP029 00ACP030
                            00ACP031 00ACP032 00ACP033 00ACP034
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-VENCE-CARACT > 0
                    IF FECHA-VENCE-CARACT > RUN-DATE-CARACT AND
                       MESES-VENCE-CARACT <= 3
                       MOVE 1 TO 00ACP027
                    END-IF
                    IF FECHA-VENCE-CARACT > RUN-DATE-CARACT AND
                       MESES-VENCE-CARACT <= 6
                       MOVE 1 TO 00ACP028
                    END-IF
                    IF FECHA-VENCE-CARACT > RUN-DATE-CARACT AND
                       MESES-VENCE-CARACT <= 12
                       MOVE 1 TO 00ACP029
                    END-IF
                    IF FECHA-VENCE-CARACT > RUN-DATE-CARACT AND
                       MESES-VENCE-CARACT <= 18
                       MOVE 1 TO 00ACP030
                    END-IF
                    IF FECHA-VENCE-CARACT > RUN-DATE-CARACT AND
                       MESES-VENCE-CARACT <= 24
                       MOVE 1 TO 00ACP031
                    END-IF
                    IF FECHA-VENCE-CARACT > RUN-DATE-CARACT AND
                       MESES-VENCE-CARACT <= 36
                       MOVE 1 TO 00ACP032
                    END-IF
                    IF FECHA-VENCE-CARACT > RUN-DATE-CARACT AND
                       MESES-VENCE-CARACT <= 48
                       MOVE 1 TO 00ACP033
                    END-IF
                    IF FECHA-VENCE-CARACT > RUN-DATE-CARACT AND
                       MESES-VENCE-CARACT >= 49
                       MOVE 1 TO 00ACP034
                    END-IF
                 ELSE
                    MOVE " -3" TO 00ACP027(1:3)
                    MOVE " -3" TO 00ACP028(1:3)
                    MOVE " -3" TO 00ACP029(1:3)
                    MOVE " -3" TO 00ACP030(1:3)
                    MOVE " -3" TO 00ACP031(1:3)
                    MOVE " -3" TO 00ACP032(1:3)
                    MOVE " -3" TO 00ACP033(1:3)
                    MOVE " -3" TO 00ACP034(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00ACP027(1:3)
                 MOVE " -2" TO 00ACP028(1:3)
                 MOVE " -2" TO 00ACP029(1:3)
                 MOVE " -2" TO 00ACP030(1:3)
                 MOVE " -2" TO 00ACP031(1:3)
                 MOVE " -2" TO 00ACP032(1:3)
                 MOVE " -2" TO 00ACP033(1:3)
                 MOVE " -2" TO 00ACP034(1:3)
              END-IF
           END-IF.
      *** 00ACP035 *** APERTURA Y CIERRE DE PRODUCTO EN ULTIMOS  3 MESES
      *** 00ACP036 *** APERTURA Y CIERRE DE PRODUCTO EN ULTIMOS  6 MESES
      *** 00ACP037 *** APERTURA Y CIERRE DE PRODUCTO EN ULTIMOS  9 MESES
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT"
              MOVE ZEROS TO 00ACP035 00ACP036 00ACP037
              IF REG-CERRADO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS  AND
                    FECHA-APERT-CARACT > ZEROS
                    IF MESES-MADUR-CARACT >= 0 AND <= 3 AND
                       MESES-DESAC-CARACT >= 0 AND <= 3
                       MOVE 1 TO 00ACP035
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 6 AND
                       MESES-DESAC-CARACT >= 0 AND <= 6
                       MOVE 1 TO 00ACP036
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 9 AND
                       MESES-DESAC-CARACT >= 0 AND <= 9
                       MOVE 1 TO 00ACP037
                    END-IF
                 ELSE
                    MOVE " -3" TO 00ACP035(1:3)
                    MOVE " -3" TO 00ACP036(1:3)
                    MOVE " -3" TO 00ACP037(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00ACP035(1:3)
                 MOVE " -2" TO 00ACP036(1:3)
                 MOVE " -2" TO 00ACP037(1:3)
              END-IF
           END-IF. 
      *** 00ACP038 *** PRODUCTO CANCELADO ENTRE EL  0% - 25% DE MADURAC
      *** 00ACP039 *** PRODUCTO CANCELADO ENTRE EL 26% - 50% DE MADURAC
      *** 00ACP040 *** PRODUCTO CANCELADO ENTRE EL 51% - 75% DE MADURAC
      *** 00ACP041 *** PRODUCTO CANCELADO ENTRE EL 76% -100% DE MADURAC
      *** 00ACP042 *** PRODUCTO CANCELADO POR ENCIMA DE 100% DE MADURAC
           MOVE ZEROS TO VAL-RATIO-CARACT
           IF COD-PORTAF-CARACT = "IN" OR "VE" OR "HP" OR "OT"
              MOVE ZEROS TO 00ACP038 00ACP039 00ACP040 00ACP041 00ACP042
              IF REG-CERRADO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS  AND
                    FECHA-APERT-CARACT > ZEROS
                    IF MESES-VENAP-CARACT > 0
                      IF FECHA-ESTADO-CARACT >= FECHA-APERT-CARACT
                       COMPUTE VAL-RATIO-CARACT ROUNDED = 
                       (MESES-NOVAP-CARACT / MESES-VENAP-CARACT)
                       IF VAL-RATIO-CARACT >= 0 AND <= 0.25
                          MOVE 1 TO 00ACP038
                       END-IF
                       IF VAL-RATIO-CARACT >= 0.26 AND <= 0.50
                          MOVE 1 TO 00ACP039
                       END-IF
                       IF VAL-RATIO-CARACT >= 0.51 AND <= 0.75
                          MOVE 1 TO 00ACP040
                       END-IF
                       IF VAL-RATIO-CARACT >= 0.76 AND <= 1
                          MOVE 1 TO 00ACP041
                       END-IF
                       IF VAL-RATIO-CARACT > 1
                          MOVE 1 TO 00ACP042
                       END-IF
                      END-IF
                    ELSE
                       MOVE " -4" TO 00ACP038(1:3)
                       MOVE " -4" TO 00ACP039(1:3)
                       MOVE " -4" TO 00ACP040(1:3)
                       MOVE " -4" TO 00ACP041(1:3)
                       MOVE " -4" TO 00ACP042(1:3)
                    END-IF
                 ELSE
                    MOVE " -3" TO 00ACP038(1:3)
                    MOVE " -3" TO 00ACP039(1:3)
                    MOVE " -3" TO 00ACP040(1:3)
                    MOVE " -3" TO 00ACP041(1:3)
                    MOVE " -3" TO 00ACP042(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00ACP038(1:3)
                 MOVE " -2" TO 00ACP039(1:3)
                 MOVE " -2" TO 00ACP040(1:3)
                 MOVE " -2" TO 00ACP041(1:3)
                 MOVE " -2" TO 00ACP042(1:3)
              END-IF
           END-IF.

       2450-CALCULA-CARACT-01ACP.
REMARK******************************************************************
REMARK*2450-CALCULA-CARACT-01ACP.
REMARK******************************************************************
           MOVE COD-PORTAF-CARACT TO 01ACPPTF(IND-PORTAF-CARACT).
      *** 01ACP001 *** NUMERO DE APERTURAS EN ULTIMOS 3 MESES
           IF 00ACP001 > 0
             IF 01ACP001(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP001(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP001(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP001(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP001(1:3)) < 
                  FUNCTION NUMVAL(01ACP001(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP001(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP001(1:3) TO 01ACP001(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP002 *** NUMERO DE APERTURAS EN ULTIMOS 6 MESES
           IF 00ACP002 > 0
             IF 01ACP002(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP002(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP002(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP002(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP002(1:3)) < 
                  FUNCTION NUMVAL(01ACP002(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP002(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP002(1:3) TO 01ACP002(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP003 *** NUMERO DE APERTURAS EN ULTIMOS 12 MESES
           IF 00ACP003 > 0
             IF 01ACP003(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP003(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP003(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP003(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP003(1:3)) < 
                  FUNCTION NUMVAL(01ACP003(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP003(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP003(1:3) TO 01ACP003(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP004 *** NUMERO DE APERTURAS EN ULTIMOS 18 MESES
           IF 00ACP004 > 0
             IF 01ACP004(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP004(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP004(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP004(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP004(1:3)) < 
                  FUNCTION NUMVAL(01ACP004(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP004(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP004(1:3) TO 01ACP004(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP005 *** NUMERO DE APERTURAS EN ULTIMOS 24 MESES
           IF 00ACP005 > 0
             IF 01ACP005(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP005(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP005(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP005(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP005(1:3)) < 
                  FUNCTION NUMVAL(01ACP005(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP005(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP005(1:3) TO 01ACP005(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP006 *** NUMERO DE APERTURAS EN ULTIMOS 36 MESES
           IF 00ACP006 > 0
             IF 01ACP006(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP006(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP006(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP006(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP006(1:3)) < 
                  FUNCTION NUMVAL(01ACP006(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP006(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP006(1:3) TO 01ACP006(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP007 *** NUMERO DE APERTURAS EN ULTIMOS 48 MESES
           IF 00ACP007 > 0
             IF 01ACP007(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP007(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP007(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP007(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP007(1:3)) < 
                  FUNCTION NUMVAL(01ACP007(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP007(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP007(1:3) TO 01ACP007(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP008 *** NUMERO DE APERTURAS EN ULTIMOS 49 MESES O MAS
           IF 00ACP008 > 0
             IF 01ACP008(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP008(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP008(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP008(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP008(1:3)) < 
                  FUNCTION NUMVAL(01ACP008(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP008(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP008(1:3) TO 01ACP008(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP009 *** NUMERO DE CANCELACIONES POSITIVAS ULTIMOS 3 MESES
           IF 00ACP009 > 0
             IF 01ACP009(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP009(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP009(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP009(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP009(1:3)) < 
                  FUNCTION NUMVAL(01ACP009(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP009(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP009(1:3) TO 01ACP009(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP010 *** NUMERO DE CANCELACIONES POSITIVAS ULTIMOS 6 MESES
           IF 00ACP010 > 0
             IF 01ACP010(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP010(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP010(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP010(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP010(1:3)) < 
                  FUNCTION NUMVAL(01ACP010(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP010(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP010(1:3) TO 01ACP010(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP011 *** NUMERO DE CANCELACIONES POSITIVAS ULTIMOS 12 MESES
           IF 00ACP011 > 0
             IF 01ACP011(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP011(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP011(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP011(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP011(1:3)) < 
                  FUNCTION NUMVAL(01ACP011(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP011(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP011(1:3) TO 01ACP011(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP012 *** NUMERO DE CANCELACIONES POSITIVAS ULTIMOS 18 MESES
           IF 00ACP012 > 0
             IF 01ACP012(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP012(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP012(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP012(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP012(1:3)) < 
                  FUNCTION NUMVAL(01ACP012(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP012(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP012(1:3) TO 01ACP012(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP013 *** NUMERO DE CANCELACIONES POSITIVAS ULTIMOS 24 MESES
           IF 00ACP013 > 0
             IF 01ACP013(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP013(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP013(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP013(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP013(1:3)) < 
                  FUNCTION NUMVAL(01ACP013(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP013(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP013(1:3) TO 01ACP013(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP014 *** NUMERO DE CANCELACIONES POSITIVAS ULTIMOS 36 MESES
           IF 00ACP014 > 0
             IF 01ACP014(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP014(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP014(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP014(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP014(1:3)) < 
                  FUNCTION NUMVAL(01ACP014(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP014(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP014(1:3) TO 01ACP014(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP015 *** NUMERO DE CANCELACIONES POSITIVAS ULTIMOS 48 MESES
           IF 00ACP015 > 0
             IF 01ACP015(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP015(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP015(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP015(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP015(1:3)) < 
                  FUNCTION NUMVAL(01ACP015(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP015(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP015(1:3) TO 01ACP015(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP016 *** NUMERO DE CANCELACIONES POSITIVAS ULTIMOS 49 MESES +
           IF 00ACP016 > 0
             IF 01ACP016(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP016(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP016(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP016(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP016(1:3)) < 
                  FUNCTION NUMVAL(01ACP016(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP016(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP016(1:3) TO 01ACP016(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP017 *** MESES DESDE CANCELACION POSITIVA MAS RECIENTE
           IF 00ACP017 >= 0
             IF 01ACP017(IND-PORTAF-CARACT) < 0
                MOVE 999 TO 01ACP017(IND-PORTAF-CARACT)
             END-IF
             IF 00ACP017 < 01ACP017(IND-PORTAF-CARACT)
                MOVE 00ACP017 TO 01ACP017(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01ACP017(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00ACP017(1:3)) < 
                  FUNCTION NUMVAL(01ACP017(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP017(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP017(1:3) TO 01ACP017(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP018 *** NUMERO DE CANCELACIONES NEGATIVAS ULTIMOS 3 MESES
           IF 00ACP018 > 0
             IF 01ACP018(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP018(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP018(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP018(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP018(1:3)) < 
                  FUNCTION NUMVAL(01ACP018(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP018(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP018(1:3) TO 01ACP018(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP019 *** NUMERO DE CANCELACIONES NEGATIVAS ULTIMOS 9 MESES
           IF 00ACP019 > 0
             IF 01ACP019(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP019(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP019(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP019(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP019(1:3)) < 
                  FUNCTION NUMVAL(01ACP019(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP019(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP019(1:3) TO 01ACP019(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP020 *** NUMERO DE CANCELACIONES NEGATIVAS ULTIMOS 12 MESES
           IF 00ACP020 > 0
             IF 01ACP020(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP020(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP020(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP020(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP020(1:3)) < 
                  FUNCTION NUMVAL(01ACP020(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP020(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP020(1:3) TO 01ACP020(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP021 *** NUMERO DE CANCELACIONES NEGATIVAS ULTIMOS 18 MESES
           IF 00ACP021 > 0
             IF 01ACP021(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP021(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP021(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP021(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP021(1:3)) < 
                  FUNCTION NUMVAL(01ACP021(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP021(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP021(1:3) TO 01ACP021(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP022 *** NUMERO DE CANCELACIONES NEGATIVAS ULTIMOS 24 MESES
           IF 00ACP022 > 0
             IF 01ACP022(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP022(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP022(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP022(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP022(1:3)) < 
                  FUNCTION NUMVAL(01ACP022(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP022(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP022(1:3) TO 01ACP022(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP023 *** NUMERO DE CANCELACIONES NEGATIVAS ULTIMOS 36 MESES
           IF 00ACP023 > 0
             IF 01ACP023(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP023(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP023(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP023(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP023(1:3)) < 
                  FUNCTION NUMVAL(01ACP023(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP023(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP023(1:3) TO 01ACP023(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP024 *** NUMERO DE CANCELACIONES NEGATIVAS ULTIMOS 48 MESES
           IF 00ACP024 > 0
             IF 01ACP024(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP024(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP024(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP024(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP024(1:3)) < 
                  FUNCTION NUMVAL(01ACP024(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP024(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP024(1:3) TO 01ACP024(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP025 *** NUMERO DE CANCELACIONES NEGATIVAS ULTIMOS 49 MESES +
           IF 00ACP025 > 0
             IF 01ACP025(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP025(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP025(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP025(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP025(1:3)) < 
                  FUNCTION NUMVAL(01ACP025(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP025(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP025(1:3) TO 01ACP025(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP026 *** MESES DESDE CANCELACION NEGATIVA MAS RECIENTE
           IF 00ACP026 >= 0
             IF 01ACP026(IND-PORTAF-CARACT) < 0
                MOVE 999 TO 01ACP026(IND-PORTAF-CARACT)
             END-IF
             IF 00ACP026 < 01ACP026(IND-PORTAF-CARACT)
                MOVE 00ACP026 TO 01ACP026(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01ACP026(IND-PORTAF-CARACT) < 0 OR = "0999"             DLM0010
               IF FUNCTION NUMVAL(00ACP026(1:3)) < 
                  FUNCTION NUMVAL(01ACP026(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP026(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP026(1:3) TO 01ACP026(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP027 *** NUMERO PROD ABIERTOS QUE VENCE PROXIMOS 3 MESES
           IF 00ACP027 > 0
             IF 01ACP027(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP027(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP027(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP027(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP027(1:3)) < 
                  FUNCTION NUMVAL(01ACP027(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP027(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP027(1:3) TO 01ACP027(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP028 *** NUMERO PROD ABIERTOS QUE VENCE PROXIMOS 6 MESES
           IF 00ACP028 > 0
             IF 01ACP028(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP028(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP028(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP028(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP028(1:3)) < 
                  FUNCTION NUMVAL(01ACP028(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP028(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP028(1:3) TO 01ACP028(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP029 *** NUMERO PROD ABIERTOS QUE VENCE PROXIMOS 12 MESES
           IF 00ACP029 > 0
             IF 01ACP029(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP029(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP029(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP029(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP029(1:3)) < 
                  FUNCTION NUMVAL(01ACP029(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP029(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP029(1:3) TO 01ACP029(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP030 *** NUMERO PROD ABIERTOS QUE VENCE PROXIMOS 18 MESES
           IF 00ACP030 > 0
             IF 01ACP030(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP030(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP030(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP030(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP030(1:3)) < 
                  FUNCTION NUMVAL(01ACP030(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP030(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP030(1:3) TO 01ACP030(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP031 *** NUMERO PROD ABIERTOS QUE VENCE PROXIMOS 24 MESES
           IF 00ACP031 > 0
             IF 01ACP031(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP031(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP031(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP031(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP031(1:3)) < 
                  FUNCTION NUMVAL(01ACP031(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP031(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP031(1:3) TO 01ACP031(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP032 *** NUMERO PROD ABIERTOS QUE VENCE PROXIMOS 36 MESES
           IF 00ACP032 > 0
             IF 01ACP032(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP032(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP032(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP032(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP032(1:3)) < 
                  FUNCTION NUMVAL(01ACP032(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP032(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP032(1:3) TO 01ACP032(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP033 *** NUMERO PROD ABIERTOS QUE VENCE PROXIMOS 48 MESES
           IF 00ACP033 > 0
             IF 01ACP033(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP033(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP033(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP033(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP033(1:3)) < 
                  FUNCTION NUMVAL(01ACP033(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP033(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP033(1:3) TO 01ACP033(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP034 *** NUMERO PROD ABIERTOS QUE VENCE PROXIMOS 49 MESES +
           IF 00ACP034 > 0
             IF 01ACP034(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP034(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP034(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP034(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP034(1:3)) < 
                  FUNCTION NUMVAL(01ACP034(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP034(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP034(1:3) TO 01ACP034(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP035 *** NUMERO PROD ABIERTOS ULTIM 3 MESES Y CANCELADAS
           IF 00ACP035 > 0
             IF 01ACP035(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP035(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP035(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP035(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP035(1:3)) < 
                  FUNCTION NUMVAL(01ACP035(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP035(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP035(1:3) TO 01ACP035(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP036 *** NUMERO PROD ABIERTOS ULTIM 6 MESES Y CANCELADAS
           IF 00ACP036 > 0
             IF 01ACP036(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP036(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP036(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP036(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP036(1:3)) < 
                  FUNCTION NUMVAL(01ACP036(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP036(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP036(1:3) TO 01ACP036(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP037 *** NUMERO PROD ABIERTOS ULTIM 9 MESES Y CANCELADAS
           IF 00ACP037 > 0
             IF 01ACP037(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP037(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP037(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP037(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP037(1:3)) < 
                  FUNCTION NUMVAL(01ACP037(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP037(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP037(1:3) TO 01ACP037(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP038 *** NUMERO CANCELACIONES PROD ENTRE 0% y 25% MADURACION
           IF 00ACP038 > 0
             IF 01ACP038(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP038(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP038(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP038(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP038(1:3)) < 
                  FUNCTION NUMVAL(01ACP038(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP038(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP038(1:3) TO 01ACP038(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP039 *** NUMERO CANCELACIONES PROD ENTRE 26% y 50% MADURACION
           IF 00ACP039 > 0
             IF 01ACP039(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP039(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP039(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP039(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP039(1:3)) < 
                  FUNCTION NUMVAL(01ACP039(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP039(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP039(1:3) TO 01ACP039(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP040 *** NUMERO CANCELACIONES PROD ENTRE 51% y 75% MADURACION
           IF 00ACP040 > 0
             IF 01ACP040(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP040(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP040(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP040(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP040(1:3)) < 
                  FUNCTION NUMVAL(01ACP040(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP040(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP040(1:3) TO 01ACP040(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP041 *** NUMERO CANCELACIONES PROD ENTRE 76% y 100% MADURACION
           IF 00ACP041 > 0
             IF 01ACP041(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP041(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP041(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP041(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP041(1:3)) < 
                  FUNCTION NUMVAL(01ACP041(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP041(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP041(1:3) TO 01ACP041(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01ACP042 *** NUMERO CANCELACIONES PROD SUPERIOR AL 100% MADURACION
           IF 00ACP042 > 0
             IF 01ACP042(IND-PORTAF-CARACT) < 0
                MOVE ZEROS TO 01ACP042(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01ACP042(IND-PORTAF-CARACT)
           ELSE
             IF 01ACP042(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00ACP042(1:3)) < 
                  FUNCTION NUMVAL(01ACP042(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01ACP042(IND-PORTAF-CARACT)(1:1)
                 MOVE 00ACP042(1:3) TO 01ACP042(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.

       2480-CALCULA-CARACT-02ACP.
REMARK******************************************************************
REMARK*2480-CALCULA-CARACT-02ACP.
REMARK******************************************************************
           MOVE "TO" TO 02ACPPTF
      *** 02ACP001 *** MESES DESDE LA CANCELACION NEGATIVA MAS RECIENTE
           IF 00ACP026 >= 0
             IF 02ACP001 < 0
                MOVE 999 TO 02ACP001
             END-IF
             IF 00ACP026 < 02ACP001
                MOVE 00ACP026 TO 02ACP001
             END-IF
           ELSE
             IF FUNCTION NUMVAL(02ACP001(1:4)) < 0 OR =  999
               IF FUNCTION NUMVAL(00ACP026(1:3)) < 
                  FUNCTION NUMVAL(02ACP001(1:4))
                 MOVE " " TO 02ACP001(1:1)
                 MOVE 00ACP026(1:3) TO 02ACP001(2:3)
               END-IF
             END-IF
           END-IF.
      *** 02ACP002 *** MESES DESDE LA CANCELACION POSITIVA MAS RECIENTE
           IF 00ACP017 >= 0
             IF 02ACP002 < 0
                MOVE 999 TO 02ACP002
             END-IF
             IF 00ACP017 < 02ACP002
                MOVE 00ACP017 TO 02ACP002
             END-IF
           ELSE
             IF FUNCTION NUMVAL(02ACP002(1:4)) < 0 OR = 999
               IF FUNCTION NUMVAL(00ACP017(1:3)) < 
                  FUNCTION NUMVAL(02ACP002(1:4))
                 MOVE " " TO 02ACP002(1:1)
                 MOVE 00ACP017(1:3) TO 02ACP002(2:3)
               END-IF
             END-IF
           END-IF.

       2500-CALCULA-CARACT-00EXP.
REMARK******************************************************************
REMARK*2500-CALCULA-CARACT-00EXP.
REMARK******************************************************************
           MOVE COD-PORTAF-CARACT TO 00EXPPTF
           MOVE "-99" TO 
                00EXP001(1:3) 00EXP002(1:3) 00EXP003(1:3) 00EXP004(1:3)
                00EXP005(1:3) 00EXP006(1:3) 00EXP007(1:3) 00EXP008(1:3)
      *** 00EXP001 *** MESES DESDE LA APERTURA DEL PRODUCTO
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
              MOVE ZEROS TO 00EXP001
              IF FECHA-APERT-CARACT > ZEROS
                 IF MESES-MADUR-CARACT >= 0
                    MOVE MESES-MADUR-CARACT TO 00EXP001
                 ELSE
                    MOVE " -3" TO 00EXP001(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00EXP001(1:3)
              END-IF
           END-IF.
      *** 00EXP002 *** PRODUCTO CON HASTA  6 MESES EN LIBROS
      *** 00EXP003 *** PRODUCTO CON HASTA 12 MESES EN LIBROS
      *** 00EXP004 *** PRODUCTO CON HASTA 24 MESES EN LIBROS
      *** 00EXP005 *** PRODUCTO CON HASTA 36 MESES EN LIBROS
      *** 00EXP006 *** PRODUCTO CON HASTA 48 MESES EN LIBROS
      *** 00EXP007 *** PRODUCTO CON HASTA 60 MESES EN LIBROS
      *** 00EXP008 *** PRODUCTO CON MAS DE 60 MESES EN LIBROS
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO" OR "AH" OR "CT"
             MOVE ZEROS TO 00EXP002 00EXP003 00EXP004 00EXP005
                           00EXP006 00EXP007 00EXP008
             IF REG-ABIERTO-CARACT = 1
               IF FECHA-APERT-CARACT > ZEROS
                  IF MESES-MADUR-CARACT >= 0
                    IF MESES-MADUR-CARACT >= 0 AND <= 06
                       MOVE 1 TO 00EXP002
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 12
                       MOVE 1 TO 00EXP003
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 24
                       MOVE 1 TO 00EXP004
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 36
                       MOVE 1 TO 00EXP005
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 48
                       MOVE 1 TO 00EXP006
                    END-IF
                    IF MESES-MADUR-CARACT >= 0 AND <= 60
                       MOVE 1 TO 00EXP007
                    END-IF
                    IF MESES-MADUR-CARACT > 60
                       MOVE 1 TO 00EXP008
                    END-IF
                  ELSE
                    MOVE " -4" TO 00EXP002(1:3)
                    MOVE " -4" TO 00EXP003(1:3)
                    MOVE " -4" TO 00EXP004(1:3)
                    MOVE " -4" TO 00EXP005(1:3)
                    MOVE " -4" TO 00EXP006(1:3)
                    MOVE " -4" TO 00EXP007(1:3)
                    MOVE " -4" TO 00EXP008(1:3)
                  END-IF
               ELSE
                 MOVE " -3" TO 00EXP002(1:3)
                 MOVE " -3" TO 00EXP003(1:3)
                 MOVE " -3" TO 00EXP004(1:3)
                 MOVE " -3" TO 00EXP005(1:3)
                 MOVE " -3" TO 00EXP006(1:3)
                 MOVE " -3" TO 00EXP007(1:3)
                 MOVE " -3" TO 00EXP008(1:3)
               END-IF
             ELSE
               MOVE " -2" TO 00EXP002(1:3)
               MOVE " -2" TO 00EXP003(1:3)
               MOVE " -2" TO 00EXP004(1:3)
               MOVE " -2" TO 00EXP005(1:3)
               MOVE " -2" TO 00EXP006(1:3)
               MOVE " -2" TO 00EXP007(1:3)
               MOVE " -2" TO 00EXP008(1:3)
             END-IF
           END-IF.

       2550-CALCULA-CARACT-01EXP.
REMARK******************************************************************
REMARK*2550-CALCULA-CARACT-01EXP.
REMARK******************************************************************
           MOVE COD-PORTAF-CARACT TO 01EXPPTF(IND-PORTAF-CARACT).
      *** 01EXP001 *** MESES DESDE APERTURA DEL PRODUCTO MAS ANTIGUO
           IF 00EXP001 >= 0
GNT001       IF 01EXP001(IND-PORTAF-CARACT) < 0 OR = "999"              DLM0010
                MOVE ZEROS TO 01EXP001(IND-PORTAF-CARACT)
             END-IF
             IF 00EXP001 > 01EXP001(IND-PORTAF-CARACT)
                MOVE 00EXP001 TO 01EXP001(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01EXP001(IND-PORTAF-CARACT) < 0 OR = "999"              DLM0010
               IF FUNCTION NUMVAL(00EXP001(2:2)) < 
                  FUNCTION NUMVAL(01EXP001(IND-PORTAF-CARACT)(2:2))
                 MOVE 00EXP001(1:3) TO 01EXP001(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP002 *** MESES DESDE APERTURA DEL PRODUCTO MAS RECIENTE
           IF 00EXP001 >= 0
             IF 01EXP002(IND-PORTAF-CARACT) < 0
                MOVE 999 TO 01EXP002(IND-PORTAF-CARACT)
             END-IF
             IF 00EXP001 < 01EXP002(IND-PORTAF-CARACT)
                MOVE 00EXP001 TO 01EXP002(IND-PORTAF-CARACT)
             END-IF
           ELSE
GNT001       IF 01EXP002(IND-PORTAF-CARACT) < 0 OR = "999"              DLM0010
               IF FUNCTION NUMVAL(00EXP001(2:2)) < 
                  FUNCTION NUMVAL(01EXP002(IND-PORTAF-CARACT)(2:2))
                 MOVE 00EXP001(1:3) TO 01EXP002(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP003 *** MESES DESDE APERTURA DEL PRODUCTO ABIERTO MAS ANTIGUO
           IF 00EXP001 >= 0
             IF REG-ABIERTO-CARACT = 1
GNT001         IF 01EXP003(IND-PORTAF-CARACT) < 0 OR = "999"            DLM0010
                  MOVE ZEROS TO 01EXP003(IND-PORTAF-CARACT)
               END-IF
               IF 00EXP001 > 01EXP003(IND-PORTAF-CARACT)
                  MOVE 00EXP001 TO 01EXP003(IND-PORTAF-CARACT)
               END-IF
             ELSE
GNT001         IF 01EXP003(IND-PORTAF-CARACT) < 0 OR = "999"            DLM0010
                  MOVE " -4" TO 01EXP003(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           ELSE
GNT001       IF 01EXP003(IND-PORTAF-CARACT) < 0 OR = "999"              DLM0010
               IF FUNCTION NUMVAL(00EXP001(2:2)) < 
                  FUNCTION NUMVAL(01EXP003(IND-PORTAF-CARACT)(2:2))
                 MOVE 00EXP001(1:3) TO 01EXP003(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP004 *** MESES DESDE APERTURA DEL PRODUCTO ABIERTO MAS RECIENTE
           IF 00EXP001 >= 0
             IF REG-ABIERTO-CARACT = 1
               IF 01EXP004(IND-PORTAF-CARACT) < 0
                  MOVE 999 TO 01EXP004(IND-PORTAF-CARACT)
               END-IF
               IF 00EXP001 < 01EXP004(IND-PORTAF-CARACT)
                  MOVE 00EXP001 TO 01EXP004(IND-PORTAF-CARACT)
               END-IF
             ELSE
GNT001         IF 01EXP004(IND-PORTAF-CARACT) < 0 OR = "999"            DLM0010
                  MOVE " -4" TO 01EXP004(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           ELSE
GNT001       IF 01EXP004(IND-PORTAF-CARACT) < 0 OR = "999"              DLM0010
               IF FUNCTION NUMVAL(00EXP001(2:2)) < 
                  FUNCTION NUMVAL(01EXP004(IND-PORTAF-CARACT)(2:2))
                 MOVE 00EXP001(1:3) TO 01EXP004(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP005 *** EDAD DEL PRODUCTO CANCELADO MAS RECIENTE 
           IF 00EXP001 >= 0
             IF REG-CERRADO-CARACT = 1
               IF 01EXP005(IND-PORTAF-CARACT) < 0
                  MOVE 999 TO 01EXP005(IND-PORTAF-CARACT)
               END-IF
               IF 00EXP001 < 01EXP005(IND-PORTAF-CARACT)
                  MOVE 00EXP001 TO 01EXP005(IND-PORTAF-CARACT)
               END-IF
             ELSE
GNT001         IF 01EXP005(IND-PORTAF-CARACT) < 0 OR = "999"            DLM0010
                  MOVE " -4" TO 01EXP005(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           ELSE
GNT001       IF 01EXP005(IND-PORTAF-CARACT) < 0 OR = "999"              DLM0010
               IF FUNCTION NUMVAL(00EXP001(2:2)) < 
                  FUNCTION NUMVAL(01EXP005(IND-PORTAF-CARACT)(2:2))
                 MOVE 00EXP001(1:3) TO 01EXP005(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP006 *** EDAD PROMEDIO DEL PORTAFOLIO DE PRODUCTOS ABIERTOS
           IF 00EXP001 >= 0
             IF REG-ABIERTO-CARACT = 1
GNT001         IF 01EXP006(IND-PORTAF-CARACT) < 0 OR = "999"            DLM0010
                  MOVE ZEROS TO 01EXP006(IND-PORTAF-CARACT)
               END-IF
               ADD 1 TO 01EXPTOT(IND-PORTAF-CARACT)
               COMPUTE 01EXPSUM(IND-PORTAF-CARACT) = 
                       01EXPSUM(IND-PORTAF-CARACT) + 00EXP001
             ELSE
GNT001         IF 01EXP006(IND-PORTAF-CARACT) < 0 OR = "999"            DLM0010
                  MOVE " -4" TO 01EXP006(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           ELSE
GNT001       IF 01EXP006(IND-PORTAF-CARACT) < 0 OR = "999"              DLM0010
               IF FUNCTION NUMVAL(00EXP001(2:2)) < 
                  FUNCTION NUMVAL(01EXP006(IND-PORTAF-CARACT)(2:2))
                 MOVE 00EXP001(1:3) TO 01EXP006(IND-PORTAF-CARACT)(1:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP007 *** NUMERO DE PRODUCTOS CON HASTA  6 MESES EN LIBROS   
           IF 00EXP002 = 1
             IF 01EXP007(IND-PORTAF-CARACT) < 1
                MOVE ZEROS TO 01EXP007(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01EXP007(IND-PORTAF-CARACT)
           ELSE
             IF 01EXP007(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00EXP002(1:3)) < 
                  FUNCTION NUMVAL(01EXP007(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01EXP007(IND-PORTAF-CARACT)(1:1)
                 MOVE 00EXP002(1:3) TO 01EXP007(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP008 *** NUMERO DE PRODUCTOS CON HASTA 12 MESES EN LIBROS   
           IF 00EXP003 = 1
             IF 01EXP008(IND-PORTAF-CARACT) < 1
                MOVE ZEROS TO 01EXP008(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01EXP008(IND-PORTAF-CARACT)
           ELSE
             IF 01EXP008(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00EXP003(1:3)) < 
                  FUNCTION NUMVAL(01EXP008(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01EXP008(IND-PORTAF-CARACT)(1:1)
                 MOVE 00EXP003(1:3) TO 01EXP008(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP009 *** NUMERO DE PRODUCTOS CON HASTA 24 MESES EN LIBROS   
           IF 00EXP004 = 1
             IF 01EXP009(IND-PORTAF-CARACT) < 1
                MOVE ZEROS TO 01EXP009(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01EXP009(IND-PORTAF-CARACT)
           ELSE
             IF 01EXP009(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00EXP004(1:3)) < 
                  FUNCTION NUMVAL( 01EXP009(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01EXP009(IND-PORTAF-CARACT)(1:1)
                 MOVE 00EXP004(1:3) TO 01EXP009(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP010 *** NUMERO DE PRODUCTOS CON HASTA 36 MESES EN LIBROS   
           IF 00EXP005 = 1
             IF 01EXP010(IND-PORTAF-CARACT) < 1
                MOVE ZEROS TO 01EXP010(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01EXP010(IND-PORTAF-CARACT)
           ELSE
             IF 01EXP010(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00EXP005(1:3)) < 
                  FUNCTION NUMVAL(01EXP010(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01EXP010(IND-PORTAF-CARACT)(1:1)
                 MOVE 00EXP005(1:3) TO 01EXP010(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP011 *** NUMERO DE PRODUCTOS CON HASTA 48 MESES EN LIBROS   
           IF 00EXP006 = 1
             IF 01EXP011(IND-PORTAF-CARACT) < 1
                MOVE ZEROS TO 01EXP011(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01EXP011(IND-PORTAF-CARACT)
           ELSE
             IF 01EXP011(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00EXP006(1:3)) < 
                  FUNCTION NUMVAL(01EXP011(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01EXP011(IND-PORTAF-CARACT)(1:1)
                 MOVE 00EXP006(1:3) TO 01EXP011(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP012 *** NUMERO DE PRODUCTOS CON HASTA 60 MESES EN LIBROS   
           IF 00EXP007 = 1
             IF 01EXP012(IND-PORTAF-CARACT) < 1
                MOVE ZEROS TO 01EXP012(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01EXP012(IND-PORTAF-CARACT)
           ELSE
             IF 01EXP012(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00EXP007(1:3)) < 
                  FUNCTION NUMVAL(01EXP012(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01EXP012(IND-PORTAF-CARACT)(1:1)
                 MOVE 00EXP007(1:3) TO 01EXP012(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.
      *** 01EXP013 *** NUMERO DE PRODUCTOS CON MAS DE 60 MESES EN LIBROS   
           IF 00EXP008 = 1
             IF 01EXP013(IND-PORTAF-CARACT) < 1
                MOVE ZEROS TO 01EXP013(IND-PORTAF-CARACT)
             END-IF
             ADD 1 TO 01EXP013(IND-PORTAF-CARACT)
           ELSE
             IF 01EXP013(IND-PORTAF-CARACT) < 1
               IF FUNCTION NUMVAL(00EXP008(1:3)) < 
                  FUNCTION NUMVAL(01EXP013(IND-PORTAF-CARACT)(1:4))
                 MOVE " " TO 01EXP013(IND-PORTAF-CARACT)(1:1)
                 MOVE 00EXP008(1:3) TO 01EXP013(IND-PORTAF-CARACT)(2:3)
               END-IF
             END-IF
           END-IF.

       2580-1-CALCULA-CARACT-02EXP.
REMARK******************************************************************
REMARK*2580-1-CALCULA-CARACT-02EXP.
REMARK******************************************************************
           PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL I-CARACT > 9
           IF 01EXPPTF(I-CARACT) NOT = ZEROS
             MOVE 01EXPPTF(I-CARACT) TO 02EXPPTF(I-CARACT)
      *** 02EXP001 *** MESES DESDE LA APERTURA DEL PRODUCTO MAS ANTIGUO 
             IF 01EXP001(I-CARACT) >= 0
              IF 02EXP001TO < 0
                 MOVE ZEROS TO 02EXP001TO
              END-IF
              IF 01EXP001(I-CARACT) > 02EXP001TO
                 MOVE 01EXP001(I-CARACT) TO 02EXP001TO
              END-IF
             ELSE
              IF 02EXP001TO < 1
                IF FUNCTION NUMVAL(01EXP001(I-CARACT)(1:3)) <
                   FUNCTION NUMVAL(02EXP001TO(1:3))
                  MOVE 01EXP001(I-CARACT)(1:3) TO 02EXP001TO(1:3)
                END-IF
              END-IF
             END-IF
      *** 02EXP002*** MESES DESDE LA APERTURA DEL PRODUCTO MAS RECIENTE
             IF 01EXP002(I-CARACT) >= 0
              IF 02EXP002TO < 0
                 MOVE 999 TO 02EXP002TO
              END-IF
              IF 01EXP002(I-CARACT) < 02EXP002TO
                 MOVE 01EXP002(I-CARACT) TO 02EXP002TO
              END-IF
             ELSE
GNT001        IF 02EXP002TO < 0 OR = "999"                              DLM0010
                IF FUNCTION NUMVAL(01EXP002(I-CARACT)(1:3)) < 
                   FUNCTION NUMVAL(02EXP002TO(1:3))
                  MOVE 01EXP002(I-CARACT)(1:3) TO 02EXP002TO(1:3)
                END-IF
              END-IF
             END-IF
      *** 02EXP003 *** MESES DESDE LA APERTURA DEL PRODUCTO ABIERTO MAS ANTIGUO 
             IF 01EXP003(I-CARACT) >= 0
GNT001        IF 02EXP003TO < 0 OR = "999"                              DLM0010
                 MOVE ZEROS TO 02EXP003TO
              END-IF
              IF 01EXP003(I-CARACT) > 02EXP003TO
                 MOVE 01EXP003(I-CARACT) TO 02EXP003TO
              END-IF
             ELSE
GNT001        IF 02EXP003TO < 0 OR = "999"                              DLM0010
                IF FUNCTION NUMVAL(01EXP003(I-CARACT)(1:3)) <
                   FUNCTION NUMVAL(02EXP003TO(1:3))
                  MOVE 01EXP003(I-CARACT)(1:3) TO 02EXP003TO(1:3)
                END-IF
              END-IF
             END-IF
      *** 02EXP004*** MESES DESDE LA APERTURA DEL PRODUCTO ABIERTO MAS RECIENTE
             IF 01EXP004(I-CARACT) >= 0
              IF 02EXP004TO < 0
                 MOVE 999 TO 02EXP004TO
              END-IF
              IF 01EXP004(I-CARACT) < 02EXP004TO
                 MOVE 01EXP004(I-CARACT) TO 02EXP004TO
              END-IF
             ELSE
GNT001        IF 02EXP004TO < 0 OR = "999"                              DLM0010
                IF FUNCTION NUMVAL(01EXP004(I-CARACT)(1:3)) < 
                   FUNCTION NUMVAL(02EXP004TO(1:3))
                  MOVE 01EXP004(I-CARACT)(1:3) TO 02EXP004TO(1:3)
                END-IF
              END-IF
             END-IF
      *** 02EXP005*** EDAD DEL PRODUCTO CANCELADO MAS RECIENTE
             IF 01EXP005(I-CARACT) >= 0
              IF 02EXP005TO < 0
                 MOVE 999 TO 02EXP005TO
              END-IF
              IF 02EXP005TO > 01EXP005(I-CARACT)
                 MOVE 01EXP005(I-CARACT) TO 02EXP005TO
              END-IF
             ELSE
GNT001        IF 02EXP005TO < 0 OR = "999"                              DLM0010
                IF FUNCTION NUMVAL(01EXP005(I-CARACT)(1:3)) <
                   FUNCTION NUMVAL(02EXP005TO(1:3))
                  MOVE 01EXP005(I-CARACT)(1:3) TO 02EXP005TO(1:3)
                END-IF
              END-IF
             END-IF
      *** 02EXP006*** EDAD PROMEDIO DEL PORTAFOLIO DE PRODUCTOS ABIERTOS
             IF 01EXP006(I-CARACT) >= 0
GNT001          IF 02EXP006TO < 0 OR = "999"                            DLM0010
                   MOVE ZEROS TO 02EXP006TO
                END-IF
                COMPUTE 02EXP006V = 02EXP006V + 01EXP006(I-CARACT)
                ADD 1 TO 02EXP006C
             ELSE
GNT001        IF 02EXP006TO < 0 OR = "999"                              DLM0010
                IF FUNCTION NUMVAL(01EXP006(I-CARACT)(1:3)) < 
                   FUNCTION NUMVAL(02EXP006TO(1:3))
                  MOVE 01EXP006(I-CARACT)(1:3) TO 02EXP006TO(1:3)
                END-IF
              END-IF
             END-IF
             MOVE "-99" TO 02EXP001(I-CARACT)(1:3)
                           02EXP002(I-CARACT)(1:3)
                           02EXP003(I-CARACT)(1:3)
                           02EXP004(I-CARACT)(1:3)
                           02EXP005(I-CARACT)(1:3)
                           02EXP006(I-CARACT)(1:3)
      *** 02EXP007*** PORCENTAJE DE PRODUCTOS CON HASTA 6 MESES EN LIBROS
            MOVE ZEROS TO TMP-SUMA-EXP-CARACT
            IF 01EXP012(I-CARACT) > ZEROS
             IF I-CARACT NOT = 7
               COMPUTE TMP-SUMA-EXP-CARACT = TMP-SUMA-EXP-CARACT + 
                       01EXP012(I-CARACT)
               COMPUTE 02EXP007DTO = 02EXP007DTO + 01EXP012(I-CARACT) 
               COMPUTE 02EXP008DTO = 02EXP008DTO + 01EXP012(I-CARACT) 
               COMPUTE 02EXP009DTO = 02EXP009DTO + 01EXP012(I-CARACT) 
               COMPUTE 02EXP010DTO = 02EXP010DTO + 01EXP012(I-CARACT) 
               COMPUTE 02EXP011DTO = 02EXP011DTO + 01EXP012(I-CARACT) 
               COMPUTE 02EXP012DTO = 02EXP012DTO + 01EXP012(I-CARACT) 
               COMPUTE 02EXP013DTO = 02EXP013DTO + 01EXP012(I-CARACT) 
             END-IF
            END-IF
            IF 01EXP013(I-CARACT) > ZEROS
             IF I-CARACT NOT = 7
               COMPUTE TMP-SUMA-EXP-CARACT = TMP-SUMA-EXP-CARACT + 
                       01EXP013(I-CARACT)
               COMPUTE 02EXP007DTO = 02EXP007DTO + 01EXP013(I-CARACT) 
               COMPUTE 02EXP008DTO = 02EXP008DTO + 01EXP013(I-CARACT) 
               COMPUTE 02EXP009DTO = 02EXP009DTO + 01EXP013(I-CARACT) 
               COMPUTE 02EXP010DTO = 02EXP010DTO + 01EXP013(I-CARACT) 
               COMPUTE 02EXP011DTO = 02EXP011DTO + 01EXP013(I-CARACT) 
               COMPUTE 02EXP012DTO = 02EXP012DTO + 01EXP013(I-CARACT) 
               COMPUTE 02EXP013DTO = 02EXP013DTO + 01EXP013(I-CARACT) 
             END-IF
            END-IF
            IF I-CARACT NOT = 7
             IF 01EXP007(I-CARACT) >= 0 AND TMP-SUMA-EXP-CARACT > ZEROS
              COMPUTE 02EXP007(I-CARACT) ROUNDED =
                   ((01EXP007(I-CARACT) / TMP-SUMA-EXP-CARACT) * 100)
              COMPUTE 02EXP007NTO = 02EXP007NTO + 01EXP007(I-CARACT)
              MOVE 1 TO 02EXP007FTO
             ELSE
              MOVE "      -1" TO 02EXP007(I-CARACT)(1:8)
             END-IF
            ELSE
              MOVE "     -99" TO 02EXP007(I-CARACT)(1:8)
            END-IF
      *** 02EXP008*** PORCENTAJE DE PRODUCTOS CON HASTA 12 MESES EN LIBROS
            IF I-CARACT NOT = 7
             IF 01EXP008(I-CARACT) >= 0 AND TMP-SUMA-EXP-CARACT > ZEROS
              COMPUTE 02EXP008(I-CARACT) ROUNDED =
                   ((01EXP008(I-CARACT) / TMP-SUMA-EXP-CARACT) * 100)
              COMPUTE 02EXP008NTO = 02EXP008NTO + 01EXP008(I-CARACT)
              MOVE 1 TO 02EXP008FTO
             ELSE
              MOVE "      -1" TO 02EXP008(I-CARACT)(1:8)
             END-IF
            ELSE
              MOVE "     -99" TO 02EXP008(I-CARACT)(1:8)
            END-IF
      *** 02EXP009*** PORCENTAJE DE PRODUCTOS CON HASTA 24 MESES EN LIBROS
            IF I-CARACT NOT = 7
             IF 01EXP009(I-CARACT) >= 0 AND TMP-SUMA-EXP-CARACT > ZEROS
              COMPUTE 02EXP009(I-CARACT) ROUNDED =
                   ((01EXP009(I-CARACT) / TMP-SUMA-EXP-CARACT) * 100)
              COMPUTE 02EXP009NTO = 02EXP009NTO + 01EXP009(I-CARACT)
              MOVE 1 TO 02EXP009FTO
             ELSE
              MOVE "      -1" TO 02EXP009(I-CARACT)(1:8)
             END-IF
            ELSE
              MOVE "     -99" TO 02EXP009(I-CARACT)(1:8)
            END-IF
      *** 02EXP010*** PORCENTAJE DE PRODUCTOS CON HASTA 36 MESES EN LIBROS
            IF I-CARACT NOT = 7
             IF 01EXP010(I-CARACT) >= 0 AND TMP-SUMA-EXP-CARACT > ZEROS
              COMPUTE 02EXP010(I-CARACT) ROUNDED =
                   ((01EXP010(I-CARACT) / TMP-SUMA-EXP-CARACT) * 100)
              COMPUTE 02EXP010NTO = 02EXP010NTO + 01EXP010(I-CARACT)
              MOVE 1 TO 02EXP010FTO
             ELSE
              MOVE "      -1" TO 02EXP010(I-CARACT)(1:8)
             END-IF
            ELSE
              MOVE "     -99" TO 02EXP010(I-CARACT)(1:8)
            END-IF
      *** 02EXP011*** PORCENTAJE DE PRODUCTOS CON HASTA 48 MESES EN LIBROS
            IF I-CARACT NOT = 7
             IF 01EXP011(I-CARACT) >= 0 AND TMP-SUMA-EXP-CARACT > ZEROS
              COMPUTE 02EXP011(I-CARACT) ROUNDED =
                   ((01EXP011(I-CARACT) / TMP-SUMA-EXP-CARACT) * 100)
              COMPUTE 02EXP011NTO = 02EXP011NTO + 01EXP011(I-CARACT)
              MOVE 1 TO 02EXP011FTO
             ELSE
              MOVE "      -1" TO 02EXP011(I-CARACT)(1:8)
             END-IF
            ELSE
              MOVE "     -99" TO 02EXP011(I-CARACT)(1:8)
            END-IF
      *** 02EXP012*** PORCENTAJE DE PRODUCTOS CON HASTA 60 MESES EN LIBROS
            IF I-CARACT NOT = 7
             IF 01EXP012(I-CARACT) >= 0 AND TMP-SUMA-EXP-CARACT > ZEROS 
              COMPUTE 02EXP012(I-CARACT) ROUNDED =
                   ((01EXP012(I-CARACT) / TMP-SUMA-EXP-CARACT) * 100)
              COMPUTE 02EXP012NTO = 02EXP012NTO + 01EXP012(I-CARACT)
              MOVE 1 TO 02EXP012FTO
             ELSE
              MOVE "      -1" TO 02EXP012(I-CARACT)(1:8)
             END-IF
            ELSE
              MOVE "     -99" TO 02EXP012(I-CARACT)(1:8)
            END-IF
      *** 02EXP013*** PORCENTAJE DE PRODUCTOS CON MAS 60 MESES EN LIBROS
            IF I-CARACT NOT = 7
             IF 01EXP013(I-CARACT) >= 0 AND TMP-SUMA-EXP-CARACT > ZEROS
              COMPUTE 02EXP013(I-CARACT) ROUNDED =
                   ((01EXP013(I-CARACT) / TMP-SUMA-EXP-CARACT) * 100)
              COMPUTE 02EXP013NTO = 02EXP013NTO + 01EXP013(I-CARACT)
              MOVE 1 TO 02EXP013FTO
             ELSE
              MOVE "      -1" TO 02EXP013(I-CARACT)(1:8)
             END-IF
            ELSE
              MOVE "     -99" TO 02EXP013(I-CARACT)(1:8)
            END-IF
           END-IF
           END-PERFORM
      *** 02EXP*** CALCULA CARACTERISTICAS 02EXP AGRUPADAS POR PORTAFOLIO
           IF 02EXP006V >= 0 AND 02EXP006C > 0
              COMPUTE 02EXP006TO ROUNDED =
                      (02EXP006V / 02EXP006C)
           END-IF
           IF 02EXP007NTO >= 0 AND 02EXP007DTO > 0 AND 02EXP007FTO = 1
              COMPUTE 02EXP007TO ROUNDED =
                      ((02EXP007NTO / 02EXP007DTO) * 100)
           ELSE
              MOVE "      -1" TO 02EXP007TO(1:8)     
           END-IF
           IF 02EXP008NTO >= 0 AND 02EXP008DTO > 0 AND 02EXP008FTO = 1
              COMPUTE 02EXP008TO ROUNDED =
                      ((02EXP008NTO / 02EXP008DTO) * 100)
           ELSE
              MOVE "      -1" TO 02EXP008TO(1:8)     
           END-IF
           IF 02EXP009NTO >= 0 AND 02EXP009DTO > 0 AND 02EXP009FTO = 1
              COMPUTE 02EXP009TO ROUNDED =
                      ((02EXP009NTO / 02EXP009DTO) * 100)
           ELSE
              MOVE "      -1" TO 02EXP009TO(1:8)     
           END-IF
           IF 02EXP010NTO >= 0 AND 02EXP010DTO > 0 AND 02EXP010FTO = 1
              COMPUTE 02EXP010TO ROUNDED =
                      ((02EXP010NTO / 02EXP010DTO) * 100)
           ELSE
              MOVE "      -1" TO 02EXP010TO(1:8)     
           END-IF
           IF 02EXP011NTO >= 0 AND 02EXP011DTO > 0 AND 02EXP011FTO = 1
              COMPUTE 02EXP011TO ROUNDED =
                      ((02EXP011NTO / 02EXP011DTO) * 100)
           ELSE
              MOVE "      -1" TO 02EXP011TO(1:8)     
           END-IF
           IF 02EXP012NTO >= 0 AND 02EXP012DTO > 0 AND 02EXP012FTO = 1
              COMPUTE 02EXP012TO ROUNDED =
                      ((02EXP012NTO / 02EXP012DTO) * 100)
           ELSE
              MOVE "      -1" TO 02EXP012TO(1:8)     
           END-IF
           IF 02EXP013NTO >= 0 AND 02EXP013DTO > 0 AND 02EXP013FTO = 1
              COMPUTE 02EXP013TO ROUNDED =
                      ((02EXP013NTO / 02EXP013DTO) * 100)
           ELSE
              MOVE "      -1" TO 02EXP013TO(1:8)     
           END-IF.

       2600-CALCULA-CARACT-00DEM.
REMARK******************************************************************
REMARK*2600-CALCULA-CARACT-00DEM.
REMARK******************************************************************
      *** 00DEM002 *** ESTADO DE VIDA BASADO EN REPORTE DEL SUSCRIPTOR
FALL01     IF ADJETIVO-CARACT = 1 AND GARANTE-CARACT = 0                RMB0014
              MOVE 1 TO 00DEM002
           END-IF.
      *** 00DEM027 *** NUMERO DE ENTIDADES CON QUE TIENE RELACION
           MOVE 1 TO IND-E-CARACT
           PERFORM UNTIL TAB-00DEM027(IND-E-CARACT) = 99999999999 OR
                   TAB-00DEM027(IND-E-CARACT) = NIT-SUSCRIP-S-ABD02
             ADD 1 TO IND-E-CARACT
           END-PERFORM
           IF TAB-00DEM027(IND-E-CARACT) = 99999999999
              MOVE NIT-SUSCRIP-S-ABD02 TO TAB-00DEM027(IND-S-CARACT)
              MOVE 99999999999 TO TAB-00DEM027(IND-S-CARACT + 1)
              ADD 1 TO IND-S-CARACT
           END-IF.
ACIEAA*** 01DEM031 *** VER RELACION CON EL NIT CONSULTANTE              RMB0012
ACIEAA     EVALUATE NIT-RELACION-CARACT                                 RMB0012
ACIEAA       WHEN 99999999999                                           RMB0012
ACIEAA            MOVE 1 TO 01DEM031                                    RMB0012
ACIEAA       WHEN 88888888888                                           RMB0012
ACIEAA            MOVE 0 TO 01DEM031                                    RMB0012
ACIEAA       WHEN ANY                                                   RMB0012
ACIEAA          IF NIT-RELACION-CARACT = NIT-SUSCRIP-S-ABD02            RMB0012
ACIEAA             MOVE 1 TO 01DEM031                                   RMB0012
ACIEAA          END-IF                                                  RMB0012
ACIEAA     END-EVALUATE.                                                RMB0012
       2600-1-CALCULA-CARACT-00DEM.
REMARK******************************************************************
REMARK*2600-1-CALCULA-CARACT-00DEM.
REMARK******************************************************************
           MOVE ZEROS TO 00DEM001 00DEM003 00DEM006 00DEM012 00DEM016
                         00DEM007 00DEM027
ACIEAA                   00DEM031                                       RMB0012
           MOVE TIPO-ID-CARACT TO 00DEMTIP
           MOVE NRO-ID-CARACT  TO 00DEMNRO
           MOVE 0 TO DEM-ERR-CARACT
           IF TIPO-ID-CARACT = 1
              MOVE TIPO-ID-CARACT TO TIPO-ID-BDIIREGI
              MOVE NRO-ID-CARACT  TO CEDULA-BDIIREGI
              READ BDIIREGI WITH IGNORE LOCK
                   INVALID KEY
                     MOVE 1 TO DEM-ERR-CARACT
                   NOT INVALID KEY
                     MOVE 0 TO DEM-ERR-CARACT
              END-READ
              IF DEM-ERR-CARACT = 0
      *** 00DEM001 *** ESTADO DE VIDA BASADO EN REPORTE DE REGISTRADURIA
                IF ESTADO-VIG-BDIIREGI = 21
                   MOVE 1 TO 00DEM001
                END-IF
      *** 00DEM003 *** EDAD BASADO EN REPORTE DE REGISTRADURIA
                IF FECHA-EXPEDI-BDIIREGI > ZEROS
                   MOVE FECHA-EXPEDI-BDIIREGI TO FECHA-EXP-CARACT
                   COMPUTE 00DEM003 = (ANO-RUN-DATE-CARACT -
                           ANO-EXP-CARACT) + 18
                ELSE
                   MOVE " -1" TO 00DEM003(1:3)
                END-IF
      *** 00DEM006 *** GENERO BASADO EN REPORTE DE REGISTRADURIA
                IF IND-SEXO-BDIIREGI = "M" OR "m"
                   MOVE 0 TO 00DEM006
                ELSE
                   IF IND-SEXO-BDIIREGI = "F" OR "f"
                      MOVE 1 TO 00DEM006
                   ELSE
                      MOVE "-1" TO 00DEM006(1:2)
                   END-IF
                END-IF
      *** 00DEM012 *** CIUDAD DE EXPEDICION DEL DOCUMENTO DE IDENT
                IF MUNIC-EXP-BDIIREGI > ZEROS
                   MOVE MUNIC-EXP-BDIIREGI TO 00DEM012
                ELSE
                   MOVE " -1" TO 00DEM012(1:3)
                END-IF
      *** 00DEM016 *** CIUDAD DE EXPEDICION DEL DOCUMENTO DE IDENT
                IF DEP-EXP-BDIIREGI > ZEROS
                   MOVE DEP-EXP-BDIIREGI TO 00DEM016
                ELSE
                   MOVE "-1" TO 00DEM016(1:2)
                END-IF
              END-IF
           END-IF.
           MOVE 0 TO DEM-ERR-CARACT
           IF TIPO-ID-CARACT = 4
              MOVE TIPO-ID-CARACT TO TIPO-ID-BDIIDAS
              MOVE NRO-ID-CARACT  TO NUM-ID-BDIIDAS
              READ BDIIDAS WITH IGNORE LOCK
                   INVALID KEY
                     MOVE 1 TO DEM-ERR-CARACT
                   NOT INVALID KEY
                     MOVE 0 TO DEM-ERR-CARACT
              END-READ
              IF DEM-ERR-CARACT = 0
                 IF NACIO-BDIIDAS <> SPACES
                    IF NACIO-BDIIDAS = "COLOMBIANO" OR "COLOMBIANA"
                       MOVE 1 TO 00DEM007
                    ELSE
                       MOVE 2 TO 00DEM007
                    END-IF
                 ELSE
                    MOVE "-1" TO 00DEM007(1:2)
                 END-IF
              END-IF
           END-IF.
      *** 00DEM026 *** ESTRATO SOCIOECONOMICO
      *** ESTE DATO NO SE GUARDA ACTUALMENTE EN LA BASE DE DATOS
           MOVE ZEROS TO 00DEM026
CARA01     PERFORM 2610-CALCULAR-00DEM026.                              RMB0006
      *** 00DEM027 *** NUMERO DE ENTIDADES CON QUE TIENE RELACION
           MOVE 1 TO IND-E-CARACT
           PERFORM UNTIL TAB-00DEM027(IND-E-CARACT) = 99999999999
             ADD 1 TO 00DEM027
             ADD 1 TO IND-E-CARACT
           END-PERFORM.
CARA01*** 00DEM030 *** ACTIVIDAD ECONOMICA                              RMB0006
CARA01     MOVE "  -1" TO 00DEM030(1:4).                                RMB0006
CARA01     IF TIPO-ID-CARACT = 1                                        RMB0006
CARA01        MOVE NRO-ID-CARACT  TO NITS-BDIIDIAN                      RMB0006
CARA01        READ BDIIDIAN WITH IGNORE LOCK                            RMB0006
CARA01             INVALID KEY                                          RMB0006
CARA01               MOVE 1 TO DEM-ERR-CARACT                           RMB0006
CARA01             NOT INVALID KEY                                      RMB0006
CARA01               MOVE 0 TO DEM-ERR-CARACT                           RMB0006
CARA01        END-READ                                                  RMB0006
CARA01        IF DEM-ERR-CARACT = 0                                     RMB0006
CARA01           IF COD-CIIU-BDIIDIAN NOT NUMERIC                       RMB0006
CARA01              MOVE ZEROS TO 00DEM030                              RMB0006
CARA01           ELSE                                                   RMB0006
CARA01              MOVE COD-CIIU-BDIIDIAN TO 00DEM030                  RMB0006
CARA01           END-IF                                                 RMB0006
CARA01        END-IF                                                    RMB0006
CARA01     END-IF.                                                      RMB0006
ACIEAA*** 00DEM031 *** NIT PARA VER RELACIONAMIENTO                     RMB0012
ACIEAA     IF NIT-RELACION-CARACT = ZEROS OR SPACES                     RMB0012
ACIEAA        MOVE "         -1" TO 00DEM031(1:11)                      RMB0012
ACIEAA     ELSE                                                         RMB0012
ACIEAA        MOVE   NIT-RELACION-CARACT TO 00DEM031                    RMB0012
ACIEAA     END-IF.                                                      RMB0012
CARA01 2610-CALCULAR-00DEM026.                                          RMB0006
CARA01     INITIALIZE REG-BDLSTR  .                                     RMB0006
CARA01     MOVE TIPO-ID-CARACT         TO TIPIDE-BDLSTR  .              RMB0006
CARA01     MOVE NRO-ID-CARACT          TO NUMIDE-BDLSTR  .              RMB0006
CARA01     MOVE ZEROS                  TO 00DEM026.                     RMB0006
CARA01     READ BDLSTR   IGNORE LOCK INVALID KEY                        RMB0006
CARA01          MOVE "-1" TO 00DEM026(1:2)                              RMB0006
CARA01     END-READ.                                                    RMB0006
CARA01     IF 00DEM026 = ZEROS                                          RMB0006
CARA01        IF FECHA-RUN-CARACT >= FECACT-BDLSTR                      RMB0006
CARA01           MOVE VECTOR-BDLSTR  (1:1) TO 00DEM026(2:1)             RMB0006
CARA01        ELSE                                                      RMB0006
CARA01           MOVE " " TO ULTEST-CARACT                              RMB0006
CARA01           MOVE 60 TO I-CARACT                                    RMB0006
CARA01           PERFORM UNTIL I-CARACT = 0                             RMB0006
CARA01             IF VECTOR-BDLSTR  (I-CARACT:1) = " "                 RMB0006
CARA01                MOVE ULTEST-CARACT TO VECTOR-BDLSTR(I-CARACT:1)   RMB0006
CARA01             ELSE                                                 RMB0006
CARA01                MOVE VECTOR-BDLSTR(I-CARACT:1) TO ULTEST-CARACT   RMB0006
CARA01             END-IF                                               RMB0006
CARA01             SUBTRACT 1 FROM I-CARACT                             RMB0006
CARA01           END-PERFORM                                            RMB0006
CARA01           MOVE FECACT-BDLSTR TO FECHA-ESTADO-CARACT              RMB0006
CARA01           COMPUTE I-CARACT   =                                   RMB0006
CARA01             (SIG-ANO-NOV-CARACT  * 12 + MES-NOV-CARACT     ) -   RMB0006
CARA01             (ANO-RUN-CARACT      * 12 + MES-RUN-CARACT) + 1      RMB0006
CARA01           IF I-CARACT   <= 60                                    RMB0006
CARA01              IF VECTOR-BDLSTR  (I-CARACT:1) <> " "               RMB0006
CARA01                 MOVE VECTOR-BDLSTR(I-CARACT:1) TO 00DEM026(2:1)  RMB0006
CARA01              ELSE                                                RMB0006
CARA01                 IF EST-ANTIGUO-BDLSTR = " "                      RMB0006
CARA01                    MOVE "-4"                   TO 00DEM026(1:2)  RMB0006
CARA01                 ELSE                                             RMB0006
CARA01                    MOVE EST-ANTIGUO-BDLSTR     TO 00DEM026(2:1)  RMB0006
CARA01                 END-IF                                           RMB0006
CARA01              END-IF                                              RMB0006
CARA01           ELSE                                                   RMB0006
CARA01              IF EST-ANTIGUO-BDLSTR = " "                         RMB0006
CARA01                 MOVE "-4"                     TO 00DEM026(1:2)   RMB0006
CARA01              ELSE                                                RMB0006
CARA01                 MOVE EST-ANTIGUO-BDLSTR       TO 00DEM026(2:1)   RMB0006
CARA01              END-IF                                              RMB0006
CARA01           END-IF                                                 RMB0006
CARA01        END-IF                                                    RMB0006
CARA01     END-IF.                                                      RMB0006
       2650-CALCULA-CARACT-01DEM.
REMARK******************************************************************
REMARK*2650-CALCULA-CARACT-01DEM.
REMARK******************************************************************
           MOVE TIPO-ID-CARACT TO 01DEMTIP
           MOVE NRO-ID-CARACT  TO 01DEMNRO
      *** 01DEM001 *** ESTADO DE VIDA
           IF 00DEM002 = 1
              MOVE 1 TO 01DEM001
CAV002     ELSE
CAV002        IF 00DEM001 = 1
CAV002           MOVE 1 TO 01DEM001
CAV002        END-IF
           END-IF.

       2710-CARCAR-VEC-VAL-00END.
REMARK******************************************************************
REMARK*2710-CARCAR-VEC-VAL-00END.
REMARK*     SE CONSULTA EL MAESTRO DE VALORES Y SE CARGA DE DERECHA A
REMARK*     IZQUIERDA PARA NORMALIZARLO 
REMARK******************************************************************
ICMVLR*           IF END-ERR-CARACT = 0
EREN01     IF SW-LECTURA-LEEICMVLR = 1 OR 0     *> DE TODAS FORMAS      RMB0003 
            IF SW-NORMALIZ-VECTVAL = 1
               PERFORM VARYING J-C-CARACT FROM 1 BY 1 UNTIL
                                                      J-C-CARACT > 13
                 MOVE "          -" TO 00END001(J-C-CARACT)(1:11)
                 MOVE "          -" TO 00END002(J-C-CARACT)(1:11)
                 MOVE "          -" TO 00END003(J-C-CARACT)(1:11)
                 MOVE "          -" TO 00END004(J-C-CARACT)(1:11)
               END-PERFORM
            ELSE
               PERFORM VARYING J-C-CARACT FROM 1 BY 1 UNTIL
                                                      J-C-CARACT > 13
                 IF VEC-IND-SLD-CARACT(J-C-CARACT) = 0
                    MOVE VEC-SALDO-CARACT(J-C-CARACT) TO 
                         00END001(J-C-CARACT)
                 ELSE
                    MOVE "          -" TO 00END001(J-C-CARACT)(1:11)
                 END-IF
                 IF VEC-IND-SLDM-CARACT(J-C-CARACT) = 0
                    MOVE VEC-SALDOMOR-CARACT(J-C-CARACT) TO 
                    00END002(J-C-CARACT)
                 ELSE
                    MOVE "          -" TO 00END002(J-C-CARACT)(1:11)
                 END-IF
                 IF VEC-IND-CUO-CARACT(J-C-CARACT) = 0
                    MOVE VEC-CUOTA-CARACT(J-C-CARACT) TO 
                    00END003(J-C-CARACT)
                 ELSE
                    MOVE "          -" TO 00END003(J-C-CARACT)(1:11)
                 END-IF
                 IF VEC-IND-INI-CARACT(J-C-CARACT) = 0
                    MOVE VEC-INICIAL-CARACT(J-C-CARACT) TO 
                    00END004(J-C-CARACT)
                 ELSE
                    MOVE "          -" TO 00END004(J-C-CARACT)(1:11)
                 END-IF
               END-PERFORM
            END-IF
           END-IF.

       2700-CALCULA-CARACT-00END.
REMARK******************************************************************
REMARK*2700-CALCULA-CARACT-00END.
REMARK******************************************************************
           PERFORM 2720-INICIALIZA-00END
           MOVE LLAVE-MAES-CREDIT TO 00ENDLLV
           MOVE COD-PORTAF-CARACT TO 00ENDPTF
           PERFORM 2710-CARCAR-VEC-VAL-00END
      *** 00END001 *** VECT NORMALIZ SALDO MES ACTULA Y ULTIMOS 12 MESES
      *** 00END002 *** VECT NORMALIZ SALDO MRA MES ACTULA Y ULTIMOS 12 MESES
      *** 00END003 *** VECT NORMALIZ CUOTA MES ACTULA Y ULTIMOS 12 MESES
      *** 00END004 *** VECT NORMALIZ CUPO MES ACTULA Y ULTIMOS 12 MESES
      ***          *** ANTERIORES CAMPOS EN 2710-CARCAR-VEC-VAL-00END
      *** 00END005 *** SALDO A LA FECHA 
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "OT" OR "CO" 
              MOVE ZEROS TO 00END005
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS AND
RUNDAT              ACT-DATE-CARACT > ZEROS                             RMB0003
RUNDAT              IF FECHA-ESTADO-CARACT - ACT-DATE-CARACT >= 0       RMB0003
RUNDAT                 IF VEC-SALDO-CARACT(I13) >= ZEROS AND            RMB0003
RUNDAT                    VEC-IND-SLD-CARACT(I13) = 0                   RMB0003
                          COMPUTE 00ENDV05 ROUNDED =
RUNDAT                   (VEC-SALDO-CARACT(I13) / VEC-SMLMV-CARACT(I13))RMB0003
                         MOVE 00ENDV05 TO 00END005
                       ELSE
RUNDAT                   IF VEC-SALDO-CARACT(I13) NOT NUMERIC           RMB0003
                           MOVE "        -88" TO 00END005(1:11)
                         END-IF
                       END-IF
                    ELSE
                       MOVE "         -4" TO 00END005(1:11)
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END005(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END005(1:11)
              END-IF
           END-IF.
      *** 00END006 *** SALDO EN MORA A LA FECHA 
      *** 00END007 *** CUOTA A LA FECHA 
      *** 00END008 *** CUPO O VALOR INICIAL A LA FECHA 
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00END006 00END007
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00END008
              END-IF
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS AND
RUNDAT              ACT-DATE-CARACT > ZEROS                             RMB0003
RUNDAT              IF FECHA-ESTADO-CARACT - ACT-DATE-CARACT >= 0       RMB0003
RUNDAT                 IF VEC-SALDOMOR-CARACT(I13) >= ZEROS AND         RMB0003
RUNDAT                    VEC-IND-SLDM-CARACT(I13) = 0                  RMB0003
                          COMPUTE 00ENDV06 ROUNDED =
RUNDAT                  (VEC-SALDOMOR-CARACT(I13) /                     RMB0003
RUNDAT                                      VEC-SMLMV-CARACT(I13))      RMB0003
                        MOVE 00ENDV06 TO 00END006
                       ELSE
RUNDAT                   IF VEC-SALDOMOR-CARACT(I13) NOT NUMERIC        RMB0003
                           MOVE "        -88" TO 00END006(1:11)
                         END-IF
                       END-IF
RUNDAT                 IF VEC-CUOTA-CARACT(I13) >= ZEROS AND            RMB0003
RUNDAT                    VEC-IND-CUO-CARACT(I13) = 0                   RMB0003
                          COMPUTE 00ENDV07 ROUNDED =
RUNDAT                   (VEC-CUOTA-CARACT(I13) /                       RMB0003
RUNDAT                                       VEC-SMLMV-CARACT(I13))     RMB0003
                        MOVE 00ENDV07 TO 00END007
                       ELSE
RUNDAT                   IF VEC-CUOTA-CARACT(I13) NOT NUMERIC           RMB0003
                          MOVE "        -88" TO 00END007(1:11)
                         END-IF
                       END-IF
                      IF COD-PORTAF-CARACT NOT = "CC"
RUNDAT                 IF VEC-INICIAL-CARACT(I13) >= ZEROS AND          RMB0003
RUNDAT                    VEC-IND-INI-CARACT(I13) = 0                   RMB0003
                          COMPUTE 00ENDV08 ROUNDED =
RUNDAT                   (VEC-INICIAL-CARACT(I13) /                     RMB0003
RUNDAT                            VEC-SMLMV-CARACT(I13))                RMB0003
                        MOVE 00ENDV08 TO 00END008
                       ELSE
RUNDAT                   IF VEC-INICIAL-CARACT(I13) NOT NUMERIC         RMB0003
                          MOVE "        -88" TO 00END008(1:11)
                         END-IF
                       END-IF
                      END-IF
                    ELSE
                       MOVE "         -4" TO 00END006(1:11)
                       MOVE "         -4" TO 00END007(1:11)
                       MOVE "         -4" TO 00END008(1:11)
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END006(1:11)
                    MOVE "         -3" TO 00END007(1:11)
                    MOVE "         -3" TO 00END008(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END006(1:11)
                 MOVE "         -2" TO 00END007(1:11)
                 MOVE "         -2" TO 00END008(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC"
                 MOVE "        -99" TO 00END008(1:11)
              END-IF
           END-IF.
      *** 00END009 *** CUPO DISPONIBLE A LA FECHA
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00END009 
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS AND
RUNDAT              ACT-DATE-CARACT > ZEROS                             RMB0003
RUNDAT              IF FECHA-ESTADO-CARACT - ACT-DATE-CARACT >= 0       RMB0003
RUNDAT                 IF VEC-SALDO-CARACT(I13) >= ZEROS AND            RMB0003
RUNDAT                    VEC-IND-SLD-CARACT(I13) = 0 AND               RMB0003
RUNDAT                    VEC-INICIAL-CARACT(I13) >= ZEROS AND          RMB0003
RUNDAT                    VEC-IND-INI-CARACT(I13) = 0                   RMB0003
RUNDAT                  IF VEC-INICIAL-CARACT(I13) >=                   RMB0003
RUNDAT                     VEC-SALDO-CARACT(I13)                        RMB0003
                          COMPUTE 00ENDV09 ROUNDED =
RUNDAT                ((VEC-INICIAL-CARACT(I13) -                       RMB0003
RUNDAT                                 VEC-SALDO-CARACT(I13)) /         RMB0003
RUNDAT                    VEC-SMLMV-CARACT(I13))                        RMB0003
                        MOVE 00ENDV09 TO 00END009
                        ELSE
                           MOVE "         -5" TO 00END009(1:11)
                        END-IF
                       ELSE
RUNDAT                   IF VEC-SALDO-CARACT(I13) NOT NUMERIC OR        RMB0003
RUNDAT                      VEC-INICIAL-CARACT(I13) NOT NUMERIC         RMB0003
                          MOVE "        -88" TO 00END009(1:11)
                         END-IF
                       END-IF
                    ELSE
                       MOVE "         -4" TO 00END009(1:11)
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END009(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END009(1:11)
              END-IF
           END-IF.
      *** 00END010 *** SALDO HACE 3 MESES
      *** 00END011 *** SALDO EN MORA HACE 3 MESES
      *** 00END012 *** CUOTA HACE 3 MESES 
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00END011 00END012 
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00END010
              END-IF
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 3
                   IF COD-PORTAF-CARACT NOT = "CC"
                    IF VEC-SALDO-CARACT(10) >= ZEROS AND
                       VEC-IND-SLD-CARACT(10) = 0
                       COMPUTE 00ENDV10 ROUNDED =
                       (VEC-SALDO-CARACT(10) / VEC-SMLMV-CARACT(10))
                        MOVE 00ENDV10 TO 00END010
                    ELSE
                      IF VEC-SALDO-CARACT(10) NOT NUMERIC
                       MOVE "        -88" TO 00END010(1:11)
                      END-IF
                    END-IF
                   END-IF
                    IF VEC-SALDOMOR-CARACT(10) >= ZEROS AND
                       VEC-IND-SLDM-CARACT(10) = 0
                       COMPUTE 00ENDV11 ROUNDED =
                     (VEC-SALDOMOR-CARACT(10) / VEC-SMLMV-CARACT(10))
                       MOVE 00ENDV11 TO 00END011
                    ELSE
                      IF VEC-SALDOMOR-CARACT(10) NOT NUMERIC
                       MOVE "        -88" TO 00END011(1:11)
                      END-IF
                    END-IF
                    IF VEC-CUOTA-CARACT(10) >= ZEROS AND
                       VEC-IND-CUO-CARACT(10) = 0
                       COMPUTE 00ENDV12 ROUNDED =
                      (VEC-CUOTA-CARACT(10) / VEC-SMLMV-CARACT(10))
                       MOVE 00ENDV12 TO 00END012
                    ELSE
                      IF VEC-CUOTA-CARACT(10) NOT NUMERIC
                       MOVE "        -88" TO 00END012(1:11)
                      END-IF
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END010(1:11)
                    MOVE "         -3" TO 00END011(1:11)
                    MOVE "         -3" TO 00END012(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END010(1:11)
                 MOVE "         -2" TO 00END011(1:11)
                 MOVE "         -2" TO 00END012(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC"
                 MOVE "        -99" TO 00END010(1:11)
              END-IF
           END-IF.
      *** 00END013 *** CUPO HACE 3 MESES
      *** 00END014 *** CUPO DISPONIBLE HACE 3 MESES
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00END013 00END014 
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 3 
                    IF VEC-INICIAL-CARACT(10) >= ZEROS AND
                       VEC-IND-INI-CARACT(10) = 0
                       COMPUTE 00ENDV13 ROUNDED =
                     (VEC-INICIAL-CARACT(10) / VEC-SMLMV-CARACT(10))
                       MOVE 00ENDV13 TO 00END013
                    ELSE
                      IF VEC-INICIAL-CARACT(10) NOT NUMERIC
                       MOVE "        -88" TO 00END013(1:11)
                      END-IF
                    END-IF
                    IF VEC-SALDO-CARACT(10) >= ZEROS AND
                       VEC-INICIAL-CARACT(10) >= ZEROS
                     IF VEC-INICIAL-CARACT(10) >= VEC-SALDO-CARACT(10)
                       COMPUTE 00ENDV14 ROUNDED =
                     ((VEC-INICIAL-CARACT(10) - VEC-SALDO-CARACT(10))
                       / VEC-SMLMV-CARACT(10))
                       MOVE 00ENDV14 TO 00END014
                     ELSE
                        MOVE "         -5" TO 00END014(1:11)
                     END-IF
                    ELSE
                      IF VEC-SALDO-CARACT(10) NOT NUMERIC OR
                         VEC-INICIAL-CARACT(10) NOT NUMERIC
                       MOVE "        -88" TO 00END014(1:11)
                      END-IF
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END013(1:11)
                    MOVE "         -3" TO 00END014(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END013(1:11)
                 MOVE "         -2" TO 00END014(1:11)
              END-IF
           END-IF.
      *** 00END015 *** SALDO HACE 6 MESES
      *** 00END016 *** SALDO EN MORA HACE 6 MESES
      *** 00END017 *** CUOTA HACE 6 MESES
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00END016 00END017
              IF COD-PORTAF-CARACT NOT = "CC" 
                 MOVE ZEROS TO 00END015
              END-IF
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 6
                   IF COD-PORTAF-CARACT NOT = "CC"
                    IF VEC-SALDO-CARACT(7) >= ZEROS AND
                       VEC-IND-SLD-CARACT(7) = 0
                       COMPUTE 00ENDV15 ROUNDED =
                       (VEC-SALDO-CARACT(7) / VEC-SMLMV-CARACT(7))
                       MOVE 00ENDV15 TO 00END015
                    ELSE
                      IF VEC-SALDO-CARACT(7) NOT NUMERIC
                       MOVE "        -88" TO 00END015(1:11)
                      END-IF
                    END-IF
                   END-IF
                    IF VEC-SALDOMOR-CARACT(7) >= ZEROS AND
                       VEC-IND-SLDM-CARACT(7) = 0
                       COMPUTE 00ENDV16 ROUNDED =
                      (VEC-SALDOMOR-CARACT(7) / VEC-SMLMV-CARACT(7))
                       MOVE 00ENDV16 TO 00END016
                    ELSE
                      IF VEC-SALDOMOR-CARACT(7) NOT NUMERIC
                       MOVE "        -88" TO 00END016(1:11)
                      END-IF
                    END-IF
                    IF VEC-CUOTA-CARACT(7) >= ZEROS AND
                       VEC-IND-CUO-CARACT(7) = 0
                       COMPUTE 00ENDV17 ROUNDED =
                       (VEC-CUOTA-CARACT(7) / VEC-SMLMV-CARACT(7))
                       MOVE 00ENDV17 TO 00END017
                    ELSE
                      IF VEC-CUOTA-CARACT(7) NOT NUMERIC
                       MOVE "        -88" TO 00END017(1:11)
                      END-IF
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END015(1:11)
                    MOVE "         -3" TO 00END016(1:11)
                    MOVE "         -3" TO 00END017(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END015(1:11)
                 MOVE "         -2" TO 00END016(1:11)
                 MOVE "         -2" TO 00END017(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC"
                 MOVE "        -99" TO 00END015(1:11)
              END-IF
           END-IF.
      *** 00END018 *** CUPO HACE 6 MESES
      *** 00END019 *** CUPO DISPONIBLE HACE 6 MESES
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00END018 00END019
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF  MESES-DESAC-CARACT <= 6
                    IF VEC-INICIAL-CARACT(7) >= ZEROS AND
                       VEC-IND-INI-CARACT(7) = 0
                       COMPUTE 00ENDV18 ROUNDED =
                      (VEC-INICIAL-CARACT(7) / VEC-SMLMV-CARACT(7))
                       MOVE 00ENDV18 TO 00END018
                    ELSE
                      IF VEC-INICIAL-CARACT(7) NOT NUMERIC
                       MOVE "        -88" TO 00END018(1:11)
                      END-IF
                    END-IF
                    IF VEC-SALDO-CARACT(7) >= ZEROS AND
                       VEC-IND-SLD-CARACT(7) = 0 AND
                       VEC-INICIAL-CARACT(7) >= ZEROS AND
                       VEC-IND-INI-CARACT(7) = 0
                     IF VEC-INICIAL-CARACT(7) >= VEC-SALDO-CARACT(7)
                       COMPUTE 00ENDV19 ROUNDED =
                    ((VEC-INICIAL-CARACT(7) - VEC-SALDO-CARACT(7)) /
                     VEC-SMLMV-CARACT(7))
                       MOVE 00ENDV19 TO 00END019
                     ELSE
                        MOVE "         -5" TO 00END019(1:11)
                     END-IF
                    ELSE
                      IF VEC-SALDO-CARACT(7) NOT NUMERIC OR
                         VEC-INICIAL-CARACT(7) NOT NUMERIC
                       MOVE "        -88" TO 00END019(1:11)
                      END-IF
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END018(1:11)
                    MOVE "         -3" TO 00END019(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END018(1:11)
                 MOVE "         -2" TO 00END019(1:11)
              END-IF
           END-IF.
      *** 00END020 *** SALDO HACE 9 MESES
      *** 00END021 *** SALDO EN MORA HACE 9 MESES
      *** 00END022 *** CUOTA HACE 9 MESES 
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00END021 00END022 
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00END020
              END-IF
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 9
                   IF COD-PORTAF-CARACT NOT = "CC"
                    IF VEC-SALDO-CARACT(4) >= ZEROS AND
                       VEC-IND-SLD-CARACT(4) = 0
                       COMPUTE 00ENDV20 ROUNDED =
                       (VEC-SALDO-CARACT(4) / VEC-SMLMV-CARACT(4))
                       MOVE 00ENDV20 TO 00END020
                    ELSE
                      IF VEC-SALDO-CARACT(4) NOT NUMERIC
                       MOVE "        -88" TO 00END020(1:11)
                      END-IF
                    END-IF
                   END-IF
                    IF VEC-SALDOMOR-CARACT(4) >= ZEROS AND
                       VEC-IND-SLDM-CARACT(4) = 0
                       COMPUTE 00ENDV21 ROUNDED =
                      (VEC-SALDOMOR-CARACT(4) / VEC-SMLMV-CARACT(4))
                       MOVE 00ENDV21 TO 00END021
                    ELSE
                      IF VEC-SALDOMOR-CARACT(4) NOT NUMERIC
                       MOVE "        -88" TO 00END021(1:11)
                      END-IF
                    END-IF
                    IF VEC-CUOTA-CARACT(4) >= ZEROS AND
                       VEC-IND-CUO-CARACT(4) = 0
                       COMPUTE 00ENDV22 ROUNDED =
                       (VEC-CUOTA-CARACT(4) / VEC-SMLMV-CARACT(4))
                       MOVE 00ENDV22 TO 00END022
                    ELSE
                      IF VEC-CUOTA-CARACT(4) NOT NUMERIC
                       MOVE "        -88" TO 00END022(1:11)
                      END-IF
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END020(1:11)
                    MOVE "         -3" TO 00END021(1:11)
                    MOVE "         -3" TO 00END022(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END020(1:11)
                 MOVE "         -2" TO 00END021(1:11)
                 MOVE "         -2" TO 00END022(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC"
                 MOVE "        -99" TO 00END020(1:11)
              END-IF
           END-IF.
      *** 00END023 *** CUPO HACE 9 MESES
      *** 00END024 *** CUPO DISPONIBLE HACE 9 MESES
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00END023 00END024 
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 9
                    IF VEC-INICIAL-CARACT(4) >= ZEROS AND
                       VEC-IND-INI-CARACT(4) = 0
                       COMPUTE 00ENDV23 ROUNDED =
                      (VEC-INICIAL-CARACT(4) / VEC-SMLMV-CARACT(4))
                       MOVE 00ENDV23 TO 00END023
                    ELSE
                      IF VEC-INICIAL-CARACT(4) NOT NUMERIC
                       MOVE "        -88" TO 00END023(1:11)
                      END-IF
                    END-IF
                    IF VEC-SALDO-CARACT(4) >= ZEROS AND
                       VEC-IND-SLD-CARACT(4) = 0 AND
                       VEC-INICIAL-CARACT(4) >= ZEROS AND
                       VEC-IND-INI-CARACT(4) = 0
                     IF VEC-INICIAL-CARACT(4) >= VEC-SALDO-CARACT(4)
                       COMPUTE 00ENDV24 ROUNDED =
                    ((VEC-INICIAL-CARACT(4) - VEC-SALDO-CARACT(4)) /
                        VEC-SMLMV-CARACT(4))
                       MOVE 00ENDV24 TO 00END024
                     ELSE
                        MOVE "         -5" TO 00END024(1:11)
                     END-IF
                    ELSE
                      IF VEC-SALDO-CARACT(4) NOT NUMERIC OR
                         VEC-INICIAL-CARACT(4) NOT NUMERIC
                       MOVE "        -88" TO 00END024(1:11)
                      END-IF
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END023(1:11)
                    MOVE "         -3" TO 00END024(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END023(1:11)
                 MOVE "         -2" TO 00END024(1:11)
              END-IF
           END-IF.
      *** 00END025 *** SALDO HACE 12 MESES
      *** 00END026 *** SALDO EN MORA HACE 12 MESES
      *** 00END027 *** CUOTA HACE 12 MESES 
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "CC" OR "OT" OR "CO"
              MOVE ZEROS TO 00END026 00END027
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00END025
              END-IF
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 12
                   IF COD-PORTAF-CARACT NOT = "CC"
                    IF VEC-SALDO-CARACT(1) >= ZEROS AND
                       VEC-IND-SLD-CARACT(1) = 0
                       COMPUTE 00ENDV25 ROUNDED =
                       (VEC-SALDO-CARACT(1) / VEC-SMLMV-CARACT(1))
                       MOVE 00ENDV25 TO 00END025
                    ELSE
                      IF VEC-SALDO-CARACT(1) NOT NUMERIC
                       MOVE "        -88" TO 00END025(1:11)
                      END-IF
                    END-IF
                   END-IF
                    IF VEC-SALDOMOR-CARACT(1) >= ZEROS AND 
                       VEC-IND-SLDM-CARACT(1) = 0
                       COMPUTE 00ENDV26 ROUNDED =
                      (VEC-SALDOMOR-CARACT(1) / VEC-SMLMV-CARACT(1))
                       MOVE 00ENDV26 TO 00END026
                    ELSE
                      IF VEC-SALDOMOR-CARACT(1) NOT NUMERIC
                       MOVE "        -88" TO 00END026(1:11)
                      END-IF
                    END-IF
                    IF VEC-CUOTA-CARACT(1) >= ZEROS AND
                       VEC-IND-CUO-CARACT(1) = 0
                       COMPUTE 00ENDV27 ROUNDED =
                       (VEC-CUOTA-CARACT(1) / VEC-SMLMV-CARACT(1))
                       MOVE 00ENDV27 TO 00END027
                    ELSE
                      IF VEC-CUOTA-CARACT(1) NOT NUMERIC
                       MOVE "        -88" TO 00END027(1:11)
                      END-IF
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END025(1:11)
                    MOVE "         -3" TO 00END026(1:11)
                    MOVE "         -3" TO 00END027(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END025(1:11)
                 MOVE "         -2" TO 00END026(1:11)
                 MOVE "         -2" TO 00END027(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC"
                 MOVE "        -99" TO 00END025(1:11)
              END-IF
           END-IF.
      *** 00END028 *** CUPO HACE 12 MESES
      *** 00END029 *** CUPO DISPONIBLE HACE 12 MESES
           IF COD-PORTAF-CARACT = "RO" 
              MOVE ZEROS TO 00END028 00END029
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 12
                    IF VEC-INICIAL-CARACT(1) >= ZEROS AND
                       VEC-IND-INI-CARACT(1) = 0
                       COMPUTE 00ENDV28 ROUNDED =
                      (VEC-INICIAL-CARACT(1) / VEC-SMLMV-CARACT(1))
                       MOVE 00ENDV28 TO 00END028
                    ELSE
                      IF VEC-INICIAL-CARACT(1) NOT NUMERIC
                       MOVE "        -88" TO 00END028(1:11)
                      END-IF
                    END-IF
                    IF VEC-SALDO-CARACT(1) >= ZEROS AND
                       VEC-IND-SLD-CARACT(1) = 0 AND
                       VEC-INICIAL-CARACT(1) >= ZEROS AND
                       VEC-IND-INI-CARACT(1) = 0
                     IF VEC-INICIAL-CARACT(1) >= VEC-SALDO-CARACT(1)
                       COMPUTE 00ENDV29 ROUNDED =
                    ((VEC-INICIAL-CARACT(1) - VEC-SALDO-CARACT(1)) /
                        VEC-SMLMV-CARACT(1))
                       MOVE 00ENDV29 TO 00END029
                     ELSE
                        MOVE "         -5" TO 00END029(1:11)
                     END-IF
                    ELSE
                      IF VEC-SALDO-CARACT(1) NOT NUMERIC OR
                         VEC-INICIAL-CARACT(1) NOT NUMERIC
                       MOVE "        -88" TO 00END029(1:11)
                      END-IF
                    END-IF
                 ELSE
                    MOVE "         -3" TO 00END028(1:11)
                    MOVE "         -3" TO 00END029(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END028(1:11)
                 MOVE "         -2" TO 00END029(1:11)
              END-IF
           END-IF.
      *** 00END030 *** SALDO PROMEDIO ULTIMOS 3 MESES
      *** 00END031 *** SALDO PROMEDIO EN MORA ULTIMOS 3 MESES
      *** 00END032 *** CUOTA PROMEDIO ULTIMOS 3 MESES
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "OT" OR "CC" OR "CO"
              MOVE ZEROS TO 00END031 00END032 NONUM-CARACT
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00END030
              END-IF
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
RUNDAT           IF ACT-MESES-DESAC-CARACT <= 3                         RMB0003
                  IF COD-PORTAF-CARACT NOT = "CC"
                   MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT
RUNDAT             PERFORM VARYING V-CARACT FROM I12 BY -1 UNTIL        RMB0003
RUNDAT                     V-CARACT < I10                               RMB0003
                    IF VEC-SALDO-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLD-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-SALDO-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                     IF VEC-SALDO-CARACT(V-CARACT) NOT NUMERIC
                        ADD 1 TO NONUM-CARACT
                     END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV30 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV30 TO 00END030
                   ELSE
                     IF NONUM-CARACT = 3
                      MOVE "        -88" TO 00END030(1:11)
                     END-IF
                   END-IF
                  END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
RUNDAT             PERFORM VARYING V-CARACT FROM I12 BY -1 UNTIL        RMB0003
RUNDAT                     V-CARACT < I10                               RMB0003
                    IF VEC-SALDOMOR-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLDM-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-SALDOMOR-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-SALDOMOR-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV31 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV31 TO 00END031
                   ELSE
                     IF NONUM-CARACT = 3
                      MOVE "        -88" TO 00END031(1:11)
                     END-IF
                   END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
RUNDAT             PERFORM VARYING V-CARACT FROM I12 BY -1 UNTIL        RMB0003
RUNDAT                     V-CARACT < I10                               RMB0003
                    IF VEC-CUOTA-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-CUO-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-CUOTA-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-CUOTA-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV32 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV32 TO 00END032
                   ELSE
                     IF NONUM-CARACT = 3
                      MOVE "        -88" TO 00END032(1:11)
                     END-IF
                   END-IF
                 ELSE
                    MOVE "         -3" TO 00END030(1:11)
                    MOVE "         -3" TO 00END031(1:11)
                    MOVE "         -3" TO 00END032(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END030(1:11)
                 MOVE "         -2" TO 00END031(1:11)
                 MOVE "         -2" TO 00END032(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC"
                 MOVE "        -99" TO 00END030(1:11)
              END-IF
           END-IF.
      *** 00END033 *** CUPO PROMEDIO ULTIMOS 3 MESES
      *** 00END034 *** CUPO PROMEDIO DISPONIBLE ULTIMOS 3 MESES
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00END033 00END034 NONUM-CARACT
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 3
                   MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT
RUNDAT             PERFORM VARYING V-CARACT FROM I12 BY -1 UNTIL        RMB0003
RUNDAT                     V-CARACT < I10                               RMB0003
                    IF VEC-INICIAL-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-INI-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-INICIAL-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-INICIAL-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV33 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV33 TO 00END033
                   ELSE
                     IF NONUM-CARACT = 3
                      MOVE "        -88" TO 00END033(1:11)
                     END-IF
                   END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
RUNDAT             PERFORM VARYING V-CARACT FROM I12 BY -1 UNTIL        RMB0003
RUNDAT                     V-CARACT < I10                               RMB0003
                    IF VEC-INICIAL-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-INI-CARACT(V-CARACT) = 0 AND
                       VEC-SALDO-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLD-CARACT(V-CARACT) = 0
                     IF VEC-INICIAL-CARACT(V-CARACT) >= 
                        VEC-SALDO-CARACT(V-CARACT)
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       ((VEC-INICIAL-CARACT(V-CARACT) -
                        VEC-SALDO-CARACT(V-CARACT))/
                        VEC-SMLMV-CARACT(V-CARACT))
                     END-IF
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-INICIAL-CARACT(V-CARACT) NOT NUMERIC OR
                         VEC-SALDO-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV34 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV34 TO 00END034
                   ELSE
                     IF NONUM-CARACT = 3
                      MOVE "        -88" TO 00END034(1:11)
                     END-IF
                   END-IF
                 ELSE
                    MOVE "         -3" TO 00END033(1:11)
                    MOVE "         -3" TO 00END034(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END033(1:11)
                 MOVE "         -2" TO 00END034(1:11)
              END-IF
           END-IF.
      *** 00END035 *** SALDO PROMEDIO ULTIMOS 6 MESES
      *** 00END036 *** SALDO PROMEDIO EN MORA ULTIMOS 6 MESES
      *** 00END037 *** CUOTA PROMEDIO ULTIMOS 6 MESES
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "OT" OR "CC" OR "CO"
              MOVE ZEROS TO 00END036 00END037 NONUM-CARACT
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00END035
              END-IF
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 6
                  IF COD-PORTAF-CARACT NOT = "CC"
                   MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 7
                    IF VEC-SALDO-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLD-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-SALDO-CARACT(V-CARACT) /
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-SALDO-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV35 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV35 TO 00END035
                   ELSE
                     IF NONUM-CARACT = 6
                      MOVE "        -88" TO 00END035(1:11)
                     END-IF
                   END-IF
                  END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 7
                    IF VEC-SALDOMOR-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLDM-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-SALDOMOR-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-SALDOMOR-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV36 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV36 TO 00END036
                   ELSE
                     IF NONUM-CARACT = 6
                      MOVE "        -88" TO 00END036(1:11)
                     END-IF
                   END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 7
                    IF VEC-CUOTA-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-CUO-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-CUOTA-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-CUOTA-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV37 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV37 TO 00END037
                   ELSE
                     IF NONUM-CARACT = 6
                      MOVE "        -88" TO 00END037(1:11)
                     END-IF
                   END-IF
                 ELSE
                    MOVE "         -3" TO 00END035(1:11)
                    MOVE "         -3" TO 00END036(1:11)
                    MOVE "         -3" TO 00END037(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END035(1:11)
                 MOVE "         -2" TO 00END036(1:11)
                 MOVE "         -2" TO 00END037(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC"
                 MOVE "        -99" TO 00END035(1:11)
              END-IF
           END-IF.
      *** 00END038 *** CUPO PROMEDIO ULTIMOS 6 MESES
      *** 00END039 *** CUPO PROMEDIO DISPONIBLE ULTIMOS 6 MESES
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00END038 00END039 NONUM-CARACT
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 6
                   MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 7
                    IF VEC-INICIAL-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-INI-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-INICIAL-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-INICIAL-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV38 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV38 TO 00END038
                   ELSE
                     IF NONUM-CARACT = 6
                      MOVE "        -88" TO 00END038(1:11)
                     END-IF
                   END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 7
                    IF VEC-INICIAL-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-INI-CARACT(V-CARACT) = 0 AND
                       VEC-SALDO-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLD-CARACT(V-CARACT) = 0
                     IF VEC-INICIAL-CARACT(V-CARACT) >=
                        VEC-SALDO-CARACT(V-CARACT)
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       ((VEC-INICIAL-CARACT(V-CARACT) -
                        VEC-SALDO-CARACT(V-CARACT))/
                        VEC-SMLMV-CARACT(V-CARACT))
                     END-IF
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-INICIAL-CARACT(V-CARACT) NOT NUMERIC OR
                         VEC-SALDO-CARACT(V-CARACT) NOT NUMERIC
                          ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV39 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV39 TO 00END039
                   ELSE
                     IF NONUM-CARACT = 6
                      MOVE "        -88" TO 00END039(1:11)
                     END-IF
                   END-IF
                 ELSE
                    MOVE "         -3" TO 00END038(1:11)
                    MOVE "         -3" TO 00END039(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END038(1:11)
                 MOVE "         -2" TO 00END039(1:11)
              END-IF
           END-IF.
      *** 00END040 *** SALDO PROMEDIO ULTIMOS 9 MESES
      *** 00END041 *** SALDO PROMEDIO EN MORA ULTIMOS 9 MESES
      *** 00END042 *** CUOTA PROMEDIO ULTIMOS 9 MESES
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "OT" OR "CC" OR "CO"
              MOVE ZEROS TO 00END041 00END042 NONUM-CARACT
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00END040
              END-IF
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 9
                  IF COD-PORTAF-CARACT NOT = "CC"
                   MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 4
                    IF VEC-SALDO-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLD-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-SALDO-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-SALDO-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV40 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV40 TO 00END040
                   ELSE
                     IF NONUM-CARACT = 9
                      MOVE "        -88" TO 00END040(1:11)
                     END-IF
                   END-IF
                  END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 4
                    IF VEC-SALDOMOR-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLDM-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-SALDOMOR-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-SALDOMOR-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV41 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV41 TO 00END041
                   ELSE
                     IF NONUM-CARACT = 9
                      MOVE "        -88" TO 00END041(1:11)
                     END-IF
                   END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 4
                    IF VEC-CUOTA-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-CUO-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-CUOTA-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-CUOTA-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV42 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV42 TO 00END042
                   ELSE
                     IF NONUM-CARACT = 9
                      MOVE "        -88" TO 00END042(1:11)
                     END-IF
                   END-IF
                 ELSE
                    MOVE "         -3" TO 00END040(1:11)
                    MOVE "         -3" TO 00END041(1:11)
                    MOVE "         -3" TO 00END042(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END040(1:11)
                 MOVE "         -2" TO 00END041(1:11)
                 MOVE "         -2" TO 00END042(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC" 
                 MOVE "        -99" TO 00END040(1:11)
              END-IF
           END-IF.
      *** 00END043 *** CUPO PROMEDIO ULTIMOS 9 MESES
      *** 00END044 *** CUPO PROMEDIO DISPONIBLE ULTIMOS 9 MESES
           IF COD-PORTAF-CARACT = "RO"
              MOVE ZEROS TO 00END043 00END044 NONUM-CARACT
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 9
                   MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 4
                    IF VEC-INICIAL-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-INI-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-INICIAL-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-INICIAL-CARACT(V-CARACT) NOt NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV43 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV43 TO 00END043
                   ELSE
                     IF NONUM-CARACT = 9
                      MOVE "        -88" TO 00END043(1:11)
                     END-IF
                   END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 4
                    IF VEC-INICIAL-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-INI-CARACT(V-CARACT) = 0 AND
                       VEC-SALDO-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLD-CARACT(V-CARACT) = 0
                     IF VEC-INICIAL-CARACT(V-CARACT) >=
                        VEC-SALDO-CARACT(V-CARACT)
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       ((VEC-INICIAL-CARACT(V-CARACT) - 
                         VEC-SALDO-CARACT(V-CARACT))/
                        VEC-SMLMV-CARACT(V-CARACT))
                     END-IF
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-INICIAL-CARACT(V-CARACT) NOT NUMERIC OR
                         VEC-SALDO-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV44 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV44 TO 00END044
                   ELSE
                     IF NONUM-CARACT = 9
                      MOVE "        -88" TO 00END044(1:11)
                     END-IF
                   END-IF
                 ELSE
                    MOVE "         -3" TO 00END043(1:11)
                    MOVE "         -3" TO 00END044(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END043(1:11)
                 MOVE "         -2" TO 00END044(1:11)
              END-IF
           END-IF.
      *** 00END045 *** SALDO PROMEDIO ULTIMOS 12 MESES
      *** 00END046 *** SALDO PROMEDIO EN MORA ULTIMOS 12 MESES
      *** 00END047 *** CUOTA PROMEDIO ULTIMOS 12 MESES
           IF COD-PORTAF-CARACT = "RO" OR "IN" OR "VE" OR "HP" OR
                                  "OT" OR "CC" OR "CO"
              MOVE ZEROS TO 00END046 00END047 NONUM-CARACT
              IF COD-PORTAF-CARACT NOT = "CC"
                 MOVE ZEROS TO 00END045 
              END-IF
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 12
                  IF COD-PORTAF-CARACT NOT = "CC"
                   MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 1
                    IF VEC-SALDO-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLD-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-SALDO-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-SALDO-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV45 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV45 TO 00END045
                   ELSE
                     IF NONUM-CARACT = 12
                      MOVE "        -88" TO 00END045(1:11)
                     END-IF
                   END-IF
                  END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 1
                    IF VEC-SALDOMOR-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLDM-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-SALDOMOR-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-SALDOMOR-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV46 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV46 TO 00END046
                   ELSE
                     IF NONUM-CARACT = 12
                      MOVE "        -88" TO 00END046(1:11)
                     END-IF
                   END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 1
                    IF VEC-CUOTA-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-CUO-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-CUOTA-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-CUOTA-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV47 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV47 TO 00END047
                   ELSE
                     IF NONUM-CARACT = 12
                      MOVE "        -88" TO 00END047(1:11)
                     END-IF
                   END-IF
                 ELSE
                    MOVE "         -3" TO 00END045(1:11)
                    MOVE "         -3" TO 00END046(1:11)
                    MOVE "         -3" TO 00END047(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END045(1:11)
                 MOVE "         -2" TO 00END046(1:11)
                 MOVE "         -2" TO 00END047(1:11)
              END-IF
              IF COD-PORTAF-CARACT = "CC"
                  MOVE "        -99" TO 00END045(1:11)
              END-IF
           END-IF.
      *** 00END048 *** CUPO PROMEDIO ULTIMOS 12 MESES
      *** 00END049 *** CUPO PROMEDIO DISPONIBLE ULTIMOS 12 MESES
           IF COD-PORTAF-CARACT = "RO" 
              MOVE ZEROS TO 00END048 00END049 NONUM-CARACT
              IF FECHA-ESTADO-CARACT > ZEROS AND
                 RUN-DATE-CARACT > ZEROS
                 IF MESES-DESAC-CARACT <= 12
                   MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 1
                    IF VEC-INICIAL-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-INI-CARACT(V-CARACT) = 0
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       (VEC-INICIAL-CARACT(V-CARACT)/
                        VEC-SMLMV-CARACT(V-CARACT))
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-INICIAL-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV48 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV48 TO 00END048
                   ELSE
                     IF NONUM-CARACT = 12
                      MOVE "        -88" TO 00END048(1:11)
                     END-IF
                   END-IF
                  MOVE ZEROS TO SUMA-V-CARACT CONT-V-CARACT NONUM-CARACT
                   PERFORM VARYING V-CARACT FROM 12 BY -1 UNTIL
                           V-CARACT < 1
                    IF VEC-INICIAL-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-INI-CARACT(V-CARACT) = 0 AND
                       VEC-SALDO-CARACT(V-CARACT) >= ZEROS AND
                       VEC-IND-SLD-CARACT(V-CARACT) = 0
                     IF VEC-INICIAL-CARACT(V-CARACT) >=
                        VEC-SALDO-CARACT(V-CARACT)
                       COMPUTE SUMA-V-CARACT = SUMA-V-CARACT +
                       ((VEC-INICIAL-CARACT(V-CARACT) -
                         VEC-SALDO-CARACT(V-CARACT))/
                        VEC-SMLMV-CARACT(V-CARACT))
                     END-IF
                       ADD 1 TO CONT-V-CARACT
                    ELSE
                      IF VEC-INICIAL-CARACT(V-CARACT) NOT NUMERIC OR
                         VEC-SALDO-CARACT(V-CARACT) NOT NUMERIC
                         ADD 1 TO NONUM-CARACT
                      END-IF
                    END-IF
                   END-PERFORM
                   IF CONT-V-CARACT > 0
                      COMPUTE 00ENDV49 ROUNDED =
                           (SUMA-V-CARACT / CONT-V-CARACT)
                      MOVE 00ENDV49 TO 00END049
                   ELSE
                     IF NONUM-CARACT = 12
                      MOVE "        -88" TO 00END049(1:11)
                     END-IF
                   END-IF
                 ELSE
                    MOVE "         -3" TO 00END048(1:11)
                    MOVE "         -3" TO 00END049(1:11)
                 END-IF
              ELSE
                 MOVE "         -2" TO 00END048(1:11)
                 MOVE "         -2" TO 00END049(1:11)
              END-IF
           END-IF.
ACIEA1     PERFORM 0000-PROCESE-00END090-093.                           RMB0013
ACIEA1 0000-PROCESE-00END090-093.                                       RMB0013
REMARK******************************************************************
REMARK*0000-PROCESE-00END090-093.
REMARK*    SE CALCULA LAS CARACTERISTICAS NIVEL 00 PARA VARIACION DE      
REMARK*    VALORES CON VARIANZAS,DESVIACIONES,PROMEDIOS ETC            
REMARK******************************************************************
ACIEA1*     CALCULO DE VARIABLES 00 PARA LA 01END090 VARIACION SALDOS   RMB0013
ACIEA1*     SOLO SE TOMAN LOS MESES 1 AL 12 DE LAS ABIERTAS             RMB0013
ACIEA1      MOVE 1 TO FLAG090(IND-PORTAF-CARACT)                        RMB0013
ACIEA1      IF 00NUM002 = 1                                             RMB0013
ACIEA1         MOVE 1 TO OPFLAG090(IND-PORTAF-CARACT)                   RMB0013
ACIEA1         PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL               RMB0013
ACIEA1                                                J-CARACT > 12     RMB0013
ACIEA1           COMPUTE I-CARACT = J-CARACT                            RMB0013
ACIEA1           IF 00END001(J-CARACT)(11:1) <> "-"                     RMB0013
ACIEA1              MOVE 1 TO SALDOFLAG090(IND-PORTAF-CARACT,I-CARACT)  RMB0013
ACIEA1              COMPUTE                                             RMB0013
ACIEA1                 SALDOACUM090-CARACT(IND-PORTAF-CARACT,I-CARACT) =RMB0013
ACIEA1                 SALDOACUM090-CARACT(IND-PORTAF-CARACT,I-CARACT) +RMB0013
ACIEA1                 00END001(J-CARACT)                               RMB0013
ACIEA1           END-IF                                                 RMB0013
ACIEA1         END-PERFORM                                              RMB0013
ACIEA1      END-IF.                                                     RMB0013
ACIEA1*     CALCULO DE VARIABLES 00 PARA LA 01END091 VARIACION CUOTAS   RMB0013
ACIEA1*     SOLO SE TOMAN LOS MESES 1 AL 12 DE LAS ABIERTAS             RMB0013
ACIEA1      MOVE 1 TO FLAG091(IND-PORTAF-CARACT)                        RMB0013
ACIEA1      IF 00NUM002 = 1                                             RMB0013
ACIEA1         MOVE 1 TO OPFLAG091(IND-PORTAF-CARACT)                   RMB0013
ACIEA1         PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL               RMB0013
ACIEA1                                                J-CARACT > 12     RMB0013
ACIEA1           COMPUTE I-CARACT = J-CARACT                            RMB0013
ACIEA1           IF 00END003(J-CARACT)(11:1) <> "-"                     RMB0013
ACIEA1              MOVE 1 TO CUOTAFLAG091(IND-PORTAF-CARACT,I-CARACT)  RMB0013
ACIEA1              COMPUTE                                             RMB0013
ACIEA1                 CUOTAACUM091-CARACT(IND-PORTAF-CARACT,I-CARACT) =RMB0013
ACIEA1                 CUOTAACUM091-CARACT(IND-PORTAF-CARACT,I-CARACT) +RMB0013
ACIEA1                 00END003(J-CARACT)                               RMB0013
ACIEA1           END-IF                                                 RMB0013
ACIEA1         END-PERFORM                                              RMB0013
ACIEA1      END-IF.                                                     RMB0013
ACIEAA*     CALCULO DE VARIABLES INTERMEDIAS PARA LA 01END092           RMB0012
ACIEAA*     SOLO SE TOMAN LOS MESES 1 AL 12 DE LAS ABIERTAS             RMB0012
ACIEAA      MOVE 1 TO FLAG092(IND-PORTAF-CARACT)                        RMB0012
ACIEAA      IF 00NUM002 = 1                                             RMB0012
ACIEAA         MOVE 1 TO OPFLAG092(IND-PORTAF-CARACT)                   RMB0012
ACIEAA         PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL               RMB0012
ACIEAA                                                J-CARACT > 12     RMB0012
ACIEAA           COMPUTE I-CARACT = J-CARACT                            RMB0012
ACIEAA           IF 00END001(J-CARACT)(11:1) <> "-"                     RMB0012
ACIEAA              MOVE 1 TO SALDOFLAG092(IND-PORTAF-CARACT,I-CARACT)  RMB0012
ACIEAA              COMPUTE                                             RMB0012
ACIEAA                 SUMASALDO092-CARACT(IND-PORTAF-CARACT,I-CARACT) =RMB0012
ACIEAA                 SUMASALDO092-CARACT(IND-PORTAF-CARACT,I-CARACT) +RMB0012
ACIEAA                 00END001(J-CARACT)                               RMB0012
ACIEAA           END-IF                                                 RMB0012
ACIEAA           IF 00END004(J-CARACT)(11:1) <> "-"                     RMB0012
ACIEAA              MOVE 1 TO CUPOFLAG092(IND-PORTAF-CARACT,I-CARACT)   RMB0012
ACIEAA              COMPUTE                                             RMB0012
ACIEAA                 SUMACUPO092-CARACT(IND-PORTAF-CARACT,I-CARACT) = RMB0012
ACIEAA                 SUMACUPO092-CARACT(IND-PORTAF-CARACT,I-CARACT) + RMB0012
ACIEAA                 00END004(J-CARACT)                               RMB0012
ACIEAA           END-IF                                                 RMB0012
ACIEAA         END-PERFORM                                              RMB0012
ACIEAA      END-IF.                                                     RMB0012
ACIEA1*     CALCULO DE VARIABLES 00 PARA LA 01END093 % PROMEDIO CUPO    RMB0013
ACIEA1*     SOLO SE TOMAN LOS MESES 1 AL 12 DE LAS ABIERTAS             RMB0013
ACIEA1      MOVE 1 TO FLAG093(IND-PORTAF-CARACT)                        RMB0013
ACIEA1      IF 00NUM002 = 1                                             RMB0013
ACIEA1         MOVE 1 TO OPFLAG093(IND-PORTAF-CARACT)                   RMB0013
ACIEA1         PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL               RMB0013
ACIEA1                                                J-CARACT > 12     RMB0013
ACIEA1           COMPUTE I-CARACT = J-CARACT                            RMB0013
ACIEA1           IF 00END001(J-CARACT)(11:1) <> "-" AND                 RMB0013
ACIEA1              00END004(J-CARACT)(11:1) <> "-"                     RMB0013
ACIEA1              MOVE 1 TO DIFFEFLAG093(IND-PORTAF-CARACT,I-CARACT)  RMB0013
ACIEA1              COMPUTE                                             RMB0013
ACIEA1                 DIFFEACUM093-CARACT(IND-PORTAF-CARACT,I-CARACT) =RMB0013
ACIEA1                 DIFFEACUM093-CARACT(IND-PORTAF-CARACT,I-CARACT) +RMB0013
ACIEA1                 00END004(J-CARACT) - 00END001(J-CARACT)          RMB0013
ACIEA1           END-IF                                                 RMB0013
ACIEA1           IF 00END004(J-CARACT)(11:1) <> "-"                     RMB0013
ACIEA1              COMPUTE                                             RMB0013
ACIEA1                 CUPOACUM093-CARACT(IND-PORTAF-CARACT,I-CARACT) = RMB0013
ACIEA1                 CUPOACUM093-CARACT(IND-PORTAF-CARACT,I-CARACT) + RMB0013
ACIEA1                 00END004(J-CARACT)                               RMB0013
ACIEA1           END-IF                                                 RMB0013
ACIEA1         END-PERFORM                                              RMB0013
ACIEA1      END-IF.                                                     RMB0013
       2720-INICIALIZA-00END.
REMARK******************************************************************
REMARK*2720-INICIALIZA-00END.
REMARK******************************************************************
           MOVE "        -99" TO
             00END005(1:11) 00END006(1:11) 00END007(1:11) 00END008(1:11)
             00END009(1:11) 00END010(1:11) 00END011(1:11) 00END012(1:11)
             00END013(1:11) 00END014(1:11) 00END015(1:11) 00END016(1:11)
             00END017(1:11) 00END018(1:11) 00END019(1:11) 00END020(1:11)
             00END021(1:11) 00END022(1:11) 00END023(1:11) 00END024(1:11)
             00END025(1:11) 00END026(1:11) 00END027(1:11) 00END028(1:11)
             00END029(1:11) 00END030(1:11) 00END031(1:11) 00END032(1:11)
             00END033(1:11) 00END034(1:11) 00END035(1:11) 00END036(1:11)
             00END037(1:11) 00END038(1:11) 00END039(1:11) 00END040(1:11)
             00END041(1:11) 00END042(1:11) 00END043(1:11) 00END044(1:11)
             00END045(1:11) 00END046(1:11) 00END047(1:11) 00END048(1:11)
             00END049(1:11)
           MOVE ZEROS TO 00ENDV05 00ENDV06 00ENDV07 00ENDV08 00ENDV09
                00ENDV10 00ENDV11 00ENDV12 00ENDV13 00ENDV14 00ENDV15
                00ENDV16 00ENDV17 00ENDV18 00ENDV19 00ENDV20 00ENDV21
                00ENDV22 00ENDV23 00ENDV24 00ENDV25 00ENDV26 00ENDV27
                00ENDV28 00ENDV29 00ENDV30 00ENDV31 00ENDV32 00ENDV33
                00ENDV34 00ENDV35 00ENDV36 00ENDV37 00ENDV38 00ENDV39
                00ENDV40 00ENDV41 00ENDV42 00ENDV43 00ENDV44 00ENDV45
                00ENDV46 00ENDV47 00ENDV48 00ENDV49.

       2750-CALCULA-CARACT-01END.
REMARK******************************************************************
REMARK*2750-CALCULA-CARACT-01END.
REMARK******************************************************************
           MOVE COD-PORTAF-CARACT TO 01ENDPTF(IND-PORTAF-CARACT).
      *** 01END001 *** SALDO TOTAL EN PRODUCTOS A LA FECHA
      *** 01END002 *** SALDO PROMEDIO EN PRODUCTOS A LA FECHA
           IF 00END005 >= 0
             COMPUTE 01ENDV01(IND-PORTAF-CARACT) = 
                     01ENDV01(IND-PORTAF-CARACT) + 00ENDV05
             COMPUTE 01ENDV02(IND-PORTAF-CARACT) = 
                     01ENDV02(IND-PORTAF-CARACT) + 00ENDV05
             ADD 1 TO 01ENDC01(IND-PORTAF-CARACT)
             ADD 1 TO 01ENDC02(IND-PORTAF-CARACT)
           ELSE
            IF 01END001(IND-PORTAF-CARACT) < 1 
              IF FUNCTION NUMVAL(00END005(1:11)) < 
                 FUNCTION NUMVAL(01END001(IND-PORTAF-CARACT)(1:11))
               MOVE 00END005(1:11) TO 01END001(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END002(IND-PORTAF-CARACT) < 1 
              IF FUNCTION NUMVAL(00END005(1:11)) < 
                 FUNCTION NUMVAL(01END002(IND-PORTAF-CARACT)(1:11))
               MOVE 00END005(1:11) TO 01END002(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END003 *** SALDO TOTAL EN MORA EN PRODUCTOS A LA FECHA
      *** 01END004 *** SALDO PROMEDIO EN MORA EN PRODUCTOS A LA FECHA
           IF 00END006 >= 0
                COMPUTE 01ENDV03(IND-PORTAF-CARACT) =
                        01ENDV03(IND-PORTAF-CARACT) + 00ENDV06
                COMPUTE 01ENDV04(IND-PORTAF-CARACT) =
                        01ENDV04(IND-PORTAF-CARACT) + 00ENDV06
                ADD 1 TO 01ENDC03(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC04(IND-PORTAF-CARACT)
           ELSE
            IF 01END003(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END006(1:11)) < 
                 FUNCTION NUMVAL(01END003(IND-PORTAF-CARACT)(1:11))
               MOVE 00END006(1:11) TO 01END003(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END004(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END006(1:11)) < 
                 FUNCTION NUMVAL(01END004(IND-PORTAF-CARACT)(1:11))
               MOVE 00END006(1:11) TO 01END004(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END005 *** CUOTA TOTAL EN PRODUCTOS A LA FECHA
      *** 01END006 *** CUOTA PROMEDIO EN PRODUCTOS A LA FECHA
           IF 00END007 >= 0
                COMPUTE 01ENDV05(IND-PORTAF-CARACT) =
                        01ENDV05(IND-PORTAF-CARACT) + 00ENDV07
                COMPUTE 01ENDV06(IND-PORTAF-CARACT) =
                        01ENDV06(IND-PORTAF-CARACT) + 00ENDV07
                ADD 1 TO 01ENDC05(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC06(IND-PORTAF-CARACT)
           ELSE
            IF 01END005(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END007(1:11)) < 
                 FUNCTION NUMVAL(01END005(IND-PORTAF-CARACT)(1:11))
               MOVE 00END007(1:11) TO 01END005(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END006(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END007(1:11)) < 
                 FUNCTION NUMVAL(01END006(IND-PORTAF-CARACT)(1:11))
               MOVE 00END007(1:11) TO 01END006(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END007 *** CUPO TOTAL EN PRODUCTOS A LA FECHA
           IF 00END008 >= 0
               COMPUTE 01ENDV07(IND-PORTAF-CARACT) =
                       01ENDV07(IND-PORTAF-CARACT) + 00ENDV08
               ADD 1 TO 01ENDC07(IND-PORTAF-CARACT)
           ELSE
             IF 01END007(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END008(1:11)) <
                 FUNCTION NUMVAL(01END007(IND-PORTAF-CARACT)(1:11))
               MOVE 00END008(1:11) TO 01END007(IND-PORTAF-CARACT)(1:11)
              END-IF
             END-IF
           END-IF.
      *** 01END008 *** CUPO PROMEDIO EN PRODUCTOS A LA FECHA 
           IF IND-PORTAF-CARACT = 01    *> SOLO PARA PORTAFOLIO RO
            IF 00END008 >= 0
                COMPUTE 01ENDV08(IND-PORTAF-CARACT) =
                        01ENDV08(IND-PORTAF-CARACT) + 00ENDV08
                ADD 1 TO 01ENDC08(IND-PORTAF-CARACT)
            ELSE
             IF 01END008(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END008(1:11)) < 
                 FUNCTION NUMVAL(01END008(IND-PORTAF-CARACT)(1:11))
               MOVE 00END008(1:11) TO 01END008(IND-PORTAF-CARACT)(1:11)
              END-IF
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END008(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END009 *** CUPO TOTAL DISPONIBLE EN PRODUCTOS A LA FECHA
      *** 01END010 *** CUPO PROMEDIO DISPONIBLE EN PRODUCTOS A LA FECHA
           IF 00END009 >= 0
                COMPUTE 01ENDV09(IND-PORTAF-CARACT) =
                        01ENDV09(IND-PORTAF-CARACT) + 00ENDV09
                COMPUTE 01ENDV10(IND-PORTAF-CARACT) =
                        01ENDV10(IND-PORTAF-CARACT) + 00ENDV09
                ADD 1 TO 01ENDC09(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC10(IND-PORTAF-CARACT)
           ELSE
            IF 01END009(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END009(1:11)) < 
                 FUNCTION NUMVAL(01END009(IND-PORTAF-CARACT)(1:11))
               MOVE 00END009(1:11) TO 01END009(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END010(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END009(1:11)) < 
                 FUNCTION NUMVAL(01END010(IND-PORTAF-CARACT)(1:11))
               MOVE 00END009(1:11) TO 01END010(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END011 *** PROMEDIO DEL SALDO PROMEDIO EN ULTIMOS 3 MESES
           IF 00END030 >= 0
             COMPUTE 01ENDV11(IND-PORTAF-CARACT) =
                     01ENDV11(IND-PORTAF-CARACT) + 00ENDV30
             ADD 1 TO 01ENDC11(IND-PORTAF-CARACT)
           ELSE
            IF 01END011(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END030(1:11)) < 
                 FUNCTION NUMVAL(01END011(IND-PORTAF-CARACT)(1:11))
               MOVE 00END030(1:11) TO 01END011(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END012 *** PROMEDIO DEL SALDO PROMEDIO EN MORA ULTIMOS 3 MESES 
           IF 00END031 >= 0
             COMPUTE 01ENDV12(IND-PORTAF-CARACT) =
                     01ENDV12(IND-PORTAF-CARACT) + 00ENDV31
             ADD 1 TO 01ENDC12(IND-PORTAF-CARACT)
           ELSE
            IF 01END012(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END031(1:11)) < 
                 FUNCTION NUMVAL(01END012(IND-PORTAF-CARACT)(1:11))
               MOVE 00END031(1:11) TO 01END012(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END013 *** PROMEDIO DE CUOTA PROMEDIO EN ULTIMOS 3 MESES
           IF 00END032 >= 0
             COMPUTE 01ENDV13(IND-PORTAF-CARACT) =
                     01ENDV13(IND-PORTAF-CARACT) + 00ENDV32
             ADD 1 TO 01ENDC13(IND-PORTAF-CARACT)
           ELSE
            IF 01END013(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END032(1:11)) <  
                 FUNCTION NUMVAL(01END013(IND-PORTAF-CARACT)(1:11))
               MOVE 00END032(1:11) TO 01END013(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END014 *** PROMEDIO DEL SALDO PROMEDIO EN MORA ULTIMOS 3 MESES 
           IF 00END033 >= 0
             COMPUTE 01ENDV14(IND-PORTAF-CARACT) =
                     01ENDV14(IND-PORTAF-CARACT) + 00ENDV33
             ADD 1 TO 01ENDC14(IND-PORTAF-CARACT)
           ELSE
            IF 01END014(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END033(1:11)) < 
                 FUNCTION NUMVAL(01END014(IND-PORTAF-CARACT)(1:11))
               MOVE 00END033(1:11) TO 01END014(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END015 *** PROMEDIO DEL CUPO PROMEDIO DISPON EN ULTIMOS 3 MESES 
           IF 00END034 >= 0
             COMPUTE 01ENDV15(IND-PORTAF-CARACT) =
                     01ENDV15(IND-PORTAF-CARACT) + 00ENDV34
             ADD 1 TO 01ENDC15(IND-PORTAF-CARACT)
           ELSE
            IF 01END015(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END034(1:11)) < 
                 FUNCTION NUMVAL(01END015(IND-PORTAF-CARACT)(1:11))
               MOVE 00END034(1:11) TO 01END015(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END016 *** PROMEDIO DEL SALDO PROMEDIO EN ULTIMOS 6 MESES 
           IF 00END035 >= 0
             COMPUTE 01ENDV16(IND-PORTAF-CARACT) =
                     01ENDV16(IND-PORTAF-CARACT) + 00ENDV35
             ADD 1 TO 01ENDC16(IND-PORTAF-CARACT)
           ELSE
            IF 01END016(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END035(1:11)) < 
                 FUNCTION NUMVAL(01END016(IND-PORTAF-CARACT)(1:11))
               MOVE 00END035(1:11) TO 01END016(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END017 *** PROMEDIO DEL SALDO PROMEDIO EN MORA ULTIMOS 6 MESES 
           IF 00END036 >= 0
             COMPUTE 01ENDV17(IND-PORTAF-CARACT) =
                     01ENDV17(IND-PORTAF-CARACT) + 00ENDV36
             ADD 1 TO 01ENDC17(IND-PORTAF-CARACT)
           ELSE
            IF 01END017(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END036(1:11)) < 
                 FUNCTION NUMVAL(01END017(IND-PORTAF-CARACT)(1:11))
               MOVE 00END036(1:11) TO 01END017(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END018 *** PROMEDIO DE CUOTA PROMEDIO EN ULTIMOS 6 MESES 
           IF 00END037 >= 0
             COMPUTE 01ENDV18(IND-PORTAF-CARACT) =
                     01ENDV18(IND-PORTAF-CARACT) + 00ENDV37
             ADD 1 TO 01ENDC18(IND-PORTAF-CARACT)
           ELSE
            IF 01END018(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END037(1:11)) < 
                 FUNCTION NUMVAL(01END018(IND-PORTAF-CARACT)(1:11))
               MOVE 00END037(1:11) TO 01END018(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END019 *** PROMEDIO DEL CUPO PROMEDIO EN ULTIMOS 6 MESES 
           IF 00END038 >= 0
             COMPUTE 01ENDV19(IND-PORTAF-CARACT) =
                     01ENDV19(IND-PORTAF-CARACT) + 00ENDV38
             ADD 1 TO 01ENDC19(IND-PORTAF-CARACT)
           ELSE
            IF 01END019(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END038(1:11)) < 
                 FUNCTION NUMVAL(01END019(IND-PORTAF-CARACT)(1:11))
               MOVE 00END038(1:11) TO 01END019(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END020 *** PROMEDIO DEL CUPO PROMEDIO DISPON EN ULTIMOS 6 MESES 
           IF 00END039 >= 0
             COMPUTE 01ENDV20(IND-PORTAF-CARACT) =
                     01ENDV20(IND-PORTAF-CARACT) + 00ENDV39
             ADD 1 TO 01ENDC20(IND-PORTAF-CARACT)
           ELSE
            IF 01END020(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END039(1:11)) < 
                 FUNCTION NUMVAL(01END020(IND-PORTAF-CARACT)(1:11))
               MOVE 00END039(1:11) TO 01END020(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END021 *** PROMEDIO DEL SALDO PROMEDIO DISPON EN ULTIMOS 9 MESES 
           IF 00END040 >= 0
             COMPUTE 01ENDV21(IND-PORTAF-CARACT) =
                     01ENDV21(IND-PORTAF-CARACT) + 00ENDV40
             ADD 1 TO 01ENDC21(IND-PORTAF-CARACT)
           ELSE
            IF 01END021(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END040(1:11)) < 
                 FUNCTION NUMVAL(01END021(IND-PORTAF-CARACT)(1:11))
               MOVE 00END040(1:11) TO 01END021(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END022 *** PROMEDIO DEL SALDO PROMEDIO EN MORA ULTIMOS 9 MESES 
           IF 00END041 >= 0
             COMPUTE 01ENDV22(IND-PORTAF-CARACT) =
                     01ENDV22(IND-PORTAF-CARACT) + 00ENDV41
             ADD 1 TO 01ENDC22(IND-PORTAF-CARACT)
           ELSE
            IF 01END022(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END041(1:11)) < 
                 FUNCTION NUMVAL(01END022(IND-PORTAF-CARACT)(1:11))
               MOVE 00END041(1:11) TO 01END022(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END023 *** PROMEDIO DE CUOTA PROMEDIO EN ULTIMOS 9 MESES 
           IF 00END042 >= 0
             COMPUTE 01ENDV23(IND-PORTAF-CARACT) =
                     01ENDV23(IND-PORTAF-CARACT) + 00ENDV42
             ADD 1 TO 01ENDC23(IND-PORTAF-CARACT)
           ELSE
            IF 01END023(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END042(1:11)) < 
                 FUNCTION NUMVAL(01END023(IND-PORTAF-CARACT)(1:11))
               MOVE 00END042(1:11) TO 01END023(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END024 *** PROMEDIO DE CUPO PROMEDIO EN ULTIMOS 9 MESES 
           IF 00END043 >= 0
             COMPUTE 01ENDV24(IND-PORTAF-CARACT) =
                     01ENDV24(IND-PORTAF-CARACT) + 00ENDV43
             ADD 1 TO 01ENDC24(IND-PORTAF-CARACT)
           ELSE
            IF 01END024(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END043(1:11)) < 
                 FUNCTION NUMVAL(01END024(IND-PORTAF-CARACT)(1:11))
               MOVE 00END043(1:11) TO 01END024(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END025 *** PROMEDIO DE CUPO PROMEDIO DISPON ULTIMOS 9 MESES 
           IF 00END044 >= 0
             COMPUTE 01ENDV25(IND-PORTAF-CARACT) =
                     01ENDV25(IND-PORTAF-CARACT) + 00ENDV44
             ADD 1 TO 01ENDC25(IND-PORTAF-CARACT)
           ELSE
            IF 01END025(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END044(1:11)) < 
                 FUNCTION NUMVAL(01END025(IND-PORTAF-CARACT)(1:11))
               MOVE 00END044(1:11) TO 01END025(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END026 *** PROMEDIO DE SALDO PROMEDIO ULTIMOS 12 MESES 
           IF 00END045 >= 0
             COMPUTE 01ENDV26(IND-PORTAF-CARACT) =
                     01ENDV26(IND-PORTAF-CARACT) + 00ENDV45
             ADD 1 TO 01ENDC26(IND-PORTAF-CARACT)
           ELSE
            IF 01END026(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END045(1:11)) < 
                 FUNCTION NUMVAL(01END026(IND-PORTAF-CARACT)(1:11))
               MOVE 00END045(1:11) TO 01END026(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END027 *** PROMEDIO DE SALDO PROMEDIO EN MORA ULTIMOS 12 MESES 
           IF 00END046 >= 0
             COMPUTE 01ENDV27(IND-PORTAF-CARACT) =
                     01ENDV27(IND-PORTAF-CARACT) + 00ENDV46
             ADD 1 TO 01ENDC27(IND-PORTAF-CARACT)
           ELSE
            IF 01END027(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END046(1:11)) < 
                 FUNCTION NUMVAL(01END027(IND-PORTAF-CARACT)(1:11))
               MOVE 00END046(1:11) TO 01END027(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END028 *** PROMEDIO DE CUOTA PROMEDIO EN ULTIMOS 12 MESES 
           IF 00END047 >= 0
             COMPUTE 01ENDV28(IND-PORTAF-CARACT) =
                     01ENDV28(IND-PORTAF-CARACT) + 00ENDV47
             ADD 1 TO 01ENDC28(IND-PORTAF-CARACT)
           ELSE
            IF 01END028(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END047(1:11)) < 
                 FUNCTION NUMVAL(01END028(IND-PORTAF-CARACT)(1:11))
               MOVE 00END047(1:11) TO 01END028(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END029 *** PROMEDIO DE CUPO PROMEDIO EN ULTIMOS 12 MESES 
           IF 00END048 >= 0
             COMPUTE 01ENDV29(IND-PORTAF-CARACT) =
                     01ENDV29(IND-PORTAF-CARACT) + 00ENDV48
             ADD 1 TO 01ENDC29(IND-PORTAF-CARACT)
           ELSE
            IF 01END029(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END048(1:11)) < 
                 FUNCTION NUMVAL(01END029(IND-PORTAF-CARACT)(1:11))
               MOVE 00END048(1:11) TO 01END029(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END030 *** PROMEDIO CUPO PROMEDIO DISPON EN ULTIMOS 12 MESES 
           IF 00END049 >= 0
             COMPUTE 01ENDV30(IND-PORTAF-CARACT) =
                     01ENDV30(IND-PORTAF-CARACT) + 00ENDV49
             ADD 1 TO 01ENDC30(IND-PORTAF-CARACT)
           ELSE
            IF 01END030(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END049(1:11)) < 
                 FUNCTION NUMVAL(01END030(IND-PORTAF-CARACT)(1:11))
               MOVE 00END049(1:11) TO 01END030(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END031 *** SALDO TOTAL PRODUCTOS HACE 3 MESES
      *** 01END032 *** SALDO PROMEDIO EN PRODUCTOS HACE 3 MESES
           IF 00END010 >= 0
                COMPUTE 01ENDV31(IND-PORTAF-CARACT) =
                   01ENDV31(IND-PORTAF-CARACT) + 00ENDV10
                COMPUTE 01ENDV32(IND-PORTAF-CARACT) =
                   01ENDV32(IND-PORTAF-CARACT) + 00ENDV10
                ADD 1 TO 01ENDC31(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC32(IND-PORTAF-CARACT)
           ELSE
            IF 01END031(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END010(1:11)) < 
                 FUNCTION NUMVAL(01END031(IND-PORTAF-CARACT)(1:11))
               MOVE 00END010(1:11) TO 01END031(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END032(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END010(1:11)) < 
                 FUNCTION NUMVAL(01END032(IND-PORTAF-CARACT)(1:11))
               MOVE 00END010(1:11) TO 01END032(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END033 *** SALDO TOTAL EN MORA PRODUCTOS HACE 3 MESES
      *** 01END034 *** SALDO PROMEDIO EN MORA PRODUCTOS HACE 3 MESES
           IF 00END011 >= 0
                COMPUTE 01ENDV33(IND-PORTAF-CARACT) =
                   01ENDV33(IND-PORTAF-CARACT) + 00ENDV11
                COMPUTE 01ENDV34(IND-PORTAF-CARACT) =
                   01ENDV34(IND-PORTAF-CARACT) + 00ENDV11
                ADD 1 TO 01ENDC33(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC34(IND-PORTAF-CARACT)
           ELSE
            IF 01END033(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END011(1:11)) < 
                 FUNCTION NUMVAL(01END033(IND-PORTAF-CARACT)(1:11))
               MOVE 00END011(1:11) TO 01END033(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END034(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END011(1:11)) < 
                 FUNCTION NUMVAL(01END034(IND-PORTAF-CARACT)(1:11))
               MOVE 00END011(1:11) TO 01END034(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END035 *** CUOTA TOTAL EN PRODUCTOS HACE 3 MESES
      *** 01END036 *** CUOTA PROMEDIO EN PRODUCTOS HACE 3 MESES
           IF 00END012 >= 0
                COMPUTE 01ENDV35(IND-PORTAF-CARACT) =
                   01ENDV35(IND-PORTAF-CARACT) + 00ENDV12
                COMPUTE 01ENDV36(IND-PORTAF-CARACT) =
                   01ENDV36(IND-PORTAF-CARACT) + 00ENDV12
                ADD 1 TO 01ENDC35(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC36(IND-PORTAF-CARACT)
           ELSE
            IF 01END035(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END012(1:11)) < 
                 FUNCTION NUMVAL(01END035(IND-PORTAF-CARACT)(1:11))
               MOVE 00END012(1:11) TO 01END035(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END036(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END012(1:11)) < 
                 FUNCTION NUMVAL(01END036(IND-PORTAF-CARACT)(1:11))
               MOVE 00END012(1:11) TO 01END036(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END037 *** CUPO TOTAL EN PRODUCTOS HACE 3 MESES
      *** 01END038 *** CUPO PROMEDIO EN PRODUCTOS HACE 3 MESES
           IF 00END013 >= 0
                COMPUTE 01ENDV37(IND-PORTAF-CARACT) =
                   01ENDV37(IND-PORTAF-CARACT) + 00ENDV13
                COMPUTE 01ENDV38(IND-PORTAF-CARACT) =
                   01ENDV38(IND-PORTAF-CARACT) + 00ENDV13
                ADD 1 TO 01ENDC37(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC38(IND-PORTAF-CARACT)
           ELSE
            IF 01END037(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END013(1:11)) < 
                 FUNCTION NUMVAL(01END037(IND-PORTAF-CARACT)(1:11))
               MOVE 00END013(1:11) TO 01END037(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END038(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END013(1:11)) < 
                 FUNCTION NUMVAL(01END038(IND-PORTAF-CARACT)(1:11))
               MOVE 00END013(1:11) TO 01END038(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END039 *** CUPO TOTAL DISPONIBLE EN PRODUCTOS HACE 3 MESES
      *** 01END040 *** CUPO PROMEDIO DISPONIBLE EN PRODUCTOS HACE 3 MESES
           IF 00END014 >= 0
                COMPUTE 01ENDV39(IND-PORTAF-CARACT) =
                   01ENDV39(IND-PORTAF-CARACT) + 00ENDV14
                COMPUTE 01ENDV40(IND-PORTAF-CARACT) =
                   01ENDV40(IND-PORTAF-CARACT) + 00ENDV14
                ADD 1 TO 01ENDC39(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC40(IND-PORTAF-CARACT)
           ELSE
            IF 01END039(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END014(1:11)) < 
                 FUNCTION NUMVAL(01END039(IND-PORTAF-CARACT)(1:11))
               MOVE 00END014(1:11) TO 01END039(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END040(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END014(1:11)) < 
                 FUNCTION NUMVAL(01END040(IND-PORTAF-CARACT)(1:11))
               MOVE 00END014(1:11) TO 01END040(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END041 *** SALDO TOTAL EN PRODUCTOS HACE 6 MESES
      *** 01END042 *** SALDO PROMEDIO EN PRODUCTOS HACE 6 MESES
           IF 00END015 >= 0
                COMPUTE 01ENDV41(IND-PORTAF-CARACT) =
                   01ENDV41(IND-PORTAF-CARACT) + 00ENDV15
                COMPUTE 01ENDV42(IND-PORTAF-CARACT) =
                   01ENDV42(IND-PORTAF-CARACT) + 00ENDV15
                ADD 1 TO 01ENDC41(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC42(IND-PORTAF-CARACT)
           ELSE
            IF 01END041(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END015(1:11)) < 
                 FUNCTION NUMVAL(01END041(IND-PORTAF-CARACT)(1:11))
               MOVE 00END015(1:11) TO 01END041(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END042(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END015(1:11)) < 
                 FUNCTION NUMVAL(01END042(IND-PORTAF-CARACT)(1:11))
               MOVE 00END015(1:11) TO 01END042(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END043 *** SALDO TOTAL EN MORA EN PRODUCTOS HACE 6 MESES
      *** 01END044 *** SALDO PROMEDIO EN MORA EN PRODUCTOS HACE 6 MESES
           IF 00END016 >= 0
                COMPUTE 01ENDV43(IND-PORTAF-CARACT) =
                   01ENDV43(IND-PORTAF-CARACT) + 00ENDV16
                COMPUTE 01ENDV44(IND-PORTAF-CARACT) =
                   01ENDV44(IND-PORTAF-CARACT) + 00ENDV16
                ADD 1 TO 01ENDC43(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC44(IND-PORTAF-CARACT)
           ELSE
            IF 01END043(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END016(1:11)) < 
                 FUNCTION NUMVAL(01END043(IND-PORTAF-CARACT)(1:11))
               MOVE 00END016(1:11) TO 01END043(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END044(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END016(1:11)) < 
                 FUNCTION NUMVAL(01END044(IND-PORTAF-CARACT)(1:11))
               MOVE 00END016(1:11) TO 01END044(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END045 *** CUOTA TOTAL EN PRODUCTOS HACE 6 MESES
      *** 01END046 *** CUOTA PROMEDIO EN PRODUCTOS HACE 6 MESES
           IF 00END017 >= 0
                COMPUTE 01ENDV45(IND-PORTAF-CARACT) =
                   01ENDV45(IND-PORTAF-CARACT) + 00ENDV17
                COMPUTE 01ENDV46(IND-PORTAF-CARACT) =
                   01ENDV46(IND-PORTAF-CARACT) + 00ENDV17
                ADD 1 TO 01ENDC45(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC46(IND-PORTAF-CARACT)
           ELSE
            IF 01END045(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END017(1:11)) < 
                 FUNCTION NUMVAL(01END045(IND-PORTAF-CARACT)(1:11))
               MOVE 00END017(1:11) TO 01END045(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END046(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END017(1:11)) < 
                 FUNCTION NUMVAL(01END046(IND-PORTAF-CARACT)(1:11))
               MOVE 00END017(1:11) TO 01END046(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END047 *** CUPO TOTAL EN PRODUCTOS HACE 6 MESES
      *** 01END048 *** CUPO PROMEDIO EN PRODUCTOS HACE 6 MESES
           IF 00END018 >= 0
                COMPUTE 01ENDV47(IND-PORTAF-CARACT) =
                   01ENDV47(IND-PORTAF-CARACT) + 00ENDV18
                COMPUTE 01ENDV48(IND-PORTAF-CARACT) =
                   01ENDV48(IND-PORTAF-CARACT) + 00ENDV18
                ADD 1 TO 01ENDC47(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC48(IND-PORTAF-CARACT)
           ELSE
            IF 01END047(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END018(1:11)) < 
                 FUNCTION NUMVAL(01END047(IND-PORTAF-CARACT)(1:11))
               MOVE 00END018(1:11) TO 01END047(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END048(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END018(1:11)) < 
                 FUNCTION NUMVAL(01END048(IND-PORTAF-CARACT)(1:11))
               MOVE 00END018(1:11) TO 01END048(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END049 *** CUPO TOTAL DISPONIBLE EN PRODUCTOS HACE 6 MESES
      *** 01END050 *** CUPO PROMEDIO DISPONIBLE EN PRODUCTOS HACE 6 MESES
           IF 00END019 >= 0
                COMPUTE 01ENDV49(IND-PORTAF-CARACT) =
                   01ENDV49(IND-PORTAF-CARACT) + 00ENDV19
                COMPUTE 01ENDV50(IND-PORTAF-CARACT) =
                   01ENDV50(IND-PORTAF-CARACT) + 00ENDV19
                ADD 1 TO 01ENDC49(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC50(IND-PORTAF-CARACT)
           ELSE
            IF 01END049(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END019(1:11)) < 
                 FUNCTION NUMVAL(01END049(IND-PORTAF-CARACT)(1:11))
               MOVE 00END019(1:11) TO 01END049(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END050(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END019(1:11)) < 
                 FUNCTION NUMVAL(01END050(IND-PORTAF-CARACT)(1:11))
               MOVE 00END019(1:11) TO 01END050(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END051 *** SALDO TOTAL EN PRODUCTOS HACE 9 MESES
      *** 01END052 *** SALDO PROMEDIO EN PRODUCTOS HACE 9 MESES
           IF 00END020 >= 0
                COMPUTE 01ENDV51(IND-PORTAF-CARACT) =
                   01ENDV51(IND-PORTAF-CARACT) + 00ENDV20
                COMPUTE 01ENDV52(IND-PORTAF-CARACT) =
                   01ENDV52(IND-PORTAF-CARACT) + 00ENDV20
                ADD 1 TO 01ENDC51(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC52(IND-PORTAF-CARACT)
           ELSE
            IF 01END051(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END020(1:11)) < 
                 FUNCTION NUMVAL(01END051(IND-PORTAF-CARACT)(1:11))
               MOVE 00END020(1:11) TO 01END051(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END052(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END020(1:11)) < 
                 FUNCTION NUMVAL(01END052(IND-PORTAF-CARACT)(1:11))
               MOVE 00END020(1:11) TO 01END052(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END053 *** SALDO TOTAL EN MORA EN PRODUCTOS HACE 9 MESES
      *** 01END054 *** SALDO PROMEDIO EN MORA EN PRODUCTOS HACE 9 MESES
           IF 00END021 >= 0
                COMPUTE 01ENDV53(IND-PORTAF-CARACT) =
                   01ENDV53(IND-PORTAF-CARACT) + 00ENDV21
                COMPUTE 01ENDV54(IND-PORTAF-CARACT) =
                   01ENDV54(IND-PORTAF-CARACT) + 00ENDV21
                ADD 1 TO 01ENDC53(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC54(IND-PORTAF-CARACT)
           ELSE
            IF 01END053(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END021(1:11)) < 
                 FUNCTION NUMVAL(01END053(IND-PORTAF-CARACT)(1:11))
               MOVE 00END021(1:11) TO 01END053(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END054(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END021(1:11)) < 
                 FUNCTION NUMVAL(01END054(IND-PORTAF-CARACT)(1:11))
               MOVE 00END021(1:11) TO 01END054(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END055 *** CUOTA TOTAL EN RODUCTOS HACE 9 MESES
      *** 01END056 *** CUOTA PROMEDIO EN PRODUCTOS HACE 9 MESES
           IF 00END022 >= 0
                COMPUTE 01ENDV55(IND-PORTAF-CARACT) =
                   01ENDV55(IND-PORTAF-CARACT) + 00ENDV22
                COMPUTE 01ENDV56(IND-PORTAF-CARACT) =
                   01ENDV56(IND-PORTAF-CARACT) + 00ENDV22
                ADD 1 TO 01ENDC55(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC56(IND-PORTAF-CARACT)
           ELSE
            IF 01END055(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END022(1:11)) < 
                 FUNCTION NUMVAL(01END055(IND-PORTAF-CARACT)(1:11))
               MOVE 00END022(1:11) TO 01END055(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END056(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END022(1:11)) < 
                 FUNCTION NUMVAL(01END056(IND-PORTAF-CARACT)(1:11))
               MOVE 00END022(1:11) TO 01END056(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END057 *** CUPO TOTAL EN RODUCTOS HACE 9 MESES
      *** 01END058 *** CUPO PROMEDIO EN PRODUCTOS HACE 9 MESES
           IF 00END023 >= 0
                COMPUTE 01ENDV57(IND-PORTAF-CARACT) =
                   01ENDV57(IND-PORTAF-CARACT) + 00ENDV23
                COMPUTE 01ENDV58(IND-PORTAF-CARACT) =
                   01ENDV58(IND-PORTAF-CARACT) + 00ENDV23
                ADD 1 TO 01ENDC57(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC58(IND-PORTAF-CARACT)
           ELSE
            IF 01END057(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END023(1:11)) < 
                 FUNCTION NUMVAL(01END057(IND-PORTAF-CARACT)(1:11))
               MOVE 00END023(1:11) TO 01END057(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END058(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END023(1:11)) < 
                 FUNCTION NUMVAL(01END058(IND-PORTAF-CARACT)(1:11))
               MOVE 00END023(1:11) TO 01END058(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END059 *** CUPO TOTAL EN RODUCTOS HACE 9 MESES
      *** 01END060 *** CUPO PROMEDIO EN PRODUCTOS HACE 9 MESES
           IF 00END024 >= 0
                COMPUTE 01ENDV59(IND-PORTAF-CARACT) =
                   01ENDV59(IND-PORTAF-CARACT) + 00ENDV24
                COMPUTE 01ENDV60(IND-PORTAF-CARACT) =
                   01ENDV60(IND-PORTAF-CARACT) + 00ENDV24
                ADD 1 TO 01ENDC59(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC60(IND-PORTAF-CARACT)
           ELSE
            IF 01END059(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END024(1:11)) < 
                 FUNCTION NUMVAL(01END059(IND-PORTAF-CARACT)(1:11))
               MOVE 00END024(1:11) TO 01END059(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END060(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END024(1:11)) < 
                 FUNCTION NUMVAL(01END060(IND-PORTAF-CARACT)(1:11))
               MOVE 00END024(1:11) TO 01END060(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END061 *** SALDO TOTAL EN RODUCTOS HACE 12 MESES
      *** 01END062 *** SALDO PROMEDIO EN PRODUCTOS HACE 12 MESES
           IF 00END025 >= 0
                COMPUTE 01ENDV61(IND-PORTAF-CARACT) =
                   01ENDV61(IND-PORTAF-CARACT) + 00ENDV25
                COMPUTE 01ENDV62(IND-PORTAF-CARACT) =
                   01ENDV62(IND-PORTAF-CARACT) + 00ENDV25
                ADD 1 TO 01ENDC61(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC62(IND-PORTAF-CARACT)
           ELSE
            IF 01END061(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END025(1:11)) < 
                 FUNCTION NUMVAL(01END061(IND-PORTAF-CARACT)(1:11))
               MOVE 00END025(1:11) TO 01END061(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END062(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END025(1:11)) < 
                 FUNCTION NUMVAL(01END062(IND-PORTAF-CARACT)(1:11))
               MOVE 00END025(1:11) TO 01END062(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END063 *** SALDO TOTAL EN MORA EN RODUCTOS HACE 12 MESES
      *** 01END064 *** SALDO PROMEDIO EN MORA EN PRODUCTOS HACE 12 MESES
           IF 00END026 >= 0
                COMPUTE 01ENDV63(IND-PORTAF-CARACT) =
                   01ENDV63(IND-PORTAF-CARACT) + 00ENDV26
                COMPUTE 01ENDV64(IND-PORTAF-CARACT) =
                   01ENDV64(IND-PORTAF-CARACT) + 00ENDV26
                ADD 1 TO 01ENDC63(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC64(IND-PORTAF-CARACT)
           ELSE
            IF 01END063(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END026(1:11)) < 
                 FUNCTION NUMVAL(01END063(IND-PORTAF-CARACT)(1:11))
               MOVE 00END026(1:11) TO 01END063(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END064(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END026(1:11)) < 
                 FUNCTION NUMVAL(01END064(IND-PORTAF-CARACT)(1:11))
               MOVE 00END026(1:11) TO 01END064(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END065 *** CUOTA TOTAL EN PRODUCTOS HACE 12 MESES
      *** 01END066 *** CUOTA PROMEDIO EN PRODUCTOS HACE 12 MESES
           IF 00END027 >= 0
                COMPUTE 01ENDV65(IND-PORTAF-CARACT) =
                   01ENDV65(IND-PORTAF-CARACT) + 00ENDV27
                COMPUTE 01ENDV66(IND-PORTAF-CARACT) =
                   01ENDV66(IND-PORTAF-CARACT) + 00ENDV27
                ADD 1 TO 01ENDC65(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC66(IND-PORTAF-CARACT)
           ELSE
            IF 01END065(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END027(1:11)) < 
                 FUNCTION NUMVAL(01END065(IND-PORTAF-CARACT)(1:11))
               MOVE 00END027(1:11) TO 01END065(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END066(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END027(1:11)) < 
                 FUNCTION NUMVAL(01END066(IND-PORTAF-CARACT)(1:11))
               MOVE 00END027(1:11) TO 01END066(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END067 *** CUPO TOTAL EN PRODUCTOS HACE 12 MESES
      *** 01END068 *** CUPO PROMEDIO EN PRODUCTOS HACE 12 MESES
           IF 00END028 >= 0
                COMPUTE 01ENDV67(IND-PORTAF-CARACT) =
                   01ENDV67(IND-PORTAF-CARACT) + 00ENDV28
                COMPUTE 01ENDV68(IND-PORTAF-CARACT) =
                   01ENDV68(IND-PORTAF-CARACT) + 00ENDV28
                ADD 1 TO 01ENDC67(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC68(IND-PORTAF-CARACT)
           ELSE
            IF 01END067(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END028(1:11)) < 
                 FUNCTION NUMVAL(01END067(IND-PORTAF-CARACT)(1:11))
               MOVE 00END028(1:11) TO 01END067(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END068(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END028(1:11)) < 
                 FUNCTION NUMVAL(01END068(IND-PORTAF-CARACT)(1:11))
               MOVE 00END028(1:11) TO 01END068(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END069 *** CUPO TOTAL DISPON EN PRODUCTOS HACE 12 MESES
      *** 01END070 *** CUPO PROMEDIO DISPON EN PRODUCTOS HACE 12 MESES
           IF 00END029 >= 0
                COMPUTE 01ENDV69(IND-PORTAF-CARACT) =
                   01ENDV69(IND-PORTAF-CARACT) + 00ENDV29
                COMPUTE 01ENDV70(IND-PORTAF-CARACT) =
                   01ENDV70(IND-PORTAF-CARACT) + 00ENDV29
                ADD 1 TO 01ENDC69(IND-PORTAF-CARACT)
                ADD 1 TO 01ENDC70(IND-PORTAF-CARACT)
           ELSE
            IF 01END069(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END029(1:11)) < 
                 FUNCTION NUMVAL(01END069(IND-PORTAF-CARACT)(1:11))
               MOVE 00END029(1:11) TO 01END069(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
            IF 01END070(IND-PORTAF-CARACT) < 1
              IF FUNCTION NUMVAL(00END029(1:11)) < 
                 FUNCTION NUMVAL(01END070(IND-PORTAF-CARACT)(1:11))
               MOVE 00END029(1:11) TO 01END070(IND-PORTAF-CARACT)(1:11)
              END-IF
            END-IF
           END-IF.
      *** 01END071 *** UTILIZACIONES PROMEDIO EN PRODUCTOS A LA FECHA
      *** 01END076 *** UTILIZACIONES TOTAL EN PRODUCTOS A LA FECHA
           IF IND-PORTAF-CARACT = 1    *> SOLO PARA PORTAFOLIO RO
            IF 00END008 > 0 AND 00END005 >= 0
              MOVE ZEROS TO TMP-VAL-CARACT
              COMPUTE TMP-VAL-CARACT ROUNDED = 
                      ((00ENDV05/00ENDV08) * 100)
              COMPUTE 01ENDV71(IND-PORTAF-CARACT) =
                      01ENDV71(IND-PORTAF-CARACT) + TMP-VAL-CARACT
              ADD 1 TO 01ENDC71(IND-PORTAF-CARACT)       
              COMPUTE 01ENDV76C(IND-PORTAF-CARACT) =
                      01ENDV76C(IND-PORTAF-CARACT) + 00ENDV08
              COMPUTE 01ENDV76S(IND-PORTAF-CARACT) =
                      01ENDV76S(IND-PORTAF-CARACT) + 00ENDV05
              ADD 1 TO 01ENDC76(IND-PORTAF-CARACT)       
            ELSE
             IF 01ENDC71(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END071(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC76(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END076(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END071(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END076(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END072 *** UTILIZACIONES PROMEDIO EN PRODUCTOS HACE 3 MESES
      *** 01END077 *** UTILIZACIONES TOTAL EN PRODUCTOS HACE 3 MESES
           IF IND-PORTAF-CARACT = 1   *> SOLO PARA PORTAFOLIO RO
            IF 00END013 > 0 AND 00END010 >= 0
              MOVE ZEROS TO TMP-VAL-CARACT
              COMPUTE TMP-VAL-CARACT ROUNDED = 
                      ((00ENDV10/00ENDV13) * 100)
              COMPUTE 01ENDV72(IND-PORTAF-CARACT) =
                      01ENDV72(IND-PORTAF-CARACT) + TMP-VAL-CARACT
              ADD 1 TO 01ENDC72(IND-PORTAF-CARACT)       
              COMPUTE 01ENDV77C(IND-PORTAF-CARACT) =
                      01ENDV77C(IND-PORTAF-CARACT) + 00ENDV13
              COMPUTE 01ENDV77S(IND-PORTAF-CARACT) =
                      01ENDV77S(IND-PORTAF-CARACT) + 00ENDV10
              ADD 1 TO 01ENDC77(IND-PORTAF-CARACT)       
            ELSE
             IF 01ENDC72(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END072(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC77(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END077(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END072(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END077(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END073 *** UTILIZACIONES PROMEDIO EN PRODUCTOS HACE 6 MESES
      *** 01END078 *** UTILIZACIONES TOTAL EN PRODUCTOS HACE 6 MESES
           IF IND-PORTAF-CARACT = 1   *> SOLO PARA PORTAFOLIO RO
            IF 00END018 > 0 AND 00END015 >= 0
              MOVE ZEROS TO TMP-VAL-CARACT
              COMPUTE TMP-VAL-CARACT ROUNDED = 
                      ((00ENDV15/00ENDV18) * 100)
              COMPUTE 01ENDV73(IND-PORTAF-CARACT) =
                      01ENDV73(IND-PORTAF-CARACT) + TMP-VAL-CARACT
              ADD 1 TO 01ENDC73(IND-PORTAF-CARACT)       
              COMPUTE 01ENDV78C(IND-PORTAF-CARACT) =
                      01ENDV78C(IND-PORTAF-CARACT) + 00ENDV18
              COMPUTE 01ENDV78S(IND-PORTAF-CARACT) =
                      01ENDV78S(IND-PORTAF-CARACT) + 00ENDV15
              ADD 1 TO 01ENDC78(IND-PORTAF-CARACT)       
            ELSE
             IF 01ENDC73(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END073(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC78(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END078(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END073(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END078(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END074 *** UTILIZACIONES PROMEDIO EN PRODUCTOS HACE 9 MESES
      *** 01END079 *** UTILIZACIONES TOTAL EN PRODUCTOS HACE 9 MESES
           IF IND-PORTAF-CARACT = 1    *> SOLO PARA PORTAFOLIO RO
            IF 00END023 > 0 AND 00END020 >= 0
              MOVE ZEROS TO TMP-VAL-CARACT
              COMPUTE TMP-VAL-CARACT ROUNDED = 
                      ((00ENDV20/00ENDV23) * 100)
              COMPUTE 01ENDV74(IND-PORTAF-CARACT) =
                      01ENDV74(IND-PORTAF-CARACT) + TMP-VAL-CARACT
              ADD 1 TO 01ENDC74(IND-PORTAF-CARACT)       
              COMPUTE 01ENDV79C(IND-PORTAF-CARACT) =
                      01ENDV79C(IND-PORTAF-CARACT) + 00ENDV23
              COMPUTE 01ENDV79S(IND-PORTAF-CARACT) =
                      01ENDV79S(IND-PORTAF-CARACT) + 00ENDV20
              ADD 1 TO 01ENDC79(IND-PORTAF-CARACT)       
            ELSE
             IF 01ENDC74(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END074(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC79(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END079(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END074(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END079(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END075 *** UTILIZACIONES PROMEDIO EN PRODUCTOS HACE 12 MESES
      *** 01END080 *** UTILIZACIONES TOTAL EN PRODUCTOS HACE 12 MESES
           IF IND-PORTAF-CARACT = 1   *> SOLO PARA PORTAFOLIO RO
            IF 00END028 > 0 AND 00END025 >= 0
              MOVE ZEROS TO TMP-VAL-CARACT
              COMPUTE TMP-VAL-CARACT ROUNDED = 
                      ((00ENDV25/00ENDV28) * 100)
              COMPUTE 01ENDV75(IND-PORTAF-CARACT) =
                      01ENDV75(IND-PORTAF-CARACT) + TMP-VAL-CARACT
              ADD 1 TO 01ENDC75(IND-PORTAF-CARACT)       
              COMPUTE 01ENDV80C(IND-PORTAF-CARACT) =
                      01ENDV80C(IND-PORTAF-CARACT) + 00ENDV28
              COMPUTE 01ENDV80S(IND-PORTAF-CARACT) =
                      01ENDV80S(IND-PORTAF-CARACT) + 00ENDV25
              ADD 1 TO 01ENDC80(IND-PORTAF-CARACT)       
            ELSE
             IF 01ENDC75(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END075(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC80(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END080(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END075(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END080(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END081 *** NUMERO PRODUCTOS CON UTILIZ ENTRE 0% y 25% A LA FECHA
      *** 01END082 *** NUMERO PRODUCTOS CON UTILIZ ENTRE 25% y 50% A LA FECHA
      *** 01END083 *** NUMERO PRODUCTOS CON UTILIZ ENTRE 50% y 75% A LA FECHA
      *** 01END084 *** NUMERO PRODUCTOS CON UTILIZ ENTRE 76% y 100% A LA FECHA
      *** 01END085 *** NUMERO PRODUCTOS CON UTILIZ SUPERIOR A 100% A LA FECHA
           IF IND-PORTAF-CARACT = 1   *> SOLO PARA PORTAFOLIO RO
            IF 00END008 > 0 AND 00END005 >= 0
              MOVE ZEROS TO TMP-VAL-CARACT
              ADD 1 TO 01ENDC81(IND-PORTAF-CARACT)
                       01ENDC82(IND-PORTAF-CARACT)
                       01ENDC83(IND-PORTAF-CARACT)
                       01ENDC84(IND-PORTAF-CARACT)
                       01ENDC85(IND-PORTAF-CARACT)
              COMPUTE TMP-VAL-CARACT ROUNDED =
                      ((00ENDV05/00ENDV08) * 100)
                IF TMP-VAL-CARACT >= 0 AND <= 25
                   ADD 1 TO 01ENDV81(IND-PORTAF-CARACT)
                ELSE
                   IF TMP-VAL-CARACT > 25 AND <= 50
                      ADD 1 TO 01ENDV82(IND-PORTAF-CARACT)
                   ELSE
                      IF TMP-VAL-CARACT > 50 AND <= 75
                         ADD 1 TO 01ENDV83(IND-PORTAF-CARACT)
                      ELSE
                         IF TMP-VAL-CARACT > 75 AND <= 100
                            ADD 1 TO 01ENDV84(IND-PORTAF-CARACT)
                         ELSE
                            IF TMP-VAL-CARACT > 100
                               ADD 1 TO 01ENDV85(IND-PORTAF-CARACT)
                            END-IF
                         END-IF
                      END-IF
                   END-IF
                END-IF
            ELSE
             IF 01ENDC81(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END081(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC82(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END082(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC83(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END083(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC84(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END084(IND-PORTAF-CARACT)(1:11)
             END-IF
             IF 01ENDC85(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END085(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END081(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END082(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END083(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END084(IND-PORTAF-CARACT)(1:11)
            MOVE "        -99" TO 01END085(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END086 *** UTILIZACION TOTAL EN PRODUCTOS PROMEDIO ULTIMOS 3 MESES
           IF IND-PORTAF-CARACT = 1   *> SOLO PARA PORTAFOLIO RO
            IF 00END033 > 0 AND 00END030 >= 0
              COMPUTE 01ENDV86C(IND-PORTAF-CARACT) =
                      01ENDV86C(IND-PORTAF-CARACT) + 00ENDV33
              COMPUTE 01ENDV86S(IND-PORTAF-CARACT) =
                      01ENDV86S(IND-PORTAF-CARACT) + 00ENDV30
              ADD 1 TO 01ENDC86(IND-PORTAF-CARACT)
            ELSE
             IF 01ENDC86(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END086(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END086(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END087 *** UTILIZACION TOTAL EN PRODUCTOS PROMEDIO ULTIMOS 6 MESES
           IF IND-PORTAF-CARACT = 1  *> SOLO PARA PORTAFOLIO RO
            IF 00END038 > 0 AND 00END035 >= 0
              COMPUTE 01ENDV87C(IND-PORTAF-CARACT) =
                      01ENDV87C(IND-PORTAF-CARACT) + 00ENDV38
              COMPUTE 01ENDV87S(IND-PORTAF-CARACT) =
                      01ENDV87S(IND-PORTAF-CARACT) + 00ENDV35
              ADD 1 TO 01ENDC87(IND-PORTAF-CARACT)
            ELSE
             IF 01ENDC87(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END087(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END087(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END088 *** UTILIZACION TOTAL EN PRODUCTOS PROMEDIO ULTIMOS 9 MESES
           IF IND-PORTAF-CARACT = 1   *> SOLO PARA PORTAFOLIO RO
            IF 00END043 > 0 AND 00END040 >= 0
              COMPUTE 01ENDV88C(IND-PORTAF-CARACT) =
                      01ENDV88C(IND-PORTAF-CARACT) + 00ENDV43
              COMPUTE 01ENDV88S(IND-PORTAF-CARACT) =
                      01ENDV88S(IND-PORTAF-CARACT) + 00ENDV40
              ADD 1 TO 01ENDC88(IND-PORTAF-CARACT)
            ELSE
             IF 01ENDC88(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END088(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END088(IND-PORTAF-CARACT)(1:11)
           END-IF.
      *** 01END089 *** UTILIZACION TOTAL EN PRODUCTOS PROMEDIO ULTIMOS 12 MESES
           IF IND-PORTAF-CARACT = 1     *> SOLO PARA PORTAFOLIO RO
            IF 00END048 > 0 AND 00END045 >= 0
              COMPUTE 01ENDV89C(IND-PORTAF-CARACT) =
                      01ENDV89C(IND-PORTAF-CARACT) + 00ENDV48
              COMPUTE 01ENDV89S(IND-PORTAF-CARACT) =
                      01ENDV89S(IND-PORTAF-CARACT) + 00ENDV45
              ADD 1 TO 01ENDC89(IND-PORTAF-CARACT)
            ELSE
             IF 01ENDC89(IND-PORTAF-CARACT) = ZEROS
               MOVE "        -11" TO 01END089(IND-PORTAF-CARACT)(1:11)
             END-IF
            END-IF
           ELSE
            MOVE "        -99" TO 01END089(IND-PORTAF-CARACT)(1:11)
           END-IF.

       2750-1-CALCULA-CARACT-01END.
REMARK******************************************************************
REMARK*2750-1-CALCULA-CARACT-01END.
REMARK******************************************************************
      *** CALCULA TODAS LAS CARACTERISTICAS 01END QUE SON AGRUPADAS POR
      *** IDENTIFICACION Y PORTAFOLIO 01END001  A 01END089.
           PERFORM VARYING R-CARACT FROM 1 BY 1 UNTIL R-CARACT > 9
             IF 01ENDC01(R-CARACT) > ZEROS
                MOVE 01ENDV01(R-CARACT) TO 01END001(R-CARACT)
             END-IF
             IF 01ENDC02(R-CARACT) > ZEROS
                COMPUTE 01END002(R-CARACT) ROUNDED =
                        (01ENDV02(R-CARACT) / 01ENDC02(R-CARACT))
             END-IF
             IF 01ENDC03(R-CARACT) > ZEROS
                MOVE 01ENDV03(R-CARACT) TO 01END003(R-CARACT)
             END-IF
             IF 01ENDC04(R-CARACT) > ZEROS
                COMPUTE 01END004(R-CARACT) ROUNDED =
                        (01ENDV04(R-CARACT) / 01ENDC04(R-CARACT))
             END-IF
             IF 01ENDC05(R-CARACT) > ZEROS
                MOVE 01ENDV05(R-CARACT) TO 01END005(R-CARACT)
             END-IF
             IF 01ENDC06(R-CARACT) > ZEROS
                COMPUTE 01END006(R-CARACT) ROUNDED =
                        (01ENDV06(R-CARACT) / 01ENDC06(R-CARACT))
             END-IF
             IF 01ENDC07(R-CARACT) > ZEROS
                MOVE 01ENDV07(R-CARACT) TO 01END007(R-CARACT)
             END-IF
             IF 01ENDC08(R-CARACT) > ZEROS
                COMPUTE 01END008(R-CARACT) ROUNDED =
                        (01ENDV08(R-CARACT) / 01ENDC08(R-CARACT))
             END-IF
             IF 01ENDC09(R-CARACT) > ZEROS
                MOVE 01ENDV09(R-CARACT) TO 01END009(R-CARACT)
             END-IF
             IF 01ENDC10(R-CARACT) > ZEROS
                COMPUTE 01END010(R-CARACT) ROUNDED =
                        (01ENDV10(R-CARACT) / 01ENDC10(R-CARACT))
             END-IF
             IF 01ENDC11(R-CARACT) > ZEROS
                COMPUTE 01END011(R-CARACT) ROUNDED =
                        (01ENDV11(R-CARACT) / 01ENDC11(R-CARACT))
             END-IF
             IF 01ENDC12(R-CARACT) > ZEROS
                COMPUTE 01END012(R-CARACT) ROUNDED =
                        (01ENDV12(R-CARACT) / 01ENDC12(R-CARACT))
             END-IF
             IF 01ENDC13(R-CARACT) > ZEROS
                COMPUTE 01END013(R-CARACT) ROUNDED =
                        (01ENDV13(R-CARACT) / 01ENDC13(R-CARACT))
             END-IF
             IF 01ENDC14(R-CARACT) > ZEROS
                COMPUTE 01END014(R-CARACT) ROUNDED =
                        (01ENDV14(R-CARACT) / 01ENDC14(R-CARACT))
             END-IF
             IF 01ENDC15(R-CARACT) > ZEROS
                COMPUTE 01END015(R-CARACT) ROUNDED =
                        (01ENDV15(R-CARACT) / 01ENDC15(R-CARACT))
             END-IF
             IF 01ENDC16(R-CARACT) > ZEROS
                COMPUTE 01END016(R-CARACT) ROUNDED =
                        (01ENDV16(R-CARACT) / 01ENDC16(R-CARACT))
             END-IF
             IF 01ENDC17(R-CARACT) > ZEROS
                COMPUTE 01END017(R-CARACT) ROUNDED =
                        (01ENDV17(R-CARACT) / 01ENDC17(R-CARACT))
             END-IF
             IF 01ENDC18(R-CARACT) > ZEROS
                COMPUTE 01END018(R-CARACT) ROUNDED =
                        (01ENDV18(R-CARACT) / 01ENDC18(R-CARACT))
             END-IF
             IF 01ENDC19(R-CARACT) > ZEROS
                COMPUTE 01END019(R-CARACT) ROUNDED =
                        (01ENDV19(R-CARACT) / 01ENDC19(R-CARACT))
             END-IF
             IF 01ENDC20(R-CARACT) > ZEROS
                COMPUTE 01END020(R-CARACT) ROUNDED =
                        (01ENDV20(R-CARACT) / 01ENDC20(R-CARACT))
             END-IF
             IF 01ENDC21(R-CARACT) > ZEROS
                COMPUTE 01END021(R-CARACT) ROUNDED =
                        (01ENDV21(R-CARACT) / 01ENDC21(R-CARACT))
             END-IF
             IF 01ENDC22(R-CARACT) > ZEROS
                COMPUTE 01END022(R-CARACT) ROUNDED =
                        (01ENDV22(R-CARACT) / 01ENDC22(R-CARACT))
             END-IF
             IF 01ENDC23(R-CARACT) > ZEROS
                COMPUTE 01END023(R-CARACT) ROUNDED =
                        (01ENDV23(R-CARACT) / 01ENDC23(R-CARACT))
             END-IF
             IF 01ENDC24(R-CARACT) > ZEROS
                COMPUTE 01END024(R-CARACT) ROUNDED =
                        (01ENDV24(R-CARACT) / 01ENDC24(R-CARACT))
             END-IF
             IF 01ENDC25(R-CARACT) > ZEROS
                COMPUTE 01END025(R-CARACT) ROUNDED =
                        (01ENDV25(R-CARACT) / 01ENDC25(R-CARACT))
             END-IF
             IF 01ENDC26(R-CARACT) > ZEROS
                COMPUTE 01END026(R-CARACT) ROUNDED =
                        (01ENDV26(R-CARACT) / 01ENDC26(R-CARACT))
             END-IF
             IF 01ENDC27(R-CARACT) > ZEROS
                COMPUTE 01END027(R-CARACT) ROUNDED =
                        (01ENDV27(R-CARACT) / 01ENDC27(R-CARACT))
             END-IF
             IF 01ENDC28(R-CARACT) > ZEROS
                COMPUTE 01END028(R-CARACT) ROUNDED =
                        (01ENDV28(R-CARACT) / 01ENDC28(R-CARACT))
             END-IF
             IF 01ENDC29(R-CARACT) > ZEROS
                COMPUTE 01END029(R-CARACT) ROUNDED =
                        (01ENDV29(R-CARACT) / 01ENDC29(R-CARACT))
             END-IF
             IF 01ENDC30(R-CARACT) > ZEROS
                COMPUTE 01END030(R-CARACT) ROUNDED =
                        (01ENDV30(R-CARACT) / 01ENDC30(R-CARACT))
             END-IF
             IF 01ENDC31(R-CARACT) > ZEROS
                MOVE 01ENDV31(R-CARACT) TO 01END031(R-CARACT)
             END-IF
             IF 01ENDC32(R-CARACT) > ZEROS
                COMPUTE 01END032(R-CARACT) ROUNDED =
                        (01ENDV32(R-CARACT) / 01ENDC32(R-CARACT))
             END-IF
             IF 01ENDC33(R-CARACT) > ZEROS
                MOVE 01ENDV33(R-CARACT) TO 01END033(R-CARACT)
             END-IF
             IF 01ENDC34(R-CARACT) > ZEROS
                COMPUTE 01END034(R-CARACT) ROUNDED =
                        (01ENDV34(R-CARACT) / 01ENDC34(R-CARACT))
             END-IF
             IF 01ENDC35(R-CARACT) > ZEROS
                MOVE 01ENDV35(R-CARACT) TO 01END035(R-CARACT)
             END-IF
             IF 01ENDC36(R-CARACT) > ZEROS
                COMPUTE 01END036(R-CARACT) ROUNDED =
                        (01ENDV36(R-CARACT) / 01ENDC36(R-CARACT))
             END-IF
             IF 01ENDC37(R-CARACT) > ZEROS
                MOVE 01ENDV37(R-CARACT) TO 01END037(R-CARACT)
             END-IF
             IF 01ENDC38(R-CARACT) > ZEROS
                COMPUTE 01END038(R-CARACT) ROUNDED =
                        (01ENDV38(R-CARACT) / 01ENDC38(R-CARACT))
             END-IF
             IF 01ENDC39(R-CARACT) > ZEROS
                MOVE 01ENDV39(R-CARACT) TO 01END039(R-CARACT)
             END-IF
             IF 01ENDC40(R-CARACT) > ZEROS
                COMPUTE 01END040(R-CARACT) ROUNDED =
                        (01ENDV40(R-CARACT) / 01ENDC40(R-CARACT))
             END-IF
             IF 01ENDC41(R-CARACT) > ZEROS
                MOVE 01ENDV41(R-CARACT) TO 01END041(R-CARACT)
             END-IF
             IF 01ENDC42(R-CARACT) > ZEROS
                COMPUTE 01END042(R-CARACT) ROUNDED =
                        (01ENDV42(R-CARACT) / 01ENDC42(R-CARACT))
             END-IF
             IF 01ENDC43(R-CARACT) > ZEROS
                MOVE 01ENDV43(R-CARACT) TO 01END043(R-CARACT)
             END-IF
             IF 01ENDC44(R-CARACT) > ZEROS
                COMPUTE 01END044(R-CARACT) ROUNDED =
                        (01ENDV44(R-CARACT) / 01ENDC44(R-CARACT))
             END-IF
             IF 01ENDC45(R-CARACT) > ZEROS
                MOVE 01ENDV45(R-CARACT) TO 01END045(R-CARACT)
             END-IF
             IF 01ENDC46(R-CARACT) > ZEROS
                COMPUTE 01END046(R-CARACT) ROUNDED =
                        (01ENDV46(R-CARACT) / 01ENDC46(R-CARACT))
             END-IF
             IF 01ENDC47(R-CARACT) > ZEROS
                MOVE 01ENDV47(R-CARACT) TO 01END047(R-CARACT)
             END-IF
             IF 01ENDC48(R-CARACT) > ZEROS
                COMPUTE 01END048(R-CARACT) ROUNDED =
                        (01ENDV48(R-CARACT) / 01ENDC48(R-CARACT))
             END-IF
             IF 01ENDC49(R-CARACT) > ZEROS
                MOVE 01ENDV49(R-CARACT) TO 01END049(R-CARACT)
             END-IF
             IF 01ENDC50(R-CARACT) > ZEROS
                COMPUTE 01END050(R-CARACT) ROUNDED =
                        (01ENDV50(R-CARACT) / 01ENDC50(R-CARACT))
             END-IF
             IF 01ENDC51(R-CARACT) > ZEROS
                MOVE 01ENDV51(R-CARACT) TO 01END051(R-CARACT)
             END-IF
             IF 01ENDC52(R-CARACT) > ZEROS
                COMPUTE 01END052(R-CARACT) ROUNDED =
                        (01ENDV52(R-CARACT) / 01ENDC52(R-CARACT))
             END-IF
             IF 01ENDC53(R-CARACT) > ZEROS
                MOVE 01ENDV53(R-CARACT) TO 01END053(R-CARACT)
             END-IF
             IF 01ENDC54(R-CARACT) > ZEROS
                COMPUTE 01END054(R-CARACT) ROUNDED =
                        (01ENDV54(R-CARACT) / 01ENDC54(R-CARACT))
             END-IF
             IF 01ENDC55(R-CARACT) > ZEROS
                MOVE 01ENDV55(R-CARACT) TO 01END055(R-CARACT)
             END-IF
             IF 01ENDC56(R-CARACT) > ZEROS
                COMPUTE 01END056(R-CARACT) ROUNDED =
                        (01ENDV56(R-CARACT) / 01ENDC56(R-CARACT))
             END-IF
             IF 01ENDC57(R-CARACT) > ZEROS
                MOVE 01ENDV57(R-CARACT) TO 01END057(R-CARACT)
             END-IF
             IF 01ENDC58(R-CARACT) > ZEROS
                COMPUTE 01END058(R-CARACT) ROUNDED =
                        (01ENDV58(R-CARACT) / 01ENDC58(R-CARACT))
             END-IF
             IF 01ENDC59(R-CARACT) > ZEROS
                MOVE 01ENDV59(R-CARACT) TO 01END059(R-CARACT)
             END-IF
             IF 01ENDC60(R-CARACT) > ZEROS
                COMPUTE 01END060(R-CARACT) ROUNDED =
                        (01ENDV60(R-CARACT) / 01ENDC60(R-CARACT))
             END-IF
             IF 01ENDC61(R-CARACT) > ZEROS
                MOVE 01ENDV61(R-CARACT) TO 01END061(R-CARACT)
             END-IF
             IF 01ENDC62(R-CARACT) > ZEROS
                COMPUTE 01END062(R-CARACT) ROUNDED =
                        (01ENDV62(R-CARACT) / 01ENDC62(R-CARACT))
             END-IF
             IF 01ENDC63(R-CARACT) > ZEROS
                MOVE 01ENDV63(R-CARACT) TO 01END063(R-CARACT)
             END-IF
             IF 01ENDC64(R-CARACT) > ZEROS
                COMPUTE 01END064(R-CARACT) ROUNDED =
                        (01ENDV64(R-CARACT) / 01ENDC64(R-CARACT))
             END-IF
             IF 01ENDC65(R-CARACT) > ZEROS
                MOVE 01ENDV65(R-CARACT) TO 01END065(R-CARACT)
             END-IF
             IF 01ENDC66(R-CARACT) > ZEROS
                COMPUTE 01END066(R-CARACT) ROUNDED =
                        (01ENDV66(R-CARACT) / 01ENDC66(R-CARACT))
             END-IF
             IF 01ENDC67(R-CARACT) > ZEROS
                MOVE 01ENDV67(R-CARACT) TO 01END067(R-CARACT)
             END-IF
             IF 01ENDC68(R-CARACT) > ZEROS
                COMPUTE 01END068(R-CARACT) ROUNDED =
                        (01ENDV68(R-CARACT) / 01ENDC68(R-CARACT))
             END-IF
             IF 01ENDC69(R-CARACT) > ZEROS
                MOVE 01ENDV69(R-CARACT) TO 01END069(R-CARACT)
             END-IF
             IF 01ENDC70(R-CARACT) > ZEROS
                COMPUTE 01END070(R-CARACT) ROUNDED =
                        (01ENDV70(R-CARACT) / 01ENDC70(R-CARACT))
             END-IF
             IF 01ENDC71(R-CARACT) > ZEROS
                COMPUTE 01END071(R-CARACT) ROUNDED =
                        (01ENDV71(R-CARACT) / 01ENDC71(R-CARACT))
             END-IF
             IF 01ENDC72(R-CARACT) > ZEROS
                COMPUTE 01END072(R-CARACT) ROUNDED =
                        (01ENDV72(R-CARACT) / 01ENDC72(R-CARACT))
             END-IF
             IF 01ENDC73(R-CARACT) > ZEROS
                COMPUTE 01END073(R-CARACT) ROUNDED =
                        (01ENDV73(R-CARACT) / 01ENDC73(R-CARACT))
             END-IF
             IF 01ENDC74(R-CARACT) > ZEROS
                COMPUTE 01END074(R-CARACT) ROUNDED =
                        (01ENDV74(R-CARACT) / 01ENDC74(R-CARACT))
             END-IF
             IF 01ENDC75(R-CARACT) > ZEROS
                COMPUTE 01END075(R-CARACT) ROUNDED =
                        (01ENDV75(R-CARACT) / 01ENDC75(R-CARACT))
             END-IF
             IF 01ENDC76(R-CARACT) > ZEROS
                COMPUTE 01END076(R-CARACT) ROUNDED =
                   ((01ENDV76S(R-CARACT) / 01ENDV76C(R-CARACT)) * 100)
             END-IF
             IF 01ENDC77(R-CARACT) > ZEROS
                COMPUTE 01END077(R-CARACT) ROUNDED =
                   ((01ENDV77S(R-CARACT) / 01ENDV77C(R-CARACT)) * 100)
             END-IF
             IF 01ENDC78(R-CARACT) > ZEROS
                COMPUTE 01END078(R-CARACT) ROUNDED =
                   ((01ENDV78S(R-CARACT) / 01ENDV78C(R-CARACT)) * 100)
             END-IF
             IF 01ENDC79(R-CARACT) > ZEROS
                COMPUTE 01END079(R-CARACT) ROUNDED =
                   ((01ENDV79S(R-CARACT) / 01ENDV79C(R-CARACT)) * 100)
             END-IF
             IF 01ENDC80(R-CARACT) > ZEROS
                COMPUTE 01END080(R-CARACT) ROUNDED =
                   ((01ENDV80S(R-CARACT) / 01ENDV80C(R-CARACT)) * 100)
             END-IF
             IF 01ENDC81(R-CARACT) > ZEROS
                MOVE 01ENDV81(R-CARACT) TO 01END081(R-CARACT)
             END-IF
             IF 01ENDC82(R-CARACT) > ZEROS
                MOVE 01ENDV82(R-CARACT) TO 01END082(R-CARACT)
             END-IF
             IF 01ENDC83(R-CARACT) > ZEROS
                MOVE 01ENDV83(R-CARACT) TO 01END083(R-CARACT)
             END-IF
             IF 01ENDC84(R-CARACT) > ZEROS
                MOVE 01ENDV84(R-CARACT) TO 01END084(R-CARACT)
             END-IF
             IF 01ENDC85(R-CARACT) > ZEROS
                MOVE 01ENDV85(R-CARACT) TO 01END085(R-CARACT)
             END-IF
             IF 01ENDC86(R-CARACT) > ZEROS
                COMPUTE 01END086(R-CARACT) ROUNDED =
                   ((01ENDV86S(R-CARACT) / 01ENDV86C(R-CARACT)) * 100)
             END-IF
             IF 01ENDC87(R-CARACT) > ZEROS
                COMPUTE 01END087(R-CARACT) ROUNDED =
                   ((01ENDV87S(R-CARACT) / 01ENDV87C(R-CARACT)) * 100)
             END-IF
             IF 01ENDC88(R-CARACT) > ZEROS
                COMPUTE 01END088(R-CARACT) ROUNDED =
                   ((01ENDV88S(R-CARACT) / 01ENDV88C(R-CARACT)) * 100)
             END-IF
             IF 01ENDC89(R-CARACT) > ZEROS
                COMPUTE 01END089(R-CARACT) ROUNDED =
                   ((01ENDV89S(R-CARACT) / 01ENDV89C(R-CARACT)) * 100)
             END-IF
           END-PERFORM.
ACIEA1     PERFORM 0000-PROCESE-01END090-093.                           RMB0013
ACIEA1 0000-PROCESE-01END090-093.                                       RMB0013
REMARK******************************************************************
REMARK*0000-PROCESE-01END090-093.
REMARK*    SE CALCULA LAS CARACTERISTICAS NIVEL 01 PARA VARIACION DE      
REMARK*    VALORES CON VARIANZAS,DESVIACIONES,PROMEDIOS ETC            
REMARK******************************************************************
ACIEA1*    CALCULAR COEFICIENTE DE VARIACION DE SALDOS POR PORTAFOLIO   RMB0013
ACIEA1     PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL I-CARACT > 07     RMB0013
ACIEA1       IF V-SALDOFLAG090(I-CARACT) <> ZEROS                       RMB0013
ACIEA1          PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL              RMB0013
ACIEA1                                            J-CARACT > 12         RMB0013
ACIEA1             IF SALDOACUM090-CARACT(I-CARACT,J-CARACT) >= 0 AND   RMB0013
ACIEA1                SALDOFLAG090(I-CARACT,J-CARACT) > 0 *> no vacio   RMB0013
ACIEA1                COMPUTE SUMASALDO090-CARACT(I-CARACT) =           RMB0013
ACIEA1                        SUMASALDO090-CARACT(I-CARACT) +           RMB0013
ACIEA1                      SALDOACUM090-CARACT(I-CARACT,J-CARACT)      RMB0013
ACIEA1                ADD  1 TO NUMMESES090-CARACT(I-CARACT)            RMB0013
ACIEA1             END-IF                                               RMB0013
ACIEA1          END-PERFORM                                             RMB0013
ACIEA1*         CALCULAR PROMEDIO DE UTILIZACION POR PORTAFOLIO         RMB0013
ACIEA1          IF NUMMESES090-CARACT(I-CARACT) > 0                     RMB0013
ACIEA1             COMPUTE PROMSALDO090-CARACT(I-CARACT) =              RMB0013
ACIEA1             SUMASALDO090-CARACT(I-CARACT) /                      RMB0013
ACIEA1                            NUMMESES090-CARACT(I-CARACT)          RMB0013
ACIEA1          END-IF                                                  RMB0013
ACIEA1          PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL              RMB0013
ACIEA1                                            J-CARACT > 12         RMB0013
ACIEA1*            CALCULAR VARIANZA DE LAS SALDOS  POR PORTAFOLIO      RMB0013
ACIEA1             IF SALDOFLAG090(I-CARACT,J-CARACT)  > 0 AND          RMB0013
ACIEA1                SALDOACUM090-CARACT (I-CARACT,J-CARACT) >= 0      RMB0013
ACIEA1                COMPUTE VARIANZASALDO090-CARACT(I-CARACT) =       RMB0013
ACIEA1                 VARIANZASALDO090-CARACT(I-CARACT) +              RMB0013
ACIEA1                    (SALDOACUM090-CARACT (I-CARACT,J-CARACT)  -   RMB0013
ACIEA1                     PROMSALDO090-CARACT(I-CARACT))  ** 2         RMB0013
ACIEA1             END-IF                                               RMB0013
ACIEA1          END-PERFORM                                             RMB0013
ACIEA1          IF NUMMESES090-CARACT(I-CARACT) > 0                     RMB0013
ACIEA1*            CALCULAR DESVIACION DE LAS SALDOS POR PORTAFOLIO     RMB0013
ACIEA1             COMPUTE DESVIACIONSALDO090-CARACT(I-CARACT) =        RMB0013
ACIEA1                    (VARIANZASALDO090-CARACT(I-CARACT) /          RMB0013
ACIEA1                     NUMMESES090-CARACT(I-CARACT)) ** 0.5         RMB0013
ACIEA1          END-IF                                                  RMB0013
ACIEA1       END-IF                                                     RMB0013
ACIEA1       IF FLAG090(I-CARACT) = 0                                   RMB0013
ACIEA1          MOVE "         -1" TO 01END090(I-CARACT)(1:11)          RMB0013
ACIEA1       ELSE                                                       RMB0013
ACIEA1          IF OPFLAG090(I-CARACT) = 0                              RMB0013
ACIEA1             MOVE "         -2" TO 01END090(I-CARACT)(1:11)       RMB0013
ACIEA1          ELSE                                                    RMB0013
ACIEA1             IF V-SALDOFLAG090(I-CARACT) = ZEROS                  RMB0013
ACIEA1                MOVE "        -88" TO 01END090(I-CARACT)(1:11)    RMB0013
ACIEA1             ELSE                                                 RMB0013
ACIEA1                IF PROMSALDO090-CARACT(I-CARACT) > 0              RMB0013
ACIEA1                   COMPUTE UTILAUX-CARACT(I-CARACT) ROUNDED =     RMB0013
ACIEA1                    100 *  (DESVIACIONSALDO090-CARACT(I-CARACT)/  RMB0013
ACIEA1                            PROMSALDO090-CARACT(I-CARACT))        RMB0013
ACIEA1                   MOVE UTILAUX-CARACT(I-CARACT) TO               RMB0013
ACIEA1                        01ENDV90(I-CARACT)                        RMB0013
ACIEA1                   MOVE 01ENDV90(I-CARACT) TO 01END090(I-CARACT)  RMB0013
ACIEA1                ELSE                                              RMB0013
ACIEA1                   MOVE "        -88" TO 01END090(I-CARACT)(1:11) RMB0013
ACIEA1                END-IF                                            RMB0013
ACIEA1             END-IF                                               RMB0013
ACIEA1          END-IF                                                  RMB0013
ACIEA1       END-IF                                                     RMB0013
ACIEA1     END-PERFORM.                                                 RMB0013
ACIEA1*    CALCULAR COEFICIENTE DE VARION DE CUOTAS POR PORTAFOLIO      RMB0013
ACIEA1     PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL I-CARACT > 07     RMB0013
ACIEA1       IF V-CUOTAFLAG091(I-CARACT) <> ZEROS                       RMB0013
ACIEA1          PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL              RMB0013
ACIEA1                                            J-CARACT > 12         RMB0013
ACIEA1             IF CUOTAACUM091-CARACT(I-CARACT,J-CARACT)  >= 0 AND  RMB0013
ACIEA1                CUOTAFLAG091(I-CARACT,J-CARACT) > 0 *> no vacio   RMB0013
ACIEA1                COMPUTE SUMACUOTA091-CARACT(I-CARACT) =           RMB0013
ACIEA1                        SUMACUOTA091-CARACT(I-CARACT) +           RMB0013
ACIEA1                      CUOTAACUM091-CARACT(I-CARACT,J-CARACT)      RMB0013
ACIEA1                ADD  1 TO NUMMESES091-CARACT(I-CARACT)            RMB0013
ACIEA1             END-IF                                               RMB0013
ACIEA1          END-PERFORM                                             RMB0013
ACIEA1*         CALCULAR PROMEDIO DE UTILIZACION POR PORTAFOLIO         RMB0013
ACIEA1          IF NUMMESES091-CARACT(I-CARACT) > 0                     RMB0013
ACIEA1             COMPUTE PROMCUOTA091-CARACT(I-CARACT) =              RMB0013
ACIEA1             SUMACUOTA091-CARACT(I-CARACT) /                      RMB0013
ACIEA1                            NUMMESES091-CARACT(I-CARACT)          RMB0013
ACIEA1          END-IF                                                  RMB0013
ACIEA1          PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL              RMB0013
ACIEA1                                            J-CARACT > 12         RMB0013
ACIEA1*            CALCULAR VARIANZA DE LAS CUOTAS  POR PORTAFOLIO      RMB0013
ACIEA1             IF CUOTAFLAG091(I-CARACT,J-CARACT)  > 0 AND          RMB0013
ACIEA1                CUOTAACUM091-CARACT (I-CARACT,J-CARACT) >= 0      RMB0013
ACIEA1                COMPUTE VARIANZACUOTA091-CARACT(I-CARACT) =       RMB0013
ACIEA1                 VARIANZACUOTA091-CARACT(I-CARACT) +              RMB0013
ACIEA1                    (CUOTAACUM091-CARACT (I-CARACT,J-CARACT)  -   RMB0013
ACIEA1                     PROMCUOTA091-CARACT(I-CARACT))  ** 2         RMB0013
ACIEA1             END-IF                                               RMB0013
ACIEA1          END-PERFORM                                             RMB0013
ACIEA1          IF NUMMESES091-CARACT(I-CARACT) > 0                     RMB0013
ACIEA1*            CALCULAR DESVIACION DE LAS CUOTAS POR PORTAFOLIO     RMB0013
ACIEA1             COMPUTE DESVIACIONCUOTA091-CARACT(I-CARACT) =        RMB0013
ACIEA1                    (VARIANZACUOTA091-CARACT(I-CARACT) /          RMB0013
ACIEA1                     NUMMESES091-CARACT(I-CARACT)) ** 0.5         RMB0013
ACIEA1          END-IF                                                  RMB0013
ACIEA1       END-IF                                                     RMB0013
ACIEA1       IF FLAG091(I-CARACT) = 0                                   RMB0013
ACIEA1          MOVE "         -1" TO 01END091(I-CARACT)(1:11)          RMB0013
ACIEA1       ELSE                                                       RMB0013
ACIEA1          IF OPFLAG091(I-CARACT) = 0                              RMB0013
ACIEA1             MOVE "         -2" TO 01END091(I-CARACT)(1:11)       RMB0013
ACIEA1          ELSE                                                    RMB0013
ACIEA1             IF V-CUOTAFLAG091(I-CARACT) = ZEROS                  RMB0013
ACIEA1                MOVE "        -88" TO 01END091(I-CARACT)(1:11)    RMB0013
ACIEA1             ELSE                                                 RMB0013
ACIEA1                IF PROMCUOTA091-CARACT(I-CARACT) > 0              RMB0013
ACIEA1                   COMPUTE UTILAUX-CARACT(I-CARACT) ROUNDED =     RMB0013
ACIEA1                    100 *  (DESVIACIONCUOTA091-CARACT(I-CARACT)/  RMB0013
ACIEA1                            PROMCUOTA091-CARACT(I-CARACT))        RMB0013
ACIEA1                   MOVE UTILAUX-CARACT(I-CARACT) TO               RMB0013
ACIEA1                        01ENDV91(I-CARACT)                        RMB0013
ACIEA1                   MOVE 01ENDV91(I-CARACT) TO 01END091(I-CARACT)  RMB0013
ACIEA1                ELSE                                              RMB0013
ACIEA1                   MOVE "        -88" TO 01END091(I-CARACT)(1:11) RMB0013
ACIEA1                END-IF                                            RMB0013
ACIEA1             END-IF                                               RMB0013
ACIEA1          END-IF                                                  RMB0013
ACIEA1       END-IF                                                     RMB0013
ACIEA1     END-PERFORM.                                                 RMB0013
ACIEAA*    CALCULAR UTILIZACION DE CUPOS POR PORTAFOLIO                 RMB0012
ACIEAA     PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL I-CARACT > 07     RMB0012
ACIEAA       IF V-SALDOFLAG092(I-CARACT) <> ZEROS AND                   RMB0012
ACIEAA          V-CUPOFLAG092(I-CARACT)  <> ZEROS                       RMB0012
ACIEAA          PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL              RMB0012
ACIEAA                                            J-CARACT > 12         RMB0012
ACIEAA             IF CUPOFLAG092(I-CARACT,J-CARACT)  > 0 AND           RMB0012
ACIEAA                SALDOFLAG092(I-CARACT,J-CARACT) > 0 AND           RMB0012
ACIEAA                SUMASALDO092-CARACT(I-CARACT,J-CARACT) >= 0  AND  RMB0012
ACIEAA                SUMACUPO092-CARACT (I-CARACT,J-CARACT) >  0       RMB0012
ACIEAA                COMPUTE UTIL092-CARACT(I-CARACT) =                RMB0012
ACIEAA                     UTIL092-CARACT(I-CARACT) +                   RMB0012
ACIEAA                     (SUMASALDO092-CARACT(I-CARACT,J-CARACT) /    RMB0012
ACIEAA                      SUMACUPO092-CARACT (I-CARACT,J-CARACT))     RMB0012
ACIEAA                ADD  1 TO NUMMESES092-CARACT(I-CARACT)            RMB0012
ACIEAA             END-IF                                               RMB0012
ACIEAA          END-PERFORM                                             RMB0012
ACIEAA*         CALCULAR PROMEDIO DE UTILIZACION POR PORTAFOLIO         RMB0012
ACIEAA          IF NUMMESES092-CARACT(I-CARACT) > 0                     RMB0012
ACIEAA             COMPUTE PROMUTIL092-CARACT(I-CARACT) =               RMB0012
ACIEAA             UTIL092-CARACT(I-CARACT) /                           RMB0012
ACIEAA                            NUMMESES092-CARACT(I-CARACT)          RMB0012
ACIEAA          END-IF                                                  RMB0012
ACIEAA          PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL              RMB0012
ACIEAA                                            J-CARACT > 12         RMB0012
ACIEAA*            CALCULAR VARIANZA DE UTILIZACION POR PORTAFOLIO      RMB0012
ACIEAA             IF CUPOFLAG092(I-CARACT,J-CARACT)  > 0 AND           RMB0012
ACIEAA                SALDOFLAG092(I-CARACT,J-CARACT) > 0 AND           RMB0012
ACIEAA                SUMACUPO092-CARACT (I-CARACT,J-CARACT) > 0        RMB0012
ACIEAA                COMPUTE VARIANZASALCUP092-CARACT(I-CARACT) =      RMB0012
ACIEAA                 VARIANZASALCUP092-CARACT(I-CARACT) +             RMB0012
ACIEAA                 ((( SUMASALDO092-CARACT(I-CARACT,J-CARACT)  /    RMB0012
ACIEAA                     SUMACUPO092-CARACT (I-CARACT,J-CARACT)) -    RMB0012
ACIEAA                     PROMUTIL092-CARACT(I-CARACT))) ** 2          RMB0012
ACIEAA             END-IF                                               RMB0012
ACIEAA          END-PERFORM                                             RMB0012
ACIEAA          IF NUMMESES092-CARACT(I-CARACT) > 0                     RMB0012
ACIEAA*            CALCULAR DESVIACION DE UTILIZACION POR PORTAFOLIO    RMB0012
ACIEAA             COMPUTE DESVIACIONSALCUP092-CARACT(I-CARACT) =       RMB0012
ACIEAA                    (VARIANZASALCUP092-CARACT(I-CARACT) /         RMB0012
ACIEAA                     NUMMESES092-CARACT(I-CARACT)) ** 0.5         RMB0012
ACIEAA          END-IF                                                  RMB0012
ACIEAA       END-IF                                                     RMB0012
ACIEAA       IF FLAG092(I-CARACT) = 0                                   RMB0012
ACIEAA          MOVE "         -1" TO 01END092(I-CARACT)(1:11)          RMB0012
ACIEAA       ELSE                                                       RMB0012
ACIEAA          IF OPFLAG092(I-CARACT) = 0                              RMB0012
ACIEAA             MOVE "         -2" TO 01END092(I-CARACT)(1:11)       RMB0012
ACIEAA          ELSE                                                    RMB0012
ACIEAA             IF V-SALDOFLAG092(I-CARACT) = ZEROS OR               RMB0012
ACIEAA                V-CUPOFLAG092(I-CARACT)  = ZEROS                  RMB0012
ACIEAA                MOVE "        -88" TO 01END092(I-CARACT)(1:11)    RMB0012
ACIEAA             ELSE                                                 RMB0012
ACIEAA                IF PROMUTIL092-CARACT(I-CARACT) > 0               RMB0012
ACIEAA                   COMPUTE UTILAUX-CARACT(I-CARACT) ROUNDED =     RMB0012
ACIEAA                    100 *  (DESVIACIONSALCUP092-CARACT(I-CARACT)/ RMB0012
ACIEAA                            PROMUTIL092-CARACT(I-CARACT))         RMB0012
ACIEAA                   MOVE UTILAUX-CARACT(I-CARACT) TO               RMB0012
ACIEAA                        01ENDV92(I-CARACT)                        RMB0012
ACIEAA                   MOVE 01ENDV92(I-CARACT) TO 01END092(I-CARACT)  RMB0012
ACIEAA                ELSE                                              RMB0012
ACIEAA                   MOVE "        -88" TO 01END092(I-CARACT)(1:11) RMB0012
ACIEAA                END-IF                                            RMB0012
ACIEAA             END-IF                                               RMB0012
ACIEAA          END-IF                                                  RMB0012
ACIEAA       END-IF                                                     RMB0012
ACIEAA     END-PERFORM.                                                 RMB0012
ACIEA1*    CALCULAR PROMEDIO DE LA PROPORCION DE CUPO  POR PORTAFOLIO   RMB0013
ACIEA1     PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL I-CARACT > 07     RMB0013
ACIEA1       IF V-DIFFEFLAG093(I-CARACT) <> ZEROS                       RMB0013
ACIEA1          PERFORM VARYING J-CARACT FROM 1 BY 1 UNTIL              RMB0013
ACIEA1                                            J-CARACT > 12         RMB0013
ACIEA1             IF CUPOACUM093-CARACT(I-CARACT,J-CARACT)  > 0 AND    RMB0013
ACIEA1                DIFFEFLAG093(I-CARACT,J-CARACT) > 0 *> no vacio   RMB0013
ACIEA1                COMPUTE COCIENTETOT093-CARACT(I-CARACT) =         RMB0013
ACIEA1                        COCIENTETOT093-CARACT(I-CARACT) +         RMB0013
ACIEA1                     (DIFFEACUM093-CARACT(I-CARACT,J-CARACT) /    RMB0013
ACIEA1                      CUPOACUM093-CARACT(I-CARACT,J-CARACT))      RMB0013
ACIEA1                ADD  1 TO NUMMESES093-CARACT(I-CARACT)            RMB0013
ACIEA1             END-IF                                               RMB0013
ACIEA1          END-PERFORM                                             RMB0013
ACIEA1          IF NUMMESES093-CARACT(I-CARACT) > 0                     RMB0013
ACIEA1*            CALCULAR DESVIACION DE LAS SALDOS POR PORTAFOLIO     RMB0013
ACIEA1             COMPUTE PROMCOCIENTE093-CARACT(I-CARACT) =           RMB0013
ACIEA1                    100 * (COCIENTETOT093-CARACT(I-CARACT) /      RMB0013
ACIEA1                           NUMMESES093-CARACT(I-CARACT))          RMB0013
ACIEA1          END-IF                                                  RMB0013
ACIEA1       END-IF                                                     RMB0013
ACIEA1       IF FLAG093(I-CARACT) = 0                                   RMB0013
ACIEA1          MOVE "         -1" TO 01END093(I-CARACT)(1:11)          RMB0013
ACIEA1       ELSE                                                       RMB0013
ACIEA1          IF OPFLAG093(I-CARACT) = 0                              RMB0013
ACIEA1             MOVE "         -2" TO 01END093(I-CARACT)(1:11)       RMB0013
ACIEA1          ELSE                                                    RMB0013
ACIEA1             IF V-DIFFEFLAG093(I-CARACT) = ZEROS                  RMB0013
ACIEA1                MOVE "        -88" TO 01END093(I-CARACT)(1:11)    RMB0013
ACIEA1             ELSE                                                 RMB0013
ACIEA1                IF PROMCOCIENTE093-CARACT(I-CARACT) < 0           RMB0013
ACIEA1                   COMPUTE UTILAUX-CARACT(I-CARACT) = 0           RMB0013
ACIEA1                ELSE                                              RMB0013
ACIEA1                   COMPUTE UTILAUX-CARACT(I-CARACT) ROUNDED =     RMB0013
ACIEA1                         PROMCOCIENTE093-CARACT(I-CARACT)         RMB0013
ACIEA1                END-IF                                            RMB0013
ACIEA1                MOVE UTILAUX-CARACT(I-CARACT) TO                  RMB0013
ACIEA1                     01ENDV93(I-CARACT)                           RMB0013
ACIEA1                MOVE 01ENDV93(I-CARACT) TO 01END093(I-CARACT)     RMB0013
ACIEA1             END-IF                                               RMB0013
ACIEA1          END-IF                                                  RMB0013
ACIEA1       END-IF                                                     RMB0013
ACIEA1     END-PERFORM.                                                 RMB0013
ACIEAA*    INICIALIZACION TEMPORAL MIENTRAS SE CONSTRUYEN               RMB0012
ACIEA1*    PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL I-CARACT > 07     RMB0013
ACIEA1*       MOVE "         -1" TO 01END090(I-CARACT)(1:11)            RMB0013
ACIEA1*       MOVE "         -1" TO 01END091(I-CARACT)(1:11)            RMB0013
ACIEA1*       MOVE "         -1" TO 01END093(I-CARACT)(1:11)            RMB0013
ACIEA1*    END-PERFORM.                                                 RMB0013
       2780-CALCULA-CARACT-02END.
REMARK******************************************************************
REMARK*2780-CALCULA-CARACT-02END.
REMARK******************************************************************
           PERFORM VARYING I-CARACT FROM 1 BY 1 UNTIL I-CARACT > 9
            IF 01ENDPTF(I-CARACT) > ZEROS
               MOVE "CB" TO 02ENDPTFCB
            END-IF
            MOVE 01ENDPTF(I-CARACT) TO 02ENDPTF(I-CARACT)
      *** 02END001 *** PORCENTAJE DE AMORTIZACION A LA FECHA
            IF I-CARACT = 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END007(I-CARACT)) > ZEROS
               MOVE ZEROS TO 02ENDPAGO
               COMPUTE 02ENDPAGO = 
                        FUNCTION NUMVAL(01END007(I-CARACT)) - 
                        FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END001(I-CARACT) ROUNDED = ((02ENDPAGO /
                       FUNCTION NUMVAL(01END007(I-CARACT))) * 100)
               COMPUTE 02END001V = (02END001V + 02ENDPAGO)
               COMPUTE 02END001T = (02END001T + 
                       FUNCTION NUMVAL(01END007(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END001(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END001(I-CARACT)(1:11)
            END-IF
      *** 02END002 *** PORCENTAJE DE AMORTIZACION ULTIMOS 3 MESES
            IF I-CARACT = 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END031(I-CARACT)) > ZEROS
               MOVE ZEROS TO 02ENDPAGO
               COMPUTE 02ENDPAGO = 
                       FUNCTION NUMVAL(01END031(I-CARACT)) - 
                       FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END002(I-CARACT) ROUNDED = ((02ENDPAGO /
                       FUNCTION NUMVAL(01END031(I-CARACT))) * 100)
               COMPUTE 02END002V = (02END002V + 02ENDPAGO)
               COMPUTE 02END002T = (02END002T + 
                       FUNCTION NUMVAL(01END031(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END002(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END002(I-CARACT)(1:11)
            END-IF
      *** 02END003 *** PORCENTAJE DE AMORTIZACION ULTIMOS 6 MESES
            IF I-CARACT = 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END041(I-CARACT)) > ZEROS
               MOVE ZEROS TO 02ENDPAGO
               COMPUTE 02ENDPAGO = 
                       FUNCTION NUMVAL(01END041(I-CARACT)) - 
                       FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END003(I-CARACT) ROUNDED = ((02ENDPAGO /
                       FUNCTION NUMVAL(01END041(I-CARACT))) * 100)
               COMPUTE 02END003V = (02END003V + 02ENDPAGO)
               COMPUTE 02END003T = (02END003T + 
                       FUNCTION NUMVAL(01END041(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END003(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END003(I-CARACT)(1:11)
            END-IF
      *** 02END004 *** PORCENTAJE DE AMORTIZACION ULTIMOS 9 MESES
            IF I-CARACT = 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END051(I-CARACT)) > ZEROS
               MOVE ZEROS TO 02ENDPAGO
               COMPUTE 02ENDPAGO = 
                       FUNCTION NUMVAL(01END051(I-CARACT)) - 
                       FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END004(I-CARACT) ROUNDED = ((02ENDPAGO /
                       FUNCTION NUMVAL(01END051(I-CARACT))) * 100)
               COMPUTE 02END004V = (02END004V + 02ENDPAGO)
               COMPUTE 02END004T = (02END004T + 
                       FUNCTION NUMVAL(01END051(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END004(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END004(I-CARACT)(1:11)
            END-IF
      *** 02END005 *** PORCENTAJE DE AMORTIZACION ULTIMOS 12 MESES
            IF I-CARACT = 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END061(I-CARACT)) > ZEROS
               MOVE ZEROS TO 02ENDPAGO
               COMPUTE 02ENDPAGO = 
                       FUNCTION NUMVAL(01END061(I-CARACT)) - 
                       FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END005(I-CARACT) ROUNDED = ((02ENDPAGO /
                       FUNCTION NUMVAL(01END061(I-CARACT))) * 100)
               COMPUTE 02END005V = (02END005V + 02ENDPAGO)
               COMPUTE 02END005T = 02END005T + 
                       FUNCTION NUMVAL(01END061(I-CARACT))
             ELSE
               MOVE "         -1" TO 02END005(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END005(I-CARACT)(1:11)
            END-IF
      *** 02END006 *** RALACION CUOTA TOTAL Y SALDO TOTAL A LA FECHA
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
               COMPUTE 02END006(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END005(I-CARACT)) /
                         FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
               COMPUTE 02END006V = 02END006V + 
                        FUNCTION NUMVAL(01END005(I-CARACT))
               COMPUTE 02END006T = (02END006T + 
                       FUNCTION NUMVAL(01END001(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END006(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END006(I-CARACT)(1:11)
            END-IF
      *** 02END007 *** RALACION CUOTA TOTAL Y SALDO TOTAL 3 MESES
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END031(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END035(I-CARACT)) >= ZEROS
               COMPUTE 02END007(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END035(I-CARACT)) /
                         FUNCTION NUMVAL(01END031(I-CARACT))) * 100)
               COMPUTE 02END007V = 02END007V + 
                        FUNCTION NUMVAL(01END035(I-CARACT))
               COMPUTE 02END007T = (02END007T + 
                       FUNCTION NUMVAL(01END031(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END007(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END007(I-CARACT)(1:11)
            END-IF
      *** 02END008 *** RALACION CUOTA TOTAL Y SALDO TOTAL 6 MESES
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END041(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END045(I-CARACT)) >= ZEROS
               COMPUTE 02END008(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END045(I-CARACT)) /
                         FUNCTION NUMVAL(01END041(I-CARACT))) * 100)
               COMPUTE 02END008V = 02END008V + 
                        FUNCTION NUMVAL(01END045(I-CARACT))
               COMPUTE 02END008T = (02END008T + 
                       FUNCTION NUMVAL(01END041(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END008(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END008(I-CARACT)(1:11)
            END-IF
      *** 02END009 *** RALACION CUOTA TOTAL Y SALDO TOTAL 9 MESES
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END051(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END055(I-CARACT)) >= ZEROS
               COMPUTE 02END009(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END055(I-CARACT)) /
                         FUNCTION NUMVAL(01END051(I-CARACT))) * 100)
               COMPUTE 02END009V = 02END009V + 
                        FUNCTION NUMVAL(01END055(I-CARACT))
               COMPUTE 02END009T = (02END009T + 
                       FUNCTION NUMVAL(01END051(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END009(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END009(I-CARACT)(1:11)
            END-IF
      *** 02END010 *** RALACION CUOTA TOTAL Y SALDO TOTAL 12 MESES
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END061(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END065(I-CARACT)) >= ZEROS
               COMPUTE 02END010(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END065(I-CARACT)) /
                         FUNCTION NUMVAL(01END061(I-CARACT))) * 100)
               COMPUTE 02END010V = 02END010V + 
                        FUNCTION NUMVAL(01END065(I-CARACT))
               COMPUTE 02END010T = (02END010T + 
                       FUNCTION NUMVAL(01END061(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END010(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END010(I-CARACT)(1:11)
            END-IF
      *** 02END011 *** PORCENTAJE VARIACION CUOTA SALDO 3 MESES
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END031(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END035(I-CARACT)) >= ZEROS AND
                FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
                MOVE ZEROS TO 02ENDRATION 02ENDRATIO
                COMPUTE 02ENDRATION ROUNDED = 
                  ((FUNCTION NUMVAL(01END035(I-CARACT)) /
                    FUNCTION NUMVAL(01END031(I-CARACT))) * 100)
                COMPUTE 02ENDRATIO ROUNDED = 
                  ((FUNCTION NUMVAL(01END005(I-CARACT)) /
                    FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
                COMPUTE 02END011CN = 02END011CN +
                    FUNCTION NUMVAL(01END035(I-CARACT))
                COMPUTE 02END011SN = 02END011SN +
                    FUNCTION NUMVAL(01END031(I-CARACT))
                COMPUTE 02END011C = 02END011C +
                    FUNCTION NUMVAL(01END005(I-CARACT))
                COMPUTE 02END011S = 02END011S +
                    FUNCTION NUMVAL(01END001(I-CARACT))  
                IF 02ENDRATION > ZEROS
                   COMPUTE 02END011(I-CARACT) ROUNDED =
                      (((02ENDRATIO / 02ENDRATION) - 1) * 100)
                ELSE
                  MOVE "         -1" TO 02END011(I-CARACT)(1:11)
                END-IF
             ELSE
                MOVE "         -1" TO 02END011(I-CARACT)(1:11)
             END-IF
            ELSE
                MOVE "        -99" TO 02END011(I-CARACT)(1:11)
            END-IF
      *** 02END012 *** PORCENTAJE VARIACION CUOTA SALDO 6 MESES
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END041(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END045(I-CARACT)) >= ZEROS AND
                FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
                MOVE ZEROS TO 02ENDRATION 02ENDRATIO
                COMPUTE 02ENDRATION ROUNDED =
                  ((FUNCTION NUMVAL(01END045(I-CARACT)) /
                    FUNCTION NUMVAL(01END041(I-CARACT))) * 100)
                COMPUTE 02ENDRATIO ROUNDED =
                  ((FUNCTION NUMVAL(01END005(I-CARACT)) /
                    FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
                COMPUTE 02END012CN = 02END012CN +
                    FUNCTION NUMVAL(01END045(I-CARACT))
                COMPUTE 02END012SN = 02END012SN +
                    FUNCTION NUMVAL(01END041(I-CARACT))
                COMPUTE 02END012C = 02END012C +
                    FUNCTION NUMVAL(01END005(I-CARACT))
                COMPUTE 02END012S = 02END012S +
                    FUNCTION NUMVAL(01END001(I-CARACT))
                IF 02ENDRATION > ZEROS
                   COMPUTE 02END012(I-CARACT) ROUNDED =
                      (((02ENDRATIO / 02ENDRATION) - 1) * 100)
                ELSE
                  MOVE "         -1" TO 02END012(I-CARACT)(1:11)
                END-IF
             ELSE
                MOVE "         -1" TO 02END012(I-CARACT)(1:11)
             END-IF
            ELSE
                MOVE "        -99" TO 02END012(I-CARACT)(1:11)
            END-IF
      *** 02END013 *** PORCENTAJE VARIACION CUOTA SALDO 9 MESES
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END051(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END055(I-CARACT)) >= ZEROS AND
                FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
                MOVE ZEROS TO 02ENDRATION 02ENDRATIO
                COMPUTE 02ENDRATION ROUNDED =
                  ((FUNCTION NUMVAL(01END055(I-CARACT)) /
                    FUNCTION NUMVAL(01END051(I-CARACT))) * 100)
                COMPUTE 02ENDRATIO ROUNDED =
                  ((FUNCTION NUMVAL(01END005(I-CARACT)) /
                    FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
                COMPUTE 02END013CN = 02END013CN +
                    FUNCTION NUMVAL(01END055(I-CARACT))
                COMPUTE 02END013SN = 02END013SN +
                    FUNCTION NUMVAL(01END051(I-CARACT))
                COMPUTE 02END013C = 02END013C +
                    FUNCTION NUMVAL(01END005(I-CARACT))
                COMPUTE 02END013S = 02END013S +
                    FUNCTION NUMVAL(01END001(I-CARACT))
                IF 02ENDRATION > ZEROS
                   COMPUTE 02END013(I-CARACT) ROUNDED =
                      (((02ENDRATIO / 02ENDRATION) - 1) * 100)
                ELSE
                   MOVE "         -1" TO 02END013(I-CARACT)(1:11)
                END-IF
             ELSE
                MOVE "         -1" TO 02END013(I-CARACT)(1:11)
             END-IF
            ELSE
                MOVE "        -99" TO 02END013(I-CARACT)(1:11)
            END-IF
      *** 02END014 *** PORCENTAJE VARIACION CUOTA SALDO 12 MESES
            IF I-CARACT = 1 OR 2 OR 3 OR 4 OR 5 
             IF FUNCTION NUMVAL(01END061(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END065(I-CARACT)) >= ZEROS AND
                FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
                MOVE ZEROS TO 02ENDRATION 02ENDRATIO
                COMPUTE 02ENDRATION ROUNDED =
                  ((FUNCTION NUMVAL(01END065(I-CARACT)) /
                    FUNCTION NUMVAL(01END061(I-CARACT))) * 100)
                COMPUTE 02ENDRATIO ROUNDED =
                  ((FUNCTION NUMVAL(01END005(I-CARACT)) /
                    FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
                COMPUTE 02END014CN = 02END014CN +
                    FUNCTION NUMVAL(01END065(I-CARACT))
                COMPUTE 02END014SN = 02END014SN +
                    FUNCTION NUMVAL(01END061(I-CARACT))
                COMPUTE 02END014C = 02END014C +
                    FUNCTION NUMVAL(01END005(I-CARACT))
                COMPUTE 02END014S = 02END014S +
                    FUNCTION NUMVAL(01END001(I-CARACT))
                IF 02ENDRATION > ZEROS
                   COMPUTE 02END014(I-CARACT) ROUNDED =
                      (((02ENDRATIO / 02ENDRATION) - 1) * 100)
                ELSE
                   MOVE "         -1" TO 02END014(I-CARACT)(1:11)
                END-IF
             ELSE
                MOVE "         -1" TO 02END014(I-CARACT)(1:11)
             END-IF
            ELSE
                MOVE "        -99" TO 02END014(I-CARACT)(1:11)
            END-IF
      *** 02END015 *** PORCENTAJE DE CARTERA VENCIDA A LA FECHA
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
               COMPUTE 02END015(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END003(I-CARACT)) /
                         FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
               COMPUTE 02END015C = 02END015C + 
                        FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END015CV = (02END015CV + 
                        FUNCTION NUMVAL(01END003(I-CARACT)))
              ELSE
               MOVE "         -1" TO 02END015(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END015(I-CARACT)(1:11)
            END-IF
      *** 02END016 *** PORCENTAJE DE CARTERA VENCIDA HACE 3 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END031(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END033(I-CARACT)) >= ZEROS
               COMPUTE 02END016(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END033(I-CARACT)) /
                         FUNCTION NUMVAL(01END031(I-CARACT))) * 100)
               COMPUTE 02END016C = 02END016C + 
                        FUNCTION NUMVAL(01END031(I-CARACT))
               COMPUTE 02END016CV = (02END016CV + 
                        FUNCTION NUMVAL(01END033(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END016(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END016(I-CARACT)(1:11)
            END-IF
      *** 02END017 *** PORCENTAJE DE CARTERA VENCIDA HACE 6 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END041(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END043(I-CARACT)) >= ZEROS
               COMPUTE 02END017(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END043(I-CARACT)) /
                         FUNCTION NUMVAL(01END041(I-CARACT))) * 100)
               COMPUTE 02END017C = 02END017C + 
                        FUNCTION NUMVAL(01END041(I-CARACT))
               COMPUTE 02END017CV = (02END017CV + 
                        FUNCTION NUMVAL(01END043(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END017(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END017(I-CARACT)(1:11)
            END-IF
      *** 02END018 *** PORCENTAJE DE CARTERA VENCIDA HACE 9 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END051(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END053(I-CARACT)) >= ZEROS
               COMPUTE 02END018(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END053(I-CARACT)) /
                         FUNCTION NUMVAL(01END051(I-CARACT))) * 100)
               COMPUTE 02END018C = 02END018C + 
                        FUNCTION NUMVAL(01END051(I-CARACT))
               COMPUTE 02END018CV = (02END018CV + 
                        FUNCTION NUMVAL(01END053(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END018(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END018(I-CARACT)(1:11)
            END-IF
      *** 02END019 *** PORCENTAJE DE CARTERA VENCIDA HACE 12 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END061(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END063(I-CARACT)) >= ZEROS
               COMPUTE 02END019(I-CARACT) ROUNDED = 
                       ((FUNCTION NUMVAL(01END063(I-CARACT)) /
                         FUNCTION NUMVAL(01END061(I-CARACT))) * 100)
               COMPUTE 02END019C = 02END019C + 
                        FUNCTION NUMVAL(01END061(I-CARACT))
               COMPUTE 02END019CV = (02END019CV + 
                        FUNCTION NUMVAL(01END063(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END019(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END019(I-CARACT)(1:11)
            END-IF
      *** 02END020 *** PORCENTAJE VARIACION CARTERA VENCIDA 3 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END031(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END033(I-CARACT)) >= ZEROS AND
                FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
                MOVE ZEROS TO 02ENDRATION 02ENDRATIO
                COMPUTE 02ENDRATION ROUNDED =
                  ((FUNCTION NUMVAL(01END033(I-CARACT)) /
                   FUNCTION NUMVAL(01END031(I-CARACT))) * 100)
                COMPUTE 02ENDRATIO ROUNDED =
                  ((FUNCTION NUMVAL(01END003(I-CARACT)) /
                   FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
                COMPUTE 02END020CV = 02END020CV +
                   FUNCTION NUMVAL(01END033(I-CARACT))
                COMPUTE 02END020C = 02END020C +
                    FUNCTION NUMVAL(01END031(I-CARACT))
                COMPUTE 02END020V = 02END020V +
                    FUNCTION NUMVAL(01END003(I-CARACT))
                COMPUTE 02END020T = 02END020T +
                    FUNCTION NUMVAL(01END001(I-CARACT))
                IF 02ENDRATION > ZEROS
                   COMPUTE 02END020(I-CARACT) ROUNDED =
                      (((02ENDRATIO / 02ENDRATION) - 1) * 100)
                ELSE
                   MOVE "         -1" TO 02END020(I-CARACT)(1:11)
                END-IF
             ELSE
                MOVE "         -1" TO 02END020(I-CARACT)(1:11)
             END-IF
            ELSE
                MOVE "        -99" TO 02END020(I-CARACT)(1:11)
            END-IF
      *** 02END021 *** PORCENTAJE VARIACION CARTERA VENCIDA 6 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END041(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END043(I-CARACT)) >= ZEROS AND
                FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
                MOVE ZEROS TO 02ENDRATION 02ENDRATIO
                COMPUTE 02ENDRATION ROUNDED =
                 ((FUNCTION NUMVAL(01END043(I-CARACT)) /
                    FUNCTION NUMVAL(01END041(I-CARACT))) * 100)
                COMPUTE 02ENDRATIO ROUNDED =
                  ((FUNCTION NUMVAL(01END003(I-CARACT)) /
                    FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
                COMPUTE 02END021CV = 02END021CV +
                    FUNCTION NUMVAL(01END043(I-CARACT))
                COMPUTE 02END021C = 02END021C +
                    FUNCTION NUMVAL(01END041(I-CARACT))
                COMPUTE 02END021V = 02END021V +
                    FUNCTION NUMVAL(01END003(I-CARACT))
                COMPUTE 02END021T = 02END021T +
                    FUNCTION NUMVAL(01END001(I-CARACT))
                IF 02ENDRATION > ZEROS
                   COMPUTE 02END021(I-CARACT) ROUNDED =
                      (((02ENDRATIO / 02ENDRATION) - 1) * 100)
                ELSE
                   MOVE "         -1" TO 02END021(I-CARACT)(1:11)
                END-IF
             ELSE
                MOVE "         -1" TO 02END021(I-CARACT)(1:11)
             END-IF
            ELSE
                MOVE "        -99" TO 02END021(I-CARACT)(1:11)
            END-IF
      *** 02END022 *** PORCENTAJE VARIACION CARTERA VENCIDA 9 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END051(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END053(I-CARACT)) >= ZEROS AND
                FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
                MOVE ZEROS TO 02ENDRATION 02ENDRATIO
                COMPUTE 02ENDRATION ROUNDED =
                  ((FUNCTION NUMVAL(01END053(I-CARACT)) /
                    FUNCTION NUMVAL(01END051(I-CARACT))) * 100)
                COMPUTE 02ENDRATIO ROUNDED =
                  ((FUNCTION NUMVAL(01END003(I-CARACT)) /
                    FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
                COMPUTE 02END022CV = 02END022CV +
                    FUNCTION NUMVAL(01END053(I-CARACT))
                COMPUTE 02END022C = 02END022C +
                    FUNCTION NUMVAL(01END051(I-CARACT))
                COMPUTE 02END022V = 02END022V +
                    FUNCTION NUMVAL(01END003(I-CARACT))
                COMPUTE 02END022T = 02END022T +
                    FUNCTION NUMVAL(01END001(I-CARACT))
                IF 02ENDRATION > ZEROS 
                   COMPUTE 02END022(I-CARACT) ROUNDED =
                      (((02ENDRATIO / 02ENDRATION) - 1) * 100)
                ELSE
                   MOVE "         -1" TO 02END022(I-CARACT)(1:11)
                END-IF
             ELSE
                MOVE "         -1" TO 02END022(I-CARACT)(1:11)
             END-IF
            ELSE
                MOVE "        -99" TO 02END022(I-CARACT)(1:11)
            END-IF
      *** 02END023 *** PORCENTAJE VARIACION CARTERA VENCIDA 12 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END061(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END063(I-CARACT)) >= ZEROS AND
                FUNCTION NUMVAL(01END001(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
                MOVE ZEROS TO 02ENDRATION 02ENDRATIO
                COMPUTE 02ENDRATION ROUNDED =
                  ((FUNCTION NUMVAL(01END063(I-CARACT)) /
                    FUNCTION NUMVAL(01END061(I-CARACT))) * 100)
                COMPUTE 02ENDRATIO ROUNDED =
                  ((FUNCTION NUMVAL(01END003(I-CARACT)) /
                    FUNCTION NUMVAL(01END001(I-CARACT))) * 100)
                COMPUTE 02END023CV = 02END023CV +
                    FUNCTION NUMVAL(01END063(I-CARACT))
                COMPUTE 02END023C = 02END023C +
                    FUNCTION NUMVAL(01END061(I-CARACT))
                COMPUTE 02END023V = 02END023V +
                    FUNCTION NUMVAL(01END003(I-CARACT))
                COMPUTE 02END023T = 02END023T +
                    FUNCTION NUMVAL(01END001(I-CARACT))
                IF 02ENDRATION > ZEROS
                   COMPUTE 02END023(I-CARACT) ROUNDED =
                     (((02ENDRATIO / 02ENDRATION) - 1) * 100)
                ELSE
                   MOVE "         -1" TO 02END023(I-CARACT)(1:11)
                END-IF
             ELSE
                MOVE "         -1" TO 02END023(I-CARACT)(1:11)
             END-IF
            ELSE
                MOVE "        -99" TO 02END023(I-CARACT)(1:11)
            END-IF
      *** 02END024 *** PORCENTAJE VARIACION SALDO TOTAL ULTIMOS 3 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END031(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS
               COMPUTE 02END024(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END001(I-CARACT)) /
                       FUNCTION NUMVAL(01END031(I-CARACT)))- 1) * 100)
               COMPUTE 02END024S = 02END024S +
                        FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END024SN = (02END024SN +
                        FUNCTION NUMVAL(01END031(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END024(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END024(I-CARACT)(1:11)
            END-IF
      *** 02END025 *** PORCENTAJE VARIACION SALDO TOTAL ULTIMOS 6 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END041(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS
               COMPUTE 02END025(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END001(I-CARACT)) /
                       FUNCTION NUMVAL(01END041(I-CARACT))) - 1) * 100)
               COMPUTE 02END025S = 02END025S +
                        FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END025SN = (02END025SN +
                        FUNCTION NUMVAL(01END041(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END025(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END025(I-CARACT)(1:11)
            END-IF
      *** 02END026 *** PORCENTAJE VARIACION SALDO TOTAL ULTIMOS 9 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END051(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS
               COMPUTE 02END026(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END001(I-CARACT)) /
                       FUNCTION NUMVAL(01END051(I-CARACT))) - 1)* 100)
               COMPUTE 02END026S = 02END026S +
                        FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END026SN = (02END026SN +
                        FUNCTION NUMVAL(01END051(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END026(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END026(I-CARACT)(1:11)
            END-IF
      *** 02END027 *** PORCENTAJE VARIACION SALDO TOTAL ULTIMOS 12 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END061(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END001(I-CARACT)) >= ZEROS
               COMPUTE 02END027(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END001(I-CARACT)) /
                       FUNCTION NUMVAL(01END061(I-CARACT))) - 1) * 100)
               COMPUTE 02END027S = 02END027S +
                        FUNCTION NUMVAL(01END001(I-CARACT))
               COMPUTE 02END027SN = (02END027SN +
                        FUNCTION NUMVAL(01END061(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END027(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END027(I-CARACT)(1:11)
            END-IF
      *** 02END028 *** PORCENTAJE VARIACION SALDO MORA ULTIMOS 3 MESES
            IF I-CARACT NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END033(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
               COMPUTE 02END028(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END003(I-CARACT)) /
                       FUNCTION NUMVAL(01END033(I-CARACT))) - 1) * 100)
               COMPUTE 02END028S = 02END028S +
                        FUNCTION NUMVAL(01END003(I-CARACT))
               COMPUTE 02END028SM = (02END028SM +
                        FUNCTION NUMVAL(01END033(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END028(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END028(I-CARACT)(1:11)
            END-IF
      *** 02END029 *** PORCENTAJE VARIACION SALDO MORA ULTIMOS 6 MESES
            IF I-CARACT NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END043(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
               COMPUTE 02END029(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END003(I-CARACT)) /
                       FUNCTION NUMVAL(01END043(I-CARACT))) - 1) * 100)
               COMPUTE 02END029S = 02END029S +
                        FUNCTION NUMVAL(01END003(I-CARACT))
               COMPUTE 02END029SM = (02END029SM +
                        FUNCTION NUMVAL(01END043(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END029(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END029(I-CARACT)(1:11)
            END-IF
      *** 02END030 *** PORCENTAJE VARIACION SALDO MORA ULTIMOS 9 MESES
            IF I-CARACT NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END053(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
               COMPUTE 02END030(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END003(I-CARACT)) /
                       FUNCTION NUMVAL(01END053(I-CARACT))) - 1) * 100)
               COMPUTE 02END030S = 02END030S +
                        FUNCTION NUMVAL(01END003(I-CARACT))
               COMPUTE 02END030SM = (02END030SM +
                        FUNCTION NUMVAL(01END053(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END030(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END030(I-CARACT)(1:11)
            END-IF
      *** 02END031 *** PORCENTAJE VARIACION SALDO MORA ULTIMOS 12 MESES
            IF I-CARACT NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END063(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END003(I-CARACT)) >= ZEROS
               COMPUTE 02END031(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END003(I-CARACT)) /
                       FUNCTION NUMVAL(01END063(I-CARACT))) - 1) * 100)
               COMPUTE 02END031S = 02END031S +
                        FUNCTION NUMVAL(01END003(I-CARACT))
               COMPUTE 02END031SM = (02END031SM +
                        FUNCTION NUMVAL(01END063(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END031(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END031(I-CARACT)(1:11)
            END-IF
      *** 02END032 *** PORCENTAJE VARIACION CUOTA ULTIMOS 3 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END035(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
               COMPUTE 02END032(I-CARACT) ROUNDED =
                      (((FUNCTION NUMVAL(01END005(I-CARACT)) /
                      FUNCTION NUMVAL(01END035(I-CARACT))) - 1) * 100)
               COMPUTE 02END032C = 02END032C +
                        FUNCTION NUMVAL(01END005(I-CARACT))
               COMPUTE 02END032CN = (02END032CN +
                        FUNCTION NUMVAL(01END035(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END032(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END032(I-CARACT)(1:11)
            END-IF
      *** 02END033 *** PORCENTAJE VARIACION CUOTA ULTIMOS 6 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END045(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
               COMPUTE 02END033(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END005(I-CARACT)) /
                       FUNCTION NUMVAL(01END045(I-CARACT))) - 1) * 100)
               COMPUTE 02END033C = 02END033C +
                        FUNCTION NUMVAL(01END005(I-CARACT))
               COMPUTE 02END033CN = (02END033CN +
                        FUNCTION NUMVAL(01END045(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END033(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END033(I-CARACT)(1:11)
            END-IF
      *** 02END034 *** PORCENTAJE VARIACION CUOTA ULTIMOS 9 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END055(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
               COMPUTE 02END034(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END005(I-CARACT)) /
                       FUNCTION NUMVAL(01END055(I-CARACT))) - 1) * 100)
               COMPUTE 02END034C = 02END034C +
                        FUNCTION NUMVAL(01END005(I-CARACT))
               COMPUTE 02END034CN = (02END034CN +
                        FUNCTION NUMVAL(01END055(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END034(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END034(I-CARACT)(1:11)
            END-IF
      *** 02END035 *** PORCENTAJE VARIACION CUOTA ULTIMOS 12 MESES
            IF I-CARACT NOT = 6 AND NOT = 8 AND NOT = 9
             IF FUNCTION NUMVAL(01END065(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END005(I-CARACT)) >= ZEROS
               COMPUTE 02END035(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END005(I-CARACT)) /
                       FUNCTION NUMVAL(01END065(I-CARACT)))- 1) * 100)
               COMPUTE 02END035C = 02END035C +
                        FUNCTION NUMVAL(01END005(I-CARACT))
               COMPUTE 02END035CN = (02END035CN +
                        FUNCTION NUMVAL(01END065(I-CARACT)))
             ELSE
               MOVE "         -1" TO 02END035(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END035(I-CARACT)(1:11)
            END-IF
      *** 02END036 *** PORCENTAJE VARIACION CUPO ULTIMOS 3 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END037(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END007(I-CARACT)) >= ZEROS
               COMPUTE 02END036(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END007(I-CARACT)) /
                       FUNCTION NUMVAL(01END037(I-CARACT))) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END036(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END036(I-CARACT)(1:11)
            END-IF
      *** 02END037 *** PORCENTAJE VARIACION CUPO ULTIMOS 6 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END047(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END007(I-CARACT)) >= ZEROS
                COMPUTE 02END037(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END007(I-CARACT)) /
                      FUNCTION NUMVAL(01END047(I-CARACT))) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END037(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END037(I-CARACT)(1:11)
            END-IF
      *** 02END038 *** PORCENTAJE VARIACION CUPO ULTIMOS 9 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END057(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END007(I-CARACT)) >= ZEROS
               COMPUTE 02END038(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END007(I-CARACT)) /
                       FUNCTION NUMVAL(01END057(I-CARACT))) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END038(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END038(I-CARACT)(1:11)
            END-IF
      *** 02END039 *** PORCENTAJE VARIACION CUPO ULTIMOS 12 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END067(I-CARACT)) > ZEROS AND 
                FUNCTION NUMVAL(01END007(I-CARACT)) >= ZEROS
               COMPUTE 02END039(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END007(I-CARACT)) /
                       FUNCTION NUMVAL(01END067(I-CARACT))) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END039(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END039(I-CARACT)(1:11)
            END-IF
      *** 02END040 *** PORCENTAJE VARIACION UTILIZ ULTIMOS 3 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END076(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END077(I-CARACT)) > ZEROS
               COMPUTE 02END040(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END076(I-CARACT)) /
                       FUNCTION NUMVAL(01END077(I-CARACT))) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END040(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END040(I-CARACT)(1:11)
            END-IF
      *** 02END041 *** PORCENTAJE VARIACION UTILIZ ULTIMOS 6 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END076(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END078(I-CARACT)) > ZEROS
               COMPUTE 02END041(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END076(I-CARACT)) /
                       FUNCTION NUMVAL(01END078(I-CARACT))) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END041(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END041(I-CARACT)(1:11)
            END-IF
      *** 02END042 *** PORCENTAJE VARIACION UTILIZ ULTIMOS 9 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END076(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END079(I-CARACT)) > ZEROS
               COMPUTE 02END042(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END076(I-CARACT)) /
                       FUNCTION NUMVAL(01END079(I-CARACT))) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END042(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END042(I-CARACT)(1:11)
            END-IF
      *** 02END043 *** PORCENTAJE VARIACION UTILIZ ULTIMOS 12 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END076(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END080(I-CARACT)) > ZEROS
               COMPUTE 02END043(I-CARACT) ROUNDED =
                       (((FUNCTION NUMVAL(01END076(I-CARACT)) /
                       FUNCTION NUMVAL(01END080(I-CARACT))) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END043(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END043(I-CARACT)(1:11)
            END-IF
      *** 02END044 *** PORCENTAJE VARIACION UTILIZ PROMEDIO 3 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END071(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END072(I-CARACT)) > ZEROS
               COMPUTE 02END044(I-CARACT) ROUNDED =
                     ((FUNCTION NUMVAL(01END071(I-CARACT)) /
                     FUNCTION NUMVAL(01END072(I-CARACT)) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END044(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END044(I-CARACT)(1:11)
            END-IF
      *** 02END045 *** PORCENTAJE VARIACION UTILIZ PROMEDIO 6 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END071(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END073(I-CARACT)) > ZEROS
               COMPUTE 02END045(I-CARACT) ROUNDED =
                     ((FUNCTION NUMVAL(01END071(I-CARACT)) /
                     FUNCTION NUMVAL(01END073(I-CARACT)) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END045(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END045(I-CARACT)(1:11)
            END-IF
      *** 02END046 *** PORCENTAJE VARIACION UTILIZ PROMEDIO 9 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END071(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END074(I-CARACT)) > ZEROS
               COMPUTE 02END046(I-CARACT) ROUNDED =
                     ((FUNCTION NUMVAL(01END071(I-CARACT)) /
                     FUNCTION NUMVAL(01END074(I-CARACT)) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END046(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END046(I-CARACT)(1:11)
            END-IF
      *** 02END047 *** PORCENTAJE VARIACION UTILIZ PROMEDIO 12 MESES
            IF I-CARACT = 1 
             IF FUNCTION NUMVAL(01END071(I-CARACT)) >= ZEROS AND 
                FUNCTION NUMVAL(01END075(I-CARACT)) > ZEROS
               COMPUTE 02END047(I-CARACT) ROUNDED =
                     ((FUNCTION NUMVAL(01END071(I-CARACT)) /
                     FUNCTION NUMVAL(01END075(I-CARACT)) - 1) * 100)
             ELSE
               MOVE "         -1" TO 02END047(I-CARACT)(1:11)
             END-IF
            ELSE
               MOVE "        -99" TO 02END047(I-CARACT)(1:11)
            END-IF
           END-PERFORM
      *** REALIZA LOS CALCULOS AGRUPADOS POR IDENTIFICACION
           IF 02END001T > 0
            COMPUTE 02END001CB ROUNDED = ((02END001V / 02END001T) * 100)
           ELSE
            MOVE "         -1" TO 02END001CB(1:11)
           END-IF
           IF 02END002T > 0
            COMPUTE 02END002CB ROUNDED = ((02END002V / 02END002T) * 100)
           ELSE
            MOVE "         -1" TO 02END002CB(1:11)
           END-IF
           IF 02END003T > 0
            COMPUTE 02END003CB ROUNDED = ((02END003V / 02END003T) * 100)
           ELSE
            MOVE "         -1" TO 02END003CB(1:11)
           END-IF
           IF 02END004T > 0
            COMPUTE 02END004CB ROUNDED = ((02END004V / 02END004T) * 100)
           ELSE
            MOVE "         -1" TO 02END004CB(1:11)
           END-IF
           IF 02END005T > 0
            COMPUTE 02END005CB ROUNDED = ((02END005V / 02END005T) * 100)
           ELSE
            MOVE "         -1" TO 02END005CB(1:11)
           END-IF
           IF 02END006T > 0
            COMPUTE 02END006CB ROUNDED = ((02END006V / 02END006T) * 100)
           ELSE
            MOVE "         -1" TO 02END006CB(1:11)
           END-IF
           IF 02END007T > 0
            COMPUTE 02END007CB ROUNDED = ((02END007V / 02END007T) * 100)
           ELSE
            MOVE "         -1" TO 02END007CB(1:11)
           END-IF
           IF 02END008T > 0
            COMPUTE 02END008CB ROUNDED = ((02END008V / 02END008T) * 100)
           ELSE
            MOVE "         -1" TO 02END008CB(1:11)
           END-IF
           IF 02END009T > 0
            COMPUTE 02END009CB ROUNDED = ((02END009V / 02END009T) * 100)
           ELSE
            MOVE "         -1" TO 02END009CB(1:11)
           END-IF
           IF 02END010T > 0
            COMPUTE 02END010CB ROUNDED = ((02END010V / 02END010T) * 100)
           ELSE
            MOVE "         -1" TO 02END010CB(1:11)
           END-IF
           IF 02END011S > 0
            MOVE ZEROS TO 02ENDRATION 02ENDRATIO
            COMPUTE 02ENDRATION ROUNDED = 
                                ((02END011CN / 02END011SN) * 100)
            COMPUTE 02ENDRATIO ROUNDED = ((02END011C / 02END011S) * 100)
            IF 02ENDRATION > ZEROS
               COMPUTE 02END011CB ROUNDED =
                              (((02ENDRATIO / 02ENDRATION) - 1) * 100)
            ELSE
              MOVE "         -1" TO 02END011CB(1:11)
            END-IF
           ELSE
              MOVE "         -1" TO 02END011CB(1:11)
           END-IF
           IF 02END012S > 0
            MOVE ZEROS TO 02ENDRATION 02ENDRATIO
            COMPUTE 02ENDRATION ROUNDED = 
                                ((02END012CN / 02END012SN) * 100)
            COMPUTE 02ENDRATIO ROUNDED = ((02END012C / 02END012S) * 100)
            IF 02ENDRATION > ZEROS
               COMPUTE 02END012CB ROUNDED =
                              (((02ENDRATIO / 02ENDRATION) - 1) * 100)
            ELSE
              MOVE "         -1" TO 02END012CB(1:11)
            END-IF
           ELSE
              MOVE "         -1" TO 02END012CB(1:11)
           END-IF
           IF 02END013S > 0
            MOVE ZEROS TO 02ENDRATION 02ENDRATIO
            COMPUTE 02ENDRATION ROUNDED = 
                                ((02END013CN / 02END013SN) * 100)
            COMPUTE 02ENDRATIO ROUNDED = ((02END013C / 02END013S) * 100)
            IF 02ENDRATION > ZEROS
               COMPUTE 02END013CB ROUNDED =
                              (((02ENDRATIO / 02ENDRATION) - 1) * 100)
            ELSE
              MOVE "         -1" TO 02END013CB(1:11)
            END-IF
           ELSE
              MOVE "         -1" TO 02END013CB(1:11)
           END-IF
           IF 02END014S > 0
            MOVE ZEROS TO 02ENDRATION 02ENDRATIO
            COMPUTE 02ENDRATION ROUNDED = 
                                ((02END014CN / 02END014SN) * 100)
            COMPUTE 02ENDRATIO ROUNDED = ((02END014C / 02END014S) * 100)
            IF 02ENDRATION > ZEROS
               COMPUTE 02END014CB ROUNDED =
                              (((02ENDRATIO / 02ENDRATION) - 1) * 100)
            ELSE
              MOVE "         -1" TO 02END014CB(1:11)
            END-IF
           ELSE
              MOVE "         -1" TO 02END014CB(1:11)
           END-IF
           IF 02END015C > 0
            COMPUTE 02END015CB ROUNDED = 
                               ((02END015CV / 02END015C) * 100)
           ELSE
            MOVE "         -1" TO 02END015CB(1:11)
           END-IF
           IF 02END016C > 0
            COMPUTE 02END016CB ROUNDED = 
                               ((02END016CV / 02END016C) * 100)
           ELSE
            MOVE "         -1" TO 02END016CB(1:11)
           END-IF
           IF 02END017C > 0
            COMPUTE 02END017CB ROUNDED = 
                               ((02END017CV / 02END017C) * 100)
           ELSE
            MOVE "         -1" TO 02END017CB(1:11)
           END-IF
           IF 02END018C > 0
            COMPUTE 02END018CB ROUNDED =
                               ((02END018CV / 02END018C) * 100)
           ELSE
            MOVE "         -1" TO 02END018CB(1:11)
           END-IF
           IF 02END019C > 0
            COMPUTE 02END019CB ROUNDED = 
                               ((02END019CV / 02END019C) * 100)
           ELSE
            MOVE "         -1" TO 02END019CB(1:11)
           END-IF
           IF 02END020T > 0
            MOVE ZEROS TO 02ENDRATION 02ENDRATIO
            COMPUTE 02ENDRATION ROUNDED = 
                                ((02END020CV / 02END020C) * 100)
            COMPUTE 02ENDRATIO ROUNDED = ((02END020V / 02END020T) * 100)
            IF 02ENDRATION > ZEROS
               COMPUTE 02END020CB ROUNDED =
                              (((02ENDRATIO / 02ENDRATION) - 1) * 100)
            ELSE
              MOVE "         -1" TO 02END020CB(1:11)
            END-IF
           ELSE
              MOVE "         -1" TO 02END020CB(1:11)
           END-IF
           IF 02END021T > 0
            MOVE ZEROS TO 02ENDRATION 02ENDRATIO
            COMPUTE 02ENDRATION ROUNDED = 
                                ((02END021CV / 02END021C) * 100)
            COMPUTE 02ENDRATIO ROUNDED = ((02END021V / 02END021T) * 100)
            IF 02ENDRATION > ZEROS
               COMPUTE 02END021CB ROUNDED =
                              (((02ENDRATIO / 02ENDRATION) - 1) * 100)
            ELSE
              MOVE "         -1" TO 02END021CB(1:11)
            END-IF
           ELSE
              MOVE "         -1" TO 02END021CB(1:11)
           END-IF
           IF 02END022T > 0
            MOVE ZEROS TO 02ENDRATION 02ENDRATIO
            COMPUTE 02ENDRATION ROUNDED = 
                                ((02END022CV / 02END022C) * 100)
            COMPUTE 02ENDRATIO ROUNDED = ((02END022V / 02END022T) * 100)
            IF 02ENDRATION > ZEROS
               COMPUTE 02END022CB ROUNDED =
                              (((02ENDRATIO / 02ENDRATION) - 1) * 100)
            ELSE
              MOVE "         -1" TO 02END022CB(1:11)
            END-IF
           ELSE
              MOVE "         -1" TO 02END022CB(1:11)
           END-IF
           IF 02END023T > 0
            MOVE ZEROS TO 02ENDRATION 02ENDRATIO
            COMPUTE 02ENDRATION ROUNDED = 
                                ((02END023CV / 02END023C) * 100)
            COMPUTE 02ENDRATIO ROUNDED = ((02END023V / 02END023T) * 100)
            IF 02ENDRATION > ZEROS
               COMPUTE 02END023CB ROUNDED =
                              (((02ENDRATIO / 02ENDRATION) - 1) * 100)
            ELSE
              MOVE "         -1" TO 02END023CB(1:11)
            END-IF
           ELSE
              MOVE "         -1" TO 02END023CB(1:11)
           END-IF
           IF 02END024SN > 0
              COMPUTE 02END024CB ROUNDED = 
                              (((02END024S / 02END024SN) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END024CB(1:11)
           END-IF
           IF 02END025SN > 0
              COMPUTE 02END025CB ROUNDED = 
                              (((02END025S / 02END025SN) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END025CB(1:11)
           END-IF
           IF 02END026SN > 0
              COMPUTE 02END026CB ROUNDED = 
                              (((02END026S / 02END026SN) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END026CB(1:11)
           END-IF
           IF 02END027SN > 0
              COMPUTE 02END027CB ROUNDED = 
                              (((02END027S / 02END027SN) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END027CB(1:11)
           END-IF
           IF 02END028SM > 0
              COMPUTE 02END028CB ROUNDED = 
                              (((02END028S / 02END028SM) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END028CB(1:11)
           END-IF
           IF 02END029SM > 0
              COMPUTE 02END029CB ROUNDED = 
                              (((02END029S / 02END029SM) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END029CB(1:11)
           END-IF
           IF 02END030SM > 0
              COMPUTE 02END030CB ROUNDED = 
                              (((02END030S / 02END030SM) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END030CB(1:11)
           END-IF
           IF 02END031SM > 0
              COMPUTE 02END031CB ROUNDED = 
                              (((02END031S / 02END031SM) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END031CB(1:11)
           END-IF
           IF 02END032CN > 0
              COMPUTE 02END032CB ROUNDED = 
                              (((02END032C / 02END032CN) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END032CB(1:11)
           END-IF
           IF 02END033CN > 0
              COMPUTE 02END033CB ROUNDED = 
                              (((02END033C / 02END033CN) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END033CB(1:11)
           END-IF
           IF 02END034CN > 0
              COMPUTE 02END034CB ROUNDED = 
                              (((02END034C / 02END034CN) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END034CB(1:11)
           END-IF
           IF 02END035CN > 0
              COMPUTE 02END035CB ROUNDED = 
                              (((02END035C / 02END035CN) - 1) * 100)
           ELSE
             MOVE "         -1" TO 02END035CB(1:11)
           END-IF.

       3000-PROCESA-REG-ICMCHK.
REMARK******************************************************************
REMARK*3000-PROCESA-REG-ICMCHK.
REMARK******************************************************************
           MOVE 0 TO SW-LECTURA-CARACT SW-LEESUSC-CARACT
           INITIALIZE LLAVE-MAES-CHECK
           MOVE TIPO-ID-CARACT TO TIPO-ID-ABD06
           MOVE NRO-ID-CARACT  TO NUM-ID-ABD06
           PERFORM 0600-ASIGNA-ID-ICMCHK-START *> ojo esta faltaba
           START MAESTRO-CHECK KEY NOT < LLAVE-MAES-CHECK
                 INVALID KEY
                         MOVE 1 TO SW-LECTURA-CARACT
                 NOT INVALID KEY
LEY001               PERFORM  3000-LEE-ICMCHK-SECUENCIAL
LEY001               IF SW-LECTURA-MAESTROS  =  1
LEY001                  MOVE 1 TO SW-LECTURA-CARACT
LEY001               END-IF
           END-START
           PERFORM UNTIL TIPO-ID-ABD06 <> TIPO-ID-CARACT OR
                         NUM-ID-ABD06  <> NRO-ID-CARACT  OR
                         SW-LECTURA-CARACT = 1
RUNDAT      MOVE RUN-DATE-AUX-CARACT   TO RUN-DATE-CARACT               RMB0003
            INITIALIZE VAR-00NUM VAR-00ACP VAR-00EXP
            MOVE COD-SUS-ABD06 TO COD-SUSCRIP-ABD02
            READ SUSCRIPTOR WITH IGNORE LOCK
                 INVALID KEY MOVE 1 TO SW-LEESUSC-CARACT
                 NOT INVALID KEY MOVE 0 TO SW-LEESUSC-CARACT
            END-READ
DECI01      IF  IND-BLOQUEO-ABD06 = 7 AND SIN-FRENADAS-CARACT = 1       RMB0013 
DECI01          MOVE 1 TO IND-BLOQUEO-ABD06                             RMB0013 
DECI01      END-IF                                                      RMB0013 
            IF SW-LEESUSC-CARACT = 0 AND ESTADO-ABD02 = 1 AND
               (IND-BLOQUEO-ABD06 = 0 OR 7)
               IF (ART15-ABD06 <> 5 AND <> 6) AND
                  (IND-RECLAMO-ABD06 <> 1 AND <> 2 AND <> 3)
                  PERFORM 3100-CALCULA-PORTAFOLIO-CTE
                  PERFORM 3210-CAL-ABIERTO-CERRADO-CTE
                  PERFORM 3211-CAL-FECHA-ESTADO-CTE
                  IF GEN-NUM-CARACT = 1
                     PERFORM 3200-CALCULA-CARACT-00NUM-CTE
                     PERFORM 2250-CALCULA-CARACT-01NUM
                     PERFORM 2249-PROCESE-CARCT-00NUM
                  END-IF
      *** PARA CTA CTE APLICA LA MISMA RUTINA PARA 00ACP y 01ACP
                  IF GEN-ACP-CARACT = 1
                     MOVE LLAVE-MAES-CHECK TO 00ACPLLV
                     PERFORM 2400-CALCULA-CARACT-00ACP
                     PERFORM 2450-CALCULA-CARACT-01ACP
                     PERFORM 2480-CALCULA-CARACT-02ACP
                     PERFORM 2449-PROCESE-CARCT-00ACP
                  END-IF
                  IF GEN-EXP-CARACT = 1
                     MOVE LLAVE-MAES-CHECK TO 00EXPLLV
                     PERFORM 2500-CALCULA-CARACT-00EXP
                     PERFORM 2550-CALCULA-CARACT-01EXP
                     PERFORM 2549-PROCESE-CARCT-00EXP
                  END-IF
                  IF GEN-DEM-CARACT = 1
FALL01               MOVE 0             TO GARANTE-CARACT               RMB0014
                     MOVE ADJETIVO-ABD06 TO ADJETIVO-CARACT
                     PERFORM 2600-CALCULA-CARACT-00DEM
                  END-IF
      *           DISPLAY VAR-00MUN
               END-IF
            END-IF
LEY001      PERFORM  3000-LEE-ICMCHK-SECUENCIAL
LEY001        IF SW-LECTURA-MAESTROS  =  1
LEY001           MOVE 1 TO SW-LECTURA-CARACT
LEY001        END-IF
           END-PERFORM.
RUNDAT     MOVE RUN-DATE-AUX-CARACT   TO RUN-DATE-CARACT.               RMB0003

       3100-CALCULA-PORTAFOLIO-CTE.
REMARK******************************************************************
REMARK*3100-CALCULA-PORTAFOLIO-CTE.
REMARK******************************************************************
           IF COD-CTA-ABD06 = 01 AND COD-SUS-ABD06(1:2) = 51
               MOVE "AH" TO COD-PORTAF-CARACT
               MOVE  8   TO IND-PORTAF-CARACT
           ELSE
             IF COD-CTA-ABD06 = 01 AND COD-SUS-ABD06(1:2) <> 51
                MOVE "CT" TO COD-PORTAF-CARACT
                MOVE  9   TO IND-PORTAF-CARACT
             ELSE
                DISPLAY "REG SIN PORTAFOLIO CTE " LLAVE-MAES-CHECK
             END-IF
           END-IF.
           IF IND-PORTAF-CARACT = 8 OR 9
              MOVE 1 TO 00NUM001
              MOVE COD-PORTAF-CARACT TO 00NUMPTF
           END-IF.

       3200-CALCULA-CARACT-00NUM-CTE.
REMARK******************************************************************
REMARK*3200-CALCULA-CARACT-00NUM-CTE.
REMARK******************************************************************
           PERFORM 2210-INICIALIZA-00NUM
           MOVE LLAVE-MAES-CHECK TO 00NUMLLV
      *** 00NUM002 *** PRODUCTO ABIERTO
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM002
              IF REG-ABIERTO-CARACT = 1
                 MOVE 1 TO 00NUM002
              END-IF
           END-IF.
      *** 00NUM003 *** PRODUCTO ABIERTO ACTUALIZADO A LA FECHA
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM003
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS AND
                    RUN-DATE-CARACT > ZEROS
                    IF FECHA-ESTADO-CARACT - RUN-DATE-CARACT >= 0
                       MOVE 1 TO 00NUM003
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM003(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM003(1:3)
              END-IF
           END-IF.
      *** 00NUM004 *** PRODUCTO ABIERTO DESACTUALIZADO A LA FECHA
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM004
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS AND
                    RUN-DATE-CARACT > ZEROS
                    IF FECHA-ESTADO-CARACT - RUN-DATE-CARACT < 0
                       MOVE 1 TO 00NUM004
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM004(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM004(1:3)
              END-IF
           END-IF.
      *** 00NUM005 *** PRODUCTO CERRADO
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM005
              IF REG-CERRADO-CARACT = 1
                 MOVE 1 TO 00NUM005
              END-IF
           END-IF.
      *** 00NUM007 *** PRODUCTO CON RECLAMO
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM007
              IF IND-RECLAMO-ABD06 = 1 OR 2 OR 3
                 MOVE 1 TO 00NUM007
              END-IF
           END-IF.
      *** 00NUM010 *** PRODUCTO BLOQUEADO
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM010
              IF IND-BLOQUEO-ABD06 = 3 OR 4 OR 5 OR 8 OR 9
                 MOVE 1 TO 00NUM010
              END-IF
           END-IF.
      *** 00NUM022 *** PRODUCTO EMBARGADO
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM022
EMB01*        IF NOV-REPORT-ABD06 = 06 OR 07                            RMB0005 
EMB01         IF NOV-REPORT-ABD06 = 06                                  RMB0005 
                 MOVE 1 TO 00NUM022
              END-IF
           END-IF.
      *** 00NUM028 *** PRODUCTO DESACTUALIZADO HASTA EN 6 MESES
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROs TO 00NUM028
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS
                    IF MESES-DESAC-CARACT >= 0 AND <= 6
                       MOVE 1 TO 00NUM028
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM028(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM028(1:3)
              END-IF
           END-IF.
      *** 00NUM029 *** PRODUCTO DESACTUALIZADO ENTRE 7 y 12 MESES
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM029
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS
                    IF MESES-DESAC-CARACT >= 7 AND <= 12
                       MOVE 1 TO 00NUM029
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM029(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM029(1:3)
              END-IF
           END-IF.
      *** 00NUM030 *** PRODUCTO DESACTUALIZADO EN 13 MESES O MAS
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM030
              IF REG-ABIERTO-CARACT = 1
                 IF FECHA-ESTADO-CARACT > ZEROS
                    IF MESES-DESAC-CARACT >= 13
                       MOVE 1 TO 00NUM030
                    END-IF
                 ELSE
                     MOVE " -3" TO 00NUM030(1:3)
                 END-IF
              ELSE
                 MOVE " -2" TO 00NUM030(1:3)
              END-IF
           END-IF.
      *** 00NUM049 *** PRODUCTO CON ESTADO NEGATIVO
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM049
              IF NOV-REPORT-ABD06 = 02 OR 06 OR 07 OR
                 ADJETIVO-ABD06 = 2 OR 3 
                 MOVE 1 TO 00NUM049
              END-IF
           END-IF.
      *** 00NUM050 *** PRODUCTO CON ESTADO POSITIVO
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM050
              IF NOV-REPORT-ABD06 = 01 OR 05 
                 MOVE 1 TO 00NUM050
              END-IF
           END-IF.
      *** 00NUM066 *** PRODUCTO IDENTIFICADO COMO FALLECIDO
           IF COD-PORTAF-CARACT = "AH" OR "CT"
              MOVE ZEROS TO 00NUM066
              IF ADJETIVO-ABD06 = 1
                 MOVE 1 TO 00NUM066
              END-IF
           END-IF.

       3210-CAL-ABIERTO-CERRADO-CTE.
REMARK******************************************************************
REMARK*3210-CAL-ABIERTO-CERRADO-CTE.
REMARK******************************************************************
           MOVE 0 TO REG-ABIERTO-CARACT REG-CERRADO-CARACT
                     REG-POSITIVO-CARACT REG-NEGATIVO-CARACT
           IF NOV-REPORT-ABD06 = 01 OR 06 OR 07 OR 09
              MOVE 1 TO REG-ABIERTO-CARACT
           ELSE
              IF NOV-REPORT-ABD06 = 02 OR 05
                 MOVE 1 TO REG-CERRADO-CARACT
           END-IF
           IF NOV-REPORT-ABD06 = 01 OR 05
              MOVE 1 TO REG-POSITIVO-CARACT
           END-IF
           IF NOV-REPORT-ABD06 = 02 OR 06 OR 07 OR
              ADJETIVO-ABD06 = 2 OR 3
              MOVE 1 TO REG-NEGATIVO-CARACT
           END-IF.

       3211-CAL-FECHA-ESTADO-CTE.
REMARK******************************************************************
REMARK*3211-CAL-FECHA-ESTADO-CTE.
REMARK******************************************************************
           MOVE FEC-NOVEDAD-ABD06  TO FECHA-NOV-CARACT
           MOVE FECHA-NOV-CARACT(1:2) TO MES-NOV-CARACT
           MOVE FECHA-NOV-CARACT(3:2) TO ANO-NOV-CARACT
           IF ANO-NOV-CARACT < 60
              MOVE 20          TO SIG-NOV-CARACT
           ELSE
              MOVE 19          TO SIG-NOV-CARACT
           END-IF
RUNDAT     IF REG-ABIERTO-CARACT = 1                                    RMB0003
RUNDAT        MOVE ZEROS TO MESES-DESAC-CARACT                          RMB0003
RUNDAT        IF RUN-DATE-CARACT > ZEROS AND FECHA-ESTADO-CARACT > ZEROSRMB0003
RUNDAT           COMPUTE MESES-DESAC-CARACT =                           RMB0003
RUNDAT             ((ANO-RUN-DATE-CARACT * 12)+ MES-RUN-DATE-CARACT) -  RMB0003
RUNDAT             ((SIG-ANO-NOV-CARACT * 12) + MES-NOV-CARACT)         RMB0003
RUNDAT           IF MESES-DESAC-CARACT < 0                              RMB0003
RUNDAT              MOVE FECHA-ESTADO-CARACT TO RUN-DATE-CARACT         RMB0003
RUNDAT           END-IF                                                 RMB0003
RUNDAT        END-IF                                                    RMB0003
RUNDAT     END-IF.                                                      RMB0003
           MOVE ZEROS TO MESES-DESAC-CARACT MESES-MADUR-CARACT
           IF RUN-DATE-CARACT > ZEROS AND FECHA-ESTADO-CARACT > ZEROS
             COMPUTE MESES-DESAC-CARACT =
                  ((ANO-RUN-DATE-CARACT * 12)+ MES-RUN-DATE-CARACT) -
                  ((SIG-ANO-NOV-CARACT * 12) + MES-NOV-CARACT)
           END-IF 
           MOVE FECHA-APERT-ABD06 TO FECHA-APE-CARACT
           MOVE FECHA-APE-CARACT(1:2) TO MES-APE-CARACT
           MOVE FECHA-APE-CARACT(3:2) TO ANO-APE-CARACT
           IF ANO-APE-CARACT < 60
              MOVE 20          TO SIG-APE-CARACT
           ELSE
              MOVE 19          TO SIG-APE-CARACT
           END-IF
           IF SIG-ANO-APE-CARACT = ZEROS OR
              MES-APE-CARACT < 1 OR MES-APE-CARACT > 12
              MOVE ZEROS TO FECHA-APERT-CARACT
           END-IF
           IF RUN-DATE-CARACT > ZEROS AND FECHA-APERT-CARACT > ZEROS
              COMPUTE MESES-MADUR-CARACT =
                   ((ANO-RUN-DATE-CARACT * 12)+ MES-RUN-DATE-CARACT) -
                   ((SIG-ANO-APE-CARACT * 12) + MES-APE-CARACT)
           END-IF.

       4000-PROCESA-REG-CONSULTAS.
REMARK******************************************************************
REMARK*4000-PROCESA-REG-CONSULTAS.
REMARK******************************************************************
           MOVE 0 TO SW-LECTURA-CARACT SW-LEESUSC-CARACT
           MOVE " -1" TO 00INQ001(1:3) 00INQ002(1:3) 00INQ005(1:3)
                         00INQ006(1:3) 00INQ007(1:3) 00INQ010(1:3)
                         00INQ011(1:3) 00INQ012(1:3) 00INQ015(1:3)
ACIEAA                   00INQ016(1:3) 00INQ017(1:3) 00INQ018(1:3)      RMB0012
ACIEAA                   00INQ025(1:3) 00INQ026(1:3) 00INQ027(1:3)      RMB0012
ACIEAA                   00INQ028(1:3)                                  RMB0012
           INITIALIZE LLAVE-INDEX
           MOVE TIPO-ID-CARACT TO TIP-ID-IND
           MOVE NRO-ID-CARACT  TO NUM-ID-IND
           START INDEXADO KEY NOT < LLAVE-INDEX
              INVALID KEY
                 MOVE 1 TO SW-LECTURA-CARACT
              NOT INVALID KEY
IGN001           READ INDEXADO NEXT RECORD WITH IGNORE LOCK             GJC0009
                    AT END  MOVE 1 TO SW-LECTURA-CARACT
                 END-READ
           END-START
           PERFORM UNTIL TIP-ID-IND NOT = TIPO-ID-CARACT OR
                         NUM-ID-IND NOT = NRO-ID-CARACT  OR
                         SW-LECTURA-CARACT = 1
              INITIALIZE VAR-00INQ
              MOVE  COD-SUSCRIP-IND    TO COD-SUSCRIP-ABD02
              READ SUSCRIPTOR WITH IGNORE LOCK
                   INVALID KEY
                      MOVE 1 TO SW-LEESUSC-CARACT
                   NOT INVALID KEY
                      MOVE 0 TO SW-LEESUSC-CARACT
              END-READ
ACIEA1*       IF SW-LEESUSC-CARACT = 0 AND ESTADO-ABD02 = 1             RMB0013
ACIEA1        IF SW-LEESUSC-CARACT = 0                                  RMB0013
ACIEA1           IF 01INQ016(1:4) = "  -1"                              RMB0013
ACIEA1              MOVE "0000"         TO 01INQ016(1:4)                RMB0013
ACIEA1              MOVE "0000"         TO 01INQ017(1:4)                RMB0013
ACIEA1              MOVE "0999"         TO 01INQ018(1:4)                RMB0013
ACIEA1              MOVE "0000"         TO 01INQ025(1:4)                RMB0013
ACIEA1              MOVE "0000"         TO 01INQ026(1:4)                RMB0013
ACIEA1              MOVE "0000"         TO 01INQ027(1:4)                RMB0013
ACIEA1              MOVE "0000"         TO 01INQ028(1:4)                RMB0013
ACIEA1           END-IF                                                 RMB0013
ACIEA1           IF ESTADO-ABD02 = 1                                    RMB0013
ACIEA1              MOVE 0 TO SUS-BLO-CARACT                            RMB0013
ACIEA1           ELSE                                                   RMB0013
ACIEA1              MOVE 1 TO SUS-BLO-CARACT                            RMB0013
ACIEA1           END-IF                                                 RMB0013
                 MOVE " -1" TO 00INQ001(1:3) 00INQ002(1:3) 
                               00INQ005(1:3) 00INQ006(1:3) 
                               00INQ007(1:3) 00INQ010(1:3)
                               00INQ011(1:3) 00INQ012(1:3)
                               00INQ015(1:3)
ACIEA1           MOVE ZEROS TO 00INQ016(1:3) 00INQ017(1:3)              RMB0013
ACIEAA                         00INQ018(1:3) 00INQ025(1:3)              RMB0012
ACIEAA                         00INQ026(1:3) 00INQ027(1:3)              RMB0012
ACIEAA                         00INQ028(1:3)                            RMB0012
ACIEA1           MOVE "999" TO 00INQ018(1:3)                            RMB0013
                 MOVE TIPO-ID-CARACT  TO 00INQTIP 01INQTIP
                 MOVE NRO-ID-CARACT   TO 00INQNRO 01INQNRO
                 MOVE COD-SUSCRIP-IND TO 00INQSUS
                 MOVE FEC-CONSUL-IND  TO 00INQFCH
                 MOVE CONSECUTIVO-IND TO 00INQCSC
                 PERFORM 4100-CAL-FECHA-CONSULTA
                 PERFORM 4200-CALCULA-CARACT-00INQ
                 PERFORM 4300-CALCULA-CARACT-01INQ
              END-IF
IGN001        READ  INDEXADO NEXT RECORD WITH IGNORE LOCK               GJC0009
                 AT END
                    MOVE 1 TO SW-LECTURA-CARACT
              END-READ
           END-PERFORM.

       4100-CAL-FECHA-CONSULTA.
REMARK******************************************************************
REMARK*4100-CAL-FECHA-CONSULTA.
REMARK******************************************************************
           MOVE FEC-CONSUL-IND  TO FECHA-CONS-CARACT
           MOVE FECHA-CONS-CARACT(3:2) TO MES-CONS-CARACT
           MOVE FECHA-CONS-CARACT(5:2) TO ANO-CONS-CARACT
           IF ANO-CONS-CARACT < 60
              MOVE 20          TO SIG-CONS-CARACT
           ELSE
              MOVE 19          TO SIG-CONS-CARACT
           END-IF
           MOVE ZEROS TO MESES-CONST-CARACT
      *    SE TOMA LA FECHA ACTUAL O DE RECOGIDA DE LA BASE DE DATOS
RUNDAT     IF FECHA-RUN-CARACT > ZEROS AND FECHA-CONSULT-CARACT > ZEROS RMB0003
             COMPUTE MESES-CONST-CARACT =
RUNDAT            ((ANO-RUN-CARACT * 12)+ MES-RUN-CARACT) -             RMB0003
                  ((SIG-ANO-CONS-CARACT * 12) + MES-CONS-CARACT)
           END-IF.

       4200-CALCULA-CARACT-00INQ.
REMARK******************************************************************
REMARK*4200-CALCULA-CARACT-00INQ.
REMARK******************************************************************
       MOVE ZEROS TO 00INQ001 00INQ002 00INQ006 00INQ007 00INQ011
                     00INQ012
       MOVE 999   TO 00INQ005 00INQ010 00INQ015
      *** 00INQ001 *** CONSULTA EN LOS ULTIMOS 3 MESES
           IF MESES-CONST-CARACT >= 0 AND <= 3
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              MOVE 1 TO 00INQ001
           END-IF
      *** 00INQ002 *** CONSULTA EN LOS ULTIMOS 6 MESES
           IF MESES-CONST-CARACT >= 0 AND <= 6
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              MOVE 1 TO 00INQ002
           END-IF
      *** 00INQ005 *** MESES DESDE LA CONSULTA
           IF 00INQ005 > MESES-CONST-CARACT AND 
              MESES-CONST-CARACT >= 0
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              MOVE MESES-CONST-CARACT TO 00INQ005
           END-IF
      *** 00INQ006 *** CONSULTA BATCH EN LOS ULTIMOS 3 MESES
           IF COD-SUSCRIP-IND(1:2) = 70 AND
              MESES-CONST-CARACT >= 0 AND <= 3
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              MOVE 1 TO 00INQ006
           END-IF
      *** 00INQ007 *** CONSULTA BATCH EN LOS ULTIMOS 6 MESES
           IF COD-SUSCRIP-IND(1:2) = 70 AND
              MESES-CONST-CARACT >= 0 AND <= 6
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              MOVE 1 TO 00INQ007
           END-IF
      *** 00INQ010 *** MESES DESDE LA CONSULTA BATCH
           IF COD-SUSCRIP-IND(1:2) = 70
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              IF 00INQ010 > MESES-CONST-CARACT AND
                 MESES-CONST-CARACT >= 0
                 MOVE MESES-CONST-CARACT TO 00INQ010
              END-IF
           END-IF
      *** 00INQ011 *** CONSULTA CIUDADANO EN LOS ULTIMOS 3 MESES
           IF COD-SUSCRIP-IND = 990003 AND
              MESES-CONST-CARACT >= 0 AND <= 3
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              MOVE 1 TO 00INQ011
           END-IF
      *** 00INQ012 *** CONSULTA CIUDADANOS EN LOS ULTIMOS 6 MESES
           IF COD-SUSCRIP-IND = 990003 AND
              MESES-CONST-CARACT >= 0 AND <= 6
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              MOVE 1 TO 00INQ012
           END-IF
      *** 00INQ015 *** MESES DESDE LA CONSULTA CIUDADANOS
           IF COD-SUSCRIP-IND = 990003
ACIEA1        AND SUS-BLO-CARACT = 0                                    RMB0013
              IF 00INQ015 > MESES-CONST-CARACT AND
                 MESES-CONST-CARACT >= 0
                 MOVE MESES-CONST-CARACT TO 00INQ015
              END-IF
           END-IF
ACIEA1*** 00INQ016 *** CONSULTA SUSCRIPTORES EN LOS ULTIMOS 3 MESES     RMB0013
ACIEA1     IF COD-SUSCRIP-IND = 990003 OR 990001 OR 990005              RMB0013
ACIEA1        CONTINUE                                                  RMB0013
ACIEA1     ELSE                                                         RMB0013
ACIEA1        IF MESES-CONST-CARACT >= 0 AND <= 3                       RMB0013
ACIEA1           MOVE 1 TO 00INQ016                                     RMB0013
ACIEA1        END-IF                                                    RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 00INQ017 *** CONSULTA SUSCRIPTORES EN LOS ULTIMOS 6 MESES     RMB0013
ACIEA1     IF COD-SUSCRIP-IND = 990003 OR 990001 OR 990005              RMB0013
ACIEA1        CONTINUE                                                  RMB0013
ACIEA1     ELSE                                                         RMB0013
ACIEA1        IF MESES-CONST-CARACT >= 0 AND <= 6                       RMB0013
ACIEA1           MOVE 1 TO 00INQ017                                     RMB0013
ACIEA1        END-IF                                                    RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 00INQ018 *** MESES DESDE LA ULTIMA HUELLA DE CONSULTA         RMB0013
ACIEA1     IF COD-SUSCRIP-IND = 990003 OR 990001 OR 990005              RMB0013
ACIEA1        CONTINUE                                                  RMB0013
ACIEA1     ELSE                                                         RMB0013
ACIEA1        IF MESES-CONST-CARACT >= 0                                RMB0013
ACIEA1           MOVE MESES-CONST-CARACT TO 00INQ018                    RMB0013
ACIEA1        ELSE                                                      RMB0013
ACIEA1           MOVE 0                  TO 00INQ018                    RMB0013
ACIEA1        END-IF                                                    RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 00INQ025 *** HUELLAS DE CONSULTA SECTOR FINANCIERO            RMB0013
ACIEA1     IF COD-SUSCRIP-IND = 990003 OR 990001 OR 990005              RMB0013
ACIEA1        CONTINUE                                                  RMB0013
ACIEA1     ELSE                                                         RMB0013
ACIEA1        IF COD-TIPCTA-ABD02 = 02 OR 03 OR 05 OR 06 OR 13 OR       RMB0013
ACIEA1                              14 OR 18 OR 49 OR 27                RMB0013
ACIEA1           MOVE 1 TO 00INQ025                                     RMB0013
ACIEA1        END-IF                                                    RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 00INQ026 *** HUELLAS DE CONSULTA SECTOR COMUNICACIONES        RMB0013
ACIEA1     IF COD-SUSCRIP-IND = 990003 OR 990001 OR 990005              RMB0013
ACIEA1        CONTINUE                                                  RMB0013
ACIEA1     ELSE                                                         RMB0013
ACIEA1        IF COD-TIPCTA-ABD02 = 23 OR 24                            RMB0013
ACIEA1           MOVE 1 TO 00INQ026                                     RMB0013
ACIEA1        END-IF                                                    RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 00INQ027 *** HUELLAS DE CONSULTA SECTOR OTROS                 RMB0013
ACIEA1     IF COD-SUSCRIP-IND = 990003 OR 990001 OR 990005              RMB0013
ACIEA1        CONTINUE                                                  RMB0013
ACIEA1     ELSE                                                         RMB0013
ACIEA1        IF COD-TIPCTA-ABD02 = 07 OR 17 OR 21                      RMB0013
ACIEA1           MOVE 1 TO 00INQ027                                     RMB0013
ACIEA1        END-IF                                                    RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 00INQ028 *** HUELLAS DE CONSULTA SECTOR REAL                  RMB0013
ACIEA1     IF COD-SUSCRIP-IND = 990003 OR 990001 OR 990005              RMB0013
ACIEA1        CONTINUE                                                  RMB0013
ACIEA1     ELSE                                                         RMB0013
ACIEA1        IF COD-TIPCTA-ABD02 = 04 OR 08 OR 09 OR 10 OR 11 OR       RMB0013
ACIEA1                              12 OR 15 OR 16 OR 19 OR 20 OR       RMB0013
ACIEA1                              22 OR 26 OR                         RMB0013
ACIEA1                              ( COD-TIPCTA-ABD02 >= 28 AND        RMB0013
ACIEA1                                COD-TIPCTA-ABD02 <= 48 )          RMB0013
ACIEA1           MOVE 1 TO 00INQ028                                     RMB0013
ACIEA1        END-IF                                                    RMB0013
ACIEA1     END-IF.                                                      RMB0013
           IF GEN-INQ-CARACT = 1
              PERFORM 4249-PROCESE-CARCT-00INQ
           END-IF.

       4300-CALCULA-CARACT-01INQ.
REMARK******************************************************************
REMARK*4300-CALCULA-CARACT-01INQ.
REMARK******************************************************************
      *** 01INQ001 *** NUMERO DE CONSULTAS EN LOS ULTIMOS 3 MESES
           IF 00INQ001 > 0
              IF 01INQ001 < 0
                  MOVE ZEROS TO 01INQ001
              END-IF
              ADD 1 TO 01INQ001
           ELSE
              IF 01INQ001 < 1
                 IF FUNCTION NUMVAL(00INQ001(2:2)) < 
                    FUNCTION NUMVAL(01INQ001(3:2))
                    MOVE "  " TO 01INQ001(1:2)
                    MOVE 00INQ001(2:2) TO 01INQ001(3:2)
                 END-IF
              END-IF
           END-IF
      *** 01INQ002 *** NUMERO DE CONSULTAS EN LOS ULTIMOS 6 MESES
           IF 00INQ002 > 0
              IF 01INQ002 < 0
                 MOVE ZEROS TO 01INQ002
              END-IF
              ADD 1 TO 01INQ002
           ELSE
              IF 01INQ002 < 1
                 IF FUNCTION NUMVAL(00INQ002(2:2)) < 
                    FUNCTION NUMVAL(01INQ002(3:2))
                    MOVE "  " TO 01INQ002(1:2)
                    MOVE 00INQ002(2:2) TO 01INQ002(3:2)
                 END-IF
              END-IF
           END-IF
      *** 01INQ005 *** MESES DESDE LA ULTIMA CONSULTA
           IF 00INQ005 >= 0
              IF 01INQ005 < 0
                 MOVE 999 TO 01INQ005
              END-IF
              IF 01INQ005 > 00INQ005
                 MOVE 00INQ005 TO 01INQ005
              END-IF
           ELSE
GNT001        IF 01INQ005 < 0 OR = "0999"                               DLM0010
                 IF FUNCTION NUMVAL(00INQ005(2:2)) < 
                    FUNCTION NUMVAL(01INQ005(3:2))
                    MOVE "  " TO 01INQ005(1:2)
                    MOVE 00INQ005(2:2) TO 01INQ005(3:2)
                 END-IF
              END-IF
           END-IF
      *** 01INQ006 *** NUMERO DE CONSULTAS BATCH EN LOS ULTIMOS 3 MESES
           IF 00INQ006 > 0
              IF 01INQ006 < 0
                  MOVE ZEROS TO 01INQ006
              END-IF
              ADD 1 TO 01INQ006
           ELSE
              IF 01INQ006 < 1
                 IF FUNCTION NUMVAL(00INQ006(2:2)) < 
                    FUNCTION NUMVAL(01INQ006(3:2))
                    MOVE "  " TO 01INQ006(1:2)
                    MOVE 00INQ006(2:2) TO 01INQ006(3:2)
                 END-IF
              END-IF
           END-IF
      *** 01INQ007 *** NUMERO DE CONSULTAS BATCH EN LOS ULTIMOS 6 MESES
           IF 00INQ007 > 0
              IF 01INQ007 < 0
                 MOVE ZEROS TO 01INQ007
              END-IF
              ADD 1 TO 01INQ007
           ELSE
              IF 01INQ007 < 1
                 IF FUNCTION NUMVAL(00INQ007(2:2)) < 
                    FUNCTION NUMVAL(01INQ007(3:2))
                    MOVE "  " TO 01INQ007(1:2)
                    MOVE 00INQ007(2:2) TO 01INQ007(3:2)
                 END-IF
              END-IF
           END-IF
      *** 01INQ010 *** MESES DESDE LA ULTIMA CONSULTA BATCH
           IF 00INQ010 >= 0
              IF 01INQ010 > 00INQ010
                 MOVE 00INQ010 TO 01INQ010
              END-IF
           ELSE
GNT001        IF 01INQ010 < 0 OR = "0999"                               DLM0010
                 IF FUNCTION NUMVAL(00INQ010(2:2)) < 
                    FUNCTION NUMVAL(01INQ010(3:2))
                    MOVE "  " TO 01INQ010(1:2)
                    MOVE 00INQ010(2:2) TO 01INQ010(3:2)
                 END-IF
              END-IF
           END-IF
      *** 01INQ011 *** NUEMRO DE CONSULTAS CIUDADANO EN LOS ULTIMOS 3 MESES
           IF 00INQ011 > 0
              IF 01INQ011 < 0
                 MOVE ZEROS TO 01INQ011
              END-IF
              ADD 1 TO 01INQ011
           ELSE
              IF 01INQ011 < 1
                 IF FUNCTION NUMVAL(00INQ011(2:2)) < 
                    FUNCTION NUMVAL(01INQ011(3:2))
                    MOVE "  " TO 01INQ011(1:2)
                    MOVE 00INQ011(2:2) TO 01INQ011(3:2)
                 END-IF
              END-IF
           END-IF
      *** 01INQ012 *** NUMERO DE CONSULTAS CIUDADANOS EN LOS ULTIMOS 6 MESES
           IF 00INQ012 > 0
              IF 01INQ012 < 0
                 MOVE ZEROS TO 01INQ012
              END-IF
              ADD 1 TO 01INQ012
           ELSE
              IF 01INQ012 < 1
                 IF FUNCTION NUMVAL(00INQ012(2:2)) < 
                    FUNCTION NUMVAL(01INQ012(3:2))
                    MOVE "  " TO 01INQ012(1:2)
                    MOVE 00INQ012(2:2) TO 01INQ012(3:2)
                 END-IF
              END-IF
           END-IF
      *** 01INQ015 *** MESES DESDE LA ULTIMA CONSULTA CIUDADANOS
           IF 00INQ015 >= 0
              IF 01INQ015 < 0
                 MOVE 999 TO 01INQ015
              END-IF
              IF 01INQ015 > 00INQ015
                 MOVE 00INQ015 TO 01INQ015
              END-IF
           ELSE
GNT001        IF 01INQ015 < 0 OR = "0999"                               DLM0010
                 IF FUNCTION NUMVAL(00INQ015(2:2)) < 
                    FUNCTION NUMVAL(01INQ015(3:2))
                    MOVE "  " TO 01INQ015(1:2)
                    MOVE 00INQ015(2:2) TO 01INQ015(3:2)
                 END-IF
              END-IF
           END-IF.
ACIEAA*    INICIALIZACION TEMPORAL MIENTRAS SE CONSTRUYEN               RMB0012
ACIEA1*    MOVE "  -1"         TO 01INQ016(1:4).                        RMB0013
ACIEA1*    MOVE "  -1"         TO 01INQ017(1:4).                        RMB0013
ACIEA1*    MOVE "  -1"         TO 01INQ018(1:4).                        RMB0013
ACIEA1*    MOVE "  -1"         TO 01INQ025(1:4).                        RMB0013
ACIEA1*    MOVE "  -1"         TO 01INQ026(1:4).                        RMB0013
ACIEA1*    MOVE "  -1"         TO 01INQ027(1:4).                        RMB0013
ACIEA1*    MOVE "  -1"         TO 01INQ028(1:4).                        RMB0013
ACIEA1*** 01INQ016 *** HUELLAS DE CONSULTA EN LOS ULTIMOS 3 MESES       RMB0013
ACIEA1     IF FUNCTION NUMVAL(00INQ016) > 0                             RMB0013
ACIEA1        ADD 1 TO 01INQ016                                         RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 01INQ017 *** HUELLAS DE CONSULTA EN LOS ULTIMOS 6 MESES       RMB0013
ACIEA1     IF FUNCTION NUMVAL(00INQ017) > 0                             RMB0013
ACIEA1        ADD 1 TO 01INQ017                                         RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 01INQ018 *** MESES DESDE LA ULIMA HUELLA DE CONSULTA          RMB0013
ACIEA1     IF 01INQ018 > 00INQ018                                       RMB0013
ACIEA1        MOVE 00INQ018  TO 01INQ018                                RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 01INQ025 *** HUELLAS DE CONSULTA FINANCIERAS                  RMB0013
ACIEA1     IF FUNCTION NUMVAL(00INQ025) > 0                             RMB0013
ACIEA1        ADD 1 TO 01INQ025                                         RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 01INQ026 *** HUELLAS DE CONSULTA COMUNICACIONES               RMB0013
ACIEA1     IF FUNCTION NUMVAL(00INQ026) > 0                             RMB0013
ACIEA1        ADD 1 TO 01INQ026                                         RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 01INQ027 *** HUELLAS DE CONSULTA OTROS                        RMB0013
ACIEA1     IF FUNCTION NUMVAL(00INQ027) > 0                             RMB0013
ACIEA1        ADD 1 TO 01INQ027                                         RMB0013
ACIEA1     END-IF.                                                      RMB0013
ACIEA1*** 01INQ028 *** HUELLAS DE CONSULTA REAL                         RMB0013
ACIEA1     IF FUNCTION NUMVAL(00INQ028) > 0                             RMB0013
ACIEA1        ADD 1 TO 01INQ028                                         RMB0013
ACIEA1     END-IF.                                                      RMB0013
       4500-CALCULA-CARACT-02INQ.
REMARK******************************************************************
REMARK*4500-CALCULA-CARACT-02INQ.
REMARK******************************************************************
      *** 02INQ001 *** PARTICIPACION CONSULTAS CIUD EN TOTAL CONS 6 MESES
           MOVE "TO" TO 02INQPTF
           IF 01INQ002 > 0 AND 01INQ012 >= 0
              COMPUTE 02INQ001 ROUNDED = ((01INQ012 / 01INQ002) * 100)
           ELSE
              MOVE "    -1" TO 02INQ001(1:6)
           END-IF.

       5000-MOVER-CARACT-NIVEL00.
REMARK******************************************************************
REMARK*5000-MOVER-CARACT-NIVEL00.
REMARK******************************************************************
      *** MUEVE LAS VARIABLES DE NIVEL 00 AL PORTAFOLIO CORRESPONDIENTE*
           IF GEN-NUM-CARACT = 1
              EVALUATE 00NUMPTF
                  WHEN "RO"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMRO
                  WHEN "IN"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMIN
                  WHEN "VE"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMVE
                  WHEN "HP"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMHP
                  WHEN "OT"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMOT
                  WHEN "CC"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMCC
                  WHEN "CO"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMCO
                  WHEN "AH"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMAH
                  WHEN "CT"
                       MOVE VAR-00NUM(41:117) TO VAR-00NUMCT
              END-EVALUATE
           END-IF
           IF GEN-MOR-CARACT = 1
              EVALUATE 00MORPTF
                  WHEN "RO"
                       MOVE VAR-00MOR(41:430) TO VAR-00MORRO
                  WHEN "IN"
                       MOVE VAR-00MOR(41:430) TO VAR-00MORIN
                  WHEN "VE"
                       MOVE VAR-00MOR(41:430) TO VAR-00MORVE
                  WHEN "HP"
                       MOVE VAR-00MOR(41:430) TO VAR-00MORHP
                  WHEN "OT"
                       MOVE VAR-00MOR(41:430) TO VAR-00MOROT
                  WHEN "CC"
                       MOVE VAR-00MOR(41:430) TO VAR-00MORCC
                  WHEN "CO"
                       MOVE VAR-00MOR(41:430) TO VAR-00MORCO
              END-EVALUATE
           END-IF
           IF GEN-ACP-CARACT = 1
              EVALUATE 00ACPPTF
                  WHEN "RO"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPRO
                  WHEN "IN"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPIN
                  WHEN "VE"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPVE
                  WHEN "HP"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPHP
                  WHEN "OT"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPOT
                  WHEN "CC"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPCC
                  WHEN "CO"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPCO
                  WHEN "AH"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPAH
                  WHEN "CT"
                       MOVE VAR-00ACP(41:126) TO VAR-00ACPCT
              END-EVALUATE
           END-IF
           IF GEN-EXP-CARACT = 1
              EVALUATE 00EXPPTF
                  WHEN "RO"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPRO
                  WHEN "IN"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPIN
                  WHEN "VE"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPVE
                  WHEN "HP"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPHP
                  WHEN "OT"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPOT
                  WHEN "CC"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPCC
                  WHEN "CO"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPCO
                  WHEN "AH"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPAH
                  WHEN "CT"
                       MOVE VAR-00EXP(41:24) TO VAR-00EXPCT
              END-EVALUATE
           END-IF
           IF GEN-END-CARACT = 1
              EVALUATE 00ENDPTF
                  WHEN "RO"
                       MOVE 00END-SALIDA(41:1067) TO VAR-00ENDRO
                  WHEN "IN"
                       MOVE 00END-SALIDA(41:1067) TO VAR-00ENDIN
                  WHEN "VE"
                       MOVE 00END-SALIDA(41:1067) TO VAR-00ENDVE
                  WHEN "HP"
                       MOVE 00END-SALIDA(41:1067) TO VAR-00ENDHP
                  WHEN "OT"
                       MOVE 00END-SALIDA(41:1067) TO VAR-00ENDOT
                  WHEN "CC"
                       MOVE 00END-SALIDA(41:1067) TO VAR-00ENDCC
                  WHEN "CO"
                       MOVE 00END-SALIDA(41:1067) TO VAR-00ENDCO
              END-EVALUATE
           END-IF.
