      *CARDEC-PROC.v.01.0031.
      $SET CONSTANT HACERMATCH"NO"
      $SET CONSTANT AMNISTIA21"NO"

      $IF HACERMATCH = "SI"
      $DISPLAY ".............COMPILANDO CARDEC CON MATCH **********
      $ELSE
      $DISPLAY ".............COMPILANDO CARDEC SIN MATCH **********
      $END
      
      $IF AMNISTIA21 = "SI"
      $DISPLAY ".............COMPILANDO CARDEC CON AMNISTIA *******
      $ELSE
      $DISPLAY ".............COMPILANDO CARDEC SIN AMNISTIA *******
      $END

REMARK******************************************************************
REMARK* CONJUNTO DE RUTINAS QUE PERMITE CALCULAR LAS CARACTERISTICAS   *
REMARK* INTERNAS DE DATACREDITO PARA EL PROYECTO DECISOR               *
REMARK*         PARAMETROS DE ENTRADA:                                 *
REMARK*           TIPIDE-CARDEC(TIPO DE IDENTIFICACION)                *
REMARK*           NUMIDE-CARDEC(NUMERO DE IDENTIFICACION)              *
REMARK*           FECHA-RUN-TIME-CARDEC (FECHA DIA DE CORRIDA AAAAMM ) *
REMARK*         VARIABLES DE SALIDA                                    *
REMARK*           CARACTERISTICAS-CARDEC.                              *
REMARK******************************************************************
REMARK*                     LOG DE MODIFICACIONES                      *
REMARK*----------------------------------------------------------------*
REMARK*  ANALISTA                        DESCRIPCION                   *
REMARK* ----------- * ------------------------------------------------ *
REMARK* EHA0002     | ADDCAR SE ADICIONAN NUEVAS CARACTERISTICAS.      *
REMARK* E. ALVAREZ  |                                                  *
REMARK* 22-OCT-2010 |                                                  *
REMARK* ----------- * ------------------------------------------------ *
REMARK* EHA0003     | MD1033 - SE ADICIONAN NUEVAS CARACTERISTICAS     *
REMARK* E. ALVAREZ  |          PARA SCORE DE CAJASAN                   *
REMARK* 30-DIC-2010 |                                                  *
REMARK******************************************************************
REMARK******************************************************************
REMARK* CIGD004     | CQ1224 - SE ADICIONAN NUEVAS CARACTERISTICAS     *
REMARK* C.GAONA     |          BANCOLOMBIA (CONSERVA CLIENTES)         *
REMARK* 08-FEB-2010 |                                                  *
REMARK******************************************************************
REMARK* EHA0005     | MOD734 - SE ADICIONAN NUEVAS CARACTERISTICAS     *
REMARK* E.ALVAREZ   |          PARA ESTRAVAL (ICGD54D)                 *
REMARK* 21-FEB-2010 |                                                  *
      ******************************************************************
      * EHA0006     | CQ1343 - SCORE COLPATRIA VEHICULOS E HIPOTECARIO.*
      * E.ALVAREZ.  |   RQ. CQ. 1343.                                  *
      * 25-FEB-2011 |                                                  *
      ******************************************************************
      * DLM0007     | CQ1342 - SCORE COLPATRIA HIPOTECARIO.            *
      * DARIO LASSO.|   RQ. CQ. 1342.                                  *
      * 07-MAR-2011 |                                                  *
      ******************************************************************
      * EHA0008     | CQ1445 - MODIFICACIONES PARA SCORE TUYA ICGD64D  *
      * E. ALVAREZ  |   RQ. CQ. 1445.                                  *
      * 10-MAR-2011 |                                                  *
      ******************************************************************
      * EHA0009     | AL1342 - MODIFICACIONES SCORES COLPATRIA         *
      * E. ALVAREZ  |          VEHICULOS - HIPOTECARIO RQ. CQ. 1342.   *
      * 18-MAR-2011 |                                                  *
      ******************************************************************
      * EHA0010     | AL1224 - SE ADICIONAN NUEVAS CARACTERISTICAS     *
      * E. ALVAREZ  |           BANCOLOMBIA ICGD59.                    *
      * 22-MAR-2011 |                                                  *
      ******************************************************************
      * DLM0011     | CQ1862 - PASAR LA VERSION QUE INICILIZA LAS VA-  *
      * DARIO LASSO |   RIABLES BOM-CAR-CARDEC.                        *
      * 19-ABR-2011 |   REQ. CQ. 1862.                                 *
      ******************************************************************
      * CIG0012     | RQ1648 - SCORE COLPATRIA CONSUMO                 *
      * C. GAONA    |   RQ. CQ 1648                                    *
      * 02-ABR-2011 |                                                  *
      ******************************************************************
      * EHA0013     | 1342V1 - MODIFICACIONES SCORE COLPATRIA          *
      * E. ALVAREZ  |          HIPOTECARIO CQ1342.                     *
      * 05-ABR-2011 |                                                  *
      ******************************************************************
      * CIG0013     | MD1224 - AJUSTES A LA VERSION 10 AL1224          *
      * C. GAONA    | AJ1648 - AJUSTES A CARACTERISTICAS CTA-CTE       *
      * 18-ABR-2011 |                                                  *
      ******************************************************************
      * CIG0014     | RQ1224 - CAMBIOS EN LOS RANGOS DE ACIERTA + EN   *
      * C. GAONA    |       TABLA DE FACTOR DE RIESGO.                 *
      * 24-MAY-2011 |                                                  *
      **************|***************************************************
      * DLM0014     | CQ1812 - IMPLEMENTACION DEL SCORE PARA TELECOM   *
      * DARIO LASSO |   REQ. 1812.                                     *
      * 20-MAY-2011 |                                                  *
      ******************************************************************
      * EHA0015     | CQ1949 - MODIFICACION EN EXCLUSIONES DE CAJASAN  *
      * E. ALVAREZ  |       ICGD58D - REQ. 1949.                       *
      * 02-JUN-2011 |                                                  *
      ******************************************************************
      * CIG0016     | RQ1914 - IMPLEMENTACION DEL SCORE PARA BANCOLOM- *
      * C. GAONA    |       BIA ICGS57D.                               *
      * 03-JUN-2011 |                                                  *
      *             | AJ1224 - AJUSTES CARACTERISTICAS ICGD59D         *
      ******************************************************************
      * EHA0017     | RQ2171 - SE ADICIONA NUEVA CARACTERISTICA PARA   *
      * E. ALVAREZ  |       ESTRAVAL ICGD54D.                          *
      * 16-JUN-2011 |                                                  *
      ******************************************************************
      * CIG0018     | RQ2252 - SE AGREGAN LAS RUTINAS PARA EL CALCULO  *
      * C. GAONA    |          DE LAS VARIABLES CARACTERISTICAS PROPIAS*
      * 21-JUN-2011 |          DENTRO DEL PROGRAMA.                    *
      ******************************************************************
      * CIG0019     | RQ1947 - ADICION DE NUEVAS CARACTERISTICAS PARA  *
      * C. GAONA    |          LA FUNDACION MUNDIAL DE LA MUJER B/MANGA*
      * 26-JUN-2011 |                                                  *
      ******************************************************************
      * CIG0020     | RQ2212 - SE ADICIONAN NUEVAS CARACTERISTICAS PARA*
      * C. GAONA    |          BANCO POPULAR.                          *
      * 01-JUL-2011 |                                                  *
      ******************************************************************
      * EHA0021     | RQ2340 - SE MODIFICAN CARACTERISTICAS EXISTENTES *
      * E. ALVAREZ  |          RQ. 2340                                *
      * 12-JUL-2011 |                                                  *
      ******************************************************************
      * CIG0022     | AJUVEC - SE AJUSTAN LAS CARACTERISTICAS QUE USAN *
      * C. GAONA    |          EL VECTOR 2 HISTORICO.                  *
      * 12-JUL-2011 |                                                  *
      ******************************************************************
      * EHA0023     | RQ2393 - SE MODIFICA EL CALCULO DEL INGRESO REAL *
      * E. ALVAREZ  |          PARA EL SCORE ICGD62D.                  *
      * 13-JUL-2011 |                                                  *
      ******************************************************************
      * EHA0024     | AL2393 - SE MODIFICA EL CALCULO DE LAS CUOTAS    *
      * E. ALVAREZ  |          PARA EL SCORE ICGD62D.                  *
      * 18-JUL-2011 |                                                  *
      ******************************************************************
      * EHA0025     | RQ2394 - SE MODIFICA EL CALCULO DE LAS CUOTAS    *
      * E. ALVAREZ  |          PARA EL SCORE ICGD61D.                  *
      * 27-JUL-2011 |                                                  *
      ******************************************************************
      * EHA0026     | RQ2810 - SE MODIFICA EL CALCULO DE LA VARIABLE   *
      * E. ALVAREZ  |          99MOR007TO00 PARA EL SCORE ICGD72D.     *
      * 23-AGO-2011 |                                                  *
      ******************************************************************
      * EHA0027     | RQ2902 - SE MODIFICA LA LECTURA DEL ICMCRE PARA  *
      * 19-SEP-2011 |          INCLUIR REGISTROS FRENADOS ICGS63D.CBL. *
      ******************************************************************
      * DLM0028    | CQ3535 - MODIFICACIONES VARIAS EN EL PROCESO      *
      * DARIO LASSO|   GENERAL DE APROBACIÓN DE CRÉDITO                *
      * 21-NOV-2011|   REQ. CQ. 3535.                                  *
      ******************************************************************
      * EHA0029    | RQ4406 - SE MODIFICA LA VARIABLE 99EXP002EX61     *
      * 31-ENE-2011|   REQ. CQ. 4406.                                  *
      ******************************************************************
      * DLM0030    | CQ5860 - INCLUIR A LOS CODEUDORES EN EL CONTEO DE *
      * 30-MAY-2012|   MORAS EN EL SECTOR REAL.                        *
      * DARIO LASSO|   REQ. CQ. 20902 - Alcance 2.                     *
      ******************************************************************
      * DLM0031    | CQ7181 - MODIFICACIONES AL SCORE.                 *
      * 23-AGO-2012|    REQ. CQ. 7181.                                 *
      * DARIO LASSO|                                                   *
      ******************************************************************
       5000-TOTAL-CARDEC.                        
REMARK******************************************************************
REMARK*5000-TOTAL-CARDEC.
REMARK* SE INICIALIZAN TODAS LAS VARIABLES INVOLUCRADAS EN EL MODELO, SE   *
REMARK* PROCEDE A CALCULAR LAS CARACTERISTICAS DE LA PERSONA, RECORRIENDO  *
REMARK* CARTERA,ENDEUDAMIENTO,CONSULTAS,CUENTAS CORRIENTES Y  REGISTRADURIA*
REMARK******************************************************************
            PERFORM 5000-INIVAR-CARDEC.                 
            MOVE AMNISTIA21-LEEMSTRS TO AMNISTIA21-LEEMSTRS-CARDEC           
            MOVE SW-ART13-AMNIST21   TO SW-ART13-AMNIST21-CARDEC            
            MOVE SW-NOV-48-LEEMSTRS  TO SW-NOV-48-CARDEC                   
ADDCAR*     MOVE 0 TO AMNISTIA21-LEEMSTRS *> ELIMINAR SI SCORE TOMA AMNIEHA0002
ADDCAR*     MOVE 0 TO SW-ART13-AMNIST21   *>ELIMINAR SI SCORE TOMA ART13EHA0002
ADDCAR*     MOVE 0 TO SW-NOV-48-LEEMSTRS  *>ELIMINAR SI SCORE TOM 48MESEEHA0002
ADDCAR      MOVE 1 TO AMNISTIA21-LEEMSTRS *> ELIMINAR SI SCORE TOMA AMNIEHA0002
ADDCAR      MOVE 1 TO SW-ART13-AMNIST21   *>ELIMINAR SI SCORE TOMA ART13EHA0002
ADDCAR      MOVE 1 TO SW-NOV-48-LEEMSTRS  *>ELIMINAR SI SCORE TOM 48MESEEHA0002

            PERFORM 5000-RECORRER-BD-CARDEC.                        
            MOVE  AMNISTIA21-LEEMSTRS-CARDEC TO  AMNISTIA21-LEEMSTRS.        
            MOVE  SW-ART13-AMNIST21-CARDEC   TO SW-ART13-AMNIST21.           
            MOVE  SW-NOV-48-CARDEC           TO SW-NOV-48-LEEMSTRS.         
       5000-RECORRER-BD-CARDEC.             
ADDCAR*     IF EST-CTACOR-CARDEC = 1                                    EHA0002
ADDCAR*        PERFORM 5000-RECORRER-CTACOR-CARDEC                      EHA0002
ADDCAR*     END-IF.                                                     EHA0002
            IF EST-CREDIT-CARDEC = 1        
               PERFORM 5000-RECORRER-CREDIT-CARDEC        
            END-IF.        
ADDCAR      IF EST-CTACOR-CARDEC = 1                                    EHA0002
ADDCAR         PERFORM 5000-RECORRER-CTACOR-CARDEC                      EHA0002
ADDCAR      END-IF.                                                     EHA0002
            IF EST-ENDEUD-CARDEC = 1        
               PERFORM 5000-RECORRER-ENDEUD-CARDEC        
            END-IF.        
            IF EST-CONSUL-CARDEC = 1        
               PERFORM 5000-RECORRER-CONSUL-CARDEC        
            END-IF.        
            IF EST-IDENTI-CARDEC = 1        
               PERFORM 5000-RECORRER-IDENTI-CARDEC        
            END-IF.        
            IF EST-HIBRID-CARDEC = 1        
               PERFORM 5000-RECORRER-HIBRID-CARDEC        
            END-IF.        
       5000-RECORRER-CTACOR-CARDEC.        
      ******************************************************************        
      *5000-RECORRER-CTACOR-CARDEC.        
      *     SE RECORRE LA ESTRUCTURA DE CUENTAS CORRIENTES        
      ******************************************************************        
            INITIALIZE LLAVE-MAES-CHECK.        
            MOVE TIPIDE-CARDEC   TO TIPO-ID-ABD06        
            MOVE NUMIDE-CARDEC   TO NUM-ID-ABD06.         
            MOVE 0 TO FINCHK-CARDEC.        
            PERFORM 0600-ASIGNA-ID-ICMCHK-START.                       
            START MAESTRO-CHECK KEY > LLAVE-MAES-CHECK        
               INVALID KEY MOVE 1 TO FINCHK-CARDEC        
               NOT INVALID KEY         
      *  SE DETERMINA SI SE TIENE EN CUENTA O NO BBVA        
                  IF IND-NO-BBVA-CARDEC = 1        
                     MOVE 1 TO SW-ELIMINA-BBVA-LEEMSTRS        
                  END-IF        
                  PERFORM  3000-LEE-ICMCHK-SECUENCIAL                 
                  IF  SW-LECTURA-MAESTROS  =  1                      
                    MOVE 1 TO FINCHK-CARDEC                         
                  END-IF                                           
            END-START.        
            PERFORM 5000-CTACOR-CARDEC UNTIL         
               TIPO-ID-ABD06 NOT = TIPIDE-CARDEC  OR        
               NUM-ID-ABD06  NOT = NUMIDE-CARDEC  OR        
               FINCHK-CARDEC  = 1.        
            MOVE 1 TO FINCHK-CARDEC.        
            PERFORM 5320-CTACOR-PROCES-CARDEC.        
       5000-RECORRER-CREDIT-CARDEC.        
      ******************************************************************        
      *5000-RECORRER-CREDIT-CARDEC.        
      *     SE RECORRE LA ESTRUCTURA DE CREDITO                        
      ******************************************************************        
            INITIALIZE LLAVE-MAES-CREDIT.        
            MOVE NUMIDE-CARDEC TO  NUM-ID-ABD07          
            MOVE TIPIDE-CARDEC TO  TIPO-ID-ABD07          
            MOVE 0 TO FINCRE-CARDEC.        
            MOVE 1 TO L-CARDEC        
            PERFORM 0500-ASIGNA-ID-ICMCRE-START.                              
            START MAESTRO-CREDIT KEY > LLAVE-MAES-CREDIT        
               INVALID KEY MOVE 1 TO FINCRE-CARDEC        
               NOT INVALID KEY         
      *  SE DETERMINA SI SE TIENE EN CUENTA O NO BBVA        
                  IF IND-NO-BBVA-CARDEC = 1        
                     MOVE 1 TO SW-ELIMINA-BBVA-LEEMSTRS        
                  END-IF        
                  PERFORM  1000-LEE-ICMCRE-SECUENCIAL                        
                  IF  SW-LECTURA-MAESTROS  =  1                              
                    MOVE  1         TO  FINCRE-CARDEC        
                  END-IF                                                     
            END-START.        
            PERFORM 5000-CREDIT-CARDEC   UNTIL         
               NUM-ID-ABD07 NOT = NUMIDE-CARDEC  OR        
               TIPO-ID-ABD07 NOT = TIPIDE-CARDEC OR         
               FINCRE-CARDEC = 1.        
            MOVE 1 TO FINCRE-CARDEC.        
            PERFORM 5320-CREDIT-PROCES-CARDEC.        
      *        
       0300-EVALUAR-PRODUCTO-CARDEC.        
      ******************************************************************        
      *0300-EVALUAR-PRODUCTO-CARDEC.        
      *     SE REALIZAN LOS CAMBIOS EN LOS TIPOS DE CUENTA DE ACUERDO A         
      *     LOS FLAGS EN 1 DEL VECTOR VCTR-MODTIPCTA-CARDEC        
      ******************************************************************        
            PERFORM  6000-CALC-FE-CTAS-CARDEC        
      *--------------------- MODIFICACION 1 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(1) = 1        
               IF COD-CTA-ABD07 > 29        
                  MOVE 11 TO COD-CTA-ABD07        
CQ1343         END-IF                                                   EHA0006
            END-IF        
      *--------------------- MODIFICACION 2 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(2) = 1        
               IF COD-SUS-ABD07  =  020055  OR  020007        
                  MOVE  03                  TO  COD-CTA-ABD07        
               END-IF        
            END-IF        
      *--------------------- MODIFICACION 3 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(3) = 1        
               IF  COD-SUS-ABD07 = 080001        
               AND (TOTAL-CUOTAS-ABD07  >  60  OR        
                    W-DIF-MESES-CARDEC  >  60)        
                   MOVE  13           TO  COD-CTA-ABD07        
               END-IF        
            END-IF        
      *--------------------- MODIFICACION 4 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(4) = 1
RQ2810* PARA LOS SCORES "ICGD62" E "ICGD61" NO SE MODIFICA ALMACENES SI EHA0026
RQ2810       IF NOMBRE-PROGRAMA = "ICGD62" OR NOMBRE-PROGRAMA = "ICGD61"EHA0026
RQ2810         IF COD-SUS-ABD07 = 020151 OR 020370                      EHA0026
RQ2810            MOVE   11  TO  COD-CTA-ABD07                          EHA0026
RQ2810         END-IF                                                   EHA0026
RQ2810       ELSE                                                       EHA0026
               IF COD-SUS-ABD07 = 020151 OR 020167 OR 020370        
                  MOVE   11  TO  COD-CTA-ABD07        
               END-IF
RQ2810       END-IF                                                     EHA0026
            END-IF        
      *--------------------- MODIFICACION 5 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(5) = 1        
               IF  COD-CTA-ABD07 = 05  AND  TIPO-OBLIGACION-ABD07 = 3        
                  MOVE  13                  TO  COD-CTA-ABD07        
CQ1343         END-IF                                                   EHA0006
            END-IF        
      *--------------------- MODIFICACION 6 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(6) = 1        
               IF COD-SUS-ABD07 = 080001        
                  IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1        
                     PERFORM 32000-PROCESAR-VALORES        
                     PERFORM 33000-PROCESAR-BDACUE        
                     IF IND-VALORES-VALVLR    = 1 AND        
                        VEC-VALOR-VALVLR (11) = 1        
                        IF TOTAL-CUOTAS-ABD07 > 60        
                           MOVE  13  TO  COD-CTA-ABD07        
                        END-IF        
                     END-IF        
                  END-IF        
               END-IF        
CQ1343      END-IF.                                                     EHA0006
      *--------------------- MODIFICACION 7 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(7) = 1        
               IF COD-SUS-ABD07 = 240033         *> NO IMPACTA        
                  MOVE   23  TO  COD-CTA-ABD07        
               END-IF        
            END-IF        
      *--------------------- MODIFICACION 8 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(8) = 1        
               IF COD-SUS-ABD07 = 230005 OR 230309 *> TELECARS COMCEL        
                  MOVE 24 TO COD-CTA-ABD07        
               END-IF        
            END-IF        
      *--------------------- MODIFICACION 9 ---------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(9) = 1        
               CONTINUE        
            END-IF        
      *--------------------- MODIFICACION 10 --------------------------*        
            IF VCTR-MODTIPCTA-CARDEC(10) = 1        
               CONTINUE        
            END-IF.        
      *        
RQ1648 6100-CALC-FE-CTACTE-CARDEC.                                      CIG0012
RQ1648******************************************************************CIG0012
RQ1648* CALCULA LAS DIFERENCIAS ENTRE LAS FECHAS NOVEDAD APERTURA Y    *CIG0012
RQ1648* CONSULTA PARA CUENTAS CORRIENTES.                              *CIG0012
RQ1648******************************************************************CIG0012
AJ1648     MOVE  FECHA-APERT-ABD06  TO  W-F-MMAA-CARDEC                 CIG0013
RQ1648     MOVE  W-F-MMAA-CARDEC(1:2)  TO  W-MES-AUX-CARDEC             CIG0012
RQ1648     MOVE  W-F-MMAA-CARDEC(3:2)  TO  W-ANO-AUX-CARDEC             CIG0012
RQ1648     IF  W-ANO-AUX-CARDEC  <  50                                  CIG0012
RQ1648       ADD   2000                TO  W-ANO-AUX-CARDEC             CIG0012
RQ1648     ELSE                                                         CIG0012
RQ1648       ADD   1900                TO  W-ANO-AUX-CARDEC             CIG0012
RQ1648     END-IF                                                       CIG0012
RQ1648     COMPUTE  W-MESES-TMP-CARDEC =                                CIG0012
RQ1648              ((W-ANIO-HOY-CARDEC * 12) + W-MES-HOY-CARDEC)  -    CIG0012
RQ1648              ((W-ANO-AUX-CARDEC  * 12) + W-MES-AUX-CARDEC)       CIG0012
RQ1648     MOVE  W-MESES-TMP-CARDEC    TO  W-MESES-APERTURA-CARDEC      CIG0012
RQ1648     MOVE  W-ANO-AUX-CARDEC      TO  W-FECHA-APER-AA-CARDEC       CIG0012
RQ1648     MOVE  W-MES-AUX-CARDEC      TO  W-FECHA-APER-MM-CARDEC       CIG0012
RQ1648     .                                                            CIG0012
RQ1648*                                                                 CIG0012
       6000-CALC-FE-CTAS-CARDEC.        
      ******************************************************************        
      * CALCULA LAS DIFERENCIAS ENTRE LAS FECHAS NOVEDAD APERTURA Y    *        
      * VENCIMIENTO.                                                   *        
      ******************************************************************        
           MOVE  FECHA-VENC-ABD07      TO  W-F-MMAA-CARDEC        
           MOVE  W-F-MMAA-CARDEC(1:2)  TO  W-MES-AUX-CARDEC        
           MOVE  W-F-MMAA-CARDEC(3:2)  TO  W-ANO-AUX-CARDEC        
           IF  W-ANO-AUX-CARDEC  <  50        
             ADD   2000                TO  W-ANO-AUX-CARDEC        
           ELSE        
             ADD   1900                TO  W-ANO-AUX-CARDEC        
           END-IF        
           COMPUTE  W-MESES-TMP-CARDEC =        
                    ((W-ANO-AUX-CARDEC  * 12) + W-MES-AUX-CARDEC)  -        
                    ((W-ANIO-HOY-CARDEC * 12) + W-MES-HOY-CARDEC)        
           MOVE  W-MESES-TMP-CARDEC    TO  W-MESES-CIERRE-CARDEC        
           MOVE  W-ANO-AUX-CARDEC      TO  W-FECHA-CIER-AA-CARDEC        
           MOVE  W-MES-AUX-CARDEC      TO  W-FECHA-CIER-MM-CARDEC        
      *----------------------------------------------------------------*        
           MOVE  FECHA-APERT-ABD07     TO  W-F-MMAA-CARDEC        
           MOVE  W-F-MMAA-CARDEC(1:2)  TO  W-MES-AUX-CARDEC        
           MOVE  W-F-MMAA-CARDEC(3:2)  TO  W-ANO-AUX-CARDEC        
           IF  W-ANO-AUX-CARDEC  <  50        
             ADD   2000                TO  W-ANO-AUX-CARDEC        
           ELSE        
             ADD   1900                TO  W-ANO-AUX-CARDEC        
           END-IF        
           COMPUTE  W-MESES-TMP-CARDEC =        
                    ((W-ANIO-HOY-CARDEC * 12) + W-MES-HOY-CARDEC)  -        
                    ((W-ANO-AUX-CARDEC  * 12) + W-MES-AUX-CARDEC)        
           MOVE  W-MESES-TMP-CARDEC    TO  W-MESES-APERTURA-CARDEC        
           MOVE  W-ANO-AUX-CARDEC      TO  W-FECHA-APER-AA-CARDEC        
           MOVE  W-MES-AUX-CARDEC      TO  W-FECHA-APER-MM-CARDEC        
      *----------------------------------------------------------------* 
      *                           PLAZO PACTADO                        *
           COMPUTE  W-MESES-OBLIGACION-CARDEC =        
                    ((W-FECHA-CIER-AA-CARDEC * 12) +        
                      W-FECHA-CIER-MM-CARDEC)  -        
                    ((W-FECHA-APER-AA-CARDEC * 12) +        
                      W-FECHA-APER-MM-CARDEC)        
      *----------------------------------------------------------------*        
           MOVE  FEC-NOVEDAD-ABD07     TO  W-F-MMAA-CARDEC        
           MOVE  W-F-MMAA-CARDEC(1:2)  TO  W-MES-AUX-CARDEC        
           MOVE  W-F-MMAA-CARDEC(3:2)  TO  W-ANO-AUX-CARDEC        
           IF  W-ANO-AUX-CARDEC  <  50        
             ADD   2000                TO  W-ANO-AUX-CARDEC        
           ELSE        
             ADD   1900                TO  W-ANO-AUX-CARDEC        
           END-IF        
           COMPUTE  W-MESES-TMP-CARDEC =        
                    ((W-ANIO-HOY-CARDEC * 12) + W-MES-HOY-CARDEC)  -        
                    ((W-ANO-AUX-CARDEC  * 12) + W-MES-AUX-CARDEC)        
           MOVE  W-MESES-TMP-CARDEC    TO  W-MESES-NOVEDAD-CARDEC        
           MOVE  W-ANO-AUX-CARDEC      TO  W-FECHA-NOVE-AA-CARDEC        
           MOVE  W-MES-AUX-CARDEC      TO  W-FECHA-NOVE-MM-CARDEC        
      *----------------------------------------------------------------*        
           COMPUTE  W-DIF-MESES-CARDEC  =        
                    ((W-FECHA-APER-AA-CARDEC * 12) +        
                      W-FECHA-APER-MM-CARDEC) -        
                    ((W-FECHA-CIER-AA-CARDEC * 12) +        
                      W-FECHA-CIER-MM-CARDEC)        
      *----------------------------------------------------------------*        
           IF  TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07)  =  1        
             COMPUTE  W-MESES-EXPERIENCIA-CARDEC  =        
                    ((W-ANIO-HOY-CARDEC      * 12) +        
                      W-MES-HOY-CARDEC) -        
                    ((W-FECHA-APER-AA-CARDEC * 12) +        
                      W-FECHA-APER-MM-CARDEC)        
           ELSE        
             COMPUTE  W-MESES-EXPERIENCIA-CARDEC  =        
                    ((W-FECHA-NOVE-AA-CARDEC * 12) +        
                      W-FECHA-NOVE-MM-CARDEC) -        
                    ((W-FECHA-APER-AA-CARDEC * 12) +        
                      W-FECHA-APER-MM-CARDEC)        
           END-IF.        
      *        
       5000-RECORRER-ENDEUD-CARDEC.        
      ******************************************************************        
      *5000-RECORRER-ENDEUD-CARDEC.        
      *     SE RECORRE LA ESTRUCTURA DE ENDEUDAMIENTO GLOBAL DEL TRIMEST        
      *     MAS RECIENTE AL MAS ANTIGUO        
      ******************************************************************        
            INITIALIZE BDIEMSUP-LLAVE W-FECHA-SUP.                  
            MOVE TIPIDE-CARDEC TO BDIEMSUP-TIP-ID.            
            MOVE NUMIDE-CARDEC TO BDIEMSUP-NUM-ID.             
            MOVE FUNCTION CURRENT-DATE(1:8) TO BDIEMSUP-FECHA(1:8)        
            MOVE 0 TO FINEND-CARDEC.        
            START BDIEMSUP KEY <= BDIEMSUP-LLAVE                     
               INVALID KEY MOVE 1 TO FINEND-CARDEC        
               NOT INVALID KEY         
                  READ BDIEMSUP PREVIOUS RECORD AT END              
                       MOVE 1 TO FINEND-CARDEC        
                  END-READ        
            END-START.    
            PERFORM 5000-ENDEUD-CARDEC UNTIL         
      *        BDIEMSUP-TIP-ID NOT = NUMIDE-CARDEC    OR        
      *        BDIEMSUP-NUM-ID NOT = TIPIDE-CARDEC    OR        
               BDIEMSUP-TIP-ID NOT = TIPIDE-CARDEC    OR        
               BDIEMSUP-NUM-ID NOT = NUMIDE-CARDEC    OR        
               FINEND-CARDEC = 1 .        
            MOVE 1 TO FINEND-CARDEC.        
            PERFORM 5320-ENDEUD-PROCES-CARDEC.        
       5000-RECORRER-CONSUL-CARDEC.        
      ******************************************************************        
      *5000-RECORRER-CONSUL-CARDEC.        
      *     SE RECORRE LA ESTRUCTURA DE CONSULTAS                       
      ******************************************************************        
            INITIALIZE LLAVE-INDEX.        
            MOVE TIPIDE-CARDEC TO TIP-ID-IND.         
            MOVE NUMIDE-CARDEC TO NUM-ID-IND.           
            MOVE 0 TO FINCON-CARDEC.        
            START INDEXADO KEY > LLAVE-INDEX        
               INVALID KEY MOVE 1 TO FINCON-CARDEC        
               NOT INVALID KEY         
                  READ INDEXADO NEXT RECORD WITH IGNORE LOCK              
                       AT END                                            
                       MOVE 1 TO FINCON-CARDEC        
                  END-READ        
            END-START.        
            PERFORM 5000-CONSUL-CARDEC UNTIL         
               TIP-ID-IND NOT = TIPIDE-CARDEC    OR        
               NUM-ID-IND NOT = NUMIDE-CARDEC    OR        
               FINCON-CARDEC   = 1.        
            MOVE 1 TO FINCON-CARDEC.        
            PERFORM 5320-CONSUL-PROCES-CARDEC.        
       5000-RECORRER-IDENTI-CARDEC.        
      ******************************************************************        
      *5000-RECORRER-IDENTI-CARDEC.        
      *     SE RECORRE LA ESTRUCTURA DE LA REGISTRADURIA                
      ******************************************************************        
            PERFORM 5320-IDENTI-CARDEC.        
      *        
       5000-RECORRER-HIBRID-CARDEC.        
      ******************************************************************        
      *5000-RECORRER-HIBRID-CARDEC.        
      *     SE CALCULAN LAS CARACTERSITICAS HIBRIDADS DISENADAS PARA         
      *     SIMPLIFICAR LOS ARBOLES EN MOTOR        
      ******************************************************************        
            MOVE 1 TO I-CARDEC        
            PERFORM UNTIL I-CARDEC > 499 OR         
                         C-EST-HIBRID-CARDEC(I-CARDEC) = SPACES        
                 MOVE ALL "$" TO VAL-VAR-CARDEC        
                 MOVE C-EST-HIBRID-CARDEC(I-CARDEC) TO NOM-VAR-CARDEC        
             EVALUATE C-EST-HIBRID-CARDEC(I-CARDEC)        
                 WHEN "CD99HIB001EX00"        
                      PERFORM 5320-99HIB001EX00-CARDEC        
                      MOVE 99HIB001EX00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                 WHEN "CD99HIB002EX00"        
                      PERFORM 5320-99HIB002EX00-CARDEC        
                      MOVE 99HIB002EX00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                 WHEN "CD99HIB003EX00"        
                      PERFORM 5320-99HIB003EX00-CARDEC        
                      MOVE 99HIB003EX00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC
CQ1224           WHEN "CD99HIB004EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB004EX59-CARDEC                  CIGD004
CQ1224           WHEN "CD99HIB005EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB005EX59-CARDEC                  CIGD004
CQ1224           WHEN "CD99HIB006EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB006EX59-CARDEC                  CIGD004
CQ1224           WHEN "CD99HIB007EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB007EX59-CARDEC                  CIGD004
CQ1224           WHEN "CD99HIB008EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB008EX59-CARDEC                  CIGD004
CQ1224           WHEN "CD99HIB009EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB009EX59-CARDEC                  CIGD004
CQ1224           WHEN "CD99HIB010EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB010EX59-CARDEC                  CIGD004
CQ1224           WHEN "CD99HIB011EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB011EX59-CARDEC                  CIGD004
CQ1224                MOVE 99HIB011EX59      TO VAL13-VAR-CARDEC        CIGD004
CQ1224                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIGD004
CQ1224           WHEN "CD99HIB012EX59"                                  CIGD004
CQ1224                PERFORM 5320-99HIB012EX59-CARDEC                  CIGD004
CQ1224                MOVE 99HIB012EX59      TO VAL13-VAR-CARDEC        CIGD004
CQ1224                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIGD004
CQ1812           WHEN  OTHER                                            DLM0014
CQ1812*** Tabla con solo Valores para no calcular Características.      DLM0014
CQ1812             IF  V-EST-CARACT-CARDEC(01)  NOT  =  SPACES          DLM0014
CQ1812               ADD   1           TO  TOT-VAR-CARACTERIST          DLM0014
CQ1812               MOVE  SPACES      TO  VAL-VAR-CARDEC               DLM0014
CQ1812               MOVE  V-EST-CARACT-CARDEC(TOT-VAR-CARACTERIST)     DLM0014
CQ1812                                 TO  VAL-VAR-CARDEC               DLM0014
CQ1812               IF  VAL-VAR-CARDEC  =  SPACES                      DLM0014
CQ1812                 MOVE  "0"       TO  VAL-VAR-CARDEC               DLM0014
CQ1812               ELSE                                               DLM0014
CQ1812                 MOVE  1         TO  WOR-VAR-CARDEC               DLM0014
CQ1812                 PERFORM UNTIL V-EST-CARACT-CARDEC(TOT-VAR-CARACTEDLM0014
CQ1812-RIST)(WOR-VAR-CARDEC:1) <> " "  OR WOR-VAR-CARDEC > FUNCTION LENGDLM0014
CQ1812-TH(V-EST-CARACT-CARDEC(TOT-VAR-CARACTERIST))                     DLM0014
CQ1812                    ADD  1       TO  WOR-VAR-CARDEC               DLM0014
CQ1812                 END-PERFORM                                      DLM0014
CQ1812                 MOVE  V-EST-CARACT-CARDEC(TOT-VAR-CARACTERIST)(WODLM0014
CQ1812-R-VAR-CARDEC:)                  TO  VAL-VAR-CARDEC               DLM0014
CQ1812               END-IF                                             DLM0014
CQ1812               STRING                                             DLM0014
CQ1812                  BOM-CAR-CARDEC        DELIMITED BY "           "DLM0014
CQ1812                 "["                                              DLM0014
CQ1812                  C-EST-HIBRID-CARDEC(I-CARDEC)  DELIMITED BY " " DLM0014
CQ1812                 "="                             DELIMITED BY SIZEDLM0014
CQ1812                  VAL-VAR-CARDEC                 DELIMITED BY " " DLM0014
CQ1812                 "]"                                              DLM0014
CQ1812                               INTO   BOM-CAR-CARDEC              DLM0014
CQ1812               END-STRING                                         DLM0014
CQ1812             END-IF                                               DLM0014
              END-EVALUATE        
RQ2252        PERFORM 5000-CALCULAR-HIBRID-PROG                         CIG0018              
              ADD 1 TO I-CARDEC        
            END-PERFORM.        
      *----------------------------------------------------------------*        
       5320-99HIB001EX00-CARDEC.        
      *----------------------------------------------------------------*        
           COMPUTE 99HIB001EX00 = 99DEM001TO00 + 99DEM002TO00 +         
                                  99DEM003TO00.        
      *----------------------------------------------------------------*        
       5320-99HIB002EX00-CARDEC.        
      *----------------------------------------------------------------*        
CQ1343     COMPUTE 99HIB002EX00 = 99MOR002TO00 + 99MOR001CT00 +         EHA0006
                                  99MOR004TO00 + 99MOR005TO00 +        
                                  99MOR006TO00 + 99MOR007TO00 +        
                                  99MOR008TO00 + 99MOR016TO00 +        
                                  99MOR009TO00 + 99MOR010TC00.        
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB003EX00-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     COMPUTE 99HIB003EX00 = 99MOR011TO00 + 99MOR013TO00 +         CIGD004
CQ1224                            99MOR014TO00 + 99MOR015TO00.          CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB004EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     COMPUTE 99HIB004EX59 = 99END004HP00 + 99END013EX59.          CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB005EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     COMPUTE 99HIB005EX59 = 99END004TO09 + 99END014EX59.          CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB006EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     COMPUTE 99HIB006EX59 = 99END004TO10 + 99END015EX59.          CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB007EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     COMPUTE 99HIB007EX59 = 99END004TO11 + 99END016EX59.          CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB008EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1445     COMPUTE 99HIB008EX59 =                                       EHA0008
CQ1445                     ((99END004CO00 + 99END017EX59) * 0.03).      EHA0008
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB009EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     COMPUTE 99HIB009EX59 = ((99END004CO07 + 99END018EX59) * 0.5).CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB010EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     IF FINCRE-CARDEC NOT = 0                                     CIGD004
CQ1224        EVALUATE TRUE                                             CIGD004
CQ1224          WHEN 99END005TC00 < 1000                                CIGD004
CQ1224               COMPUTE 99HIB010EX59 = 99END005TC00 * 0.07         CIGD004
CQ1224          WHEN 99END005TC00 >= 1000 AND 99END005TC00 <= 5000      CIGD004
CQ1224               COMPUTE 99HIB010EX59 = 99END005TC00 * 0.05         CIGD004
CQ1224          WHEN 99END005TC00 > 5000                                CIGD004
CQ1224               COMPUTE 99HIB010EX59 = 99END005TC00 * 0.03         CIGD004
CQ1224        END-EVALUATE                                              CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB011EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     COMPUTE W-INGR-TOT-99HIB011EX59 =                            CIGD004
CQ1224                          W-INGRESOS-SF-99HIB011EX59         +    CIGD004
CQ1224                          (W-INGRESOS-SV-99HIB011EX59 * 0.7) +    CIGD004
CQ1224                          (W-OTROS-ING-99HIB011EX59   * 0.7)      CIGD004
AL1224     IF KTE-FORMULARIO-CARDEC = "0059"                            EHA0010
AL1224        IF W-INGR-TOT-99HIB011EX59 <= W-INGR-SIS-99HIB011EX59     EHA0010
AL1224           MOVE W-INGR-SIS-99HIB011EX59 TO                        EHA0010
AL1224                W-INGR-FIN-99HIB011EX59                           EHA0010
AL1224        ELSE                                                      EHA0010
AL1224           MOVE 1 TO FACTURA-QUANTO-CARDEC                        EHA0010
AL1224* SI VALOR MÁXIMO DE QUANTO = INGRESO SISTEMA                     EHA0010
AL1224           IF W-INGR-SIS-99HIB011EX59 = CSCOPS62 *> QUANTOSUP     EHA0010
AL1224              MOVE W-INGR-SIS-99HIB011EX59 TO                     EHA0010
AL1224                   W-INGR-FIN-99HIB011EX59                        EHA0010
AL1224           ELSE                                                   EHA0010
AL1224* SI VALOR MÁXIMO DE QUANTO > INGRESO SISTEMA                     EHA0010
AL1224            IF W-INGR-SIS-99HIB011EX59 < CSCOPS62 *> QUANTOSUP    EHA0010
AL1224******** SI INGRESO TOTAL <= VALOR MÁXIMO QUANTO                  EHA0010
AL1224             IF W-INGR-TOT-99HIB011EX59 <= CSCOPS62               EHA0010
AL1224                MOVE W-INGR-TOT-99HIB011EX59 TO                   EHA0010
AL1224                     W-INGR-FIN-99HIB011EX59                      EHA0010
AL1224             ELSE                                                 EHA0010
AL1224******** SI INGRESO TOTAL > VALOR MÁXIMO QUANTO                   EHA0010
MD1224*             IF W-INGR-TOT-99HIB011EX59 > CSCOPS62               CIG0013
AL1224                 MOVE CSCOPS62 TO W-INGR-FIN-99HIB011EX59         EHA0010
MD1224*             ELSE                                                CIG0013
MD1224             END-IF                                               CIG0013
AL1224******** SI VALOR MÁXIMO DE QUANTO < INGRESO SISTEMA              EHA0010
MD1224*              IF W-INGR-SIS-99HIB011EX59 < CSCOPS62 *> QUANTOSUP CIG0013
MD1224            ELSE                                                  CIG0013
MD1224               IF W-INGR-SIS-99HIB011EX59 > CSCOPS62 *> QUANTOSUP CIG0013
AL1224                  COMPUTE DIF-SIS-TOT-99HIB011EX59 =              EHA0010
AL1224                  ((W-INGR-TOT-99HIB011EX59 -                     EHA0010
AL1224                    W-INGR-SIS-99HIB011EX59) /                    EHA0010
AL1224                    W-INGR-SIS-99HIB011EX59) * 100                EHA0010
AL1224                  IF DIF-SIS-TOT-99HIB011EX59 > 75                EHA0010
RQ1224*                    IF CSCO0067 >= 500 AND                       CIG0014
RQ1224*                       CSCO0067 <= 600                           CIG0014
RQ1224                     IF CSCO0067 >= 600 AND                       CIG0014
RQ1224                        CSCO0067 <= 700                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.40            EHA0010
AL1224                     END-IF                                       EHA0010
RQ1224*                    IF  CSCO0067 >= 601 AND                      CIG0014
RQ1224*                        CSCO0067 <= 700                          CIG0014
RQ1224                     IF  CSCO0067 >= 701 AND                      CIG0014
RQ1224                         CSCO0067 <= 800                          CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.50            EHA0010
AL1224                     END-IF                                       EHA0010
RQ1224*                    IF CSCO0067 >= 701 AND                       CIG0014
RQ1224*                       CSCO0067 <= 950                           CIG0014
RQ1224                     IF CSCO0067 >= 801 AND                       CIG0014
RQ1224                        CSCO0067 <= 950                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.60            EHA0010
AL1224                     END-IF                                       EHA0010
AL1224                  END-IF                                          EHA0010
AL1224*                                                                 EHA0010
AL1224                  IF DIF-SIS-TOT-99HIB011EX59 > 50 AND            EHA0010
AL1224                     DIF-SIS-TOT-99HIB011EX59 <= 75               EHA0010
RQ1224*                    IF CSCO0067 >= 500 AND                       CIG0014
RQ1224*                       CSCO0067 <= 600                           CIG0014
RQ1224                     IF CSCO0067 >= 600 AND                       CIG0014
RQ1224                        CSCO0067 <= 700                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.50            EHA0010
AL1224                     END-IF                                       EHA0010
RQ1224*                    IF CSCO0067 >= 601 AND                       CIG0014
RQ1224*                       CSCO0067 <= 700                           CIG0014
RQ1224                     IF CSCO0067 >= 701 AND                       CIG0014
RQ1224                        CSCO0067 <= 800                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.60            EHA0010
AL1224                     END-IF                                       EHA0010
RQ1224*                    IF CSCO0067 >= 701 AND                       CIG0014
RQ1224*                       CSCO0067 <= 950                           CIG0014
RQ1224                     IF CSCO0067 >= 801 AND                       CIG0014
RQ1224                        CSCO0067 <= 950                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.70            EHA0010
AL1224                     END-IF                                       EHA0010
AL1224                  END-IF                                          EHA0010
AL1224*                                                                 EHA0010
AL1224                  IF DIF-SIS-TOT-99HIB011EX59 > 20 AND            EHA0010
AL1224                     DIF-SIS-TOT-99HIB011EX59 <= 50               EHA0010
RQ1224*                    IF CSCO0067 >= 500 AND                       CIG0014
RQ1224*                       CSCO0067 <= 600                           CIG0014
RQ1224                     IF CSCO0067 >= 600 AND                       CIG0014
RQ1224                        CSCO0067 <= 700                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.60            EHA0010
AL1224                     END-IF                                       EHA0010
RQ1224*                    IF CSCO0067 >= 601 AND                       CIG0014
RQ1224*                       CSCO0067 <= 700                           CIG0014
RQ1224                     IF CSCO0067 >= 701 AND                       CIG0014
RQ1224                        CSCO0067 <= 800                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.70            EHA0010
AL1224                     END-IF                                       EHA0010
RQ1224*                    IF CSCO0067 >= 701 AND                       CIG0014
RQ1224*                       CSCO0067 <= 950                           CIG0014
RQ1224                     IF CSCO0067 >= 801 AND                       CIG0014
RQ1224                        CSCO0067 <= 950                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.80            EHA0010
AL1224                     END-IF                                       EHA0010
AL1224                  END-IF                                          EHA0010
AL1224*                                                                 EHA0010
AL1224                  IF DIF-SIS-TOT-99HIB011EX59 >= 0 AND            EHA0010
AL1224                     DIF-SIS-TOT-99HIB011EX59 <= 20               EHA0010
RQ1224*                    IF CSCO0067 >= 500 AND                       CIG0014
RQ1224*                       CSCO0067 <= 600                           CIG0014
RQ1224                     IF CSCO0067 >= 600 AND                       CIG0014
RQ1224                        CSCO0067 <= 700                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.70            EHA0010
AL1224                     END-IF                                       EHA0010
RQ1224*                    IF CSCO0067 >= 601 AND                       CIG0014
RQ1224*                       CSCO0067 <= 700                           CIG0014
RQ1224                     IF CSCO0067 >= 701 AND                       CIG0014
RQ1224                        CSCO0067 <= 800                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 0.80            EHA0010
AL1224                     END-IF                                       EHA0010
RQ1224*                    IF CSCO0067 >= 701 AND                       CIG0014
RQ1224*                       CSCO0067 <= 950                           CIG0014
RQ1224                     IF CSCO0067 >= 801 AND                       CIG0014
RQ1224                        CSCO0067 <= 950                           CIG0014
AL1224                        COMPUTE W-INGR-FIN-99HIB011EX59 =         EHA0010
AL1224                        W-INGR-TOT-99HIB011EX59 * 1               EHA0010
AL1224                     END-IF                                       EHA0010
AL1224                  END-IF                                          EHA0010
AL1224*                                                                 EHA0010
AL1224               END-IF                                             EHA0010
MD1224*             END-IF                                              CIG0013
MD1224*            END-IF                                               CIG0013
AL1224            END-IF                                                EHA0010
AL1224           END-IF                                                 EHA0010
AL1224        END-IF                                                    EHA0010
CQ1224        COMPUTE W-GASTOS-FAM-99HIB011EX59 =                       CIGD004
CQ1224                           W-INGR-FIN-99HIB011EX59 * 0.25         CIGD004
AL1224* CALCULO DE INGRESO NETO DISPONIBLE                              EHA0010
AL1224        COMPUTE W-INGR-NET-99HIB011EX59 =                         EHA0010
AL1224                            (W-INGR-FIN-99HIB011EX59 * 0.85) -    EHA0010
AL1224           (   W-GASTOS-FAM-99HIB011EX59   +  99HIB004EX59 +      EHA0010
AL1224               99HIB005EX59 + 99HIB006EX59 +  99HIB007EX59 +      EHA0010
AL1224               99HIB008EX59 + 99HIB009EX59 +  99HIB010EX59 )      EHA0010
AL1224        IF W-INGR-NET-99HIB011EX59 > 0                            EHA0010
AL1224           MOVE W-INGR-NET-99HIB011EX59 TO  99HIB011EX59          EHA0010
AL1224        ELSE                                                      EHA0010
AL1224           MOVE 0                       TO  99HIB011EX59          EHA0010
AL1224        END-IF                                                    EHA0010
AL1224     ELSE                                                         EHA0010
CQ1224     COMPUTE W-GASTOS-FAM-99HIB011EX59 =                          CIGD004
CQ1224                           W-INGR-TOT-99HIB011EX59 * 0.25         CIGD004
CQ1224     COMPUTE W-INGR-NET-99HIB011EX59 =                            CIGD004 
CQ1224                            (W-INGR-TOT-99HIB011EX59 * 0.85) -    CIGD004
CQ1224           (   W-GASTOS-FAM-99HIB011EX59   +  99HIB004EX59 +      CIGD004
CQ1224               99HIB005EX59 + 99HIB006EX59 +  99HIB007EX59 +      CIGD004
CQ1224               99HIB008EX59 + 99HIB009EX59 +  99HIB010EX59 )      CIGD004
CQ1224     IF W-INGR-NET-99HIB011EX59 > 0                               CIGD004 
CQ1224        MOVE W-INGR-NET-99HIB011EX59 TO  99HIB011EX59             CIGD004
CQ1224     ELSE                                                         CIGD004
CQ1224        MOVE 0                       TO  99HIB011EX59             CIGD004
AL1224     END-IF                                                       EHA0010
CQ1224     END-IF.                                                      CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99HIB012EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* 99HIB012EX59 SE DEFINE COMO EL MINIMO (CUPO MAXIMO, CUPO        CIGD004
CQ1224* ESTIMADO, LIMITES SEGUN INGRESOS)                               CIGD004
CQ1224     COMPUTE W-CUPO-ESTIM-99HIB012EX59 = 99HIB011EX59 * 14.99     CIGD004
CQ1224* APLICAR REGLAS DE REDONDEO DEL CUPO ESTIMADO                    CIGD004
CQ1224* W-TIP-PROD-99HIB012EX59 = 1 TDC                                 CIGD004
CQ1224* W-TIP-PROD-99HIB012EX59 = 2 CREDIAGIL                           CIGD004
CQ1224     IF W-CUPO-ESTIM-99HIB012EX59 < 5000                          CIGD004
CQ1224        IF W-DECENAS-MIL < 5                                      CIGD004
CQ1224           MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL                 CIGD004
CQ1224        ELSE                                                      CIGD004
CQ1224           MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL                 CIGD004
CQ1224           ADD 100 TO W-CUPO-ESTIM-99HIB012EX59                   CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224     ELSE                                                         CIGD004
CQ1224        EVALUATE W-TIP-PROD-99HIB012EX59                          CIGD004
CQ1224           WHEN 1                                                 CIGD004
CQ1224              EVALUATE TRUE                                       CIGD004
CQ1224                 WHEN W-CUPO-ESTIM-99HIB012EX59 < 10000           CIGD004
CQ1224* REDONDEO EN 200.000                                             CIGD004
CQ1224                    IF W-CENTENAS-MIL = 0 OR 2 OR 4 OR 6 OR 8     CIGD004
CQ1224                       MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL     CIGD004
CQ1224                    ELSE                                          CIGD004
CQ1224                       MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL     CIGD004
CQ1224                       ADD 100 TO W-CUPO-ESTIM-99HIB012EX59       CIGD004
CQ1224                    END-IF                                        CIGD004
CQ1224                 WHEN W-CUPO-ESTIM-99HIB012EX59 >= 10000 AND      CIGD004
CQ1224                      W-CUPO-ESTIM-99HIB012EX59 < 30000           CIGD004
CQ1224* REDONDEO EN 500.000                                             CIGD004
CQ1224                    IF W-CENTENAS-MIL < 5                         CIGD004
CQ1224                       IF W-CENTENAS-MIL <= 2 AND                 CIGD004
CQ1224                          W-DECENAS-MIL < 5                       CIGD004
CQ1224                          MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL  CIGD004
CQ1224                                    W-CENTENAS-MIL                CIGD004
CQ1224                       ELSE                                       CIGD004
CQ1224                          MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL  CIGD004
CQ1224                                    W-CENTENAS-MIL                CIGD004
CQ1224                          ADD 500 TO W-CUPO-ESTIM-99HIB012EX59    CIGD004
CQ1224                       END-IF                                     CIGD004
CQ1224                    ELSE                                          CIGD004
CQ1224                       IF W-CENTENAS-MIL <= 7 AND                 CIGD004
CQ1224                          W-DECENAS-MIL < 5                       CIGD004
CQ1224                          MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL  CIGD004
CQ1224                                    W-CENTENAS-MIL                CIGD004
CQ1224                          ADD 500 TO W-CUPO-ESTIM-99HIB012EX59    CIGD004
CQ1224                       ELSE                                       CIGD004
CQ1224                          MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL  CIGD004
CQ1224                                    W-CENTENAS-MIL                CIGD004
CQ1224                          ADD 1000 TO W-CUPO-ESTIM-99HIB012EX59   CIGD004
CQ1224                       END-IF                                     CIGD004
CQ1224                    END-IF                                        CIGD004
CQ1224                 WHEN W-CUPO-ESTIM-99HIB012EX59 >= 30000 AND      CIGD004
CQ1224                      W-CUPO-ESTIM-99HIB012EX59 < 40000           CIGD004
CQ1224* REDONDEO EN 1.000.000                                           CIGD004
CQ1224                    IF W-CENTENAS-MIL < 5                         CIGD004
CQ1224                      MOVE 0  TO W-DECENAS-MIL W-UNIDADES-MIL     CIGD004
CQ1224                                 W-CENTENAS-MIL                   CIGD004
CQ1224                    ELSE                                          CIGD004
CQ1224                      MOVE 0  TO W-DECENAS-MIL W-UNIDADES-MIL     CIGD004
CQ1224                                 W-CENTENAS-MIL                   CIGD004
CQ1224                      ADD 1000 TO W-CUPO-ESTIM-99HIB012EX59       CIGD004
CQ1224                    END-IF                                        CIGD004
CQ1224              END-EVALUATE                                        CIGD004
CQ1224           WHEN 2                                                 CIGD004
CQ1224*          CREDIAGIL MAYOR A 5.000.00 SE SUMA DE 500 EN 500 MIL   CIGD004
CQ1224              IF W-CENTENAS-MIL < 5                               CIGD004
CQ1224                 MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL           CIGD004
CQ1224                           W-CENTENAS-MIL                         CIGD004
CQ1224              ELSE                                                CIGD004
CQ1224                 MOVE 0 TO W-DECENAS-MIL W-UNIDADES-MIL           CIGD004
CQ1224                           W-CENTENAS-MIL                         CIGD004
CQ1224                 ADD 1000 TO W-CUPO-ESTIM-99HIB012EX59            CIGD004
CQ1224              END-IF                                              CIGD004
CQ1224        END-EVALUATE                                              CIGD004
CQ1224     END-IF                                                       CIGD004
CQ1224* LIMITES SEGUN INGRESOS                                          CIGD004
AL1224     IF KTE-FORMULARIO-CARDEC = "0059"                            EHA0010
AL1224        EVALUATE TRUE                                             EHA0010
AJ1224           WHEN W-INGR-FIN-99HIB011EX59 <= 500                    CIG0016
AJ1224               COMPUTE W-LIMS-INGR-99HIB012EX59 =                 CIG0016
AJ1224                         W-INGR-FIN-99HIB011EX59 * 0.6            CIG0016
AJ1224           WHEN W-INGR-FIN-99HIB011EX59 > 500 AND                 CIG0016
AJ1224                W-INGR-FIN-99HIB011EX59 <= 1000                   CIG0016
AJ1224                MOVE W-INGR-FIN-99HIB011EX59 TO                   CIG0016
AJ1224                         W-LIMS-INGR-99HIB012EX59                 CIG0016
AJ1224           WHEN W-INGR-FIN-99HIB011EX59 > 1000 AND                CIG0016
AJ1224                W-INGR-FIN-99HIB011EX59 <= 2000                   CIG0016
AJ1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                CIG0016
AJ1224                         W-INGR-FIN-99HIB011EX59 * 1.5            CIG0016
AJ1224           WHEN W-INGR-FIN-99HIB011EX59 > 2000 AND                CIG0016
AJ1224                W-INGR-FIN-99HIB011EX59 <= 3000                   CIG0016
AJ1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                CIG0016
AJ1224                         W-INGR-FIN-99HIB011EX59 * 2              CIG0016
AJ1224           WHEN W-INGR-FIN-99HIB011EX59 > 3000 AND                CIG0016
AJ1224                W-INGR-FIN-99HIB011EX59 <= 4000                   CIG0016
AJ1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                CIG0016
AJ1224                         W-INGR-FIN-99HIB011EX59 * 3              CIG0016
AJ1224           WHEN W-INGR-FIN-99HIB011EX59 > 4000 AND                CIG0016
AJ1224                W-INGR-FIN-99HIB011EX59 <= 5000                   CIG0016
AJ1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                CIG0016
AJ1224                         W-INGR-FIN-99HIB011EX59 * 3.5            CIG0016
AJ1224           WHEN W-INGR-FIN-99HIB011EX59 > 5000                    CIG0016
AJ1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                CIG0016
AJ1224                         W-INGR-FIN-99HIB011EX59 * 4              CIG0016
AL1224        END-EVALUATE                                              EHA0010
AL1224     ELSE                                                         EHA0010
AL1224        EVALUATE TRUE                                             EHA0010
AL1224           WHEN W-INGR-TOT-99HIB011EX59 <= 500                    EHA0010
AL1224               COMPUTE W-LIMS-INGR-99HIB012EX59 =                 EHA0010
AL1224                         W-INGR-TOT-99HIB011EX59 * 0.6            EHA0010
AL1224           WHEN W-INGR-TOT-99HIB011EX59 > 500 AND                 EHA0010
AL1224                W-INGR-TOT-99HIB011EX59 <= 1000                   EHA0010
AL1224                MOVE W-INGR-TOT-99HIB011EX59 TO                   EHA0010
AL1224                         W-LIMS-INGR-99HIB012EX59                 EHA0010
AL1224           WHEN W-INGR-TOT-99HIB011EX59 > 1000 AND                EHA0010
AL1224                W-INGR-TOT-99HIB011EX59 <= 2000                   EHA0010
AL1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                EHA0010
AL1224                         W-INGR-TOT-99HIB011EX59 * 1.5            EHA0010
AL1224           WHEN W-INGR-TOT-99HIB011EX59 > 2000 AND                EHA0010
AL1224                W-INGR-TOT-99HIB011EX59 <= 3000                   EHA0010
AL1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                EHA0010
AL1224                         W-INGR-TOT-99HIB011EX59 * 2              EHA0010
AL1224           WHEN W-INGR-TOT-99HIB011EX59 > 3000 AND                EHA0010
AL1224                W-INGR-TOT-99HIB011EX59 <= 4000                   EHA0010
AL1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                EHA0010
AL1224                         W-INGR-TOT-99HIB011EX59 * 3              EHA0010
AL1224           WHEN W-INGR-TOT-99HIB011EX59 > 4000 AND                EHA0010
AL1224                W-INGR-TOT-99HIB011EX59 <= 5000                   EHA0010
AL1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                EHA0010
AL1224                         W-INGR-TOT-99HIB011EX59 * 3.5            EHA0010
AL1224           WHEN W-INGR-TOT-99HIB011EX59 > 5000                    EHA0010
AL1224                COMPUTE W-LIMS-INGR-99HIB012EX59 =                EHA0010
AL1224                         W-INGR-TOT-99HIB011EX59 * 4              EHA0010
AL1224        END-EVALUATE                                              EHA0010
AL1224     END-IF                                                       EHA0010
CQ1224* EL LIMITE MAXIMO DEL CUPO ES 40000                              CIGD004
CQ1224     MOVE 40000 TO 99HIB012EX59                                   CIGD004
CQ1224     IF W-LIMS-INGR-99HIB012EX59 < 99HIB012EX59                   CIGD004
CQ1224        MOVE W-LIMS-INGR-99HIB012EX59 TO 99HIB012EX59             CIGD004
CQ1224     END-IF                                                       CIGD004
CQ1224     IF W-CUPO-ESTIM-99HIB012EX59 < 99HIB012EX59                  CIGD004
CQ1224        MOVE W-CUPO-ESTIM-99HIB012EX59 TO 99HIB012EX59            CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1224 5000-INIVAR-CARDEC.                                              CIGD004
REMARK**********************************************************************
REMARK*5000-TRU-INI-VAR.         
REMARK* SE INICIALIZAN LAS VARIABLES INTERNAS, SE ESTABLECE LA FECHA DE LA *
REMARK* LA CORRIDA (LA ACTUAL) Y LA FECHA PARA EL ULTIMO TRIMESTRE DE      *
REMARK* ENDEUDAMIENTO GLOBAL . TODAS LAS CARACTERISTICAS CON VALOR 999 SON *
REMARK* INICIALIZADAS AQUI.
REMARK**********************************************************************
           INITIALIZE CARACTERISTICAS-CARDEC.
CQ1862     INITIALIZE BOM-CAR-CARDEC.                                   DLM0011
CQ1343     INITIALIZE VARIABLES-TRABAJO-CARDEC.                         EHA0006
       5000-CTACOR-CARDEC.             
REMARK**********************************************************************
REMARK*5000-CTACOR-CARDEC.                                                 *
REMARK* SE REALIZA EL RECORRIDO POR TODAS LAS CUENTAS BANCARIAS  DE LA     *
REMARK* PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS CARACTERISTICAS        *
REMARK**********************************************************************
            MOVE 0 TO VALIDA-CARDEC.        
            IF IND-BLOQUEO-ABD06 = 0           
               MOVE COD-SUS-ABD06 TO COD-SUSCRIP-ABD02          
               READ SUSCRIPTOR WITH IGNORE LOCK                         
                  NOT INVALID KEY         
                      IF ESTADO-ABD02 = 1         
                         MOVE 1 TO VALIDA-CARDEC        
                      END-IF                                   
               END-READ                                   
            END-IF.        
           IF VALIDA-CARDEC = 1
RQ1648        PERFORM 6100-CALC-FE-CTACTE-CARDEC                        CIG0012
              PERFORM 5320-CTACOR-PROCES-CARDEC.        
      *  SE DETERMINA SI SE TIENE EN CUENTA O NO BBVA        
           IF IND-NO-BBVA-CARDEC = 1        
              MOVE 1 TO SW-ELIMINA-BBVA-LEEMSTRS        
           END-IF        
           PERFORM  3000-LEE-ICMCHK-SECUENCIAL                   
           IF  SW-LECTURA-MAESTROS  =  1                          
             MOVE 1 TO FINCHK-CARDEC           
           END-IF.                            
       5000-CREDIT-CARDEC.               
REMARK**********************************************************************
REMARK*5000-CREDIT-CARDEC.
REMARK* SE REALIZA EL RECORRIDO POR TODAS LAS CUENTAS DE CARTERA DE LA     *
REMARK* PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS CARACTERISTICAS MIRANDO*
REMARK* QUE EL SUSCRIPTOR NO ESTE BLOQUEADO Y UBICANDO EL REGISTRO         *
REMARK**********************************************************************
            MOVE 0 TO VALIDA-CARDEC.        
            IF IND-BLOQUEO-ABD07 = 0
RQ2902* SE INCLUYEN REGISTROS FRENADOS EN PROGRAMA ICGS63
RQ2902         OR (NOMBRE-PROGRAMA = "ICGS63" AND 
RQ2902         IND-BLOQUEO-ABD07 = 7 AND CONSECUTIVO-ABD07 <> 5)
               MOVE COD-SUS-ABD07 TO COD-SUSCRIP-ABD02          
               READ SUSCRIPTOR  WITH IGNORE LOCK        
                  NOT INVALID KEY         
                      IF ESTADO-ABD02 = 1         
                         MOVE 1 TO VALIDA-CARDEC        
                      END-IF                                   
               END-READ                                   
            END-IF.        
           IF VALIDA-CARDEC = 1         
      * SE INCLUYE RUTINA PARA CAMBIOS DE CUENTAS        
              MOVE  COD-CTA-ABD07 TO  W-CTA-BDCUE        
              PERFORM 0300-EVALUAR-PRODUCTO-CARDEC        
              MOVE ZEROS  TO  SW-CODEUDOR        
              MOVE  NUM-CTA-ABD07    TO  TEM-NRO-CTA        
              IF GARANTE-ABD07 >  0        
                 MOVE  1             TO  SW-CODEUDOR        
              ELSE                                              
                 IF TEM-NRO-CTA-C17 = "C" OR "c"                
                    MOVE  1          TO  SW-CODEUDOR            
                 END-IF                                         
              END-IF        
              PERFORM 32000-PROCESAR-VALORES        
              PERFORM 33000-PROCESAR-BDACUE        
      * SE CARGA EL VECTOR DE COMPORTAMIENTO PARA MORAS HISTORICAS        
              PERFORM  7500-ANALIZA-VECTOR-HISTORICO        
              MOVE  VECTOR-S  TO  W-MORAS-HISTORY-V-CARDEC        
              PERFORM 5320-CREDIT-PROCES-CARDEC         
           END-IF.        
      *  SE DETERMINA SI SE TIENE EN CUENTA O NO BBVA        
           IF IND-NO-BBVA-CARDEC = 1        
              MOVE 1 TO SW-ELIMINA-BBVA-LEEMSTRS        
           END-IF        
           PERFORM  1000-LEE-ICMCRE-SECUENCIAL                 
           IF  SW-LECTURA-MAESTROS  =  1                      
             MOVE 1 TO FINCRE-CARDEC        
           END-IF.                                          
       5000-ENDEUD-CARDEC.             
REMARK**********************************************************************
REMARK*5000-ENDEUD-CARDE.                                                  *
REMARK* SE REALIZA EL RECORRIDO POR TODAS LAS CUENTAS DE ENDEUDAMIENTO DEL *
REMARK* ULTIMO TRIMESTRE A LA PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS  *
REMARK* CARACTERISTICAS                                                    *
REMARK**********************************************************************
            IF BDIEMSUP-IND-BLOQ <> 1        
               AND BDIEMSUP-FECHA > 0             
               PERFORM 5320-ENDEUD-PROCES-CARDEC           
            END-IF.                                       
            READ BDIEMSUP PREVIOUS RECORD AT END             
                 MOVE 1 TO FINEND-CARDEC        
            END-READ.        
       5000-CONSUL-CARDEC.          
REMARK**********************************************************************
REMARK*5000-CONSUL-CARDEC.   
REMARK* SE REALIZA EL RECORRIDO POR TODAS LAS CONSULTAS REALIZADAS A LA    *
REMARK* PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS CARACTERISTICAS        *
REMARK**********************************************************************
           PERFORM 5320-CONSUL-PROCES-CARDEC.        
           READ INDEXADO NEXT RECORD WITH IGNORE LOCK                
                AT END                                               
                MOVE 1 TO FINCON-CARDEC        
           END-READ.        
       5320-IDENTI-CARDEC.        
REMARK**********************************************************************
REMARK*5320-IDENTI-CARDEC.                                                 *
REMARK* SE REALIZA EL ACCESO AL REGISTRO DE DATOS PERSONALES DE LA         *
REMARK* PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS CARACTERISTICAS        *
REMARK**********************************************************************
               INITIALIZE  REG-BDIIREGI        
               MOVE TIPIDE-CARDEC TO TIP-IDE-BDIIVIDE             
               MOVE NUMIDE-CARDEC TO NUM-IDE-BDIIVIDE            
               PERFORM 80100-VALIDAR-IDENTIFICACION             
               IF SW-ID-BDIIVIDE = 0                           
                  EVALUATE TIPIDE-CARDEC        
                     WHEN 1        
                       PERFORM 5320-NATURAL-PROCES-CARDEC        
                     WHEN 2        
                       PERFORM 5320-NIT-PROCES-CARDEC        
                     WHEN 3        
                       PERFORM 5320-NIT-PROCES-CARDEC        
                     WHEN 4
                       PERFORM 5320-NATURAL-PROCES-CARDEC
      *                PERFORM 5320-EXTRANJERO-PROCES-CARDEC        
                     WHEN ANY         
                       PERFORM 5320-NOHAYIDE-PROCES-CARDEC        
                  END-EVALUATE        
               ELSE        
                  PERFORM 5320-NOHAYIDE-PROCES-CARDEC        
               END-IF.        
       5320-CTACOR-PROCES-CARDEC.        
           MOVE 1 TO I-CARDEC        
CQ1812     MOVE  0                     TO  SW-UNA-VEZ-MAESTRO           DLM0014
           PERFORM UNTIL I-CARDEC > 499 OR         
                         C-EST-CTACOR-CARDEC(I-CARDEC) = SPACES        
              IF FINCHK-CARDEC = 1        
                 MOVE ALL "$" TO VAL-VAR-CARDEC        
                 MOVE C-EST-CTACOR-CARDEC(I-CARDEC) TO NOM-VAR-CARDEC        
              END-IF        
              EVALUATE C-EST-CTACOR-CARDEC(I-CARDEC)        
                 WHEN "CD99DEM002TO00"        
                   IF FINCHK-CARDEC = 0        
                      PERFORM 5320-99DEM002TO00-CARDEC        
                   ELSE        
                      MOVE 99DEM002TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF        
CQ1343           WHEN "CD99DEM008TO00"                                  EHA0006
CQ1343             IF FINCHK-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99DEM008TO00-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                PERFORM 5320-99DEM008TO00-CARDEC                  EHA0006
CQ1343                MOVE 99DEM008TO00      TO VAL3-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
CQ1343           WHEN "CD99MOR001TO00"                                  EHA0006
CQ1343             IF  FINCHK-CARDEC = 0                                EHA0006
CQ1343               PERFORM 5320-99MOR001TO00-CARDEC                   EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343               MOVE  99MOR001TO00 TO VAL5-VAR-CARDEC              EHA0006
CQ1343               PERFORM 5400-ARMAR-BOM-CAR-CARDEC                  EHA0006
CQ1343             END-IF                                               EHA0006
CQ1343           WHEN "CD99MOR001CT00"                                  EHA0006
                   IF FINCHK-CARDEC = 0        
CQ1343                PERFORM 5320-99MOR001CT00-CARDEC                  EHA0006
                   ELSE        
CQ1343                MOVE 99MOR001CT00      TO VAL5-VAR-CARDEC         EHA0006
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF        
                 WHEN "CD99MOR002TO00"        
                   IF FINCHK-CARDEC = 0        
                      PERFORM 5320-99MOR002TO00-CARDEC        
                   ELSE        
                      MOVE 99MOR002TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
RQ2212           WHEN "CD99MOR002CT00"                                  CIG0020
RQ2212             IF FINCHK-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR002CT00-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR002CT00      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
RQ2212           WHEN "CD99MOR002AH00"                                  CIG0020
RQ2212             IF FINCHK-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR002AH00-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR002AH00      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
RQ1648           WHEN "CD99EXP001CT00"                                  CIG0012
RQ1648             IF FINCHK-CARDEC = 0                                 CIG0012
RQ1648                PERFORM 5320-99EXP001CT00-CARDEC                  CIG0012
RQ1648             ELSE                                                 CIG0012
RQ1648                MOVE 99EXP001CT00      TO VAL5-VAR-CARDEC         CIG0012
RQ1648                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0012
RQ1648             END-IF                                               CIG0012
RQ1648           WHEN "CD99NUM005CT00"                                  CIG0012
RQ1648             IF FINCHK-CARDEC = 0                                 CIG0012
RQ1648                PERFORM 5320-99NUM005CT00-CARDEC                  CIG0012
RQ1648             ELSE                                                 CIG0012
RQ1648                MOVE 99NUM005CT00      TO VAL5-VAR-CARDEC         CIG0012
RQ1648                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0012
RQ1648             END-IF                                               CIG0012
                 WHEN "CCOR0DES"        
                   IF FINCHK-CARDEC = 0        
                      PERFORM 5300-PROCESE-REG-CHECK-SCODRU        
                   END-IF        
                 WHEN ANY         
CQ1812             MOVE  1             TO  ERR-EST-CTACOR-CARDEC        DLM0014
              END-EVALUATE        
RQ2252        PERFORM  5000-CALCULAR-CTACTE-PROG                        CIG0018
              ADD 1 TO I-CARDEC        
           END-PERFORM.        
CQ1812     IF  SW-UNA-VEZ-MAESTRO  =  1                                 DLM0014
CQ1812       MOVE  1                   TO  FINCHK-CARDEC                DLM0014
CQ1812     END-IF.                                                      DLM0014
CQ1812*                                                                 DLM0014
      *----------------------------------------------------------------*        
       5320-99DEM002TO00-CARDEC.        
      *----------------------------------------------------------------*        
           IF ADJETIVO-ABD06 > ZEROS        
              ADD   1   TO  99DEM002TO00        
CQ1343     END-IF.                                                      EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR001TO00-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343* SE ESTABLECE EL NUMERO DE CTAS CANCELADAS MAL MANEJO            EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF  FINCRE-CARDEC = 0                                        EHA0006
CQ1343       IF SW-CODEUDOR = ZEROS                                     EHA0006
CQ1343         IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 08            EHA0006
CQ1343           ADD   1               TO  99MOR001TO00                 EHA0006
CQ1343         END-IF                                                   EHA0006
CQ1343       END-IF                                                     EHA0006
CQ1343     ELSE                                                         EHA0006
CQ1343       IF FINCHK-CARDEC = 0                                       EHA0006
CQ1343         IF TAB-NOV-CTAC-CODINT(NOV-REPORT-ABD06) = 31            EHA0006
CQ1343           ADD   1               TO  99MOR001TO00                 EHA0006
CQ1343         END-IF                                                   EHA0006
CQ1343       END-IF                                                     EHA0006
CQ1343     END-IF.                                                      EHA0006
      *----------------------------------------------------------------*        
CQ1343 5320-99MOR001CT00-CARDEC.                                        EHA0006
      *----------------------------------------------------------------*        
      * SE ESTABLECE EL NUMERO DE CTAS CTES CANCELADAS MAL MANEJO        
      *----------------------------------------------------------------*        
           IF TAB-NOV-CTAC-CODINT(NOV-REPORT-ABD06) = 31        
CQ1343        ADD   1      TO  99MOR001CT00                             EHA0006
           END-IF.        
      *----------------------------------------------------------------*        
       5320-99MOR002TO00-CARDEC.        
      *----------------------------------------------------------------*        
      * SE ESTABLECE EL NUMERO DE CTAS CTES EMBARGADAS        
      *----------------------------------------------------------------*        
           IF TAB-NOV-CTAC-CODINT(NOV-REPORT-ABD06)  =  33        
              ADD   1      TO  99MOR002TO00        
           END-IF. 
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR002CT00-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212     IF COD-SUS-ABD06(1:2) = 01                                   CIG0020
RQ2212        IF TAB-NOV-CTAC-CODINT(NOV-REPORT-ABD06)  =  33           CIG0020
RQ2212           ADD 1     TO  99MOR002CT00                             CIG0020
RQ2212        END-IF                                                    CIG0020
RQ2212     END-IF                                                       CIG0020
RQ2212     .                                                            CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR002AH00-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212     IF COD-SUS-ABD06(1:2) = 51                                   CIG0020
RQ2212        IF TAB-NOV-CTAC-CODINT(NOV-REPORT-ABD06)  =  33           CIG0020
RQ2212           ADD 1     TO  99MOR002AH00                             CIG0020
RQ2212        END-IF                                                    CIG0020
RQ2212     END-IF                                                       CIG0020
RQ2212     .                                                            CIG0020
RQ1648*----------------------------------------------------------------*CIG0012
RQ1648 5320-99EXP001CT00-CARDEC.                                        CIG0012
RQ1648*----------------------------------------------------------------*CIG0012
RQ1648* NUMERO DE MESES DE LA CTA CTE VIGENTE MAS ANTIGUA               CIG0012
RQ1648*----------------------------------------------------------------*CIG0012
AJ1648     IF (TAB-NOV-CTAC-CODINT(NOV-REPORT-ABD06) = 30  OR 35) AND   CIG0013
AJ1648        COD-SUS-ABD06(1:2) = 01                                   CIG0013
RQ1648        IF W-MESES-APERTURA-CARDEC  >  99EXP001CT00               CIG0012
RQ1648           MOVE W-MESES-APERTURA-CARDEC TO 99EXP001CT00           CIG0012
RQ1648        END-IF                                                    CIG0012
RQ1648     END-IF.                                                      CIG0012
RQ1648*----------------------------------------------------------------*CIG0012
RQ1648 5320-99NUM005CT00-CARDEC.                                        CIG0012
RQ1648*----------------------------------------------------------------*CIG0012
RQ1648* NUMERO DE CUENTAS CORRIENTES VIGENTES                           CIG0012
RQ1648*----------------------------------------------------------------*CIG0012
AJ1648     IF (TAB-NOV-CTAC-CODINT(NOV-REPORT-ABD06) = 30  OR 35) AND   CIG0013
AJ1648        COD-SUS-ABD06(1:2) = 01                                   CIG0013
RQ1648        ADD 1 TO 99NUM005CT00                                     CIG0012
RQ1648     END-IF.                                                      CIG0012
RQ1648*                                                                 CIG0012
      *----------------------------------------------------------------*        
      *5320-C00COR0004-CARDEC.        
      *----------------------------------------------------------------*        
      *    IF ADJETIVO-ABD06 > ZEROS        
      *       ADD   1      TO  C00COR0004        
      *    END-IF.        
      *        
       5320-CCOR0005-CARDEC.        
       5320-CREDIT-PROCES-CARDEC.        
           MOVE 1 TO I-CARDEC        
CQ1812     MOVE  0                     TO  SW-UNA-VEZ-MAESTRO           DLM0014
           PERFORM UNTIL I-CARDEC > 499 OR         
                         C-EST-CREDIT-CARDEC(I-CARDEC) = SPACES        
              IF FINCRE-CARDEC = 1        
                 MOVE ALL "$" TO VAL-VAR-CARDEC        
                 MOVE C-EST-CREDIT-CARDEC(I-CARDEC) TO NOM-VAR-CARDEC        
              END-IF        
              EVALUATE C-EST-CREDIT-CARDEC(I-CARDEC)        
                 WHEN "CD99DEM003TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99DEM003TO00-CARDEC        
                   ELSE        
                      MOVE 99DEM003TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
RQ1947           WHEN "CD99DEM003TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99DEM003TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99DEM003TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99DEM003TO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99DEM003TO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99DEM003TO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
CQ1343           WHEN "CD99DEM003TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99DEM003TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99DEM003TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
CQ1343           WHEN "CD99DEM007TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99DEM007TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99DEM007TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
CQ1343           WHEN "CD99DEM008TO00"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99DEM008TO00-CARDEC                  EHA0006
CQ1343*             ELSE                                                EHA0006
CQ1343*                MOVE 99DEM008TO00      TO VAL3-VAR-CARDEC        EHA0006
CQ1343*                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                EHA0006
CQ1343             END-IF                                               EHA0006
                 WHEN "CD99END001TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99END001TO00-CARDEC        
                   ELSE        
                      MOVE 99END001TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF        
                 WHEN "CD99END003TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99END003TO00-CARDEC        
                   ELSE        
                      MOVE 99END003TO00      TO VAL10-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF        
                 WHEN "CD99END004TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99END004TO00-CARDEC        
                   ELSE        
                      MOVE 99END004TO00      TO VAL10-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
CQ1224           WHEN "CD99END004HP00"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END004HP00-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END004HP00      TO VAL13-VAR-CARDEC     CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END004CO00"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END004CO00-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END004CO00      TO VAL13-VAR-CARDEC     CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END004TO09"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END004TO09-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END004TO09      TO VAL13-VAR-CARDEC     CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END004TO10"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END004TO10-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END004TO10      TO VAL13-VAR-CARDEC     CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END004TO11"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END004TO11-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END004TO11      TO VAL13-VAR-CARDEC     CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
CQ1343           WHEN "CD99END004TO13"                                  EHA0006
CQ1343                IF  FINCRE-CARDEC  =  0                           EHA0006
CQ1343                  PERFORM  5320-99END004TO13-CARDEC               EHA0006
CQ1343                ELSE                                              EHA0006
CQ1343                  MOVE 99END004TO13      TO VAL13-VAR-CARDEC      EHA0006
CQ1343                  PERFORM  5400-ARMAR-BOM-CAR-CARDEC              EHA0006
CQ1343                END-IF                                            EHA0006
CQ1224           WHEN "CD99END004CO07"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END004CO07-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END004CO07      TO VAL13-VAR-CARDEC     CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
                 WHEN "CD99END005TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99END005TO00-CARDEC        
                   ELSE        
                      MOVE 99END005TO00      TO VAL10-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
CQ1224           WHEN "CD99END005TC00"                                  CIGD004
CQ1224             IF FINCRE-CARDEC = 0                                 CIGD004
CQ1224                PERFORM 5320-99END005TC00-CARDEC                  CIGD004
CQ1224             ELSE                                                 CIGD004
CQ1224                MOVE 99END005TC00      TO VAL13-VAR-CARDEC        CIGD004
CQ1224                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIGD004
CQ1224             END-IF                                               CIGD004
MD1033           WHEN "CD99END006EX00"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99END006EX00-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033* SE LLAMA POR ULTIMA VEZ PARA ESTABLECER EL PORCENTAJE TOTAL     EHA0003
MD1033                PERFORM 5320-99END006EX00-CARDEC                  EHA0003
MD1033                MOVE 99END006EX00      TO VAL3-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99END007TC00"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99END007TC00-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033* SE LLAMA POR ULTIMA VEZ PARA ESTABLECER EL PORCENTAJE DE TDC    EHA0003
MD1033                PERFORM 5320-99END007TC00-CARDEC                  EHA0003
MD1033                MOVE 99END007TC00      TO VAL3-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
CQ1224           WHEN "CD99END010EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END010EX59-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END010EX59   TO VAL13-VAR-CARDEC        CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END011EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END011EX59-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END011EX59   TO VAL13-VAR-CARDEC        CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END012EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END012EX59-CARDEC               CIGD004
CQ1224                ELSE                                              CIGD004
CQ1224                   MOVE 99END012EX59   TO VAL13-VAR-CARDEC        CIGD004
CQ1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END013EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END013EX59-CARDEC               CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END014EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END014EX59-CARDEC               CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END015EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END015EX59-CARDEC               CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END016EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END016EX59-CARDEC               CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END017EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END017EX59-CARDEC               CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224           WHEN "CD99END018EX59"                                  CIGD004
CQ1224                IF FINCRE-CARDEC = 0                              CIGD004
CQ1224                   PERFORM 5320-99END018EX59-CARDEC               CIGD004
CQ1224                END-IF                                            CIGD004
MD1033           WHEN "CD99END019TO04"                                  EHA0003
MD1033                IF FINCRE-CARDEC = 0                              EHA0003
MD1033                   PERFORM 5320-99END019TO04-CARDEC               EHA0003
MD1033                ELSE                                              EHA0003
MD1033                   MOVE 99END019TO04      TO VAL13-VAR-CARDEC     EHA0003
MD1033                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              EHA0003
MD1033                END-IF                                            EHA0003
AL1224           WHEN "CD99END019TO01"                                  EHA0010
AL1224                IF FINCRE-CARDEC = 0                              EHA0010
AL1224                   PERFORM 5320-99END019TO01-CARDEC               EHA0010
AL1224                ELSE                                              EHA0010
AL1224                   MOVE 99END019TO01      TO VAL13-VAR-CARDEC     EHA0010
AL1224                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              EHA0010
AL1224                END-IF                                            EHA0010
CQ1343           WHEN "CD99END019TO13"                                  EHA0006
CQ1343                IF FINCRE-CARDEC = 0                              EHA0006
CQ1343                   PERFORM 5320-99END019TO13-CARDEC               EHA0006
CQ1343                ELSE                                              EHA0006
CQ1343                   MOVE 99END019TO13      TO VAL13-VAR-CARDEC     EHA0006
CQ1343                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              EHA0006
CQ1343                END-IF                                            EHA0006
CQ1343           WHEN "CD99END020EX61"                                  EHA0006
CQ1343                IF FINCRE-CARDEC = 0                              EHA0006
CQ1343                   PERFORM 5320-99END020EX61-CARDEC               EHA0006
CQ1343                ELSE                                              EHA0006
CQ1343                   PERFORM 5320-99END020EX61-CARDEC               EHA0006
RQ1648                   COMPUTE 99END020EX61-INTVALOR =                CIG0012
RQ1648                           99END020EX61 * 1000                    CIG0012
RQ1648                   MOVE 99END020EX61-INTVALOR TO                  CIG0012
RQ1648*                                        VAL13DEC-VAR-CARDEC      CIG0012
RQ1648                                         VAL13-VAR-CARDEC         CIG0012
CQ1343                   PERFORM 5400-ARMAR-BOM-CAR-CARDEC              EHA0006
CQ1343                END-IF                                            EHA0006                                          
                 WHEN "CD99NUM001EX36"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99NUM001EX36-CARDEC        
                   ELSE        
                      MOVE 99NUM001EX36      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF 
ADDCAR           WHEN "CD99NUM002TO00"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99NUM002TO00-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99NUM002TO00      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
ADDCAR           WHEN "CD99NUM002TO02"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99NUM002TO02-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99NUM002TO02      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
ADDCAR           WHEN "CD99NUM002TO05"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99NUM002TO05-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99NUM002TO05      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ1648           WHEN "CD99NUM006HP00"                                  CIG0012
RQ1648             IF FINCRE-CARDEC = 0                                 CIG0012
RQ1648                PERFORM 5320-99NUM006HP00-CARDEC                  CIG0012
RQ1648             ELSE                                                 CIG0012
RQ1648                MOVE 99NUM006HP00      TO VAL5-VAR-CARDEC         CIG0012
RQ1648                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0012
RQ1648             END-IF                                               CIG0012
RQ1648           WHEN "CD99NUM007EX65"                                  CIG0012
RQ1648             IF FINCRE-CARDEC = 0                                 CIG0012
RQ1648                PERFORM 5320-99NUM007EX65-CARDEC                  CIG0012
RQ1648             ELSE                                                 CIG0012
RQ1648                MOVE 99NUM007EX65      TO VAL5-VAR-CARDEC         CIG0012
RQ1648                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0012
RQ1648             END-IF                                               CIG0012
CQ1343           WHEN "CD99MOR001TO00"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99MOR001TO00-CARDEC                  EHA0006
CQ1343*            ELSE                                                 EHA0006
CQ1343*               MOVE 99MOR001TO00      TO VAL5-VAR-CARDEC         EHA0006
CQ1343*               PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
                 WHEN "CD99MOR003TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99MOR003TO00-CARDEC        
                   ELSE        
                      MOVE 99MOR003TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
RQ2212           WHEN "CD99MOR003TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR003TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR003TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
ADDCAR           WHEN "CD99MOR003TO02"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR003TO02-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR003TO02      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ2212           WHEN "CD99MOR003TO03"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR003TO03-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR003TO03      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
ADDCAR           WHEN "CD99MOR003TO05"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR003TO05-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR003TO05      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ1947           WHEN "CD99MOR003CO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR003CO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR003CO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CD99MOR004TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99MOR004TO00-CARDEC        
                   ELSE        
                      MOVE 99MOR004TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
RQ2212           WHEN "CD99MOR004TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR004TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR004TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
ADDCAR           WHEN "CD99MOR004TO02"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR004TO02-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR004TO02      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ2212           WHEN "CD99MOR004TO03"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR004TO03-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR004TO03      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
ADDCAR           WHEN "CD99MOR004TO05"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR004TO05-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR004TO05      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ1947           WHEN "CD99MOR004CO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR004CO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR004CO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CD99MOR005TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99MOR005TO00-CARDEC        
                   ELSE        
                      MOVE 99MOR005TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF       
RQ2212           WHEN "CD99MOR005TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR005TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR005TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
ADDCAR           WHEN "CD99MOR005TO02"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR005TO02-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR005TO02      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ2212           WHEN "CD99MOR005TO03"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR005TO03-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR005TO03      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
ADDCAR           WHEN "CD99MOR005TO05"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR005TO05-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR005TO05      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ1947           WHEN "CD99MOR005CO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR005CO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR005CO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CD99MOR006TO00"
                   IF FINCRE-CARDEC = 0
                      PERFORM 5320-99MOR006TO00-CARDEC
                   ELSE
                      MOVE 99MOR006TO00      TO VAL5-VAR-CARDEC
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC
                   END-IF
RQ2212           WHEN "CD99MOR006TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR006TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR006TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
ADDCAR           WHEN "CD99MOR006TO02"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR006TO02-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR006TO02      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ2212           WHEN "CD99MOR006TO03"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR006TO03-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR006TO03      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
ADDCAR           WHEN "CD99MOR006TO05"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR006TO05-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR006TO05      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
RQ1947           WHEN "CD99MOR006CO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR006CO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR006CO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CD99MOR007TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99MOR007TO00-CARDEC        
                   ELSE        
                      MOVE 99MOR007TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF        
RQ2212           WHEN "CD99MOR007TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR007TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR007TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
RQ2212           WHEN "CD99MOR007TO03"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR007TO03-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR007TO03      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
CQ1343           WHEN "CD99MOR007TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99MOR007TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR007TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
ADDCAR           WHEN "CD99MOR007TO02"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR007TO02-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR007TO02      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
ADDCAR           WHEN "CD99MOR007TO05"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR007TO05-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR007TO05      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
                 WHEN "CD99MOR008TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99MOR008TO00-CARDEC        
                   ELSE        
                      MOVE 99MOR008TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
CQ1343             END-IF                                               EHA0006
CQ1343           WHEN "CD99MOR008TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99MOR008TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR008TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
ADDCAR           WHEN "CD99MOR008TO02"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR008TO02-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR008TO02      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
ADDCAR           WHEN "CD99MOR008TO05"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR008TO05-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR008TO05      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
                 WHEN "CD99MOR009TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99MOR009TO00-CARDEC        
                   ELSE        
                      MOVE 99MOR009TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
CQ1343             END-IF                                               EHA0006
RQ1947           WHEN "CD99MOR009TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR009TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR009TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99MOR009TO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR009TO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR009TO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
CQ1343           WHEN "CD99MOR009TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99MOR009TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR009TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
                 WHEN "CD99MOR010TC00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99MOR010TC00-CARDEC        
                   ELSE        
                      MOVE 99MOR010TC00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
RQ1947           WHEN "CD99MOR010TC05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR010TC05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR010TC05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CD99MOR011TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-CUENTA-MORAS-HIST-CARDEC        
                   ELSE        
                      MOVE 99MOR011TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
CQ1343             END-IF                                               EHA0006
RQ2212           WHEN "CD99MOR011TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR011TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR011TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
CQ1343           WHEN "CD99MOR011TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             EHA0006
CQ1343                PERFORM 5320-99MOR011TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR011TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
RQ2212           WHEN "CD99MOR011TC00"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR011TC00-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR011TC00      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
RQ2212           WHEN "CD99MOR013TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR013TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR013TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
CQ1343           WHEN "CD99MOR013TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             EHA0006
CQ1343                PERFORM 5320-99MOR013TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR013TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
RQ2212           WHEN "CD99MOR013TC00"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR013TC00-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR013TC00      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
RQ2212           WHEN "CD99MOR014TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR014TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR014TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
CQ1343           WHEN "CD99MOR014TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             EHA0006
CQ1343                PERFORM 5320-99MOR014TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR014TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
RQ2212           WHEN "CD99MOR014TC00"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR014TC00-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR014TC00      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
RQ2212           WHEN "CD99MOR015TO01"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR015TO01-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR015TO01      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
CQ1343           WHEN "CD99MOR015TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             EHA0006
CQ1343                PERFORM 5320-99MOR015TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR015TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
RQ2212           WHEN "CD99MOR015TC00"                                  CIG0020
RQ2212             IF FINCRE-CARDEC = 0                                 CIG0020
RQ2212                PERFORM 5320-99MOR015TC00-CARDEC                  CIG0020
RQ2212             ELSE                                                 CIG0020
RQ2212                MOVE 99MOR015TC00      TO VAL5-VAR-CARDEC         CIG0020
RQ2212                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0020
RQ2212             END-IF                                               CIG0020
                 WHEN "CD99MOR012TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-CUENTA-MORAS-HIST-CARDEC        
                   ELSE        
                      MOVE 99MOR012TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF        
                 WHEN "CD99MOR013TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-CUENTA-MORAS-HIST-CARDEC        
                   ELSE        
                      MOVE 99MOR013TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
RQ1947           WHEN "CD99MOR013TO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR013TO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CD99MOR014TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-CUENTA-MORAS-HIST-CARDEC        
                   ELSE        
                      MOVE 99MOR014TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF     
RQ1947           WHEN "CD99MOR014TO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR014TO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CD99MOR015TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-CUENTA-MORAS-HIST-CARDEC        
                   ELSE        
                      MOVE 99MOR015TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF  
RQ1947           WHEN "CD99MOR015TO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR015TO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CD99MOR016TO00"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5320-99MOR016TO00-CARDEC        
                   ELSE        
                      MOVE 99MOR016TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF        
CQ1343           WHEN "CD99MOR016TO12"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99MOR016TO12-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR016TO12      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
ADDCAR           WHEN "CD99MOR017TO00"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR017TO00-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR017TO00      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
ADDCAR           WHEN "CD99MOR017TO02"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR017TO02-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR017TO02      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
ADDCAR           WHEN "CD99MOR017TO05"                                  EHA0002
ADDCAR             IF FINCRE-CARDEC = 0                                 EHA0002
ADDCAR                PERFORM 5320-99MOR017TO05-CARDEC                  EHA0002
ADDCAR             ELSE                                                 EHA0002
ADDCAR                MOVE 99MOR017TO05      TO VAL5-VAR-CARDEC         EHA0002
ADDCAR                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0002
ADDCAR             END-IF                                               EHA0002
MD1033           WHEN "CD99MOR018EX58"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99MOR018EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR018EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99MOR019EX58"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99MOR019EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR019EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99MOR020EX58"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99MOR020EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR020EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99MOR020TO04"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99MOR020TO04-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR020TO04      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99MOR021TO00"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99MOR021TO00-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR021TO00      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99MOR022TO00"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99MOR022TO00-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR022TO00      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
RQ1947           WHEN "CD99MOR022TO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR022TO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR022TO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
MD1033           WHEN "CD99MOR023TC00"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99MOR023TC00-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR023TC00      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
RQ1947           WHEN "CD99MOR023TC05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR023TC05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR023TC05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
MD1033           WHEN "CD99MOR024EX58"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             EHA0003
MD1033                PERFORM 5320-99MOR024EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR024EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
CQ1224           WHEN "CD99MOR025EX59"                                  CIGD004
CQ1224             IF FINCRE-CARDEC = 0                                 CIGD004
CQ1224                PERFORM 5320-99MOR025EX59-CARDEC                  CIGD004
CQ1224             ELSE                                                 CIGD004
CQ1224                PERFORM 5320-99MOR025EX59-CARDEC                  CIGD004
CQ1224                MOVE 99MOR025EX59      TO VAL3-VAR-CARDEC         CIGD004
CQ1224                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIGD004
CQ1224             END-IF                                               CIGD004
CQ1343           WHEN "CD99MOR026TO00"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             EHA0006
CQ1343                PERFORM 5320-99MOR026TO00-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR026TO00      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006

RQ2171           WHEN "CD99MOR026TO05"                                  EHA0017
RQ2171             IF FINCRE-CARDEC = 0                                 EHA0017
RQ2171                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             EHA0017
RQ2171                PERFORM 5320-99MOR026TO05-CARDEC                  EHA0017
RQ2171             ELSE                                                 EHA0017
RQ2171                MOVE 99MOR026TO05      TO VAL5-VAR-CARDEC         EHA0017
RQ2171                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0017
RQ2171             END-IF                                               EHA0017

MD1033           WHEN "CD99MOR027EX54"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99MOR027EX54-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99MOR027EX54      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
CQ1343           WHEN "CD99MOR028EX61"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1343                PERFORM 5320-99MOR028EX61-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99MOR028EX61      TO VAL3-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
RQ1914           WHEN "CD99MOR029TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR029TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR029TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR029CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR029CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR029CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR030TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR030TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR030TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR030CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR030CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR030CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR031TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR031TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR031TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR031CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR031CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR031CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR032TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR032TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR032TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR032CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR032CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR032CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR033TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR033TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR033TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR033CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR033CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR033CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR034TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR034TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR034TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR034CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR034CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR034CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR035TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR035TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR035TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR035CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR035CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR035CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR037TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR037TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR037TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR037CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR037CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR037CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR038TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR038TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR038TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR038CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR038CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR038CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR039TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR039TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR039TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR039CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR039CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR039CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR040TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR040TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR040TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR040CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR040CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR040CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR041TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR041TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR041TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR041CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR041CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR041CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR042TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR042TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR042TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR042CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR042CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR042CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR043TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR043TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR043TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR043CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR043CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR043CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR044TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR044TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR044TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR044CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR044CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR044CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR045TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR045TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR045TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR045CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR045CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR045CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR046TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR046TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR046TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR046CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR046CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR046CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR047TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR047TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR047TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR047CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR047CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR047CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR048TO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR048TO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR048TO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           WHEN "CD99MOR048CO00"                                  CIG0016
RQ1914             IF FINCRE-CARDEC = 0                                 CIG0016
RQ1914                PERFORM 5320-99MOR048CO00-CARDEC                  CIG0016
RQ1914             ELSE                                                 CIG0016
RQ1914                MOVE 99MOR048CO00      TO VAL5-VAR-CARDEC         CIG0016
RQ1914                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0016
RQ1914             END-IF                                               CIG0016
RQ1947           WHEN "CD99MOR049TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR049TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR049TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99MOR049TO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR049TO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR049TO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99MOR050TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR050TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR050TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99MOR050TO05"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR050TO05-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR050TO05      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99MOR051TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR051TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR051TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99MOR052TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR052TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR052TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99MOR053TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR053TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR053TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
RQ1947           WHEN "CD99MOR054TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99MOR054TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99MOR054TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
AJ1648           WHEN "CD99NUM002TO14"                                  CIG0013
AJ1648               IF FINCRE-CARDEC = 0                               CIG0013
AJ1648                  PERFORM 5320-99NUM002TO14-CARDEC                CIG0013
AJ1648               ELSE                                               CIG0013
AJ1648                  MOVE 99NUM002TO14      TO VAL5-VAR-CARDEC       CIG0013
AJ1648                  PERFORM 5400-ARMAR-BOM-CAR-CARDEC               CIG0013
AJ1648               END-IF                                             CIG0013
RQ1947           WHEN "CD99NUM003TO02"                                  CIG0019
RQ1947             IF FINCRE-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99NUM003TO02-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99NUM003TO02      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
MD1033           WHEN "CD99NUM003EX58"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99NUM003EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99NUM003EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99NUM004EX58"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99NUM004EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99NUM004EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99EXP001EX58"                                  EHA0003
MD1033             IF FINCRE-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99EXP001EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99EXP001EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
CQ1343           WHEN "CD99EXP002EX61"                                  EHA0006
CQ1343             IF FINCRE-CARDEC = 0                                 EHA0006
CQ1342                PERFORM 5320-CUENTA-MORAS-HIST-CARDEC             DLM0007
CQ1343                PERFORM 5320-99EXP002EX61-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                MOVE 99EXP002EX61      TO VAL5-VAR-CARDEC         EHA0006
CQ1343                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
CQ1343           WHEN "CD99EXP003TC00"                                  EHA0006
CQ1343             IF  FINCRE-CARDEC  =  0                              EHA0006
CQ1343               PERFORM  5320-99EXP003TC00-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343               MOVE  99EXP003TC00 TO  VAL5-VAR-CARDEC             EHA0006
CQ1343               PERFORM  5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
RQ1648           WHEN "CD99EXP004HP00"                                  CIG0012
RQ1648             IF  FINCRE-CARDEC  =  0                              CIG0012
RQ1648               PERFORM  5320-99EXP004HP00-CARDEC                  CIG0012
RQ1648             ELSE                                                 CIG0012
RQ1648               MOVE  99EXP004HP00 TO  VAL5-VAR-CARDEC             CIG0012
RQ1648               PERFORM  5400-ARMAR-BOM-CAR-CARDEC                 CIG0012
RQ1648             END-IF                                               CIG0012
CQ1342           WHEN "CD99EXP003TO14"                                  DLM0007
CQ1342             IF  FINCRE-CARDEC  =  0                              DLM0007
CQ1342               PERFORM  5320-99EXP003TO14-CARDEC                  DLM0007
CQ1342             ELSE                                                 DLM0007
CQ1342               MOVE  99EXP003TO14 TO  VAL5-VAR-CARDEC             DLM0007
CQ1342               PERFORM  5400-ARMAR-BOM-CAR-CARDEC                 DLM0007
CQ1342             END-IF                                               DLM0007
CQ1343           WHEN "CD99EXP003TO07"                                  EHA0006
CQ1343             IF  FINCRE-CARDEC  =  0                              EHA0006
CQ1343               PERFORM  5320-99EXP003TO07-CARDEC                  EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343               MOVE  99EXP003TO07 TO  VAL5-VAR-CARDEC             EHA0006
CQ1343               PERFORM  5400-ARMAR-BOM-CAR-CARDEC                 EHA0006
CQ1343             END-IF                                               EHA0006
RQ1648           WHEN "CD99EXP003TO13"                                  CIG0012
RQ1648             IF  FINCRE-CARDEC  =  0                              CIG0012
RQ1648               PERFORM  5320-99EXP003TO13-CARDEC                  CIG0012
RQ1648             ELSE                                                 CIG0012
RQ1648               MOVE  99EXP003TO13 TO  VAL5-VAR-CARDEC             CIG0012
RQ1648               PERFORM  5400-ARMAR-BOM-CAR-CARDEC                 CIG0012
RQ1648             END-IF                                               CIG0012
                 WHEN "CCAR0DES"        
                   IF FINCRE-CARDEC = 0        
                      PERFORM 5200-PROCESE-REG-CREDIT-SCODRU        
                   END-IF        
                 WHEN ANY         
CQ1812             MOVE  1             TO  ERR-EST-CREDIT-CARDEC        DLM0014
              END-EVALUATE        
CQ1812        PERFORM  5000-CALCULAR-CARTERA-PROG                       DLM0014
              ADD 1 TO I-CARDEC        
           END-PERFORM.        
CQ1812     IF  SW-UNA-VEZ-MAESTRO  =  1                                 DLM0014
CQ1812       MOVE  1                   TO  FINCRE-CARDEC                DLM0014
CQ1812     END-IF.                                                      DLM0014
      *----------------------------------------------------------------*        
       5320-99DEM003TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF ADJETIVO1-ABD07 = 1 OR    *>  Fallecido        
               ADJETIVO2-ABD07 = 1 OR        
               ADJETIVO3-ABD07 = 1        
               ADD  1  TO  99DEM003TO00        
            END-IF.      
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99DEM003TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2                    CIG0019
RQ1947         IF ADJETIVO1-ABD07 = 1 OR    *>  Fallecido               CIG0019
RQ1947            ADJETIVO2-ABD07 = 1 OR                                CIG0019
RQ1947            ADJETIVO3-ABD07 = 1                                   CIG0019
RQ1947            ADD  1  TO  99DEM003TO02                              CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99DEM003TO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3               CIG0019
RQ1947         IF ADJETIVO1-ABD07 = 1 OR    *>  Fallecido               CIG0019
RQ1947            ADJETIVO2-ABD07 = 1 OR                                CIG0019
RQ1947            ADJETIVO3-ABD07 = 1                                   CIG0019
RQ1947            ADD  1  TO  99DEM003TO05                              CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99DEM003TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343      IF SW-CODEUDOR = ZEROS                                      EHA0006
CQ1343         IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                   EHA0006
CQ1343            IF ADJETIVO1-ABD07 = 1 OR    *>  Fallecido            EHA0006
CQ1343               ADJETIVO2-ABD07 = 1 OR                             EHA0006
CQ1343               ADJETIVO3-ABD07 = 1                                EHA0006
CQ1343               ADD  1  TO  99DEM003TO12                           EHA0006
CQ1343            END-IF                                                EHA0006
CQ1343         END-IF                                                   EHA0006
CQ1343      END-IF.                                                     EHA0006
CQ1343                                                                  EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99DEM007TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343      IF SW-CODEUDOR = ZEROS                                      EHA0006
CQ1343         IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                   EHA0006
CQ1343            IF ADJETIVO1-ABD07 = 3 OR    *>  No Localizado        EHA0006
CQ1343               ADJETIVO2-ABD07 = 3 OR                             EHA0006
CQ1343               ADJETIVO3-ABD07 = 3                                EHA0006
CQ1343               ADD  1  TO  99DEM007TO12                           EHA0006
CQ1343            END-IF                                                EHA0006
CQ1343         END-IF                                                   EHA0006
CQ1343      END-IF.                                                     EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99DEM008TO00-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343* si entra por FINCRE-CARDEC = 0 tiene obligaciones es tipo 1     EHA0006
CQ1343      IF FINCRE-CARDEC = 0                                        EHA0006
CQ1343         MOVE 1 TO 99DEM008TO00                                   EHA0006
CQ1343      END-IF                                                      EHA0006
CQ1343* si entra por FINCHK-CARDEC = 0 tiene cuentas es tipo 1 sin desemEHA0006
CQ1343      IF FINCHK-CARDEC = 0 AND                                    EHA0006
CQ1343         99DEM008TO00  = ZEROS                                    EHA0006
CQ1343         MOVE 2 TO 99DEM008TO00                                   EHA0006
CQ1343      END-IF                                                      EHA0006
CQ1343* si entra por FINCHK-CARDEC = 1 NO tiene cuentas es tipo 5       EHA0006
CQ1343      IF FINCHK-CARDEC = 1 AND                                    EHA0006
CQ1342         FINCRE-CARDEC = 1 AND                                    DLM0007
CQ1343         99DEM008TO00  = ZEROS                                    EHA0006
CQ1343         MOVE 5 TO 99DEM008TO00                                   EHA0006
CQ1343      END-IF.                                                     EHA0006
      *----------------------------------------------------------------*        
       5320-99END001TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1 *> ABIERTAS        
               IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 12 *> M30DIAS        
                  IF IND-VALORES-VALVLR = 1        
                     IF VEC-VALOR-VALVLR (5) = 1        
                        MOVE VALOR-SALDO-MORAM-ABD07 TO        
                             99END001TO00        
                     END-IF        
                  END-IF        
               END-IF        
            END-IF.        
      *----------------------------------------------------------------*        
       5320-99NUM001EX36-CARDEC.        
      *----------------------------------------------------------------*        
           IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1        
RQ1947      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR 03             CIG0019
               IF COD-CTA-ABD07 = 02        
               OR NIT-SUSCRIP-S-ABD02 = 00800037800        
                  NEXT SENTENCE        
               ELSE        
                  IF SW-CODEUDOR = ZEROS        
                   IF SW-TIP-TITULAR = 1        
      *                 PERFORM 1100-ENTIDAD-SEC-FINANCIERO        
                    IF L-CARDEC = 1        
                       MOVE NIT-SUSCRIP-S-ABD02 TO        
                                        W-NIT-SEC-FINA-CARDEC(L-CARDEC)        
                       ADD    1           TO   L-CARDEC        
                       MOVE   L-CARDEC    TO   TOPE-NIT-CARDEC        
                       MOVE   1           TO   99NUM001EX36        
                    ELSE        
                       PERFORM VARYING L-CARDEC FROM 1 BY 1 UNTIL        
                                             L-CARDEC > TOPE-NIT-CARDEC        
                            IF NIT-SUSCRIP-S-ABD02 =        
                                        W-NIT-SEC-FINA-CARDEC(L-CARDEC)        
                               MOVE  60 TO  L-CARDEC        
                            ELSE        
                               IF W-NIT-SEC-FINA-CARDEC(L-CARDEC) =        
                                                                  ZEROS        
                                  MOVE NIT-SUSCRIP-S-ABD02 TO        
                                        W-NIT-SEC-FINA-CARDEC(L-CARDEC)        
                                  ADD    1        TO   99NUM001EX36        
                                  ADD    1        TO   L-CARDEC        
                                  MOVE   L-CARDEC TO   TOPE-NIT-CARDEC        
                                  MOVE   60   TO   L-CARDEC        
                               END-IF        
                            END-IF        
                       END-PERFORM        
                    END-IF        
                   END-IF        
                  END-IF        
               END-IF        
            END-IF        
           END-IF.        
ADDCAR**---------------------------------------------------------------*EHA0002
ADDCAR 5320-99NUM002TO00-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          ADD  1  TO  99NUM002TO00                                EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
ADDCAR**---------------------------------------------------------------*EHA0002
ADDCAR 5320-99NUM002TO02-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
RQ1947          IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 02 AND          CIG0019
ADDCAR              COD-CTA-ABD07 NOT = 23 AND                          EHA0002
ADDCAR              COD-CTA-ABD07 NOT = 24                              EHA0002
ADDCAR              ADD  1  TO  99NUM002TO02                            EHA0002
ADDCAR          END-IF                                                  EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
ADDCAR**---------------------------------------------------------------*EHA0002
ADDCAR 5320-99NUM002TO05-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
RQ1947          IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR 03        CIG0019
ADDCAR              ADD  1  TO  99NUM002TO05                            EHA0002
ADDCAR          END-IF                                                  EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ1648**---------------------------------------------------------------*CIG0012
RQ1648 5320-99NUM006HP00-CARDEC.                                        CIG0012
RQ1648**---------------------------------------------------------------*CIG0012
RQ1648* NUMERO DE CREDITOS HIPOTECARIOS VIGENTES COMO TITULAR           CIG0012
RQ1648     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               CIG0012
RQ1648        IF SW-CODEUDOR = ZERO                                     CIG0012
RQ1648           IF  TIPO-OBLIGACION-ABD07 = 3                          CIG0012
RQ1648              ADD 1 TO 99NUM006HP00                               CIG0012
RQ1648           END-IF                                                 CIG0012
RQ1648        END-IF                                                    CIG0012
RQ1648     END-IF.                                                      CIG0012
RQ1648*                                                                 CIG0012
RQ1648*----------------------------------------------------------------*CIG0012
RQ1648 5320-99NUM007EX65-CARDEC.                                        CIG0012
RQ1648*----------------------------------------------------------------*CIG0012
RQ1648* NUMERO DE TDC CANCELADAS VOLUNTARIAMENTE                        CIG0012
RQ1648     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 0               CIG0012
RQ1648        IF SW-CODEUDOR = ZERO                                     CIG0012
RQ1648           IF  NOV-REPORT-ABD07 = 5 AND                           CIG0012
AJ1648               COD-CTA-ABD07 = 02                                 CIG0013
RQ1648               ADD 1 TO 99NUM007EX65                              CIG0012
RQ1648           END-IF                                                 CIG0012
RQ1648        END-IF                                                    CIG0012
RQ1648     END-IF.                                                      CIG0012
RQ1648*                                                                 CIG0012
      **---------------------------------------------------------------*        
       5320-99MOR003TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1
RQ2340       IF SW-CODEUDOR = ZERO                                      EHA0021
               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        
                     WHEN 12        
                          ADD  1  TO  99MOR003TO00        
               END-EVALUATE
RQ2340       END-IF                                                     EHA0021
            END-IF. 
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR003TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE OBLIGACIONES EN MORA 30 EN EL SECTOR FINANCIERO       CIG0020
RQ2212* APLICA PARA TITULAR Y CODEUDOR                                  CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1           CIG0020
RQ2212            IF MORA-NOV(NOV-REPORT-ABD07) = 1                     CIG0020
RQ2212               ADD 1        TO  99MOR003TO01                      CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
ADDCAR**---------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR003TO02-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 12                                           EHA0002
RQ1947                   IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 02 AND CIG0019
ADDCAR                       COD-CTA-ABD07 NOT = 23 AND                 EHA0002
ADDCAR                       COD-CTA-ABD07 NOT = 24                     EHA0002
ADDCAR                       ADD  1  TO  99MOR003TO02                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR003TO03-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE OBLIGACIONES EN MORA 30 EN EL SECTOR COOPERATIVO      CIG0020
RQ2212* APLICA PARA TITULAR Y CODEUDOR                                  CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 3                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1           CIG0020
RQ2212            IF MORA-NOV(NOV-REPORT-ABD07) = 1                     CIG0020
RQ2212               ADD 1        TO  99MOR003TO03                      CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
ADDCAR**---------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR003TO05-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 12                                           EHA0002
RQ1947                   IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR  CIG0019
RQ1947                                                           03     CIG0019
ADDCAR                       ADD  1  TO  99MOR003TO05                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR003CO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF SW-CODEUDOR <> ZEROS                                     CIG0019
RQ1947         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0019
RQ1947            IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3         CIG0019
RQ1947               IF MORA-NOV(NOV-REPORT-ABD07) = 1                  CIG0019
RQ1947                  ADD 1               TO 99MOR003CO05             CIG0019
RQ1947               END-IF                                             CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
      *----------------------------------------------------------------*        
       5320-99MOR004TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1
RQ2340       IF SW-CODEUDOR = ZERO                                      EHA0021
               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        
                     WHEN 13        
                          ADD  1  TO  99MOR004TO00        
               END-EVALUATE        
RQ2340       END-IF                                                     EHA0021
            END-IF.        
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR004TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE OBLIGACIONES EN MORA 60 EN EL SECTOR FINANCIERO       CIG0020
RQ2212* APLICA PARA TITULAR Y CODEUDOR                                  CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1           CIG0020
RQ2212            IF MORA-NOV(NOV-REPORT-ABD07) = 2                     CIG0020
RQ2212               ADD 1        TO  99MOR004TO01                      CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR004TO02-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 13                                           EHA0002
RQ1947                   IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 02 AND  CIG0019
ADDCAR                       COD-CTA-ABD07 NOT = 23 AND                 EHA0002
ADDCAR                       COD-CTA-ABD07 NOT = 24                     EHA0002
ADDCAR                       ADD  1  TO  99MOR004TO02                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR004TO03-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE OBLIGACIONES EN MORA 60 EN EL SECTOR COOPERATIVO      CIG0020
RQ2212* APLICA PARA TITULAR Y CODEUDOR                                  CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 3                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1           CIG0020
RQ2212            IF MORA-NOV(NOV-REPORT-ABD07) = 2                     CIG0020
RQ2212               ADD 1        TO  99MOR004TO03                      CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR004TO05-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 13                                           EHA0002
RQ1947                  IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR 03CIG0019
ADDCAR                       ADD  1  TO  99MOR004TO05                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR004CO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF SW-CODEUDOR <> ZEROS                                     CIG0019
RQ1947         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0019
RQ1947            IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3         CIG0019
RQ1947               IF MORA-NOV(NOV-REPORT-ABD07) = 2                  CIG0019
RQ1947                  ADD 1               TO 99MOR004CO05             CIG0019
RQ1947               END-IF                                             CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
      *----------------------------------------------------------------*        
       5320-99MOR005TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1        
RQ2340       IF SW-CODEUDOR = ZERO                                      EHA0021
               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        
                     WHEN 14        
                          ADD  1  TO  99MOR005TO00        
               END-EVALUATE        
RQ2340       END-IF                                                     EHA0021
            END-IF.        
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR005TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE OBLIGACIONES EN MORA 90 EN EL SECTOR FINANCIERO       CIG0020
RQ2212* APLICA PARA TITULAR Y CODEUDOR                                  CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1           CIG0020
RQ2212            IF MORA-NOV(NOV-REPORT-ABD07) = 3                     CIG0020
RQ2212               ADD 1        TO  99MOR005TO01                      CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR005TO02-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 14                                           EHA0002
RQ1947                   IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 02 AND  CIG0019
ADDCAR                       COD-CTA-ABD07 NOT = 23 AND                 EHA0002
ADDCAR                       COD-CTA-ABD07 NOT = 24                     EHA0002
ADDCAR                       ADD  1  TO  99MOR005TO02                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR005TO03-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE OBLIGACIONES EN MORA 90 EN EL SECTOR COOPERATIVO      CIG0020
RQ2212* APLICA PARA TITULAR Y CODEUDOR                                  CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 3                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1           CIG0020
RQ2212            IF MORA-NOV(NOV-REPORT-ABD07) = 3                     CIG0020
RQ2212               ADD 1        TO  99MOR005TO03                      CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR005TO05-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 14                                           EHA0002
RQ1947                   IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR 03CIG0019
ADDCAR                       ADD  1  TO  99MOR005TO05                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR005CO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF SW-CODEUDOR <> ZEROS                                     CIG0019
RQ1947         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0019
RQ1947            IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3         CIG0019
RQ1947               IF MORA-NOV(NOV-REPORT-ABD07) = 3                  CIG0019
RQ1947                  ADD 1               TO 99MOR005CO05             CIG0019
RQ1947               END-IF                                             CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
      *----------------------------------------------------------------*        
       5320-99MOR006TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1
RQ2340       IF SW-CODEUDOR = ZERO                                      EHA0021
               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        
                     WHEN 15        
                          ADD  1  TO  99MOR006TO00        
               END-EVALUATE        
RQ2340       END-IF                                                     EHA0021
            END-IF.        
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR006TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE OBLIGACIONES EN MORA 120 EN EL SECTOR FINANCIERO      CIG0020
RQ2212* APLICA PARA TITULAR Y CODEUDOR                                  CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1           CIG0020
RQ2212            IF MORA-NOV(NOV-REPORT-ABD07) = 4 AND                 CIG0020
RQ2212               NOV-REPORT-ABD07 <> 45 AND                         CIG0020
RQ2212               NOV-REPORT-ABD07 <> 47                             CIG0020
RQ2212               ADD 1        TO  99MOR006TO01                      CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR006TO02-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 15                                           EHA0002
RQ1947                   IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 02 AND CIG0019
ADDCAR                       COD-CTA-ABD07 NOT = 23 AND                 EHA0002
ADDCAR                       COD-CTA-ABD07 NOT = 24                     EHA0002
ADDCAR                       ADD  1  TO  99MOR006TO02                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR006TO03-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE OBLIGACIONES EN MORA 120 EN EL SECTOR COOPERATIVO     CIG0020
RQ2212* APLICA PARA TITULAR Y CODEUDOR                                  CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 3                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1           CIG0020
RQ2212            IF MORA-NOV(NOV-REPORT-ABD07) = 4 AND                 CIG0020
RQ2212               NOV-REPORT-ABD07 <> 45 AND                         CIG0020
RQ2212               NOV-REPORT-ABD07 <> 47                             CIG0020
RQ2212               ADD 1        TO  99MOR006TO03                      CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR006TO05-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 15                                           EHA0002
RQ1947                   IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR 03CIG0019
ADDCAR                       ADD  1  TO  99MOR006TO05                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR006CO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF SW-CODEUDOR <> ZEROS                                     CIG0019
RQ1947         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0019
RQ1947            IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3         CIG0019
RQ1947               IF MORA-NOV(NOV-REPORT-ABD07) = 4 AND              CIG0019
RQ1947                  NOV-REPORT-ABD07 <> 45 AND                      CIG0019
RQ1947                  NOV-REPORT-ABD07 <> 47                          CIG0019
RQ1947                  ADD 1               TO 99MOR006CO05             CIG0019
RQ1947               END-IF                                             CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
      *----------------------------------------------------------------*        
       5320-99MOR007TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1        
RQ2340* SE APLICA ESTE MATCH PARA EVITAR MODIFICACION EN EL BOM
RQ2340       IF SW-CODEUDOR = ZERO                                      EHA0021
RQ2810        IF NOMBRE-PROGRAMA = "ICGD72"                             EHA0026
RQ2810         IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                   EHA0026
RQ2810            EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        EHA0026
RQ2810               WHEN 09                                            EHA0026
RQ2810                    ADD  1  TO  99MOR007TO00                      EHA0026
RQ2810            END-EVALUATE                                          EHA0026
RQ2810         END-IF                                                   EHA0026
RQ2810        ELSE                                                      EHA0026
               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        
                     WHEN 09        
                          ADD  1  TO  99MOR007TO00        
               END-EVALUATE        
RQ2810        END-IF                                                    EHA0026
RQ2340       END-IF                                                     EHA0021
CQ1343      END-IF.                                                     EHA0006
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR007TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* CARTERAS CASTIGADAS EN EL SECTOR FINANCIERO APLICA PARA TITULAR*CIG0020
RQ2212* Y CODEUDOR.                                                     CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0020
RQ2212            IF NOV-REPORT-ABD07 = 45                              CIG0020
RQ2212               ADD 1           TO 99MOR007TO01                    CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR007TO03-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212*CARTERAS CASTIGADAS EN EL SECTOR COOPERATIVO APLICA PARA TITULAR*CIG0020
RQ2212* Y CODEUDOR.                                                     CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 3                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0020
RQ2212            IF NOV-REPORT-ABD07 = 45                              CIG0020
RQ2212               ADD 1           TO 99MOR007TO03                    CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR007TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0006
AL1342         IF SW-CODEUDOR = ZEROS                                   EHA0009
CQ1343          IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                  EHA0006
CQ1343             EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)       EHA0006
CQ1343                   WHEN 09                                        EHA0006
CQ1343                        ADD  1  TO  99MOR007TO12                  EHA0006
CQ1343             END-EVALUATE                                         EHA0006
CQ1343          END-IF                                                  EHA0006
AL1342         END-IF                                                   EHA0009
CQ1343      END-IF.                                                     EHA0006
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR007TO02-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 09                                           EHA0002
RQ1947                  IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 02 AND  CIG0019
ADDCAR                       COD-CTA-ABD07 NOT = 23 AND                 EHA0002
ADDCAR                       COD-CTA-ABD07 NOT = 24                     EHA0002
ADDCAR                       ADD  1  TO  99MOR007TO02                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR007TO05-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 09                                           EHA0002
RQ1947                  IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR 03CIG0019
ADDCAR                       ADD  1  TO  99MOR007TO05                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
      *----------------------------------------------------------------*        
       5320-99MOR008TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1
RQ2340       IF SW-CODEUDOR = ZERO                                      EHA0021
               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        
                     WHEN 11        
                          ADD  1  TO  99MOR008TO00        
               END-EVALUATE
RQ2340       END-IF                                                     EHA0021
            END-IF.
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR008TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0006
CQ1343         IF SW-CODEUDOR = ZEROS                                   EHA0006
CQ1343            IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                EHA0006
CQ1343               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)     EHA0006
CQ1343                     WHEN 11                                      EHA0006
CQ1343                          ADD  1  TO  99MOR008TO12                EHA0006
CQ1343               END-EVALUATE                                       EHA0006
CQ1343            END-IF                                                EHA0006
CQ1343         END-IF                                                   EHA0006
CQ1343      END-IF.                                                     EHA0006
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR008TO02-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 11                                           EHA0002
RQ1947                  IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 02 AND  CIG0019
ADDCAR                       COD-CTA-ABD07 NOT = 23 AND                 EHA0002
ADDCAR                       COD-CTA-ABD07 NOT = 24                     EHA0002
ADDCAR                       ADD  1  TO  99MOR008TO02                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR008TO05-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 11                                           EHA0002
RQ1947                   IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR 03CIG0019
ADDCAR                       ADD  1  TO  99MOR008TO05                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
      *----------------------------------------------------------------*        
       5320-99MOR009TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) <> 1        
RQ2340       IF SW-CODEUDOR = ZERO                                      EHA0021
               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        
                     WHEN 10        
                          ADD  1  TO  99MOR009TO00        
               END-EVALUATE        
RQ2340       END-IF                                                     EHA0021
            END-IF. 
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR009TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) <> 1              CIG0019
RQ1947         IF SW-CODEUDOR = ZEROS                                   CIG0019
RQ1947            IF NOV-REPORT-ABD07 = 46 AND                          CIG0019
RQ1947               IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2              CIG0019
RQ1947               ADD 1            TO 99MOR009TO02                   CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR009TO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) <> 1              CIG0019
RQ1947         IF SW-CODEUDOR = ZEROS                                   CIG0019
RQ1947            IF NOV-REPORT-ABD07 = 46 AND                          CIG0019
RQ1947               (IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3)       CIG0019
RQ1947               ADD 1            TO 99MOR009TO05                   CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR009TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) <> 1              EHA0006
CQ1343         IF SW-CODEUDOR = ZEROS                                   EHA0006
CQ1343            IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                EHA0006
CQ1343               IF W-MESES-NOVEDAD-CARDEC <= 12                    EHA0006
CQ1343                  EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)  EHA0006
CQ1343                        WHEN 10                                   EHA0006
CQ1343                             ADD  1  TO  99MOR009TO12             EHA0006
CQ1343                  END-EVALUATE                                    EHA0006
CQ1343               END-IF                                             EHA0006
CQ1343            END-IF                                                EHA0006
CQ1343         END-IF                                                   EHA0006
CQ1343      END-IF.                                                     EHA0006
      *----------------------------------------------------------------*        
       5320-99MOR010TC00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) <> 1
RQ2340       IF SW-CODEUDOR = ZERO                                      EHA0021
               EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)        
                     WHEN 08        
                          ADD  1  TO  99MOR010TC00        
               END-EVALUATE        
RQ2340       END-IF                                                     EHA0021
CQ1343      END-IF.                                                     EHA0006
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR010TC05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) <> 1              CIG0019
RQ1947         IF SW-CODEUDOR = ZEROS                                   CIG0019
RQ1947            IF NOV-REPORT-ABD07 = 03                              CIG0019
RQ1947              ADD 1                  TO 99MOR010TC05              CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR011TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE MORAS HISTORICAS DE 30 EN OBLIGACIONES ABIERTAS Y     CIG0020
RQ2212* CERRADAS, APLICAN PARA EL SECTOR FINANCIERO, EN CALIDAD DE      CIG0020
RQ2212* TITULAR Y CODEUDOR.                                             CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0020
RQ2212            MOVE   12   TO   TOPE-V-CARDEC                        CIG0020
RQ2212            PERFORM VARYING W-IND FROM 1 BY 1 UNTIL               CIG0020
RQ2212                                            W-IND >  TOPE-V-CARDECCIG0020
RQ2212               IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"             CIG0020
RQ2212                  ADD 1    TO 99MOR011TO01                        CIG0020
RQ2212               END-IF                                             CIG0020
RQ2212            END-PERFORM                                           CIG0020
RQ2212         ELSE                                                     CIG0020
RQ2212            IF W-MESES-NOVEDAD-CARDEC <= 12                       CIG0020
RQ2212               COMPUTE  TOPE-V-CARDEC = 12 -                      CIG0020
RQ2212                                            W-MESES-NOVEDAD-CARDECCIG0020
RQ2212               PERFORM VARYING W-IND FROM 1 BY 1 UNTIL            CIG0020
RQ2212                                            W-IND >  TOPE-V-CARDECCIG0020
RQ2212                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"           CIG0020
RQ2212                    ADD 1    TO 99MOR011TO01                      CIG0020
RQ2212                 END-IF                                           CIG0020
RQ2212               END-PERFORM                                        CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR011TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0006
CQ1343        IF SW-CODEUDOR = ZEROS                                    EHA0006
CQ1343           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                 EHA0006
CQ1343              IF MORA-NOV(NOV-REPORT-ABD07) = 1 *> MORA 30        EHA0006
CQ1343                 ADD 1 TO 99MOR011TO12                            EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343     END-IF.                                                      EHA0006
CQ1343*                                                                 EHA0006
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR011TC00-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212     IF COD-CTA-ABD07 = 02                                        CIG0020
RQ2212        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0020
RQ2212           MOVE   12   TO   TOPE-V-CARDEC                         CIG0020
RQ2212           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0020
RQ2212                                           W-IND >  TOPE-V-CARDEC CIG0020
RQ2212              IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"              CIG0020
RQ2212                 ADD 1    TO 99MOR011TC00                         CIG0020
RQ2212              END-IF                                              CIG0020
RQ2212           END-PERFORM                                            CIG0020
RQ2212        ELSE                                                      CIG0020
RQ2212           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0020
RQ2212              COMPUTE  TOPE-V-CARDEC = 12 - W-MESES-NOVEDAD-CARDECCIG0020
RQ2212              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0020
RQ2212                                           W-IND >  TOPE-V-CARDEC CIG0020
RQ2212                IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"            CIG0020
RQ2212                   ADD 1    TO 99MOR011TC00                       CIG0020
RQ2212                END-IF                                            CIG0020
RQ2212              END-PERFORM                                         CIG0020
RQ2212           END-IF                                                 CIG0020
RQ2212        END-IF                                                    CIG0020
RQ2212     END-IF                                                       CIG0020
RQ2212     .                                                            CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR013TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE MORAS HISTORICAS DE 60 EN OBLIGACIONES ABIERTAS Y     CIG0020
RQ2212* CERRADAS, APLICAN PARA EL SECTOR FINANCIERO, EN CALIDAD DE      CIG0020
RQ2212* TITULAR Y CODEUDOR.                                             CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0020
RQ2212            MOVE   12   TO   TOPE-V-CARDEC                        CIG0020
RQ2212            PERFORM VARYING W-IND FROM 1 BY 1 UNTIL               CIG0020
RQ2212                                            W-IND >  TOPE-V-CARDECCIG0020
RQ2212               IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"             CIG0020
RQ2212                  ADD 1    TO 99MOR013TO01                        CIG0020
RQ2212               END-IF                                             CIG0020
RQ2212            END-PERFORM                                           CIG0020
RQ2212         ELSE                                                     CIG0020
RQ2212            IF W-MESES-NOVEDAD-CARDEC <= 12                       CIG0020
RQ2212               COMPUTE  TOPE-V-CARDEC = 12 -                      CIG0020
RQ2212                                            W-MESES-NOVEDAD-CARDECCIG0020
RQ2212               PERFORM VARYING W-IND FROM 1 BY 1 UNTIL            CIG0020
RQ2212                                            W-IND >  TOPE-V-CARDECCIG0020
RQ2212                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"           CIG0020
RQ2212                    ADD 1    TO 99MOR013TO01                      CIG0020
RQ2212                 END-IF                                           CIG0020
RQ2212               END-PERFORM                                        CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR013TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0006
CQ1343        IF SW-CODEUDOR = ZEROS                                    EHA0006
CQ1343           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                 EHA0006
CQ1343              IF MORA-NOV(NOV-REPORT-ABD07) = 2 *> MORA 30        EHA0006
CQ1343                 ADD 1 TO 99MOR013TO12                            EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343     END-IF.                                                      EHA0006
CQ1343*                                                                 EHA0006
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR013TC00-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212     IF COD-CTA-ABD07 = 02                                        CIG0020
RQ2212        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0020
RQ2212           MOVE   12   TO   TOPE-V-CARDEC                         CIG0020
RQ2212           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0020
RQ2212                                           W-IND >  TOPE-V-CARDEC CIG0020
RQ2212              IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"              CIG0020
RQ2212                 ADD 1    TO 99MOR013TC00                         CIG0020
RQ2212              END-IF                                              CIG0020
RQ2212           END-PERFORM                                            CIG0020
RQ2212        ELSE                                                      CIG0020
RQ2212           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0020
RQ2212              COMPUTE  TOPE-V-CARDEC = 12 - W-MESES-NOVEDAD-CARDECCIG0020
RQ2212              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0020
RQ2212                                           W-IND >  TOPE-V-CARDEC CIG0020
RQ2212                IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"            CIG0020
RQ2212                   ADD 1    TO 99MOR013TC00                       CIG0020
RQ2212                END-IF                                            CIG0020
RQ2212              END-PERFORM                                         CIG0020
RQ2212           END-IF                                                 CIG0020
RQ2212        END-IF                                                    CIG0020
RQ2212     END-IF                                                       CIG0020
RQ2212     .                                                            CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR014TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE MORAS HISTORICAS DE 90 EN OBLIGACIONES ABIERTAS Y     CIG0020
RQ2212* CERRADAS, APLICAN PARA EL SECTOR FINANCIERO, EN CALIDAD DE      CIG0020
RQ2212* TITULAR Y CODEUDOR.                                             CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0020
RQ2212            MOVE   12   TO   TOPE-V-CARDEC                        CIG0020
RQ2212            PERFORM VARYING W-IND FROM 1 BY 1 UNTIL               CIG0020
RQ2212                                            W-IND >  TOPE-V-CARDECCIG0020
RQ2212               IF W-MORAS-HISTORY-CARDEC(W-IND) = "3"             CIG0020
RQ2212                  ADD 1    TO 99MOR014TO01                        CIG0020
RQ2212               END-IF                                             CIG0020
RQ2212            END-PERFORM                                           CIG0020
RQ2212         ELSE                                                     CIG0020
RQ2212            IF W-MESES-NOVEDAD-CARDEC <= 12                       CIG0020
RQ2212               COMPUTE  TOPE-V-CARDEC = 12 -                      CIG0020
RQ2212                                           W-MESES-NOVEDAD-CARDEC CIG0020
RQ2212               PERFORM VARYING W-IND FROM 1 BY 1 UNTIL            CIG0020
RQ2212                                            W-IND >  TOPE-V-CARDECCIG0020
RQ2212                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "3"           CIG0020
RQ2212                    ADD 1    TO 99MOR014TO01                      CIG0020
RQ2212                 END-IF                                           CIG0020
RQ2212               END-PERFORM                                        CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR014TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0006
CQ1343        IF SW-CODEUDOR = ZEROS                                    EHA0006
CQ1343           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                 EHA0006
CQ1343              IF MORA-NOV(NOV-REPORT-ABD07) = 3 *> MORA 90        EHA0006
CQ1343                 ADD 1 TO 99MOR014TO12                            EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343     END-IF.                                                      EHA0006
CQ1343*                                                                 EHA0006
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR014TC00-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212     IF COD-CTA-ABD07 = 02                                        CIG0020
RQ2212        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0020
RQ2212           MOVE   12   TO   TOPE-V-CARDEC                         CIG0020
RQ2212           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0020
RQ2212                                           W-IND >  TOPE-V-CARDEC CIG0020
RQ2212              IF W-MORAS-HISTORY-CARDEC(W-IND) = "3"              CIG0020
RQ2212                 ADD 1      TO 99MOR014TC00                       CIG0020
RQ2212              END-IF                                              CIG0020
RQ2212           END-PERFORM                                            CIG0020
RQ2212        ELSE                                                      CIG0020
RQ2212           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0020
RQ2212              COMPUTE  TOPE-V-CARDEC = 12 - W-MESES-NOVEDAD-CARDECCIG0020
RQ2212              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0020
RQ2212                                           W-IND >  TOPE-V-CARDEC CIG0020
RQ2212                IF W-MORAS-HISTORY-CARDEC(W-IND) = "3"            CIG0020
RQ2212                   ADD 1    TO 99MOR014TC00                       CIG0020
RQ2212                END-IF                                            CIG0020
RQ2212              END-PERFORM                                         CIG0020
RQ2212           END-IF                                                 CIG0020
RQ2212        END-IF                                                    CIG0020
RQ2212     END-IF                                                       CIG0020
RQ2212     .                                                            CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR015TO01-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212* NUMERO DE MORAS HISTORICAS DE 120 EN OBLIGACIONES ABIERTAS Y    CIG0020
RQ2212* CERRADAS, APLICAN PARA EL SECTOR FINANCIERO, EN CALIDAD DE      CIG0020
RQ2212* TITULAR Y CODEUDOR.                                             CIG0020
RQ2212      IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1                    CIG0020
RQ2212         IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1            CIG0020
RQ2212            MOVE   12   TO   TOPE-V-CARDEC                        CIG0020
RQ2212            PERFORM VARYING W-IND FROM 1 BY 1 UNTIL               CIG0020
RQ2212                                            W-IND >  TOPE-V-CARDECCIG0020
RQ2212               IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"             CIG0020
RQ2212                  ADD 1    TO 99MOR015TO01                        CIG0020
RQ2212               END-IF                                             CIG0020
RQ2212            END-PERFORM                                           CIG0020
RQ2212         ELSE                                                     CIG0020
RQ2212            IF W-MESES-NOVEDAD-CARDEC <= 12                       CIG0020
RQ2212               COMPUTE  TOPE-V-CARDEC = 12 -                      CIG0020
RQ2212                                            W-MESES-NOVEDAD-CARDECCIG0020
RQ2212               PERFORM VARYING W-IND FROM 1 BY 1 UNTIL            CIG0020
RQ2212                                            W-IND >  TOPE-V-CARDECCIG0020
RQ2212                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"           CIG0020
RQ2212                    ADD 1    TO 99MOR015TO01                      CIG0020
RQ2212                 END-IF                                           CIG0020
RQ2212               END-PERFORM                                        CIG0020
RQ2212            END-IF                                                CIG0020
RQ2212         END-IF                                                   CIG0020
RQ2212      END-IF                                                      CIG0020
RQ2212      .                                                           CIG0020
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR015TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0006
CQ1343        IF SW-CODEUDOR = ZEROS                                    EHA0006
CQ1343           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                 EHA0006
CQ1343              IF MORA-NOV(NOV-REPORT-ABD07) = 4 *> MORA 120       EHA0006
CQ1343                 ADD 1 TO 99MOR015TO12                            EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343     END-IF.                                                      EHA0006
CQ1343*                                                                 EHA0006
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212 5320-99MOR015TC00-CARDEC.                                        CIG0020
RQ2212*----------------------------------------------------------------*CIG0020
RQ2212     IF COD-CTA-ABD07 = 02                                        CIG0020
RQ2212        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0020
RQ2212           MOVE   12   TO   TOPE-V-CARDEC                         CIG0020
RQ2212           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0020
RQ2212                                           W-IND >  TOPE-V-CARDEC CIG0020
RQ2212              IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"              CIG0020
RQ2212                 ADD 1      TO 99MOR015TC00                       CIG0020
RQ2212              END-IF                                              CIG0020
RQ2212           END-PERFORM                                            CIG0020
RQ2212        ELSE                                                      CIG0020
RQ2212           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0020
RQ2212              COMPUTE  TOPE-V-CARDEC = 12 - W-MESES-NOVEDAD-CARDECCIG0020
RQ2212              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0020
RQ2212                                           W-IND >  TOPE-V-CARDEC CIG0020
RQ2212                IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"            CIG0020
RQ2212                   ADD 1    TO 99MOR015TC00                       CIG0020
RQ2212                END-IF                                            CIG0020
RQ2212              END-PERFORM                                         CIG0020
RQ2212           END-IF                                                 CIG0020
RQ2212        END-IF                                                    CIG0020
RQ2212     END-IF                                                       CIG0020
RQ2212     .                                                            CIG0020
      *----------------------------------------------------------------*        
       5320-CUENTA-MORAS-HIST-CARDEC.        
      *----------------------------------------------------------------*        
            MOVE    ZEROS     TO  TOPE-V-CARDEC        
            IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1        
               MOVE   12   TO   TOPE-V-CARDEC        
      *        PERFORM  5900-ACUM-MORAS-HISTORICAS        
               INSPECT W-MORAS-HISTORY-V-CARDEC        
                                         REPLACING  ALL "5" BY "N"        
               INSPECT W-MORAS-HISTORY-V-CARDEC        
                                         REPLACING  ALL "9" BY "-"        
               INSPECT W-MORAS-HISTORY-V-CARDEC        
                                         REPLACING  ALL "6" BY "-"        
               INSPECT W-MORAS-HISTORY-V-CARDEC        
                                         REPLACING  ALL "7" BY "-"        
               INSPECT W-MORAS-HISTORY-V-CARDEC        
                                         REPLACING  ALL "8" BY "N"        
               INSPECT W-MORAS-HISTORY-V-CARDEC        
                                         REPLACING  ALL "0" BY " "        
               PERFORM VARYING W-IND FROM 1 BY 1 UNTIL        
                                                 W-IND >  TOPE-V-CARDEC        
                  EVALUATE W-MORAS-HISTORY-CARDEC(W-IND)        
                     WHEN = "1" *> MORAS 30 DIAS
MOD734                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0005
MOD734                     "CD99MOR026TO00"                             EHA0005
MOD734                     IF W-IND <= 2                                EHA0005
MOD734                        IF SW-CODEUDOR = ZEROS                    EHA0005
MOD734                           IF 99MOR026TO00 < 2                    EHA0005
MOD734                              MOVE 2 TO  99MOR026TO00             EHA0005
MOD734                           END-IF                                 EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
MOD734                  END-IF                                          EHA0005
RQ2171*                                                                 EHA0017
RQ2171                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0017
RQ2171                     "CD99MOR026TO05"                             EHA0017
RQ2171                     IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2      EHA0017
RQ2171                      IF W-IND <= 2                               EHA0017
RQ2171                         IF SW-CODEUDOR = ZEROS                   EHA0017
RQ2171                            IF 99MOR026TO05 < 2                   EHA0017
RQ2171                               MOVE 2 TO  99MOR026TO05            EHA0017
RQ2171                            END-IF                                EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                      END-IF                                      EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171                  END-IF                                          EHA0017
RQ2171*                                                                 EHA0017
CQ1343                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0006
CQ1343                     "CD99MOR011TO12"                             EHA0006
CQ1343                     IF SW-CODEUDOR = ZEROS                       EHA0006
CQ1343                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1    EHA0006
CQ1343                           IF W-IND <= 11                         EHA0006
CQ1343                              ADD  1  TO  99MOR011TO12            EHA0006
CQ1343                           END-IF                                 EHA0006
CQ1343                        END-IF                                    EHA0006
CQ1343                     END-IF                                       EHA0006
CQ1343                  END-IF                                          EHA0006
CQ1342                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              DLM0007
CQ1342                     "CD99MOR011TO00"                             DLM0007
RQ2340                   IF SW-CODEUDOR = ZEROS                         EHA0021
CQ1342                     ADD  1  TO  99MOR011TO00                     DLM0007
RQ2340                   END-IF                                         EHA0021
CQ1342                  END-IF                                          DLM0007
CQ1342                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              DLM0007
CQ1342                     "CD99MOR012TO00"                             DLM0007
CQ1342                     ADD  1  TO  99MOR012TO00                     DLM0007
CQ1342                  END-IF                                          DLM0007
MD1033                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0003
MD1033                        "CD99MOR024EX58"                          EHA0003
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033                        IF SW-CODEUDOR = ZEROS                    EHA0003
MD1033                         IF  COD-CTA-ABD07  <>  23                EHA0003
MD1033                         AND  COD-CTA-ABD07  <>  29               EHA0003
MD1033                         AND  COD-SUS-ABD07  <>  24               EHA0003
MD1033                             ADD 1 TO W-NUM-MORAS-99MOR024EX58    EHA0003
MD1033                             IF ALTURA-MORA-99MOR024EX58 < 30     EHA0003
MD1033                                MOVE 30 TO                        EHA0003
MD1033                                     ALTURA-MORA-99MOR024EX58     EHA0003
MD1033                             END-IF                               EHA0003
MD1033                         END-IF                                   EHA0003
MD1033                        ELSE                                      EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                         IF NIT-SUSCRIP-S-ABD02 <> 00890200106 ANDEHA0003
MD1033                         NIT-SUSCRIP-S-ABD02 <> ZEROS             EHA0003
MD1033                            ADD 1 TO W-NUM-MORAS-99MOR024EX58     EHA0003
MD1033                            IF ALTURA-MORA-99MOR024EX58 < 30      EHA0003
MD1033                                MOVE 30 TO                        EHA0003
MD1033                                     ALTURA-MORA-99MOR024EX58     EHA0003
MD1033                            END-IF                                EHA0003
MD1033                         END-IF                                   EHA0003
MD1033                        END-IF                                    EHA0003
MD1033                     END-IF                                       EHA0003
                     WHEN = "2" *> MORAS 60 DIAS
MOD734                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0005
MOD734                     "CD99MOR026TO00"                             EHA0005
MOD734                     IF W-IND <= 2                                EHA0005
MOD734                        IF SW-CODEUDOR = ZEROS                    EHA0005
MOD734                          IF 99MOR026TO00 < 3                     EHA0005
MOD734                             MOVE 3 TO  99MOR026TO00              EHA0005
MOD734                          END-IF                                  EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
MOD734                  END-IF                                          EHA0005
RQ2171*                                                                 EHA0017
RQ2171                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0017
RQ2171                     "CD99MOR026TO05"                             EHA0017
RQ2171                     IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2      EHA0017
RQ2171                      IF W-IND <= 2                               EHA0017
RQ2171                         IF SW-CODEUDOR = ZEROS                   EHA0017
RQ2171                           IF 99MOR026TO05 < 3                    EHA0017
RQ2171                              MOVE 3 TO  99MOR026TO05             EHA0017
RQ2171                           END-IF                                 EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                      END-IF                                      EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171                  END-IF                                          EHA0017
RQ2171*                                                                 EHA0017
CQ1342                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              DLM0007
CQ1342                     "CD99MOR013TO12"                             DLM0007
CQ1342                     IF SW-CODEUDOR = ZEROS                       DLM0007
CQ1342                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1    DLM0007
CQ1342                           IF W-IND <= 11                         DLM0007
CQ1342                              ADD  1  TO  99MOR013TO12            DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
CQ1342                  END-IF                                          DLM0007
                        IF C-EST-CREDIT-CARDEC(I-CARDEC) =        
                           "CD99MOR013TO00"
RQ2340                   IF SW-CODEUDOR = ZEROS                         EHA0021
                           ADD  1  TO  99MOR013TO00        
RQ2340                   END-IF                                         EHA0021
                        END-IF
RQ1947                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              CIG0019
RQ1947                                                "CD99MOR013TO05"  CIG0019
RQ1947                     IF SW-CODEUDOR = ZEROS AND                   CIG0019
RQ1947                      (IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3)CIG0019
RQ1947                       ADD 1          TO  99MOR013TO05            CIG0019
RQ1947                     END-IF                                       CIG0019
RQ1947                  END-IF                                          CIG0019
MD1033                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0003
MD1033                     "CD99MOR024EX58"                             EHA0003
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033                   IF SW-CODEUDOR = ZEROS                         EHA0003
MD1033                    IF  COD-CTA-ABD07  <>  23                     EHA0003
MD1033                    AND  COD-CTA-ABD07  <>  29                    EHA0003
MD1033                    AND  COD-SUS-ABD07  <>  24                    EHA0003
MD1033                        ADD 1 TO W-NUM-MORAS-99MOR024EX58         EHA0003
MD1033                        IF ALTURA-MORA-99MOR024EX58 < 60          EHA0003
MD1033                           MOVE 60 TO ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                        END-IF                                    EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                   ELSE                                           EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                    IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND     EHA0003
MD1033                       NIT-SUSCRIP-S-ABD02 <> ZEROS               EHA0003
MD1033                       ADD 1 TO W-NUM-MORAS-99MOR024EX58          EHA0003
MD1033                       IF ALTURA-MORA-99MOR024EX58 < 60           EHA0003
MD1033                           MOVE 60 TO ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                  END-IF                                          EHA0003
                     WHEN = "3"  *> MORAS 90 DIAS
MOD734                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0005
MOD734                     "CD99MOR026TO00"                             EHA0005
MOD734                     IF W-IND <= 2                                EHA0005
MOD734                        IF SW-CODEUDOR = ZEROS                    EHA0005
MOD734                           IF 99MOR026TO00 < 4                    EHA0005
MOD734                              MOVE 4 TO  99MOR026TO00             EHA0005
MOD734                           END-IF                                 EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
MOD734                  END-IF                                          EHA0005
RQ2171*                                                                 EHA0017
RQ2171                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0017
RQ2171                     "CD99MOR026TO05"                             EHA0017
RQ2171                     IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2      EHA0017
RQ2171                      IF W-IND <= 2                               EHA0017
RQ2171                         IF SW-CODEUDOR = ZEROS                   EHA0017
RQ2171                            IF 99MOR026TO05 < 4                   EHA0017
RQ2171                               MOVE 4 TO  99MOR026TO05            EHA0017
RQ2171                            END-IF                                EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                      END-IF                                      EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171                  END-IF                                          EHA0017
RQ2171*                                                                 EHA0017
CQ1342                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              DLM0007
CQ1342                     "CD99MOR014TO12"                             DLM0007
CQ1342                     IF SW-CODEUDOR = ZEROS                       DLM0007
CQ1342                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1    DLM0007
CQ1342                           IF W-IND <= 11                         DLM0007
CQ1342                              ADD  1  TO  99MOR014TO12            DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
CQ1342                  END-IF                                          DLM0007
                        IF C-EST-CREDIT-CARDEC(I-CARDEC) =         
                           "CD99MOR014TO00"        
RQ2340                   IF SW-CODEUDOR = ZEROS                         EHA0021
                           ADD  1  TO  99MOR014TO00        
RQ2340                   END-IF                                         EHA0021
                        END-IF
RQ1947                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              CIG0019
RQ1947                                              "CD99MOR014TO05"    CIG0019
RQ1947                     IF SW-CODEUDOR = ZEROS AND                   CIG0019
RQ1947                        (IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR CIG0019
RQ1947                         3)                                       CIG0019
RQ1947                         ADD 1        TO 99MOR014TO05             CIG0019
RQ1947                     END-IF                                       CIG0019
RQ1947                  END-IF                                          CIG0019
MD1033*                                                                 EHA0003
MD1033                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0003
MD1033                     "CD99MOR024EX58"                             EHA0003
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033                   IF SW-CODEUDOR = ZEROS                         EHA0003
MD1033                    IF  COD-CTA-ABD07  <>  23                     EHA0003
MD1033                    AND COD-CTA-ABD07  <>  29                     EHA0003
MD1033                    AND COD-SUS-ABD07  <>  24                     EHA0003
MD1033                        ADD 1 TO W-NUM-MORAS-99MOR024EX58         EHA0003
MD1033                        IF ALTURA-MORA-99MOR024EX58 < 90          EHA0003
MD1033                           MOVE 90 TO ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                        END-IF                                    EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                   ELSE                                           EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                    IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND     EHA0003
MD1033                       NIT-SUSCRIP-S-ABD02 <> ZEROS               EHA0003
MD1033                       ADD 1 TO W-NUM-MORAS-99MOR024EX58          EHA0003
MD1033                       IF ALTURA-MORA-99MOR024EX58 < 90           EHA0003
MD1033                          MOVE 90 TO ALTURA-MORA-99MOR024EX58     EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                  END-IF                                          EHA0003
                     WHEN = "4" *> MORA 120 DIAS
MOD734                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0005
MOD734                     "CD99MOR026TO00"                             EHA0005
MOD734                     IF W-IND <= 2                                EHA0005
MOD734                        IF SW-CODEUDOR = ZEROS                    EHA0005
MOD734                             IF 99MOR026TO00 < 5                  EHA0005
MOD734                                MOVE 5 TO  99MOR026TO00           EHA0005
MOD734                             END-IF                               EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
MOD734                  END-IF                                          EHA0005
RQ2171*                                                                 EHA0017
RQ2171                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0017
RQ2171                     "CD99MOR026TO05"                             EHA0017
RQ2171                     IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2      EHA0017
RQ2171                      IF W-IND <= 2                               EHA0017
RQ2171                         IF SW-CODEUDOR = ZEROS                   EHA0017
RQ2171                              IF 99MOR026TO05 < 5                 EHA0017
RQ2171                                 MOVE 5 TO  99MOR026TO05          EHA0017
RQ2171                              END-IF                              EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                      END-IF                                      EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171                  END-IF                                          EHA0017
RQ2171*                                                                 EHA0017
CQ1342                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              DLM0007
CQ1342                     "CD99MOR015TO12"                             DLM0007
CQ1342                     IF SW-CODEUDOR = ZEROS                       DLM0007
CQ1342                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1    DLM0007
CQ1342                           IF W-IND <= 11                         DLM0007
CQ1342                              ADD  1  TO  99MOR015TO12            DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
CQ1342                  END-IF                                          DLM0007
CQ1342*                                                                 DLM0007
                        IF C-EST-CREDIT-CARDEC(I-CARDEC) =         
                           "CD99MOR015TO00"        
RQ2340                   IF SW-CODEUDOR = ZEROS                         EHA0021
                           ADD  1  TO  99MOR015TO00        
RQ2340                   END-IF                                         EHA0021
                        END-IF
RQ1947                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              CIG0019
RQ1947                                              "CD99MOR015TO05"    CIG0019
RQ1947                     IF SW-CODEUDOR = ZEROS AND                   CIG0019
RQ1947                        (IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR CIG0019
RQ1947                         3)                                       CIG0019
RQ1947                         ADD 1        TO 99MOR015TO05             CIG0019
RQ1947                     END-IF                                       CIG0019
RQ1947                  END-IF                                          CIG0019
MD1033                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0003
MD1033                     "CD99MOR024EX58"                             EHA0003
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033                   IF SW-CODEUDOR = ZEROS                         EHA0003
MD1033                    IF  COD-CTA-ABD07  <>  23                     EHA0003
MD1033                    AND COD-CTA-ABD07  <>  29                     EHA0003
MD1033                    AND COD-SUS-ABD07  <>  24                     EHA0003
MD1033                        ADD 1 TO W-NUM-MORAS-99MOR024EX58         EHA0003
MD1033                       IF ALTURA-MORA-99MOR024EX58 < 120          EHA0003
MD1033                          MOVE 120 TO ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                   ELSE                                           EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                    IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND     EHA0003
MD1033                       NIT-SUSCRIP-S-ABD02 <> ZEROS               EHA0003
MD1033                       ADD 1 TO W-NUM-MORAS-99MOR024EX58          EHA0003
MD1033                       IF ALTURA-MORA-99MOR024EX58 < 120          EHA0003
MD1033                          MOVE 120 TO ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               WHEN = "N" *> AL DIA                               EHA0003
MD1033               WHEN = "-"                                         EHA0003
MOD734                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0005
MOD734                     "CD99MOR026TO00"                             EHA0005
MOD734                     IF W-IND <= 2                                EHA0005
MOD734                        IF SW-CODEUDOR = ZEROS                    EHA0005
MOD734                             IF 99MOR026TO00 < 1                  EHA0005
MOD734                                MOVE 1 TO  99MOR026TO00           EHA0005
MOD734                             END-IF                               EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
MOD734                  END-IF                                          EHA0005
RQ2171*                                                                 EHA0017
RQ2171                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0017
RQ2171                     "CD99MOR026TO05"                             EHA0017
RQ2171                     IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2      EHA0017
RQ2171                      IF W-IND <= 2                               EHA0017
RQ2171                         IF SW-CODEUDOR = ZEROS                   EHA0017
RQ2171                              IF 99MOR026TO05 < 1                 EHA0017
RQ2171                                 MOVE 1 TO  99MOR026TO05          EHA0017
RQ2171                              END-IF                              EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                      END-IF                                      EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171                  END-IF                                          EHA0017
RQ2171*                                                                 EHA0017
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033* Se cuenta el número de reportes al dia o saltos antes del primerEHA0003
MD1033* reporte en mora                                                 EHA0003
MOD734                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0005
MOD734                     "CD99MOR024EX58"                             EHA0005
MD1033                  IF SW-CODEUDOR = ZEROS                          EHA0003
MD1033                     IF  COD-CTA-ABD07  <>  23                    EHA0003
MD1033                         AND COD-CTA-ABD07  <>  29                EHA0003
MD1033                         AND COD-SUS-ABD07  <>  24                EHA0003
MD1033                         IF ALTURA-MORA-99MOR024EX58 = ZEROS      EHA0003
MD1033                            ADD 1 TO W-OBL-DIA-99MOR024EX58       EHA0003
MD1033                         END-IF                                   EHA0003
MD1033                     END-IF                                       EHA0003
MD1033                  ELSE                                            EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                   IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND      EHA0003
MD1033                      NIT-SUSCRIP-S-ABD02 <> ZEROS                EHA0003
MD1033                      IF ALTURA-MORA-99MOR024EX58 = ZEROS         EHA0003
MD1033                         ADD 1 TO W-OBL-DIA-99MOR024EX58          EHA0003
MD1033                      END-IF                                      EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                  END-IF                                          EHA0003
MOD734                  END-IF                                          EHA0005
                  END-EVALUATE        
               END-PERFORM        
            ELSE        
               IF W-MESES-NOVEDAD-CARDEC <= 12        
                  COMPUTE  TOPE-V-CARDEC = 12 - W-MESES-NOVEDAD-CARDEC        
      *           PERFORM  5900-ACUM-MORAS-HISTORICAS        
                  INSPECT W-MORAS-HISTORY-V-CARDEC        
                                            REPLACING  ALL "5" BY "N"        
                  INSPECT W-MORAS-HISTORY-V-CARDEC        
                                            REPLACING  ALL "9" BY "-"        
                  INSPECT W-MORAS-HISTORY-V-CARDEC        
                                            REPLACING  ALL "6" BY "-"        
                  INSPECT W-MORAS-HISTORY-V-CARDEC        
                                            REPLACING  ALL "7" BY "-"        
                  INSPECT W-MORAS-HISTORY-V-CARDEC        
                                            REPLACING  ALL "8" BY "N"        
                  INSPECT W-MORAS-HISTORY-V-CARDEC        
                                            REPLACING  ALL "0" BY " "        
                  PERFORM VARYING W-IND FROM 1 BY 1 UNTIL        
                                                W-IND > TOPE-V-CARDEC        
                     EVALUATE W-MORAS-HISTORY-CARDEC(W-IND)        
                        WHEN = "1" *> MORAS 30 DIAS
CQ1342                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           DLM0007
CQ1342                        "CD99EXP002EX61"                          DLM0007
CQ1342                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1    DLM0007
CQ1342                           IF SW-CODEUDOR = ZEROS                 DLM0007
CQ1342                              ADD 1 TO MORAS30-99EXP002EX61       DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
MOD734                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0005
MOD734                        "CD99MOR026TO00"                          EHA0005
MOD734                        IF W-MESES-NOVEDAD-CARDEC <= 2            EHA0005
MOD734                          IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2EHA0005
MOD734                              IF SW-CODEUDOR = ZEROS              EHA0005
MOD734                                IF 99MOR026TO00 < 2               EHA0005
MOD734                                   MOVE 2 TO  99MOR026TO00        EHA0005
MOD734                                END-IF                            EHA0005
MOD734                              END-IF                              EHA0005
MOD734                          END-IF                                  EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
RQ2171*                                                                 EHA0017
RQ2171                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0017
RQ2171                        "CD99MOR026TO05"                          EHA0017
RQ2171                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2   EHA0017
RQ2171                         IF W-MESES-NOVEDAD-CARDEC <= 2           EHA0017
RQ2171                          IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2EHA0017
RQ2171                               IF SW-CODEUDOR = ZEROS             EHA0017
RQ2171                                 IF 99MOR026TO05 < 2              EHA0017
RQ2171                                    MOVE 2 TO  99MOR026TO05       EHA0017
RQ2171                                 END-IF                           EHA0017
RQ2171                               END-IF                             EHA0017
RQ2171                          END-IF                                  EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                        END-IF                                    EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171*                                                                 EHA0017
CQ1342*                    IF W-IND <= 6                                DLM0007
CQ1342                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           DLM0007
CQ1342                        "CD99MOR011TO12"                          DLM0007
CQ1342                        IF SW-CODEUDOR = ZEROS                    DLM0007
CQ1342                           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 DLM0007
CQ1342                              ADD  1  TO  99MOR011TO12            DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
CQ1342*                                                                 DLM0007
                              IF C-EST-CREDIT-CARDEC(I-CARDEC) =        
                                 "CD99MOR011TO00"        
RQ2340                         IF SW-CODEUDOR = ZEROS                   EHA0021
                                 ADD  1  TO  99MOR011TO00        
RQ2340                         END-IF                                   EHA0021
                              END-IF        
CQ1343*                    ELSE                                         EHA0006
                              IF C-EST-CREDIT-CARDEC(I-CARDEC) =        
                                 "CD99MOR012TO00"        
                                 ADD  1  TO  99MOR012TO00        
                              END-IF
MD1033                        IF C-EST-CREDIT-CARDEC(I-CARDEC) =        EHA0003
MD1033                           "CD99MOR024EX58"                       EHA0003
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033                         IF SW-CODEUDOR = ZEROS                   EHA0003
MD1033                          IF  COD-CTA-ABD07  <>  23               EHA0003
MD1033                          AND  COD-CTA-ABD07  <>  29              EHA0003
MD1033                          AND  COD-SUS-ABD07  <>  24              EHA0003
MD1033                              ADD 1 TO W-NUM-MORAS-99MOR024EX58   EHA0003
MD1033                              IF ALTURA-MORA-99MOR024EX58 < 30    EHA0003
MD1033                                 MOVE 30 TO                       EHA0003
MD1033                                      ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                              END-IF                              EHA0003
MD1033                          END-IF                                  EHA0003
MD1033                         ELSE                                     EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                          IF NIT-SUSCRIP-S-ABD02 <> 00890200106   EHA0003
MD1033                             AND NIT-SUSCRIP-S-ABD02 <> ZEROS     EHA0003
MD1033                             ADD 1 TO W-NUM-MORAS-99MOR024EX58    EHA0003
MD1033                             IF ALTURA-MORA-99MOR024EX58 < 30     EHA0003
MD1033                                 MOVE 30 TO                       EHA0003
MD1033                                      ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                             END-IF                               EHA0003
MD1033                          END-IF                                  EHA0003
MD1033                         END-IF                                   EHA0003
MD1033                        END-IF                                    EHA0003
CQ1343*                    END-IF                                       EHA0006
                        WHEN = "2"
CQ1342                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           DLM0007
CQ1342                        "CD99EXP002EX61"                          DLM0007
CQ1342                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1    DLM0007
CQ1342                           IF SW-CODEUDOR = ZEROS                 DLM0007
CQ1342                              ADD 1 TO MORAS60-99EXP002EX61       DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
MOD734                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0005
MOD734                        "CD99MOR026TO00"                          EHA0005
MOD734                        IF W-MESES-NOVEDAD-CARDEC <= 2            EHA0005
MOD734                          IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2EHA0005
MOD734                              IF SW-CODEUDOR = ZEROS              EHA0005
MOD734                                IF 99MOR026TO00 < 3               EHA0005
MOD734                                   MOVE 3 TO  99MOR026TO00        EHA0005
MOD734                                END-IF                            EHA0005
MOD734                              END-IF                              EHA0005
MOD734                          END-IF                                  EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
RQ2171*                                                                 EHA0017
RQ2171                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0017
RQ2171                        "CD99MOR026TO05"                          EHA0017
RQ2171                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2   EHA0017
RQ2171                         IF W-MESES-NOVEDAD-CARDEC <= 2           EHA0017
RQ2171                          IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2EHA0017
RQ2171                               IF SW-CODEUDOR = ZEROS             EHA0017
RQ2171                                 IF 99MOR026TO05 < 3              EHA0017
RQ2171                                    MOVE 3 TO  99MOR026TO05       EHA0017
RQ2171                                 END-IF                           EHA0017
RQ2171                               END-IF                             EHA0017
RQ2171                          END-IF                                  EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                        END-IF                                    EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171*                                                                 EHA0017
CQ1342*                                                                 DLM0007
CQ1342                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           DLM0007
CQ1342                        "CD99MOR013TO12"                          DLM0007
CQ1342                        IF SW-CODEUDOR = ZEROS                    DLM0007
CQ1342                           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 DLM0007
CQ1342                              ADD  1  TO  99MOR013TO12            DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
                           IF C-EST-CREDIT-CARDEC(I-CARDEC) =        
                              "CD99MOR013TO00"        
RQ2340                      IF SW-CODEUDOR = ZEROS                      EHA0021
                              ADD  1  TO  99MOR013TO00        
RQ2340                      END-IF                                      EHA0021
                           END-IF
RQ1947                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           CIG0019
RQ1947                                                 "CD99MOR013TO05" CIG0019
RQ1947                        IF SW-CODEUDOR = ZEROS AND                CIG0019
RQ1947                         (IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 ORCIG0019
RQ1947                          3)                                      CIG0019
RQ1947                          ADD 1          TO  99MOR013TO05         CIG0019
RQ1947                        END-IF                                    CIG0019
RQ1947                     END-IF                                       CIG0019
MD1033                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0003
MD1033                        "CD99MOR024EX58"                          EHA0003
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033                      IF SW-CODEUDOR = ZEROS                      EHA0003
MD1033                       IF  COD-CTA-ABD07  <>  23                  EHA0003
MD1033                       AND  COD-CTA-ABD07  <>  29                 EHA0003
MD1033                       AND  COD-SUS-ABD07  <>  24                 EHA0003
MD1033                           ADD 1 TO W-NUM-MORAS-99MOR024EX58      EHA0003
MD1033                           IF ALTURA-MORA-99MOR024EX58 < 60       EHA0003
MD1033                              MOVE 60 TO ALTURA-MORA-99MOR024EX58 EHA0003
MD1033                           END-IF                                 EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                      ELSE                                        EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                       IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND  EHA0003
MD1033                          NIT-SUSCRIP-S-ABD02 <> ZEROS            EHA0003
MD1033                          ADD 1 TO W-NUM-MORAS-99MOR024EX58       EHA0003
MD1033                          IF ALTURA-MORA-99MOR024EX58 < 60        EHA0003
MD1033                              MOVE 60 TO ALTURA-MORA-99MOR024EX58 EHA0003
MD1033                          END-IF                                  EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                      END-IF                                      EHA0003
MD1033                     END-IF                                       EHA0003
                        WHEN = "3" *> MORA 90 DIAS
CQ1342                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           DLM0007
CQ1342                        "CD99EXP002EX61"                          DLM0007
CQ1342                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1    DLM0007
CQ1342                           IF SW-CODEUDOR = ZEROS                 DLM0007
CQ1342                              ADD 1 TO MORAS90-99EXP002EX61       DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
MOD734                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0005
MOD734                        "CD99MOR026TO00"                          EHA0005
MOD734                        IF W-MESES-NOVEDAD-CARDEC <= 2            EHA0005
MOD734                          IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2EHA0005
MOD734                              IF SW-CODEUDOR = ZEROS              EHA0005
MOD734                                IF 99MOR026TO00 < 4               EHA0005
MOD734                                   MOVE 4 TO  99MOR026TO00        EHA0005
MOD734                                END-IF                            EHA0005
MOD734                              END-IF                              EHA0005
MOD734                          END-IF                                  EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
RQ2171*                                                                 EHA0017
RQ2171                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0017
RQ2171                        "CD99MOR026TO05"                          EHA0017
RQ2171                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2   EHA0017
RQ2171                         IF W-MESES-NOVEDAD-CARDEC <= 2           EHA0017
RQ2171                          IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2EHA0017
RQ2171                               IF SW-CODEUDOR = ZEROS             EHA0017
RQ2171                                 IF 99MOR026TO05 < 4              EHA0017
RQ2171                                    MOVE 4 TO  99MOR026TO05       EHA0017
RQ2171                                 END-IF                           EHA0017
RQ2171                               END-IF                             EHA0017
RQ2171                          END-IF                                  EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                        END-IF                                    EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171*                                                                 EHA0017
CQ1342*                                                                 DLM0007
CQ1342                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           DLM0007
CQ1342                        "CD99MOR014TO12"                          DLM0007
CQ1342                        IF SW-CODEUDOR = ZEROS                    DLM0007
CQ1342                           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 DLM0007
CQ1342                              ADD  1  TO  99MOR014TO12            DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
                           IF C-EST-CREDIT-CARDEC(I-CARDEC) =         
                              "CD99MOR014TO00"        
RQ2340                      IF SW-CODEUDOR = ZEROS                      EHA0021
                              ADD  1  TO  99MOR014TO00        
RQ2340                      END-IF                                      EHA0021
                           END-IF
RQ1947                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           CIG0019
RQ1947                                                 "CD99MOR014TO05" CIG0019
RQ1947                        IF SW-CODEUDOR = ZEROS AND                CIG0019
RQ1947                         (IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 ORCIG0019
RQ1947                          3)                                      CIG0019
RQ1947                            ADD 1        TO 99MOR014TO05          CIG0019
RQ1947                        END-IF                                    CIG0019
RQ1947                     END-IF                                       CIG0019
MD1033                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0003
MD1033                        "CD99MOR024EX58"                          EHA0003
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033                      IF SW-CODEUDOR = ZEROS                      EHA0003
MD1033                       IF  COD-CTA-ABD07  <>  23                  EHA0003
MD1033                       AND COD-CTA-ABD07  <>  29                  EHA0003
MD1033                       AND COD-SUS-ABD07  <>  24                  EHA0003
MD1033                           ADD 1 TO W-NUM-MORAS-99MOR024EX58      EHA0003
MD1033                           IF ALTURA-MORA-99MOR024EX58 < 90       EHA0003
MD1033                              MOVE 90 TO ALTURA-MORA-99MOR024EX58 EHA0003
MD1033                           END-IF                                 EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                      ELSE                                        EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                       IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND  EHA0003
MD1033                          NIT-SUSCRIP-S-ABD02 <> ZEROS            EHA0003
MD1033                          ADD 1 TO W-NUM-MORAS-99MOR024EX58       EHA0003
MD1033                          IF ALTURA-MORA-99MOR024EX58 < 90        EHA0003
MD1033                             MOVE 90 TO ALTURA-MORA-99MOR024EX58  EHA0003
MD1033                          END-IF                                  EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                      END-IF                                      EHA0003
MD1033                     END-IF                                       EHA0003
                        WHEN = "4" *> MORA 120 DIAS
CQ1342                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           DLM0007
CQ1342                        "CD99EXP002EX61"                          DLM0007
CQ1342                        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1    DLM0007
CQ1342                           IF SW-CODEUDOR = ZEROS                 DLM0007
CQ1342                              ADD 1 TO MORAS120-99EXP002EX61      DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
MOD734                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0005
MOD734                        "CD99MOR026TO00"                          EHA0005
MOD734                       IF W-MESES-NOVEDAD-CARDEC <= 2             EHA0005
MOD734                          IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2EHA0005
MOD734                             IF SW-CODEUDOR = ZEROS               EHA0005
MOD734                               IF 99MOR026TO00 < 5                EHA0005
MOD734                                  MOVE 5 TO  99MOR026TO00         EHA0005
MOD734                               END-IF                             EHA0005
MOD734                             END-IF                               EHA0005
MOD734                          END-IF                                  EHA0005
MOD734                       END-IF                                     EHA0005
MOD734                     END-IF                                       EHA0005
RQ2171*                                                                 EHA0017
RQ2171                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           EHA0017
RQ2171                        "CD99MOR026TO05"                          EHA0017
RQ2171                       IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2    EHA0017
RQ2171                        IF W-MESES-NOVEDAD-CARDEC <= 2            EHA0017
RQ2171                          IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2EHA0017
RQ2171                              IF SW-CODEUDOR = ZEROS              EHA0017
RQ2171                                IF 99MOR026TO05 < 5               EHA0017
RQ2171                                   MOVE 5 TO  99MOR026TO05        EHA0017
RQ2171                                END-IF                            EHA0017
RQ2171                              END-IF                              EHA0017
RQ2171                          END-IF                                  EHA0017
RQ2171                        END-IF                                    EHA0017
RQ2171                       END-IF                                     EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171*                                                                 EHA0017
CQ1342*                                                                 DLM0007
CQ1342                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           DLM0007
CQ1342                        "CD99MOR015TO12"                          DLM0007
CQ1342                        IF SW-CODEUDOR = ZEROS                    DLM0007
CQ1342                           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 DLM0007
CQ1342                              ADD  1  TO  99MOR015TO12            DLM0007
CQ1342                           END-IF                                 DLM0007
CQ1342                        END-IF                                    DLM0007
CQ1342                     END-IF                                       DLM0007
                           IF C-EST-CREDIT-CARDEC(I-CARDEC) =         
                              "CD99MOR015TO00"        
RQ2340                      IF SW-CODEUDOR = ZEROS                      EHA0021
                              ADD  1  TO  99MOR015TO00        
RQ2340                      END-IF                                      EHA0021
                           END-IF
RQ1947                     IF C-EST-CREDIT-CARDEC(I-CARDEC) =           CIG0019
RQ1947                                                 "CD99MOR015TO05" CIG0019
RQ1947                        IF SW-CODEUDOR = ZEROS AND                CIG0019
RQ1947                         (IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 ORCIG0019
RQ1947                          3)                                      CIG0019
RQ1947                          ADD 1          TO  99MOR015TO05         CIG0019
RQ1947                        END-IF                                    CIG0019
RQ1947                     END-IF                                       CIG0019
MD1033                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0003
MD1033                     "CD99MOR024EX58"                             EHA0003
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033                   IF SW-CODEUDOR = ZEROS                         EHA0003
MD1033                    IF  COD-CTA-ABD07  <>  23                     EHA0003
MD1033                    AND COD-CTA-ABD07  <>  29                     EHA0003
MD1033                    AND COD-SUS-ABD07  <>  24                     EHA0003
MD1033                        ADD 1 TO W-NUM-MORAS-99MOR024EX58         EHA0003
MD1033                       IF ALTURA-MORA-99MOR024EX58 < 120          EHA0003
MD1033                          MOVE 120 TO ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                   ELSE                                           EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                    IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND     EHA0003
MD1033                       NIT-SUSCRIP-S-ABD02 <> ZEROS               EHA0003
MD1033                       ADD 1 TO W-NUM-MORAS-99MOR024EX58          EHA0003
MD1033                       IF ALTURA-MORA-99MOR024EX58 < 120          EHA0003
MD1033                          MOVE 120 TO ALTURA-MORA-99MOR024EX58    EHA0003
MD1033                       END-IF                                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               WHEN = "N"  *> AL DIA                              EHA0003
MD1033               WHEN = "-"                                         EHA0003
MOD734                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0005
MOD734                     "CD99MOR026TO00"                             EHA0005
MOD734                     IF W-MESES-NOVEDAD-CARDEC <= 2               EHA0005
MOD734                        IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2  EHA0005
MOD734                           IF SW-CODEUDOR = ZEROS                 EHA0005
MOD734                             IF 99MOR026TO00 < 1                  EHA0005
MOD734                                MOVE 1 TO  99MOR026TO00           EHA0005
MOD734                             END-IF                               EHA0005
MOD734                           END-IF                                 EHA0005
MOD734                        END-IF                                    EHA0005
MOD734                     END-IF                                       EHA0005
MOD734                  END-IF                                          EHA0005
RQ2171*                                                                 EHA0017
RQ2171                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0017
RQ2171                     "CD99MOR026TO05"                             EHA0017
RQ2171                     IF IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2      EHA0017
RQ2171                      IF W-MESES-NOVEDAD-CARDEC <= 2              EHA0017
RQ2171                         IF (W-IND + W-MESES-NOVEDAD-CARDEC) <= 2 EHA0017
RQ2171                            IF SW-CODEUDOR = ZEROS                EHA0017
RQ2171                              IF 99MOR026TO05 < 1                 EHA0017
RQ2171                                 MOVE 1 TO  99MOR026TO05          EHA0017
RQ2171                              END-IF                              EHA0017
RQ2171                            END-IF                                EHA0017
RQ2171                         END-IF                                   EHA0017
RQ2171                      END-IF                                      EHA0017
RQ2171                     END-IF                                       EHA0017
RQ2171                  END-IF                                          EHA0017
RQ2171*                                                                 EHA0017
MD1033* Se tienen en cuenta obligaciones como titular de todos los      EHA0003
MD1033* mercados a excepción de Servicios publicos y telcos             EHA0003
MD1033* Se cuenta el número de reportes al dia o saltos antes del primerEHA0003
MD1033* reporte en mora                                                 EHA0003
MOD734                  IF C-EST-CREDIT-CARDEC(I-CARDEC) =              EHA0005
MOD734                     "CD99MOR024EX58"                             EHA0005
MD1033                  IF SW-CODEUDOR = ZEROS                          EHA0003
MD1033                     IF  COD-CTA-ABD07  <>  23                    EHA0003
MD1033                         AND COD-CTA-ABD07  <>  29                EHA0003
MD1033                         AND COD-SUS-ABD07  <>  24                EHA0003
MD1033                         IF ALTURA-MORA-99MOR024EX58 = ZEROS      EHA0003
MD1033                            ADD 1 TO W-OBL-DIA-99MOR024EX58       EHA0003
MD1033                         END-IF                                   EHA0003
MD1033                     END-IF                                       EHA0003
MD1033                  ELSE                                            EHA0003
MD1033* Para coopfuturo se tiene en cuenta las obligaciones como codeudoEHA0003
MD1033                   IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND      EHA0003
MD1033                      NIT-SUSCRIP-S-ABD02 <> ZEROS                EHA0003
MD1033                      IF ALTURA-MORA-99MOR024EX58 = ZEROS         EHA0003
MD1033                         ADD 1 TO W-OBL-DIA-99MOR024EX58          EHA0003
MD1033                      END-IF                                      EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                  END-IF                                          EHA0003
MOD734                  END-IF                                          EHA0005
                     END-EVALUATE        
                  END-PERFORM        
               END-IF        
            END-IF.        
      *----------------------------------------------------------------*        
       5320-99MOR016TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF ADJETIVO1-ABD07 = 2 OR    *>   Cuenta en Cobrador        
               ADJETIVO2-ABD07 = 2 OR        
               ADJETIVO3-ABD07 = 2        
RQ2340       IF SW-CODEUDOR = ZEROS                                     EHA0021
               ADD  1  TO  99MOR016TO00        
RQ2340       END-IF                                                     EHA0021
            END-IF.
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR016TO12-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343      IF SW-CODEUDOR = ZEROS                                      EHA0006
CQ1343         IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                   EHA0006
CQ1343            IF ADJETIVO1-ABD07 = 2 OR    *>   Cuenta en Cobrador  EHA0006
CQ1343               ADJETIVO2-ABD07 = 2 OR                             EHA0006
CQ1343               ADJETIVO3-ABD07 = 2                                EHA0006
CQ1343               ADD  1  TO  99MOR016TO12                           EHA0006
CQ1343            END-IF                                                EHA0006
CQ1343         END-IF                                                   EHA0006
CQ1343      END-IF.                                                     EHA0006
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR017TO00-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 01                                           EHA0002
ADDCAR                   ADD  1  TO  99MOR017TO00                       EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR017TO02-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 01                                           EHA0002
RQ1947                   IF  IND-SECTOR-CARTERA(COD-CTA-ABD07) = 02 AND CIG0019
ADDCAR                       COD-CTA-ABD07 NOT = 23 AND                 EHA0002
ADDCAR                       COD-CTA-ABD07 NOT = 24                     EHA0002
ADDCAR                       ADD  1  TO  99MOR017TO02                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR 5320-99MOR017TO05-CARDEC.                                        EHA0002
ADDCAR*----------------------------------------------------------------*EHA0002
ADDCAR      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0002
ADDCAR         IF SW-CODEUDOR = ZEROS                                   EHA0002
ADDCAR          EVALUATE TAB-NOV-CART-CODINT(NOV-REPORT-ABD07)          EHA0002
ADDCAR                WHEN 01                                           EHA0002
RQ1947                   IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 01 OR 03CIG0019
ADDCAR                       ADD  1  TO  99MOR017TO05                   EHA0002
ADDCAR                   END-IF                                         EHA0002
ADDCAR          END-EVALUATE                                            EHA0002
ADDCAR         END-IF                                                   EHA0002
ADDCAR      END-IF.                                                     EHA0002
ADDCAR*                                                                 EHA0002
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99MOR018EX58-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0003
MD1033* SE EXCLUYEN LAS CUENTAS 29, 23 Y 24 DE LA EVALUACION            EHA0003
MD1033         IF COD-CTA-ABD07 <> 29 AND COD-CTA-ABD07 <> 23 AND       EHA0003
MD1033            COD-CTA-ABD07 <> 24                                   EHA0003
MD1033* CARTERA CASTIGADA                                               EHA0003
MD1033             IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 09        EHA0003
MD1033                IF 99MOR018EX58 < 9                               EHA0003
MD1033                   MOVE 9 TO 99MOR018EX58                         EHA0003
MD1033                END-IF                                            EHA0003
MD1033             ELSE                                                 EHA0003
MD1033* DUDOSO RECAUDO                                                  EHA0003
MD1033              IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 11       EHA0003
MD1033                 IF 99MOR018EX58 < 8                              EHA0003
MD1033                    MOVE 8 TO 99MOR018EX58                        EHA0003
MD1033                 END-IF                                           EHA0003
MD1033              ELSE                                                EHA0003
MD1033* FALLECIDO                                                       EHA0003
MD1033               IF ADJETIVO1-ABD07 = 1                             EHA0003
MD1033                  IF 99MOR018EX58 < 6                             EHA0003
MD1033                     MOVE 6 TO 99MOR018EX58                       EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               END-IF                                             EHA0003
MD1033               IF ADJETIVO2-ABD07 = 1                             EHA0003
MD1033                  IF 99MOR018EX58 < 6                             EHA0003
MD1033                     MOVE 6 TO 99MOR018EX58                       EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               END-IF                                             EHA0003
MD1033               IF ADJETIVO3-ABD07 = 1                             EHA0003
MD1033                  IF 99MOR018EX58 < 6                             EHA0003
MD1033                     MOVE 6 TO 99MOR018EX58                       EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               END-IF                                             EHA0003
MD1033              END-IF                                              EHA0003
MD1033             END-IF                                               EHA0003
MD1033         END-IF                                                   EHA0003
MD1033      ELSE                                                        EHA0003
CQ1343* CANCELADAS MAL MANEJO                                           EHA0006
CQ1343       IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 08              EHA0006
CQ1343          IF 99MOR018EX58 < 7                                     EHA0006
CQ1343             MOVE 7 TO 99MOR018EX58                               EHA0006
CQ1343          END-IF                                                  EHA0006
CQ1343       ELSE                                                       EHA0006
MD1033*  Se evaluan los estados cartera recuperada                      EHA0003
CQ1343        IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 10             EHA0006
CQ1343           IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND *>cajasan    EHA0006
CQ1343              NIT-SUSCRIP-S-ABD02 <> ZEROS                        EHA0006
CQ1343              IF 99MOR018EX58 < 5                                 EHA0006
CQ1343                 MOVE 5 TO 99MOR018EX58                           EHA0006
MD1033              END-IF                                              EHA0003
CQ1343           ELSE                                                   EHA0006
CQ1343            IF SW-CODEUDOR <> ZEROS                               EHA0006
CQ1343               IF COD-CTA-ABD07 <> 29 AND COD-CTA-ABD07 <> 23 AND EHA0006
CQ1343                  COD-CTA-ABD07 <> 24                             EHA0006
CQ1343                  IF 99MOR018EX58 < 5                             EHA0006
CQ1343                     MOVE 5 TO 99MOR018EX58                       EHA0006
CQ1343                  END-IF                                          EHA0006
CQ1343               END-IF                                             EHA0006
CQ1343            END-IF                                                EHA0006
MD1033           END-IF                                                 EHA0003
CQ1343        END-IF                                                    EHA0006
MD1033       END-IF                                                     EHA0003
MD1033      END-IF.                                                     EHA0003
MD1033*                                                                 EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99MOR019EX58-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0003
MD1033       IF COD-CTA-ABD07 <> 29 AND COD-CTA-ABD07 <> 23 AND         EHA0003
MD1033          COD-CTA-ABD07 <> 24                                     EHA0003
MD1033* MORAS 30 DIAS                                                   EHA0003
MD1033          IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 12           EHA0003
MD1033             CONTINUE                                             EHA0003
MD1033          ELSE                                                    EHA0003
MD1033* MORAS 60 DIAS                                                   EHA0003
MD1033           IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 13          EHA0003
MD1033             IF SW-CODEUDOR = ZEROS                               EHA0003
MD1033              IF 99MOR019EX58 < 2                                 EHA0003
MD1033                 MOVE 2 TO 99MOR019EX58                           EHA0003
MD1033              END-IF                                              EHA0003
MD1033             END-IF                                               EHA0003
MD1033           ELSE                                                   EHA0003
MD1033* MORAS 90 DIAS                                                   EHA0003
MD1033            IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 14         EHA0003
MD1033               IF SW-CODEUDOR <> ZEROS                            EHA0003
CQ1949*                 IF 99MOR019EX58 < 3                             EHA0015
CQ1949*                    MOVE 3 TO 99MOR019EX58                       EHA0015
CQ1949*                 END-IF                                          EHA0015
CQ1949                  CONTINUE                                        EHA0015
MD1033               ELSE                                               EHA0003
MD1033                  IF 99MOR019EX58 < 3                             EHA0003
MD1033                     MOVE 3 TO 99MOR019EX58                       EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               END-IF                                             EHA0003
MD1033            ELSE                                                  EHA0003
MD1033* MORAS 120 DIAS                                                  EHA0003
MD1033             IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 15        EHA0003
MD1033                IF SW-CODEUDOR <> ZEROS                           EHA0003
CQ1949*                  IF 99MOR019EX58 < 4                            EHA0015
CQ1949*                     MOVE 4 TO 99MOR019EX58                      EHA0015
CQ1949*                  END-IF                                         EHA0015
CQ1949                   CONTINUE                                       EHA0015
MD1033                ELSE                                              EHA0003
MD1033                   IF 99MOR019EX58 < 4                            EHA0003
MD1033                      MOVE 4 TO 99MOR019EX58                      EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                END-IF                                            EHA0003
MD1033             END-IF                                               EHA0003
MD1033            END-IF                                                EHA0003
MD1033           END-IF                                                 EHA0003
MD1033          END-IF                                                  EHA0003
MD1033       END-IF                                                     EHA0003
MD1033      END-IF.                                                     EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99MOR020EX58-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               EHA0003
MD1033       IF COD-CTA-ABD07 <> 29 AND COD-CTA-ABD07 <> 23 AND         EHA0003
MD1033          COD-CTA-ABD07 <> 24                                     EHA0003
MD1033* MORAS 30 DIAS                                                   EHA0003
MD1033          IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 12           EHA0003
CQ1949*            IF SW-CODEUDOR = ZEROS                               EHA0015
MD1033              IF 99MOR020EX58 < 1                                 EHA0003
MD1033                 MOVE 1 TO 99MOR020EX58                           EHA0003
MD1033              END-IF                                              EHA0003
CQ1949*            END-IF                                               EHA0015
MD1033          ELSE                                                    EHA0003
MD1033* MORAS 60 DIAS                                                   EHA0003
MD1033           IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 13          EHA0003
MD1033              IF 99MOR020EX58 < 2                                 EHA0003
MD1033                 MOVE 2 TO 99MOR020EX58                           EHA0003
MD1033              END-IF                                              EHA0003
MD1033           ELSE                                                   EHA0003
MD1033* MORAS 90 DIAS                                                   EHA0003
MD1033            IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 14         EHA0003
MD1033               IF SW-CODEUDOR <> ZEROS                            EHA0003
MD1033                  IF 99MOR020EX58 < 3                             EHA0003
MD1033                     MOVE 3 TO 99MOR020EX58                       EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               ELSE                                               EHA0003
MD1033                  IF 99MOR020EX58 < 3                             EHA0003
MD1033                     MOVE 3 TO 99MOR020EX58                       EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               END-IF                                             EHA0003
MD1033            ELSE                                                  EHA0003
MD1033* MORAS 120 DIAS                                                  EHA0003
MD1033             IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 15        EHA0003
MD1033                IF SW-CODEUDOR <> ZEROS                           EHA0003
MD1033                   IF 99MOR020EX58 < 4                            EHA0003
MD1033                      MOVE 4 TO 99MOR020EX58                      EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                ELSE                                              EHA0003
MD1033                   IF 99MOR020EX58 < 4                            EHA0003
MD1033                      MOVE 4 TO 99MOR020EX58                      EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                END-IF                                            EHA0003
MD1033             END-IF                                               EHA0003
MD1033            END-IF                                                EHA0003
MD1033           END-IF                                                 EHA0003
MD1033          END-IF                                                  EHA0003
MD1033       END-IF                                                     EHA0003
MD1033      END-IF.                                                     EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99MOR020TO04-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033      IF COD-CTA-ABD07 = 23 OR COD-CTA-ABD07 = 24                 EHA0003
MD1033       IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1              EHA0003
MD1033* MORAS 30 DIAS                                                   EHA0003
MD1033          IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 12           EHA0003
MD1033              IF 99MOR020TO04 < 1                                 EHA0003
MD1033                 MOVE 1 TO 99MOR020TO04                           EHA0003
MD1033              END-IF                                              EHA0003
MD1033             END-IF                                               EHA0003
MD1033          ELSE                                                    EHA0003
MD1033* MORAS 60 DIAS                                                   EHA0003
MD1033           IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 13          EHA0003
MD1033              IF 99MOR020TO04 < 2                                 EHA0003
MD1033                 MOVE 2 TO 99MOR020TO04                           EHA0003
MD1033              END-IF                                              EHA0003
MD1033           ELSE                                                   EHA0003
MD1033* MORAS 90 DIAS                                                   EHA0003
MD1033            IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 14         EHA0003
MD1033               IF 99MOR020TO04 < 3                                EHA0003
MD1033                  MOVE 3 TO 99MOR020TO04                          EHA0003
MD1033               END-IF                                             EHA0003
MD1033            ELSE                                                  EHA0003
MD1033* MORAS 120 DIAS                                                  EHA0003
MD1033             IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 15        EHA0003
MD1033                IF 99MOR020TO04 < 4                               EHA0003
MD1033                   MOVE 4 TO 99MOR020TO04                         EHA0003
MD1033                END-IF                                            EHA0003
MD1033             ELSE                                                 EHA0003
MD1033* CARTERA CASTIGADA                                               EHA0003
MD1033               IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 09      EHA0003
MD1033                  IF 99MOR020TO04 < 9                             EHA0003
MD1033                     MOVE 9 TO 99MOR020TO04                       EHA0003
MD1033                  END-IF                                          EHA0003
MD1033               ELSE                                               EHA0003
MD1033* DUDOSO RECAUDO                                                  EHA0003
MD1033                IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 11     EHA0003
MD1033                   IF 99MOR020TO04 < 8                            EHA0003
MD1033                      MOVE 8 TO 99MOR020TO04                      EHA0003
MD1033                   END-IF                                         EHA0003
MD1033                ELSE                                              EHA0003
MD1033* FALLECIDO                                                       EHA0003
MD1033                 IF ADJETIVO1-ABD07 = 1                           EHA0003
MD1033                    IF 99MOR020TO04 < 6                           EHA0003
MD1033                       MOVE 6 TO 99MOR020TO04                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                 END-IF                                           EHA0003
MD1033                 IF ADJETIVO2-ABD07 = 1                           EHA0003
MD1033                    IF 99MOR020TO04 < 6                           EHA0003
MD1033                       MOVE 6 TO 99MOR020TO04                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                 END-IF                                           EHA0003
MD1033                 IF ADJETIVO3-ABD07 = 1                           EHA0003
MD1033                    IF 99MOR020TO04 < 6                           EHA0003
MD1033                       MOVE 6 TO 99MOR020TO04                     EHA0003
MD1033                    END-IF                                        EHA0003
MD1033                 END-IF                                           EHA0003
MD1033                END-IF                                            EHA0003
MD1033               END-IF                                             EHA0003
MD1033           END-IF                                                 EHA0003
MD1033       ELSE                                                       EHA0003
CQ1343* CANCELADAS MAL MANEJO                                           EHA0006
CQ1343        IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 08             EHA0006
CQ1343           IF 99MOR020TO04 < 7                                    EHA0006
CQ1343              MOVE 7 TO 99MOR020TO04                              EHA0006
MD1033           END-IF                                                 EHA0003
CQ1343        ELSE                                                      EHA0006
CQ1343*  Se evaluan los estados cartera recuperada                      EHA0006
CQ1343         IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 10            EHA0006
CQ1343            IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND *>cajasan   EHA0006
CQ1343               NIT-SUSCRIP-S-ABD02 <> ZEROS                       EHA0006
CQ1343               IF 99MOR020TO04 < 5                                EHA0006
CQ1343                  MOVE 5 TO 99MOR020TO04                          EHA0006
CQ1343               END-IF                                             EHA0006
CQ1343            END-IF                                                EHA0006
CQ1343         END-IF                                                   EHA0006
MD1033        END-IF                                                    EHA0003
MD1033       END-IF.                                                    EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99MOR021TO00-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033       IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1             EHA0003
MD1033          IF SITUACION-TITULAR-ABD07 = 5 OR                       EHA0003
MD1033             SITUACION-TITULAR-ABD07 = 6                          EHA0003
MD1033             ADD 1 TO 99MOR021TO00                                EHA0003
MD1033          END-IF                                                  EHA0003
MD1033       END-IF.                                                    EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99MOR022TO00-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033       IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1             EHA0003
MD1033* SE VERIFICA SI LA OBLIGACION FIGURA COMO REESTRUCTURADA         EHA0003
MD1033          IF ESTADO-ORIGEN-ABD07 = 1                              EHA0003
MD1033             ADD 1 TO 99MOR022TO00                                EHA0003
MD1033          END-IF                                                  EHA0003
MD1033       END-IF.                                                    EHA0003
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR022TO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947       IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1             CIG0019
RQ1947          IF ESTADO-ORIGEN-ABD07 = 1 AND                          CIG0019
RQ1947             (IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3)         CIG0019
RQ1947             ADD 1                 TO 99MOR022TO05                CIG0019
RQ1947          END-IF                                                  CIG0019
RQ1947       END-IF                                                     CIG0019
RQ1947       .                                                          CIG0019
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99MOR023TC00-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0003
MD1033        CONTINUE                                                  EHA0003
MD1033     ELSE                                                         EHA0003
MD1033*  Se evaluan los estados cartera recuperada y no renovada        EHA0003
MD1033        IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 49             EHA0003
MD1033           ADD 1 TO 99MOR023TC00                                  EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-IF.                                                      EHA0003
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR023TC05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947     IF NOV-REPORT-ABD07 = 49 AND SW-CODEUDOR  =  ZEROS           CIG0019
RQ1947        IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3             CIG0019
RQ1947           ADD 1                   TO 99MOR023TC05                CIG0019
RQ1947        END-IF                                                    CIG0019
RQ1947     END-IF                                                       CIG0019
RQ1947     .                                                            CIG0019
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99MOR024EX58-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033* Si la altura de mora para la obligación evaluada es mayor a ceroEHA0003
MD1033* se establece el numero de meses que debe tener con comportamientEHA0003
MD1033* normal                                                          EHA0003
MD1033     IF ALTURA-MORA-99MOR024EX58 > ZEROS                          EHA0003
MD1033        COMPUTE W-MESES-REPO-99MOR024EX58 =                       EHA0003
MD1033                                   ALTURA-MORA-99MOR024EX58 / 30  EHA0003
MD1033     ELSE                                                         EHA0003
MD1033        MOVE ZEROS TO W-MESES-REPO-99MOR024EX58                   EHA0003
MD1033     END-IF                                                       EHA0003
MD1033* Si el número de reportes al dia es menor al número de moras     EHA0003
MD1033* o a los meses correspondiente a la altura maxima se mueve       EHA0003
MD1033* 1 al indicador para dejer a la persona pendiente por moras his. EHA0003
MD1033     IF (W-OBL-DIA-99MOR024EX58 < W-NUM-MORAS-99MOR024EX58 AND    EHA0003
MD1033         W-NUM-MORAS-99MOR024EX58 > ZEROS) OR                     EHA0003
MD1033        (W-OBL-DIA-99MOR024EX58 < W-MESES-REPO-99MOR024EX58 AND   EHA0003
MD1033         W-MESES-REPO-99MOR024EX58 > ZEROS)                       EHA0003
MD1033         MOVE 1 TO 99MOR024EX58                                   EHA0003
MD1033     END-IF.                                                      EHA0003
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99MOR025EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     IF FINCRE-CARDEC = 0                                         CIGD004
CQ1224        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIGD004
CQ1224            IF SW-CODEUDOR = ZEROS                                CIGD004
CQ1224               IF MORA-NOV(NOV-REPORT-ABD07) >= 1 AND             CIGD004
CQ1224                  MORA-NOV(NOV-REPORT-ABD07) <= 4 AND             CIGD004
CQ1224                  IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1             CIGD004
CQ1224                  IF IND-VALORES-VALVLR = 1 AND                   CIGD004
CQ1224                     VEC-VALOR-VALVLR (5) = 1                     CIGD004
CQ1224                     IF VALOR-SALDO-MORAM-ABD07 > 50              CIGD004
CQ1224                         MOVE 1 TO 99MOR025EX59                   CIGD004
CQ1224                     END-IF                                       CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               ELSE                                               CIGD004
CQ1224                  IF NOV-REPORT-ABD07 = 45                        CIGD004
CQ1224                     IF IND-VALORES-VALVLR = 1 AND                CIGD004
CQ1224                        VEC-VALOR-VALVLR (5) = 1                  CIGD004
CQ1224                        IF VALOR-SALDO-MORAM-ABD07 > 50           CIGD004
CQ1224                            MOVE 1 TO 99MOR025EX59                CIGD004
CQ1224                        END-IF                                    CIGD004
CQ1224                     END-IF                                       CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224     ELSE                                                         CIGD004
CQ1224        IF 99MOR025EX59 = 0                                       CIGD004
CQ1224           MOVE 2 TO 99MOR025EX59                                 CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR026TO00-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0006
CQ1343        IF SW-CODEUDOR = ZEROS                                    EHA0006
CQ1343           IF NOV-REPORT-ABD07 = 45 *> CARTERA CASTIGADA          EHA0006
CQ1343              IF 99MOR026TO00 < 7                                 EHA0006
CQ1343                 MOVE 7 TO 99MOR026TO00                           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343           IF NOV-REPORT-ABD07 = 47 *> DUDOSO RECAUDO             EHA0006
CQ1343              IF 99MOR026TO00 < 6                                 EHA0006
CQ1343                 MOVE 6 TO 99MOR026TO00                           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343           IF MORA-NOV(NOV-REPORT-ABD07) = 4 *> MORA 120          EHA0006
CQ1343              IF 99MOR026TO00 < 5                                 EHA0006
CQ1343                 MOVE 5 TO 99MOR026TO00                           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343           IF MORA-NOV(NOV-REPORT-ABD07) = 3 *> MORA 90           EHA0006
CQ1343              IF 99MOR026TO00 < 4                                 EHA0006
CQ1343                 MOVE 4 TO 99MOR026TO00                           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343           IF MORA-NOV(NOV-REPORT-ABD07) = 2 *> MORA 60           EHA0006
CQ1343              IF 99MOR026TO00 < 3                                 EHA0006
CQ1343                 MOVE 3 TO 99MOR026TO00                           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343           IF MORA-NOV(NOV-REPORT-ABD07) = 1 *> MORA 30           EHA0006
CQ1343              IF 99MOR026TO00 < 2                                 EHA0006
CQ1343                 MOVE 2 TO 99MOR026TO00                           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343           IF MORA-NOV(NOV-REPORT-ABD07) = 5 *> AL DIA            EHA0006
CQ1343              IF 99MOR026TO00 < 1                                 EHA0006
CQ1343                 MOVE 1 TO 99MOR026TO00                           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343     END-IF.                                                      EHA0006
CQ1343*                                                                 EHA0006
RQ2171*----------------------------------------------------------------*EHA0017
RQ2171 5320-99MOR026TO05-CARDEC.                                        EHA0017
RQ2171*----------------------------------------------------------------*EHA0017
RQ2171     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0017
RQ2171        IF SW-CODEUDOR = ZEROS                                    EHA0017
RQ2171           AND IND-SECTOR-CARTERA(W-CTA-BDCUE) <> 2               EHA0017
RQ2171           IF NOV-REPORT-ABD07 = 45 *> CARTERA CASTIGADA          EHA0017
RQ2171              IF 99MOR026TO05 < 7                                 EHA0017
RQ2171                 MOVE 7 TO 99MOR026TO05                           EHA0017
RQ2171              END-IF                                              EHA0017
RQ2171           END-IF                                                 EHA0017
RQ2171           IF NOV-REPORT-ABD07 = 47 *> DUDOSO RECAUDO             EHA0017
RQ2171              IF 99MOR026TO05 < 6                                 EHA0017
RQ2171                 MOVE 6 TO 99MOR026TO05                           EHA0017
RQ2171              END-IF                                              EHA0017
RQ2171           END-IF                                                 EHA0017
RQ2171           IF MORA-NOV(NOV-REPORT-ABD07) = 4 *> MORA 120          EHA0017
RQ2171              IF 99MOR026TO05 < 5                                 EHA0017
RQ2171                 MOVE 5 TO 99MOR026TO05                           EHA0017
RQ2171              END-IF                                              EHA0017
RQ2171           END-IF                                                 EHA0017
RQ2171           IF MORA-NOV(NOV-REPORT-ABD07) = 3 *> MORA 90           EHA0017
RQ2171              IF 99MOR026TO05 < 4                                 EHA0017
RQ2171                 MOVE 4 TO 99MOR026TO05                           EHA0017
RQ2171              END-IF                                              EHA0017
RQ2171           END-IF                                                 EHA0017
RQ2171           IF MORA-NOV(NOV-REPORT-ABD07) = 2 *> MORA 60           EHA0017
RQ2171              IF 99MOR026TO05 < 3                                 EHA0017
RQ2171                 MOVE 3 TO 99MOR026TO05                           EHA0017
RQ2171              END-IF                                              EHA0017
RQ2171           END-IF                                                 EHA0017
RQ2171           IF MORA-NOV(NOV-REPORT-ABD07) = 1 *> MORA 30           EHA0017
RQ2171              IF 99MOR026TO05 < 2                                 EHA0017
RQ2171                 MOVE 2 TO 99MOR026TO05                           EHA0017
RQ2171              END-IF                                              EHA0017
RQ2171           END-IF                                                 EHA0017
RQ2171           IF MORA-NOV(NOV-REPORT-ABD07) = 5 *> AL DIA            EHA0017
RQ2171              IF 99MOR026TO05 < 1                                 EHA0017
RQ2171                 MOVE 1 TO 99MOR026TO05                           EHA0017
RQ2171              END-IF                                              EHA0017
RQ2171           END-IF                                                 EHA0017
RQ2171        END-IF                                                    EHA0017
RQ2171     END-IF.                                                      EHA0017
RQ2171*                                                                 EHA0017
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR027EX54-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0006
CQ1343        IF SW-CODEUDOR = ZEROS                                    EHA0006
CQ1343           IF NOV-REPORT-ABD07 = 45 *> CARTERA CASTIGADA          EHA0006
CQ1343              IF  COD-SUS-ABD07 = 059914 *> BCO POPULAR           EHA0006
CQ1343               OR COD-SUS-ABD07 = 050260 *> BCO AVVILLAS          EHA0006
CQ1343               OR COD-SUS-ABD07 = 069918 *> SUPLAN                EHA0006
CQ1343               OR COD-SUS-ABD07 = 270009 *> SOLUCIONES PRONTAS    EHA0006
CQ1343               OR COD-SUS-ABD07 = 440027 *> CREDIVAL-CREDISERV    EHA0006
CQ1343               OR COD-SUS-ABD07 = 279906 *> SOCOMIR               EHA0006
CQ1343               OR COD-SUS-ABD07 = 270039 *> CREDIPROGRESO         EHA0006
CQ1343                  ADD 1 TO 99MOR027EX54                           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343     END-IF.                                                      EHA0006
CQ1343*                                                                 EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99MOR028EX61-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0006
CQ1343        IF SW-CODEUDOR = ZEROS                                    EHA0006
CQ1343           IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                 EHA0006
AL2393             IF NOMBRE-PROGRAMA = "ICGD62"                        EHA0024
RQ2394             OR NOMBRE-PROGRAMA = "ICGD61"                        EHA0025
AL2393              IF MORA-NOV(NOV-REPORT-ABD07) = 4 *> MORA 120       EHA0024
AL2393              OR MORA-NOV(NOV-REPORT-ABD07) = 3 *> MORA 90        EHA0024
AL2393              OR MORA-NOV(NOV-REPORT-ABD07) = 2 *> MORA 60        EHA0024
AL2393              OR MORA-NOV(NOV-REPORT-ABD07) = 1 *> MORA 30        EHA0024
AL2393                 IF IND-VALORES-VALVLR = 1 AND                    EHA0024
AL2393                    VEC-VALOR-VALVLR (5) = 1                      EHA0024
AL2393                    IF VALOR-SALDO-MORAM-ABD07 > 70               EHA0024
CQ7181                      IF  MORA-NOV(NOV-REPORT-ABD07) = 1          DLM0031
CQ7181                        ADD   1  TO  WOR-VAR-CARDEC               DLM0031
CQ7181                        IF  WOR-VAR-CARDEC  >=  3                 DLM0031
CQ7181                          MOVE 1 TO 99MOR028EX61                  DLM0031
CQ7181                        END-IF                                    DLM0031
CQ7181                      ELSE                                        DLM0031
CQ7181                        MOVE 1   TO 99MOR028EX61                  DLM0031
CQ7181                      END-IF                                      DLM0031
AL2393                    END-IF                                        EHA0024
AL2393                 END-IF                                           EHA0024
AL2393              END-IF                                              EHA0024
AL2393             ELSE                                                 EHA0024
CQ1343              IF MORA-NOV(NOV-REPORT-ABD07) = 3 *> MORA 90        EHA0006
CQ1343              OR MORA-NOV(NOV-REPORT-ABD07) = 2 *> MORA 60        EHA0006
CQ1343              OR MORA-NOV(NOV-REPORT-ABD07) = 1 *> MORA 30        EHA0006
CQ1343                 IF IND-VALORES-VALVLR = 1 AND                    EHA0006
CQ1343                    VEC-VALOR-VALVLR (5) = 1                      EHA0006
CQ1343                    IF VALOR-SALDO-MORAM-ABD07 > 50               EHA0006
CQ1343                        MOVE 1 TO 99MOR028EX61                    EHA0006
CQ1343                    END-IF                                        EHA0006
CQ1343                 END-IF                                           EHA0006
CQ1343              END-IF                                              EHA0006
AL2393             END-IF                                               EHA0024
CQ1343           END-IF                                                 EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343     END-IF.                                                      EHA0006
RQ1914*                                                                 CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR029TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF MORA-NOV(NOV-REPORT-ABD07) = "4" AND                CIG0016
RQ1914              (NOV-REPORT-ABD07 NOT = 45 AND 47)                  CIG0016
RQ1914              ADD 1            TO 99MOR029TO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914              IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"              CIG0016
RQ1914                 ADD 1    TO 99MOR029TO00                         CIG0016
RQ1914              END-IF                                              CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"            CIG0016
RQ1914                   ADD 1    TO 99MOR029TO00                       CIG0016
RQ1914                END-IF                                            CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR029CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF MORA-NOV(NOV-REPORT-ABD07) = "4" AND                CIG0016
RQ1914              (NOV-REPORT-ABD07 NOT = 45 AND 47)                  CIG0016
RQ1914              ADD 1            TO 99MOR029CO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914              IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"              CIG0016
RQ1914                 ADD 1    TO 99MOR029CO00                         CIG0016
RQ1914              END-IF                                              CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"           CIG0016
RQ1914                    ADD 1    TO 99MOR029CO00                      CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR030TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        MOVE  S48-VEC   TO W-MORAS-HISTORY-V-CARDEC               CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF VECTOR-S(12:1) = "4"                                CIG0016
RQ1914              ADD 1            TO 99MOR030TO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914             IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"               CIG0016
RQ1914                ADD 1    TO 99MOR030TO00                          CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 24                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"           CIG0016
RQ1914                          ADD 1    TO 99MOR030TO00                CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
AJUVEC        MOVE  VECTOR-S  TO W-MORAS-HISTORY-V-CARDEC               CIG0022
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR030CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        MOVE  S48-VEC   TO W-MORAS-HISTORY-V-CARDEC               CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF VECTOR-S(12:1) = "4"                                CIG0016
RQ1914              ADD 1            TO 99MOR030CO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914             IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"               CIG0016
RQ1914                ADD 1    TO 99MOR030CO00                          CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 24                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "4"           CIG0016
RQ1914                          ADD 1    TO 99MOR030CO00                CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
AJUVEC        MOVE  VECTOR-S  TO W-MORAS-HISTORY-V-CARDEC               CIG0022
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR031TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        MOVE  S48-VEC   TO W-MORAS-HISTORY-V-CARDEC               CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF VECTOR-S(12:1) = "3"                                CIG0016
RQ1914              ADD 1            TO 99MOR031TO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914             IF W-MORAS-HISTORY-CARDEC(W-IND) = "3"               CIG0016
RQ1914                ADD 1    TO 99MOR031TO00                          CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 24                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "3"           CIG0016
RQ1914                          ADD 1    TO 99MOR031TO00                CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
AJUVEC        MOVE  VECTOR-S  TO W-MORAS-HISTORY-V-CARDEC               CIG0022
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR031CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        MOVE  S48-VEC   TO W-MORAS-HISTORY-V-CARDEC               CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF VECTOR-S(12:1) = "3"                                CIG0016
RQ1914              ADD 1            TO 99MOR031CO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914             IF W-MORAS-HISTORY-CARDEC(W-IND) = "3"               CIG0016
RQ1914                ADD 1    TO 99MOR031CO00                          CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 24                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "3"           CIG0016
RQ1914                          ADD 1    TO 99MOR031CO00                CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
AJUVEC        MOVE  VECTOR-S  TO W-MORAS-HISTORY-V-CARDEC               CIG0022
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR032TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF MORA-NOV(NOV-REPORT-ABD07) = "2"                    CIG0016
RQ1914              ADD 1            TO 99MOR032TO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914              IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"              CIG0016
RQ1914                 ADD 1    TO 99MOR032TO00                         CIG0016
RQ1914              END-IF                                              CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"            CIG0016
RQ1914                   ADD 1    TO 99MOR032TO00                       CIG0016
RQ1914                END-IF                                            CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR032CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF MORA-NOV(NOV-REPORT-ABD07) = "2"                    CIG0016
RQ1914              ADD 1            TO 99MOR032CO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914              IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"              CIG0016
RQ1914                 ADD 1    TO 99MOR032CO00                         CIG0016
RQ1914              END-IF                                              CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"            CIG0016
RQ1914                   ADD 1    TO 99MOR032CO00                       CIG0016
RQ1914                END-IF                                            CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR033TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        MOVE  S48-VEC   TO W-MORAS-HISTORY-V-CARDEC               CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF VECTOR-S(12:1) = "2"                                CIG0016
RQ1914              ADD 1            TO 99MOR033TO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914             IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"               CIG0016
RQ1914                ADD 1    TO 99MOR033TO00                          CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 24                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"           CIG0016
RQ1914                          ADD 1    TO 99MOR033TO00                CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
AJUVEC        MOVE  VECTOR-S  TO W-MORAS-HISTORY-V-CARDEC               CIG0022
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR033CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        MOVE  S48-VEC   TO W-MORAS-HISTORY-V-CARDEC               CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF VECTOR-S(12:1) = "2"                                CIG0016
RQ1914              ADD 1            TO 99MOR033CO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914             IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"               CIG0016
RQ1914                ADD 1    TO 99MOR033CO00                          CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 24                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "2"           CIG0016
RQ1914                          ADD 1    TO 99MOR033CO00                CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
AJUVEC        MOVE  VECTOR-S  TO W-MORAS-HISTORY-V-CARDEC               CIG0022
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR034TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF MORA-NOV(NOV-REPORT-ABD07) = "1"                    CIG0016
RQ1914              ADD 1            TO 99MOR034TO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914              IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"              CIG0016
RQ1914                 ADD 1    TO 99MOR034TO00                         CIG0016
RQ1914              END-IF                                              CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"            CIG0016
RQ1914                   ADD 1    TO 99MOR034TO00                       CIG0016
RQ1914                END-IF                                            CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR034CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF MORA-NOV(NOV-REPORT-ABD07) = "1"                    CIG0016
RQ1914              ADD 1            TO 99MOR034CO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914              IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"              CIG0016
RQ1914                 ADD 1    TO 99MOR034CO00                         CIG0016
RQ1914              END-IF                                              CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 12                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"            CIG0016
RQ1914                   ADD 1    TO 99MOR034CO00                       CIG0016
RQ1914                END-IF                                            CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR035TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        MOVE  S48-VEC   TO W-MORAS-HISTORY-V-CARDEC               CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF VECTOR-S(12:1) = "1"                                CIG0016
RQ1914              ADD 1            TO 99MOR035TO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914             IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"               CIG0016
RQ1914                ADD 1    TO 99MOR035TO00                          CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 24                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"           CIG0016
RQ1914                          ADD 1    TO 99MOR035TO00                CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
AJUVEC        MOVE  VECTOR-S  TO W-MORAS-HISTORY-V-CARDEC               CIG0022
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR035CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        MOVE  S48-VEC   TO W-MORAS-HISTORY-V-CARDEC               CIG0016
RQ1914        IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0016
RQ1914           MOVE   11   TO   TOPE-V-CARDEC                         CIG0016
RQ1914           IF VECTOR-S(12:1) = "1"                                CIG0016
RQ1914              ADD 1            TO 99MOR035CO00                    CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914           PERFORM VARYING W-IND FROM 1 BY 1 UNTIL                CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914             IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"               CIG0016
RQ1914                ADD 1    TO 99MOR035CO00                          CIG0016
RQ1914             END-IF                                               CIG0016
RQ1914           END-PERFORM                                            CIG0016
RQ1914        ELSE                                                      CIG0016
RQ1914           IF W-MESES-NOVEDAD-CARDEC <= 24                        CIG0016
RQ1914              MOVE 12  TO   TOPE-V-CARDEC                         CIG0016
RQ1914              PERFORM VARYING W-IND FROM 1 BY 1 UNTIL             CIG0016
RQ1914                                           W-IND >  TOPE-V-CARDEC CIG0016
RQ1914                 IF W-MORAS-HISTORY-CARDEC(W-IND) = "1"           CIG0016
RQ1914                          ADD 1    TO 99MOR035CO00                CIG0016
RQ1914                 END-IF                                           CIG0016
RQ1914              END-PERFORM                                         CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
AJUVEC        MOVE  VECTOR-S  TO W-MORAS-HISTORY-V-CARDEC               CIG0022
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR037TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF COD-CTA-ABD07 = 02 AND NOV-REPORT-ABD07 = 03           CIG0016
RQ1914           ADD 1                   TO 99MOR037TO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR037CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF COD-CTA-ABD07 = 02 AND NOV-REPORT-ABD07 = 03           CIG0016
RQ1914           ADD 1                   TO 99MOR037CO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR038TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF COD-CTA-ABD07 = 02 AND NOV-REPORT-ABD07 = 49           CIG0016
RQ1914           ADD 1                   TO 99MOR038TO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR038CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF COD-CTA-ABD07 = 02 AND NOV-REPORT-ABD07 = 49           CIG0016
RQ1914           ADD 1                   TO 99MOR038CO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR039TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF COD-CTA-ABD07 = 02 AND NOV-REPORT-ABD07 = 47           CIG0016
RQ1914           ADD 1                   TO 99MOR039TO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR039CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF COD-CTA-ABD07 = 02 AND NOV-REPORT-ABD07 = 47           CIG0016
RQ1914           ADD 1                   TO 99MOR039CO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR040TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF COD-CTA-ABD07 = 02 AND NOV-REPORT-ABD07 = 45           CIG0016
RQ1914           ADD 1                   TO 99MOR040TO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR040CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF COD-CTA-ABD07 = 02 AND NOV-REPORT-ABD07 = 45           CIG0016
RQ1914           ADD 1                   TO 99MOR040CO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR041TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF COD-CTA-ABD07 = 02                                     CIG0016
RQ1914           IF ADJETIVO1-ABD07 = 7 OR                              CIG0016
RQ1914              ADJETIVO2-ABD07 = 7 OR                              CIG0016
RQ1914              ADJETIVO3-ABD07 = 7                                 CIG0016
RQ1914              ADD 1                TO 99MOR041TO00                CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR041CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF COD-CTA-ABD07 = 02                                     CIG0016
RQ1914           IF ADJETIVO1-ABD07 = 7 OR                              CIG0016
RQ1914              ADJETIVO2-ABD07 = 7 OR                              CIG0016
RQ1914              ADJETIVO3-ABD07 = 7                                 CIG0016
RQ1914              ADD 1                TO 99MOR041CO00                CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR042TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF COD-CTA-ABD07 = 02                                     CIG0016
RQ1914           IF ADJETIVO1-ABD07 = 6 OR                              CIG0016
RQ1914              ADJETIVO2-ABD07 = 6 OR                              CIG0016
RQ1914              ADJETIVO3-ABD07 = 6                                 CIG0016
RQ1914              ADD 1                TO 99MOR042TO00                CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR042CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF COD-CTA-ABD07 = 02                                     CIG0016
RQ1914           IF ADJETIVO1-ABD07 = 6 OR                              CIG0016
RQ1914              ADJETIVO2-ABD07 = 6 OR                              CIG0016
RQ1914              ADJETIVO3-ABD07 = 6                                 CIG0016
RQ1914              ADD 1                TO 99MOR042CO00                CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR043TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF COD-CTA-ABD07 = 02                                     CIG0016
RQ1914           IF ADJETIVO1-ABD07 = 2 OR                              CIG0016
RQ1914              ADJETIVO2-ABD07 = 2 OR                              CIG0016
RQ1914              ADJETIVO3-ABD07 = 2                                 CIG0016
RQ1914              ADD 1                TO 99MOR043TO00                CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR043CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF COD-CTA-ABD07 = 02                                     CIG0016
RQ1914           IF ADJETIVO1-ABD07 = 2 OR                              CIG0016
RQ1914              ADJETIVO2-ABD07 = 2 OR                              CIG0016
RQ1914              ADJETIVO3-ABD07 = 2                                 CIG0016
RQ1914              ADD 1                TO 99MOR043CO00                CIG0016
RQ1914           END-IF                                                 CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR044TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF NOV-REPORT-ABD07 = 47                                  CIG0016
RQ1914           ADD 1                   TO 99MOR044TO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR044CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF NOV-REPORT-ABD07 = 47                                  CIG0016
RQ1914           ADD 1                   TO 99MOR044CO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR045TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF NOV-REPORT-ABD07 = 45                                  CIG0016
RQ1914           ADD 1                   TO 99MOR045TO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR045CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF NOV-REPORT-ABD07 = 45                                  CIG0016
RQ1914           ADD 1                   TO 99MOR045CO00                CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR046TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF ADJETIVO1-ABD07 = 7 OR                                 CIG0016
RQ1914           ADJETIVO2-ABD07 = 7 OR                                 CIG0016
RQ1914           ADJETIVO3-ABD07 = 7                                    CIG0016
RQ1914           ADD 1                TO 99MOR046TO00                   CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR046CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF ADJETIVO1-ABD07 = 7 OR                                 CIG0016
RQ1914           ADJETIVO2-ABD07 = 7 OR                                 CIG0016
RQ1914           ADJETIVO3-ABD07 = 7                                    CIG0016
RQ1914           ADD 1                TO 99MOR046CO00                   CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR047TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF ADJETIVO1-ABD07 = 2 OR                                 CIG0016
RQ1914           ADJETIVO2-ABD07 = 2 OR                                 CIG0016
RQ1914           ADJETIVO3-ABD07 = 2                                    CIG0016
RQ1914           ADD 1                TO 99MOR047TO00                   CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR047CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF ADJETIVO1-ABD07 = 2 OR                                 CIG0016
RQ1914           ADJETIVO2-ABD07 = 2 OR                                 CIG0016
RQ1914           ADJETIVO3-ABD07 = 2                                    CIG0016
RQ1914           ADD 1                TO 99MOR047CO00                   CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR048TO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR = ZEROS                                       CIG0016
RQ1914        IF ADJETIVO1-ABD07 = 6 OR                                 CIG0016
RQ1914           ADJETIVO2-ABD07 = 6 OR                                 CIG0016
RQ1914           ADJETIVO3-ABD07 = 6                                    CIG0016
RQ1914           ADD 1                TO 99MOR048TO00                   CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914 5320-99MOR048CO00-CARDEC.                                        CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1914     IF SW-CODEUDOR <> ZEROS                                      CIG0016
RQ1914        IF ADJETIVO1-ABD07 = 6 OR                                 CIG0016
RQ1914           ADJETIVO2-ABD07 = 6 OR                                 CIG0016
RQ1914           ADJETIVO3-ABD07 = 6                                    CIG0016
RQ1914           ADD 1                TO 99MOR048CO00                   CIG0016
RQ1914        END-IF                                                    CIG0016
RQ1914     END-IF                                                       CIG0016
RQ1914     .                                                            CIG0016
RQ1914*----------------------------------------------------------------*CIG0016
RQ1947 5320-99MOR049TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947     IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2                     CIG0019
RQ1947        IF NOV-REPORT-ABD07 = 45                                  CIG0019
RQ1947           ADD 1                TO 99MOR049TO02                   CIG0019
RQ1947        END-IF                                                    CIG0019
RQ1947     END-IF                                                       CIG0019
RQ1947     .                                                            CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR049TO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947     IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3                CIG0019
RQ1947        IF NOV-REPORT-ABD07 = 45                                  CIG0019
RQ1947           ADD 1                TO 99MOR049TO05                   CIG0019
RQ1947        END-IF                                                    CIG0019
RQ1947     END-IF                                                       CIG0019
RQ1947     .                                                            CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR050TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947     IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2                     CIG0019
RQ1947        IF NOV-REPORT-ABD07 = 47                                  CIG0019
RQ1947           ADD 1                TO 99MOR050TO02                   CIG0019
RQ1947        END-IF                                                    CIG0019
RQ1947     END-IF                                                       CIG0019
RQ1947     .                                                            CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR050TO05-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947     IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1 OR 3                CIG0019
RQ1947        IF NOV-REPORT-ABD07 = 47                                  CIG0019
RQ1947           ADD 1                TO 99MOR050TO05                   CIG0019
RQ1947        END-IF                                                    CIG0019
RQ1947     END-IF                                                       CIG0019
RQ1947     .                                                            CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR051TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               CIG0019
RQ1947         IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2                 CIG0019
RQ1947            IF MORA-NOV(NOV-REPORT-ABD07) = 1                     CIG0019
RQ1947               ADD 1               TO 99MOR051TO02                CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR052TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               CIG0019
RQ1947         IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2                 CIG0019
RQ1947            IF MORA-NOV(NOV-REPORT-ABD07) = 2                     CIG0019
RQ1947               ADD 1               TO 99MOR052TO02                CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR053TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               CIG0019
RQ1947         IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2                 CIG0019
RQ1947            IF MORA-NOV(NOV-REPORT-ABD07) = 3                     CIG0019
RQ1947               ADD 1               TO 99MOR053TO02                CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99MOR054TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1               CIG0019
RQ1947         IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2                 CIG0019
RQ1947            IF MORA-NOV(NOV-REPORT-ABD07) = 4 AND                 CIG0019
RQ1947               NOV-REPORT-ABD07 <> 45 AND                         CIG0019
RQ1947               NOV-REPORT-ABD07 <> 47                             CIG0019
RQ1947               ADD 1               TO 99MOR054TO02                CIG0019
RQ1947            END-IF                                                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
AJ1648* NUMERO DE CUENTAS CONSUMO DEFINIDAS POR COLPATRIA               CIG0013
AJ1648 5320-99NUM002TO14-CARDEC.                                        CIG0013
AJ1648     IF  SW-CODEUDOR  =  ZEROS                                    CIG0013
AJ1648       IF (W-CTA-BDCUE  = 05 OR 03)  AND                          CIG0013
AJ1648           TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0013
AJ1648           ADD   1                 TO  99NUM002TO14               CIG0013
AJ1648       END-IF                                                     CIG0013
AJ1648     END-IF.                                                      CIG0013
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99NUM003TO02-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947     IF SW-CODEUDOR <>  ZEROS                                     CIG0019
RQ1947        IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1 AND        CIG0019
RQ1947           IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2                  CIG0019
RQ1947           ADD   1                 TO  99NUM003TO02               CIG0019
RQ1947        END-IF                                                    CIG0019
RQ1947     END-IF                                                       CIG0019
RQ1947     .                                                            CIG0019
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99NUM003EX58-CARDEC.                                        EHA0003
MD1033* NUMERO DE OBLIGACIONES COMO CODEUDOR DE CAJASAN                *EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0003
MD1033        IF SW-CODEUDOR = 1                                        EHA0003
MD1033           IF NIT-SUSCRIP-S-ABD02 = 00890200106 AND *>cajasan     EHA0003
MD1033              NIT-SUSCRIP-S-ABD02 <> ZEROS                        EHA0003
MD1033              ADD 1 TO 99NUM003EX58                               EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-IF.                                                      EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99NUM004EX58-CARDEC.                                        EHA0003
MD1033* NUMERO DE OBLIGACIONES COMO CODEUDOR TODO EL MERCADO (-CAJASAN)*EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033     IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1               EHA0003
MD1033        IF SW-CODEUDOR = 1                                        EHA0003
MD1033           IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND *>cajasan    EHA0003
MD1033              NIT-SUSCRIP-S-ABD02 <> ZEROS                        EHA0003
MD1033*             CONTINUE                                            EHA0003
MD1033*          ELSE                                                   EHA0003
MD1033              ADD 1 TO 99NUM004EX58                               EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-IF.                                                      EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99EXP001EX58-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033                                                                  EHA0003
MD1033* SE REALIZA CONTEO DE REPORTES PARA EVALUAR EXPERIENCIA FINANC.  EHA0003
MD1033* Si la obligación es diferente a sobregiro y es titular se cuentaEHA0003
MD1033* el numero de meses reportados                                   EHA0003
MD1033     INITIALIZE  REPORTES-EXP-99EXP001EX58                        EHA0003
MD1033*                                                                 EHA0003
MD1033     MOVE VECTOR-HIS-1-ABD07 TO VECTOR-W1-99EXP001EX58            EHA0003
MD1033     MOVE VECTOR-HIS-2-ABD07 TO VECTOR-W2-99EXP001EX58            EHA0003
MD1033     MOVE VECTOR-HIS-3-ABD07 TO VECTOR-W3-99EXP001EX58            EHA0003
MD1033     MOVE VECTOR-HIS-4-ABD07 TO VECTOR-W4-99EXP001EX58            EHA0003
MD1033*                                                                 EHA0003
MD1033* SE ANALIZA AÑO 4 DESDE EL REPORTE MÁS ANTIGUO                   EHA0003
MD1033     PERFORM VARYING W-IND FROM 1 BY 1 UNTIL W-IND > 12           EHA0003
MD1033        IF SW-CODEUDOR = ZEROS                                    EHA0003
MD1033           IF VECTOR-W4-R-99EXP001EX58 (W-IND) <> 0 AND           EHA0003
MD1033              VECTOR-W4-R-99EXP001EX58 (W-IND) <> 6 AND           EHA0003
MD1033              VECTOR-W4-R-99EXP001EX58 (W-IND) <> 7 AND           EHA0003
MD1033              VECTOR-W4-R-99EXP001EX58 (W-IND) <> 8 AND           EHA0003
MD1033              VECTOR-W4-R-99EXP001EX58 (W-IND) <> 9               EHA0003
MD1033              IF COD-CTA-ABD07 <> 48                              EHA0003
MD1033                 ADD 1 TO REPORTES-EXP-99EXP001EX58               EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        ELSE                                                      EHA0003
MD1033* Si la obligación es de Coopfuturo las obligaciones como codeudorEHA0003
MD1033* tambien se tienen en cuenta para la experiencia financiera      EHA0003
MD1033           IF NIT-SUSCRIP-S-ABD02 = 00890200106 *> nit cajasan    EHA0003
MD1033              IF VECTOR-W4-R-99EXP001EX58 (W-IND) <> 0 AND        EHA0003
MD1033                 VECTOR-W4-R-99EXP001EX58 (W-IND) <> 6 AND        EHA0003
MD1033                 VECTOR-W4-R-99EXP001EX58 (W-IND) <> 7 AND        EHA0003
MD1033                 VECTOR-W4-R-99EXP001EX58 (W-IND) <> 8 AND        EHA0003
MD1033                 VECTOR-W4-R-99EXP001EX58 (W-IND) <> 9            EHA0003
MD1033                 IF COD-CTA-ABD07 <> 48                           EHA0003
MD1033                    ADD 1 TO REPORTES-EXP-99EXP001EX58            EHA0003
MD1033                 END-IF                                           EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-PERFORM                                                  EHA0003
MD1033* SE ANALIZA AÑO 3 DESDE EL REPORTE MÁS ANTIGUO                   EHA0003
MD1033     PERFORM VARYING W-IND FROM 1 BY 1 UNTIL W-IND > 12           EHA0003
MD1033        IF SW-CODEUDOR = ZEROS                                    EHA0003
MD1033           IF VECTOR-W3-R-99EXP001EX58 (W-IND) <> 0 AND           EHA0003
MD1033              VECTOR-W3-R-99EXP001EX58 (W-IND) <> 6 AND           EHA0003
MD1033              VECTOR-W3-R-99EXP001EX58 (W-IND) <> 7 AND           EHA0003
MD1033              VECTOR-W3-R-99EXP001EX58 (W-IND) <> 8 AND           EHA0003
MD1033              VECTOR-W3-R-99EXP001EX58 (W-IND) <> 9               EHA0003
MD1033              IF COD-CTA-ABD07 <> 48                              EHA0003
MD1033                 ADD 1 TO REPORTES-EXP-99EXP001EX58               EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        ELSE                                                      EHA0003
MD1033* Si la obligación es de Coopfuturo las obligaciones como codeudorEHA0003
MD1033* tambien se tienen en cuenta para la experiencia financiera      EHA0003
MD1033           IF NIT-SUSCRIP-S-ABD02 = 00890200106 *> nit cajasan    EHA0003
MD1033              IF VECTOR-W3-R-99EXP001EX58 (W-IND) <> 0 AND        EHA0003
MD1033                 VECTOR-W3-R-99EXP001EX58 (W-IND) <> 6 AND        EHA0003
MD1033                 VECTOR-W3-R-99EXP001EX58 (W-IND) <> 7 AND        EHA0003
MD1033                 VECTOR-W3-R-99EXP001EX58 (W-IND) <> 8 AND        EHA0003
MD1033                 VECTOR-W3-R-99EXP001EX58 (W-IND) <> 9            EHA0003
MD1033                 IF COD-CTA-ABD07 <> 48                           EHA0003
MD1033                    ADD 1 TO REPORTES-EXP-99EXP001EX58            EHA0003
MD1033                 END-IF                                           EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-PERFORM                                                  EHA0003
MD1033* SE ANALIZA AÑO 2 DESDE EL REPORTE MÁS ANTIGUO                   EHA0003
MD1033     PERFORM VARYING W-IND FROM 1 BY 1 UNTIL W-IND > 12           EHA0003
MD1033        IF SW-CODEUDOR = ZEROS                                    EHA0003
MD1033           IF VECTOR-W2-R-99EXP001EX58 (W-IND) <> 0 AND           EHA0003
MD1033              VECTOR-W2-R-99EXP001EX58 (W-IND) <> 6 AND           EHA0003
MD1033              VECTOR-W2-R-99EXP001EX58 (W-IND) <> 7 AND           EHA0003
MD1033              VECTOR-W2-R-99EXP001EX58 (W-IND) <> 8 AND           EHA0003
MD1033              VECTOR-W2-R-99EXP001EX58 (W-IND) <> 9               EHA0003
MD1033              IF COD-CTA-ABD07 <> 48                              EHA0003
MD1033                 ADD 1 TO REPORTES-EXP-99EXP001EX58               EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        ELSE                                                      EHA0003
MD1033* Si la obligación es de Coopfuturo las obligaciones como codeudorEHA0003
MD1033* tambien se tienen en cuenta para la experiencia financiera      EHA0003
MD1033           IF NIT-SUSCRIP-S-ABD02 = 00890200106 *> nit cajasan    EHA0003
MD1033              IF VECTOR-W2-R-99EXP001EX58 (W-IND) <> 0 AND        EHA0003
MD1033                 VECTOR-W2-R-99EXP001EX58 (W-IND) <> 6 AND        EHA0003
MD1033                 VECTOR-W2-R-99EXP001EX58 (W-IND) <> 7 AND        EHA0003
MD1033                 VECTOR-W2-R-99EXP001EX58 (W-IND) <> 8 AND        EHA0003
MD1033                 VECTOR-W2-R-99EXP001EX58 (W-IND) <> 9            EHA0003
MD1033                 IF COD-CTA-ABD07 <> 48                           EHA0003
MD1033                    ADD 1 TO REPORTES-EXP-99EXP001EX58            EHA0003
MD1033                 END-IF                                           EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-PERFORM                                                  EHA0003
MD1033* SE ANALIZA AÑO 1 DESDE EL REPORTE MÁS ANTIGUO                   EHA0003
MD1033     PERFORM VARYING W-IND FROM 1 BY 1 UNTIL W-IND > 12           EHA0003
MD1033        IF SW-CODEUDOR = ZEROS                                    EHA0003
MD1033           IF VECTOR-W1-R-99EXP001EX58 (W-IND) <> 0 AND           EHA0003
MD1033              VECTOR-W1-R-99EXP001EX58 (W-IND) <> 6 AND           EHA0003
MD1033              VECTOR-W1-R-99EXP001EX58 (W-IND) <> 7 AND           EHA0003
MD1033              VECTOR-W1-R-99EXP001EX58 (W-IND) <> 8 AND           EHA0003
MD1033              VECTOR-W1-R-99EXP001EX58 (W-IND) <> 9               EHA0003
MD1033              IF COD-CTA-ABD07 <> 48                              EHA0003
MD1033                 ADD 1 TO REPORTES-EXP-99EXP001EX58               EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        ELSE                                                      EHA0003
MD1033* Si la obligación es de Coopfuturo las obligaciones como codeudorEHA0003
MD1033* tambien se tienen en cuenta para la experiencia financiera      EHA0003
MD1033           IF NIT-SUSCRIP-S-ABD02 = 00890200106 *> nit cajasan    EHA0003
MD1033              IF VECTOR-W1-R-99EXP001EX58 (W-IND) <> 0 AND        EHA0003
MD1033                 VECTOR-W1-R-99EXP001EX58 (W-IND) <> 6 AND        EHA0003
MD1033                 VECTOR-W1-R-99EXP001EX58 (W-IND) <> 7 AND        EHA0003
MD1033                 VECTOR-W1-R-99EXP001EX58 (W-IND) <> 8 AND        EHA0003
MD1033                 VECTOR-W1-R-99EXP001EX58 (W-IND) <> 9            EHA0003
MD1033                 IF COD-CTA-ABD07 <> 48                           EHA0003
MD1033                    ADD 1 TO REPORTES-EXP-99EXP001EX58            EHA0003
MD1033                 END-IF                                           EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-PERFORM                                                  EHA0003
MD1033     IF REPORTES-EXP-99EXP001EX58 >= 2                            EHA0003
MD1033        ADD 1 TO 99EXP001EX58                                     EHA0003
MD1033     END-IF.                                                      EHA0003
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99EXP002EX61-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343      IF SW-CODEUDOR = ZEROS                                      EHA0006
RQ4406* SE MODIFICA EL CALCULO DE LA VARIABLE PARA EL PROGRAMA ICGD62   EHA0029
RQ4406         IF NOMBRE-PROGRAMA = "ICGD62"                            EHA0029
RQ4406          IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                  EHA0029
RQ4406             IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1       EHA0029
RQ4406              IF W-MESES-EXPERIENCIA-CARDEC > 12                  EHA0029
RQ4406                ADD 1 TO 99EXP002EX61                             EHA0029
RQ4406              END-IF                                              EHA0029
RQ4406             ELSE                                                 EHA0029
RQ4406                IF W-MESES-NOVEDAD-CARDEC <= 24                   EHA0029
RQ4406                 IF W-MESES-EXPERIENCIA-CARDEC > 12               EHA0029
RQ4406                   IF MORAS30-99EXP002EX61  <= 6 AND              EHA0029
RQ4406                      MORAS60-99EXP002EX61  <= 1 AND              EHA0029
RQ4406                      MORAS90-99EXP002EX61   = 0 AND              EHA0029
RQ4406                      MORAS120-99EXP002EX61  = 0                  EHA0029
RQ4406                      ADD 1 TO 99EXP002EX61                       EHA0029
RQ4406                   END-IF                                         EHA0029
RQ4406                 END-IF                                           EHA0029
RQ4406                END-IF                                            EHA0029
RQ4406             END-IF                                               EHA0029
RQ4406          END-IF                                                  EHA0029
RQ4406         ELSE                                                     EHA0029
CQ1343          IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                  EHA0006
CQ1343             IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1       EHA0006
CQ1343                ADD 1 TO 99EXP002EX61                             EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343                IF W-MESES-NOVEDAD-CARDEC <= 24                   EHA0006
CQ1342                   IF MORAS30-99EXP002EX61  <= 6 AND              DLM0007
CQ1342                      MORAS60-99EXP002EX61  <= 1 AND              DLM0007
CQ1342                      MORAS90-99EXP002EX61   = 0 AND              DLM0007
CQ1342                      MORAS120-99EXP002EX61  = 0                  DLM0007
CQ1343                      ADD 1 TO 99EXP002EX61                       EHA0006
CQ1342                   END-IF                                         DLM0007
CQ1343                END-IF                                            EHA0006
CQ1343             END-IF                                               EHA0006
CQ1343          END-IF                                                  EHA0006
RQ4406         END-IF                                                   EHA0029
CQ1343      END-IF
CQ1342      MOVE ZEROS TO MORAS30-99EXP002EX61                          DLM0007
CQ1342                    MORAS60-99EXP002EX61                          DLM0007
CQ1342                    MORAS90-99EXP002EX61                          DLM0007
CQ1342                    MORAS120-99EXP002EX61.                        DLM0007
CQ1343*                                                                 EHA0006
CQ1343 5320-99EXP003TC00-CARDEC.                                        EHA0006
CQ1343     IF  SW-CODEUDOR  =  ZEROS                                    EHA0006
CQ1343       IF  W-CTA-BDCUE  =  02  AND                                EHA0006
CQ1343           TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1  AND        EHA0006
CQ1343           W-MESES-APERTURA-CARDEC  >  99EXP003TC00               EHA0006
CQ1343         MOVE W-MESES-APERTURA-CARDEC TO 99EXP003TC00             EHA0006
CQ1343       END-IF                                                     EHA0006
CQ1343     END-IF.                                                      EHA0006
RQ1648*----------------------------------------------------------------*CIG0012
RQ1648 5320-99EXP004HP00-CARDEC.                                        CIG0012
RQ1648*----------------------------------------------------------------*CIG0012
RQ1648     IF  SW-CODEUDOR  =  ZEROS                                    CIG0012
RQ1648       IF  TIPO-OBLIGACION-ABD07 = 3  AND                         CIG0012
RQ1648           TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1  AND        CIG0012
RQ1648           W-MESES-APERTURA-CARDEC  >  99EXP004HP00               CIG0012
RQ1648             MOVE W-MESES-APERTURA-CARDEC TO 99EXP004HP00         CIG0012
RQ1648       END-IF                                                     CIG0012
RQ1648     END-IF.                                                      CIG0012
RQ1648*                                                                 CIG0012
CQ1342* ANTIGUEDAD EN CUENTAS CONSUMO                                   DLM0007
CQ1342 5320-99EXP003TO07-CARDEC.                                        DLM0007
CQ1342     IF  SW-CODEUDOR  =  ZEROS                                    DLM0007
CQ1342***    IF (TIPO-OBLIGACION-ABD07 = 2 OR 4)  AND                   DLM0007
CQ1342       IF (W-CTA-BDCUE  = 05 OR 03)  AND                          DLM0007
RQ1648           TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1             CIG0012
RQ1648***        TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1  AND        CIG0012
RQ1648***        W-MESES-APERTURA-CARDEC  >  99EXP003TO07               CIG0012
RQ1648         IF  W-MESES-APERTURA-CARDEC  >  99EXP003TO07             CIG0012
RQ1648           MOVE W-MESES-APERTURA-CARDEC TO 99EXP003TO07           CIG0012
RQ1648         END-IF                                                   CIG0012
AJ1648*        ADD   1                 TO  99NUM002TO14                 CIG0013
CQ1342       END-IF                                                     DLM0007
CQ1342     END-IF.                                                      DLM0007
CQ1342* ANTIGUEDAD EN CUENTAS CONSUMO DEFINIDAS POR COLPATRIA           DLM0007
CQ1342 5320-99EXP003TO14-CARDEC.                                        DLM0007
CQ1342     IF  SW-CODEUDOR  =  ZEROS                                    DLM0007
CQ1342       IF (W-CTA-BDCUE  = 05 OR 03)  AND                          DLM0007
CQ1342           TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1  AND        DLM0007
CQ1342           W-MESES-APERTURA-CARDEC  >  99EXP003TO14               DLM0007
CQ1342         MOVE W-MESES-APERTURA-CARDEC TO 99EXP003TO14             DLM0007
CQ1342       END-IF                                                     DLM0007
CQ1342     END-IF.                                                      DLM0007
RQ1648* ANTIGUEDAD EN CUENTAS SECTOR REAL DEFINIDOS POR COLPATRIA       CIG0012
RQ1648 5320-99EXP003TO13-CARDEC.                                        CIG0012
RQ1648     IF  SW-CODEUDOR  =  ZEROS                                    CIG0012
RQ1648        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 2 AND                CIG0012
RQ1648           TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1 AND         CIG0012
RQ1648           W-MESES-APERTURA-CARDEC  >  99EXP003TO13               CIG0012
RQ1648              MOVE W-MESES-APERTURA-CARDEC TO 99EXP003TO13        CIG0012
RQ1648        END-IF                                                    CIG0012
RQ1648     END-IF.                                                      CIG0012
      *----------------------------------------------------------------*        
       5320-99END003TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1        
               IF SW-CODEUDOR = ZEROS        
                  IF IND-VALORES-VALVLR = 1        
                     IF VEC-VALOR-VALVLR (3) = 1        
                        COMPUTE 99END003TO00 =  99END003TO00 +         
                                     (VALOR-SALDO-DEUDAM-ABD07)        
                     END-IF        
                  END-IF        
               END-IF        
            END-IF.        
      *        
      *----------------------------------------------------------------*        
       5320-99END004TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1        
               IF SW-CODEUDOR = ZEROS        
                  IF IND-VALORES-VALVLR = 1        
                     IF VEC-VALOR-VALVLR (1) = 1        
                        COMPUTE 99END004TO00 = 99END004TO00 +         
                                           (CUANTIA-ABD07)        
                     END-IF        
                  END-IF        
               END-IF        
            END-IF.        
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END004HP00-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* CUOTAS HIPOTECARIAS ACTIVAS COMO TITULAR DEL SECTOR COOPERATIVO CIGD004
CQ1224* Y FINANCIERO                                                    CIGD004
CQ1224      IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1              CIGD004
CQ1224         IF SW-CODEUDOR = ZEROS                                   CIGD004
CQ1224            IF TIPO-OBLIGACION-ABD07 = 3 AND                      CIGD004
CQ1224               (IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 OR 3)         CIGD004
CQ1224               IF IND-VALORES-VALVLR = 1                          CIGD004
CQ1224                  IF VEC-VALOR-VALVLR (1) = 1                     CIGD004
CQ1224                     COMPUTE 99END004HP00 = 99END004HP00 +        CIGD004
CQ1224                                        (CUANTIA-ABD07)           CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224         END-IF                                                   CIGD004
CQ1224      END-IF.                                                     CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END004CO00-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* CUOTAS HIPOTECARIAS ACTIVAS COMO CODEUDOR                       CIGD004
CQ1224      IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1              CIGD004
CQ1224         IF SW-CODEUDOR = 1                                       CIGD004
CQ1224            IF  TIPO-OBLIGACION-ABD07 = 3                         CIGD004
CQ1224               IF IND-VALORES-VALVLR = 1                          CIGD004
CQ1224                  IF VEC-VALOR-VALVLR (1) = 1                     CIGD004
CQ1224                     COMPUTE 99END004CO00 = 99END004CO00 +        CIGD004
CQ1224                                        (CUANTIA-ABD07)           CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224         END-IF                                                   CIGD004
CQ1224      END-IF.                                                     CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END004TO09-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* CUOTAS DE CREDITOS DE CONSUMO ACTIVAS DIFERENTES A TDC DEL     *CIGD004
CQ1224* SECTOR FINANCIERO Y COOPERATIVO.                               *CIGD004
CQ1224      IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1              CIGD004
CQ1224         IF SW-CODEUDOR = ZEROS                                   CIGD004
CQ1224            IF COD-CTA-ABD07 <> 02 AND                            CIGD004
CQ1224              (IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 OR 3) AND      CIGD004
CQ1224                (TIPO-OBLIGACION-ABD07 = 2 OR 4)                  CIGD004
CQ1224               IF IND-VALORES-VALVLR = 1                          CIGD004
CQ1224                  IF VEC-VALOR-VALVLR (1) = 1                     CIGD004
CQ1224                     COMPUTE 99END004TO09 = 99END004TO09 +        CIGD004
CQ1224                                        (CUANTIA-ABD07)           CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224         END-IF                                                   CIGD004
CQ1224      END-IF.                                                     CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END004TO10-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* CUOTAS CREDITOS COMERCIALES DIFERENTES A TDC DEL SECTOR        *CIGD004
CQ1224* FINANCIERO Y COOPERATIVO                                       *CIGD004
CQ1224      IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1              CIGD004
CQ1224         IF SW-CODEUDOR = ZEROS                                   CIGD004
CQ1224            IF COD-CTA-ABD07 <> 02 AND                            CIGD004
CQ1224               (IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 OR 3) AND     CIGD004
CQ1224               TIPO-OBLIGACION-ABD07 = 1                          CIGD004
CQ1224               IF IND-VALORES-VALVLR = 1                          CIGD004
CQ1224                  IF VEC-VALOR-VALVLR (1) = 1                     CIGD004
CQ1224                     COMPUTE 99END004TO10 = 99END004TO10 +        CIGD004
CQ1224                                        (CUANTIA-ABD07)           CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224         END-IF                                                   CIGD004
CQ1224      END-IF.                                                     CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END004TO11-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224      IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1              CIGD004
CQ1224         IF SW-CODEUDOR = ZEROS                                   CIGD004
CQ1224            IF COD-CTA-ABD07 <> 02 AND                            CIGD004
CQ1224               (IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 OR 3) AND     CIGD004
CQ1224               TIPO-OBLIGACION-ABD07 = 5                          CIGD004
CQ1224               IF IND-VALORES-VALVLR = 1                          CIGD004
CQ1224                  IF VEC-VALOR-VALVLR (1) = 1                     CIGD004
CQ1224                     COMPUTE 99END004TO11 = 99END004TO11 +        CIGD004
CQ1224                                        (CUANTIA-ABD07)           CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224         END-IF                                                   CIGD004
CQ1224      END-IF.                                                     CIGD004
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99END004TO13-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343      IF  TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1              EHA0006
CQ1343        IF  SW-CODEUDOR  =  ZEROS                                 EHA0006
CQ1343          IF  IND-SECTOR-CARTERA(W-CTA-BDCUE)  =  2               EHA0006
CQ1343            IF  IND-VALORES-VALVLR = 1                            EHA0006
CQ1343              IF  VEC-VALOR-VALVLR (1) = 1                        EHA0006
CQ1343                COMPUTE  99END004TO13  =  99END004TO13 +          EHA0006
CQ1343                                          CUANTIA-ABD07           EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343            END-IF                                                EHA0006
CQ1343          END-IF                                                  EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343      END-IF.                                                     EHA0006
CQ1224*----------------------------------------------------------------*CIGD004
       5320-99END004CO07-CARDEC.
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* CUOTAS CREDITOS CONSUMO COMO CODEUDOR, TODAS LAS OBLIGACIONES  *CIGD004
CQ1224* ACTIVAS DE CONSUMO DIFERENRE A TDC                              CIGD004
CQ1224      IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1              CIGD004
CQ1224         IF SW-CODEUDOR = 1                                       CIGD004
CQ1224            IF COD-CTA-ABD07 <> 02 AND                            CIGD004
CQ1224               (TIPO-OBLIGACION-ABD07 = 2 OR 4)                   CIGD004
CQ1224               IF IND-VALORES-VALVLR = 1                          CIGD004
CQ1224                  IF VEC-VALOR-VALVLR (1) = 1                     CIGD004
CQ1224                     COMPUTE 99END004CO07 = 99END004CO07 +        CIGD004
CQ1224                                        (CUANTIA-ABD07)           CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224         END-IF                                                   CIGD004
CQ1224      END-IF.                                                     CIGD004
      *        
      *----------------------------------------------------------------*        
       5320-99END005TO00-CARDEC.        
      *----------------------------------------------------------------*        
            IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1        
               IF SW-CODEUDOR = ZEROS        
                  IF IND-VALORES-VALVLR = 1        
                     IF VEC-VALOR-VALVLR (2) = 1        
                        COMPUTE 99END005TO00 = 99END005TO00 +         
                                           (VALOR-INICIAL-ABD07)        
                     END-IF        
                  END-IF        
               END-IF        
            END-IF.
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END005TC00-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224      IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1              CIGD004
CQ1224         IF SW-CODEUDOR = ZEROS                                   CIGD004
CQ1224            IF COD-CTA-ABD07 = 02                                 CIGD004
CQ1224               IF IND-VALORES-VALVLR = 1                          CIGD004
CQ1224                  IF VEC-VALOR-VALVLR (2) = 1                     CIGD004
CQ1224                     COMPUTE 99END005TC00 = 99END005TC00 +        CIGD004
CQ1224                                        (VALOR-INICIAL-ABD07)     CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224         END-IF                                                   CIGD004
CQ1224      END-IF.                                                     CIGD004
MD1033*                                                                 EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99END006EX00-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033* SE VERIFICA SI LA OBLIGACION REPORTA VALORES COMO TITULAR       EHA0003
MD1033     IF FINCRE-CARDEC = 0                                         EHA0003
MD1033        IF SW-CODEUDOR = ZEROS                                    EHA0003
MD1033           IF IND-VALORES-VALVLR = 1                              EHA0003
MD1033* SE ACUMULA SALDO MORA                                           EHA0003
MD1033              IF VEC-VALOR-VALVLR (5) = 1                         EHA0003
MD1033                 ADD VALOR-SALDO-MORAM-ABD07 TO                   EHA0003
MD1033                     T-SLD-MORA-99END06EX00                       EHA0003
MD1033              END-IF                                              EHA0003
MD1033* SE ACUMULA SALDO DEUDA                                          EHA0003
MD1033              IF VEC-VALOR-VALVLR (3) = 1                         EHA0003
MD1033                 ADD VALOR-SALDO-DEUDAM-ABD07 TO                  EHA0003
MD1033                     T-SLD-DEUDA-99END06EX00                      EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033        IF COD-CTA-ABD07 = 29                                     EHA0003
MD1033           IF IND-VALORES-VALVLR = 1                              EHA0003
MD1033* SE ACUMULA SALDO MORA PARA TIPO DE CTA. 29 SERVICIOS PUBLICOS   EHA0003
MD1033              IF VEC-VALOR-VALVLR (5) = 1                         EHA0003
MD1033                 ADD VALOR-SALDO-MORAM-ABD07 TO                   EHA0003
MD1033                     T-SLD-MORA-29-99END006EX00                   EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     ELSE                                                         EHA0003
MD1033* SI EL TOTAL DE VALORES EN MORA ES >= AL 40% DEL TOT. DE SALDOS  EHA0003
MD1033        COMPUTE PORC-40-99END006EX00 =                            EHA0003
MD1033                        (T-SLD-DEUDA-99END06EX00 * 40) / 100      EHA0003
MD1033        IF T-SLD-MORA-99END06EX00 >= PORC-40-99END006EX00 AND     EHA0003
MD1033           PORC-40-99END006EX00 > ZEROS                           EHA0003
MD1033           MOVE 1 TO 99END006EX00                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033* SI EL VALOR EN MORA DE LAS CTAS. S. PUB. >= 251000              EHA0003
MD1033        IF T-SLD-MORA-29-99END006EX00 >= 251                      EHA0003
MD1033           MOVE 1 TO 99END006EX00                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-IF.                                                      EHA0003
MD1033*                                                                 EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99END007TC00-CARDEC.                                        EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033     IF FINCRE-CARDEC = 0                                         EHA0003
      * SE VERIFICA SI LA OBLIGACION REPORTA VALORES COMO TITULAR
              IF SW-CODEUDOR = ZEROS
                 IF IND-VALORES-VALVLR = 1
      * SE ACUMULA SALDO DEUDA TDC
                    IF VEC-VALOR-VALVLR (3) = 1
                       IF COD-CTA-ABD07 = 02
                          ADD VALOR-SALDO-DEUDAM-ABD07 TO
                              T-SLD-DEUDA-99END007TC00
                       END-IF
                    END-IF
      * SE ACUMULA CUPO INICIAL PARA TDC
                    IF COD-CTA-ABD07 = 02
                       IF VEC-VALOR-VALVLR (2) = 1
                          ADD VALOR-INICIAL-ABD07 TO
                              T-VAL-INICIAL-99END007TC00
                       END-IF
                    END-IF
                 END-IF
              END-IF
           ELSE
      * SI EL SALDO DEUDA TDC ES MAYOR AL 75% DEL CUPO TOTAL DE TDC
              COMPUTE PORC-75-99END007TC00 =
                      (T-VAL-INICIAL-99END007TC00 * 75) / 100
              IF T-SLD-DEUDA-99END007TC00 >= PORC-75-99END007TC00 AND
                 PORC-75-99END007TC00 > ZEROS
                 MOVE 1 TO 99END007TC00
              END-IF
           END-IF.
      *      
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END010EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* CUPO TDC M-CARD BANCOL                                          CIGD004
CQ1224     IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1                CIGD004
CQ1224        IF SW-CODEUDOR = ZEROS                                    CIGD004
CQ1224           IF COD-CTA-ABD07 = 02 AND COD-SUS-ABD07 = 020233       CIGD004
CQ1224              IF IND-VALORES-VALVLR = 1                           CIGD004
CQ1224                 IF VEC-VALOR-VALVLR (2) = 1                      CIGD004
CQ1224                    COMPUTE 99END010EX59 = 99END010EX59 +         CIGD004
CQ1224                                       (VALOR-INICIAL-ABD07)      CIGD004
CQ1224                 END-IF                                           CIGD004
CQ1224              END-IF                                              CIGD004
CQ1224           END-IF                                                 CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END011EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* CUPO TDC VISA BANCOL                                            CIGD004
CQ1224     IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1                CIGD004
CQ1224        IF SW-CODEUDOR = ZEROS                                    CIGD004
CQ1224           IF COD-CTA-ABD07 = 02 AND COD-SUS-ABD07 = 020232       CIGD004
CQ1224              IF IND-VALORES-VALVLR = 1                           CIGD004
CQ1224                 IF VEC-VALOR-VALVLR (2) = 1                      CIGD004
CQ1224                    COMPUTE 99END011EX59 = 99END011EX59 +         CIGD004
CQ1224                                       (VALOR-INICIAL-ABD07)      CIGD004
CQ1224                 END-IF                                           CIGD004
CQ1224              END-IF                                              CIGD004
CQ1224           END-IF                                                 CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END012EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224* CUPO TDC VISA BANCOL                                            CIGD004
CQ1224     IF TAB-VIGENTES-CARTERA(NOV-REPORT-ABD07) = 1                CIGD004
CQ1224        IF SW-CODEUDOR = ZEROS                                    CIGD004
CQ1224           IF COD-CTA-ABD07 = 02 AND COD-SUS-ABD07 = 020234       CIGD004
CQ1224              IF IND-VALORES-VALVLR = 1                           CIGD004
CQ1224                 IF VEC-VALOR-VALVLR (2) = 1                      CIGD004
CQ1224                    COMPUTE 99END012EX59 = 99END012EX59 +         CIGD004
CQ1224                                       (VALOR-INICIAL-ABD07)      CIGD004
CQ1224                 END-IF                                           CIGD004
CQ1224              END-IF                                              CIGD004
CQ1224           END-IF                                                 CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END013EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224      IF FINCRE-CARDEC = 0                                        CIGD004
CQ1224        IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1            CIGD004
CQ1224          IF SW-CODEUDOR = ZEROS                                  CIGD004
CQ1224             IF (IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 OR 3) AND    CIGD004
CQ1224                TIPO-OBLIGACION-ABD07 = 3                         CIGD004
CQ1224                ADD 1 TO W-NUM-OBLIG-HIP                          CIGD004
CQ1224                IF IND-VALORES-VALVLR = 1                         CIGD004
CQ1224* SI NO REPORTAN CUOTA O ESTA ES IGUAL A CERO                     CIGD004
CQ1224                   IF VEC-VALOR-VALVLR (1) = ZERO OR              CIGD004
CQ1224                      CUANTIA-ABD07 = ZEROS                       CIGD004
CQ1224* SI NO REPORTAN MONTO INICIAL O ESTE ES IGUAL A CERO             CIGD004
CQ1224                     IF VEC-VALOR-VALVLR (2) = ZERO OR            CIGD004
CQ1224                        VALOR-INICIAL-ABD07 = ZERO                CIGD004
CQ1224* SI NO REPORTAN SALDO O ESTE ES IGUAL A CERO                     CIGD004
CQ1224                        IF VEC-VALOR-VALVLR (3) = ZERO OR         CIGD004
CQ1224                           VALOR-SALDO-DEUDAM-ABD07 =ZERO         CIGD004
CQ1224                           ADD 1 TO W-NUM-CHPNOREP-99END013EX59   CIGD004
CQ1224                        ELSE                                      CIGD004
CQ1224                           COMPUTE 99END013EX59 = 99END013EX59 +  CIGD004
CQ1224                                   VALOR-SALDO-DEUDAM-ABD07 *     CIGD004
CQ1224                                   (14 / 1000)                    CIGD004
CQ1224                        END-IF                                    CIGD004
CQ1224                     ELSE                                         CIGD004
CQ1224                        COMPUTE 99END013EX59 = 99END013EX59 +     CIGD004
CQ1224                                VALOR-INICIAL-ABD07 * (14 / 1000) CIGD004
CQ1224                     END-IF                                       CIGD004
CQ1224                   END-IF                                         CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224             END-IF                                               CIGD004
CQ1224          END-IF                                                  CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224      ELSE                                                        CIGD004
CQ1224        COMPUTE 99END013EX59 = 99END013EX59 +                     CIGD004
CQ1224              (W-NUM-CHPNOREP-99END013EX59 * W-NUM-OBLIG-HIP *    CIGD004
CQ1224                300)                                              CIGD004
CQ1224      END-IF.                                                     CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END014EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224      IF FINCRE-CARDEC = 0                                        CIGD004
CQ1224        IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1            CIGD004
CQ1224           IF SW-CODEUDOR = ZEROS                                 CIGD004
CQ1224              IF COD-CTA-ABD07 <> 02 AND                          CIGD004
CQ1224                 (IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 OR 3) AND   CIGD004
CQ1224                 (TIPO-OBLIGACION-ABD07 = 2 OR 4)                 CIGD004
CQ1224                 ADD 1 TO W-NUM-CRE-CON-PR                        CIGD004
CQ1224                 IF IND-VALORES-VALVLR = 1                        CIGD004
CQ1224                    IF VEC-VALOR-VALVLR (1) = ZERO OR             CIGD004
CQ1224                       CUANTIA-ABD07 = ZERO                       CIGD004
CQ1224                       IF VEC-VALOR-VALVLR (2) = ZERO OR          CIGD004
CQ1224                          VALOR-INICIAL-ABD07 = ZERO              CIGD004
CQ1224                          IF VEC-VALOR-VALVLR (3) = ZERO OR       CIGD004
CQ1224                             VALOR-SALDO-DEUDAM-ABD07 =ZERO       CIGD004
CQ1224                             ADD 1 TO W-NUM-CHPNOREP-99END014EX59 CIGD004
CQ1224                          ELSE                                    CIGD004
CQ1224                             COMPUTE 99END014EX59 = 99END014EX59 +CIGD004
CQ1224                                     VALOR-SALDO-DEUDAM-ABD07 *   CIGD004
CQ1224                                     (36 / 1000)                  CIGD004
CQ1224                          END-IF                                  CIGD004
CQ1224                       ELSE                                       CIGD004
CQ1224                         COMPUTE 99END014EX59 = 99END014EX59 +    CIGD004
CQ1224                                VALOR-INICIAL-ABD07 * (36 / 1000) CIGD004
CQ1224                       END-IF                                     CIGD004
CQ1224                    END-IF                                        CIGD004
CQ1224                 END-IF                                           CIGD004
CQ1224              END-IF                                              CIGD004
CQ1224           END-IF                                                 CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224      ELSE                                                        CIGD004
CQ1224        COMPUTE 99END014EX59 = 99END014EX59 +                     CIGD004
CQ1224              (W-NUM-CHPNOREP-99END014EX59 * W-NUM-CRE-CON-PR *   CIGD004
CQ1224                180)                                              CIGD004
CQ1224      END-IF.                                                     CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END015EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     IF FINCRE-CARDEC = 0                                         CIGD004
CQ1224       IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1             CIGD004
CQ1224          IF SW-CODEUDOR = ZEROS                                  CIGD004
CQ1224             IF COD-CTA-ABD07 <> 02 AND                           CIGD004
CQ1224                (IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 OR 3) AND    CIGD004
CQ1224                TIPO-OBLIGACION-ABD07 = 1                         CIGD004
CQ1224                ADD 1 TO W-NUM-CRE-CONSU-PR                       CIGD004
CQ1224                IF IND-VALORES-VALVLR = 1                         CIGD004
CQ1224                   IF VEC-VALOR-VALVLR (1) = ZEROS OR             CIGD004
CQ1224                      CUANTIA-ABD07 = ZEROS                       CIGD004
CQ1224                      IF VEC-VALOR-VALVLR (2) = ZERO OR           CIGD004
CQ1224                          VALOR-INICIAL-ABD07 = ZERO              CIGD004
CQ1224                          IF VEC-VALOR-VALVLR (3) = ZERO OR       CIGD004
CQ1224                             VALOR-SALDO-DEUDAM-ABD07 =ZERO       CIGD004
CQ1224                             ADD 1 TO W-NUM-CHPNOREP-99END015EX59 CIGD004
CQ1224                          ELSE                                    CIGD004
CQ1224                             COMPUTE 99END015EX59 = 99END015EX59 +CIGD004
CQ1224                                     VALOR-SALDO-DEUDAM-ABD07 *   CIGD004
CQ1224                                     (33 / 1000)                  CIGD004
CQ1224                          END-IF                                  CIGD004
CQ1224                      ELSE                                        CIGD004
CQ1224                         COMPUTE 99END015EX59 = 99END015EX59 +    CIGD004
CQ1224                                VALOR-INICIAL-ABD07 * (33 / 1000) CIGD004
CQ1224                      END-IF                                      CIGD004
CQ1224                                                                  CIGD004
CQ1224                   END-IF                                         CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224             END-IF                                               CIGD004
CQ1224          END-IF                                                  CIGD004
CQ1224       END-IF                                                     CIGD004
CQ1224     ELSE                                                         CIGD004
CQ1224        COMPUTE 99END015EX59 = 99END015EX59 +                     CIGD004
CQ1224              (W-NUM-CHPNOREP-99END015EX59 * W-NUM-CRE-CONSU-PR * CIGD004
CQ1224                200)                                              CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END016EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     IF FINCRE-CARDEC = 0                                         CIGD004
CQ1224       IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1             CIGD004
CQ1224          IF SW-CODEUDOR = ZEROS                                  CIGD004
CQ1224             IF COD-CTA-ABD07 <> 02 AND                           CIGD004
CQ1224                (IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 OR 3) AND    CIGD004
CQ1224                TIPO-OBLIGACION-ABD07 = 5                         CIGD004
CQ1224                ADD 1 TO W-NUM-CRE-MICRO-PR                       CIGD004
CQ1224                IF IND-VALORES-VALVLR = 1                         CIGD004
CQ1224                   IF VEC-VALOR-VALVLR (1) = ZERO OR              CIGD004
CQ1224                      CUANTIA-ABD07 = ZERO                        CIGD004
CQ1224                      IF VEC-VALOR-VALVLR (2) = ZERO OR           CIGD004
CQ1224                          VALOR-INICIAL-ABD07 = ZERO              CIGD004
CQ1224                          IF VEC-VALOR-VALVLR (3) = ZERO OR       CIGD004
CQ1224                             VALOR-SALDO-DEUDAM-ABD07 =ZERO       CIGD004
CQ1224                             ADD 1 TO W-NUM-CHPNOREP-99END016EX59 CIGD004
CQ1224                          ELSE                                    CIGD004
CQ1224                             COMPUTE 99END016EX59 = 99END016EX59 +CIGD004
CQ1224                                     VALOR-SALDO-DEUDAM-ABD07 *   CIGD004
CQ1224                                     (51 / 1000)                  CIGD004
CQ1224                          END-IF                                  CIGD004
CQ1224                      ELSE                                        CIGD004
CQ1224                         COMPUTE 99END016EX59 = 99END016EX59 +    CIGD004
CQ1224                                VALOR-INICIAL-ABD07 * (51 / 1000) CIGD004
CQ1224                      END-IF                                      CIGD004
CQ1224                   END-IF                                         CIGD004
CQ1224                END-IF                                            CIGD004
CQ1224             END-IF                                               CIGD004
CQ1224          END-IF                                                  CIGD004
CQ1224       END-IF                                                     CIGD004
CQ1224     ELSE                                                         CIGD004
CQ1224        COMPUTE 99END016EX59 = 99END016EX59 +                     CIGD004
CQ1224              (W-NUM-CHPNOREP-99END016EX59 * W-NUM-CRE-MICRO-PR * CIGD004
CQ1224                200)                                              CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END017EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     IF FINCRE-CARDEC = 0                                         CIGD004
CQ1224        IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1            CIGD004
CQ1224           IF SW-CODEUDOR = 1                                     CIGD004
CQ1224              IF  TIPO-OBLIGACION-ABD07 = 3                       CIGD004
CQ1224                 IF IND-VALORES-VALVLR = 1                        CIGD004
CQ1224                    IF VEC-VALOR-VALVLR (1) = ZERO OR             CIGD004
CQ1224                       CUANTIA-ABD07 =ZERO                        CIGD004
CQ1224                       IF VEC-VALOR-VALVLR (2) = ZERO OR          CIGD004
CQ1224                          VALOR-INICIAL-ABD07 = ZERO              CIGD004
CQ1224                          IF VEC-VALOR-VALVLR (3) = ZERO OR       CIGD004
CQ1224                             VALOR-SALDO-DEUDAM-ABD07 =ZERO       CIGD004
CQ1224                             CONTINUE                             CIGD004
CQ1224                          ELSE                                    CIGD004
CQ1224                             COMPUTE 99END017EX59 = 99END017EX59 +CIGD004
CQ1224                                     VALOR-SALDO-DEUDAM-ABD07 *   CIGD004
CQ1224                                     (4 / 1000)                   CIGD004
CQ1224                          END-IF                                  CIGD004
CQ1224                       ELSE                                       CIGD004
CQ1224                          COMPUTE 99END017EX59 = 99END017EX59 +   CIGD004
CQ1224                                VALOR-INICIAL-ABD07 * (4 / 1000)  CIGD004
CQ1224                       END-IF                                     CIGD004
CQ1224                    END-IF                                        CIGD004
CQ1224                 END-IF                                           CIGD004
CQ1224              END-IF                                              CIGD004
CQ1224           END-IF                                                 CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224 5320-99END018EX59-CARDEC.                                        CIGD004
CQ1224*----------------------------------------------------------------*CIGD004
CQ1224     IF FINCRE-CARDEC = 0                                         CIGD004
CQ1224        IF TAB-VIGENTES-CARTERA (NOV-REPORT-ABD07) = 1            CIGD004
CQ1224            IF SW-CODEUDOR = 1                                    CIGD004
CQ1224               IF COD-CTA-ABD07 <> 02 AND                         CIGD004
CQ1224                  (TIPO-OBLIGACION-ABD07 = 2 OR 4)                CIGD004
CQ1224                  ADD 1 TO W-NUM-CRE-CONSU-COD                    CIGD004
CQ1224                  IF IND-VALORES-VALVLR = 1                       CIGD004
CQ1224                     IF VEC-VALOR-VALVLR (1) = ZERO OR            CIGD004
CQ1224                        CUANTIA-ABD07 = ZERO                      CIGD004
CQ1224                        IF VEC-VALOR-VALVLR (2) = ZERO OR         CIGD004
CQ1224                          VALOR-INICIAL-ABD07 = ZERO              CIGD004
CQ1224                          IF VEC-VALOR-VALVLR (3) = ZERO OR       CIGD004
CQ1224                             VALOR-SALDO-DEUDAM-ABD07 =ZERO       CIGD004
CQ1224                             ADD 1 TO W-NUM-CHPNOREP-99END018EX59 CIGD004
CQ1224                          ELSE                                    CIGD004
CQ1224                             COMPUTE 99END018EX59 = 99END018EX59 +CIGD004
CQ1224                                     VALOR-SALDO-DEUDAM-ABD07 *   CIGD004
CQ1224                                     (18 / 1000)                  CIGD004
CQ1224                          END-IF                                  CIGD004
CQ1224                        ELSE                                      CIGD004
CQ1224                          COMPUTE 99END018EX59 = 99END018EX59 +   CIGD004
CQ1224                                VALOR-INICIAL-ABD07 * (18 / 1000) CIGD004
CQ1224                        END-IF                                    CIGD004
CQ1224                     END-IF                                       CIGD004
CQ1224                  END-IF                                          CIGD004
CQ1224               END-IF                                             CIGD004
CQ1224            END-IF                                                CIGD004
CQ1224        END-IF                                                    CIGD004
CQ1224     ELSE                                                         CIGD004
CQ1224        COMPUTE 99END018EX59 = 99END018EX59 +                     CIGD004
CQ1224             (W-NUM-CHPNOREP-99END018EX59 * W-NUM-CRE-CONSU-COD * CIGD004
CQ1224              180)                                                CIGD004
CQ1224     END-IF.                                                      CIGD004
CQ1343*                                                                 EHA0006
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99END019TO04-CARDEC.                                        EHA0003
MD1033* SALDO MORA SECTOR TELCOS                                       *EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033     IF COD-CTA-ABD07 = 23 OR COD-CTA-ABD07 = 24                  EHA0003
MD1033* SI TIENE ESTADO DE MORA                                         EHA0003
MD1033        IF TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 08 OR *>CMM    EHA0003
MD1033           TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 09 OR *>CC     EHA0003
MD1033           TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 10 OR *>CR     EHA0003
MD1033           TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 11 OR *>DR     EHA0003
MD1033           TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 12 OR *>MOR30  EHA0003
MD1033           TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 13 OR *>MOR60  EHA0003
MD1033           TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 14 OR *>MOR90  EHA0003
MD1033           TAB-NOV-CART-CODINT(NOV-REPORT-ABD07) = 15    *>MOR120 EHA0003
MD1033           IF IND-VALORES-VALVLR = 1                              EHA0003
MD1033* SE ACUMULA SALDO MORA                                           EHA0003
MD1033              IF VEC-VALOR-VALVLR (5) = 1                         EHA0003
MD1033                 ADD VALOR-SALDO-MORAM-ABD07 TO                   EHA0003
MD1033                     99END019TO04                                 EHA0003
MD1033              END-IF                                              EHA0003
MD1033           END-IF                                                 EHA0003
MD1033        END-IF                                                    EHA0003
MD1033     END-IF.                                                      EHA0003
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99END019TO13-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF SW-CODEUDOR = ZEROS                                       EHA0006
CQ1343        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 2                    EHA0006
CQ1343           IF IND-VALORES-VALVLR = 1                              EHA0006
CQ1343* SE ACUMULA SALDO MORA                                           EHA0006
CQ1343              IF VEC-VALOR-VALVLR (5) = 1                         EHA0006
CQ1343                 ADD VALOR-SALDO-MORAM-ABD07 TO                   EHA0006
CQ1343                     99END019TO13                                 EHA0006
CQ1343              END-IF                                              EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343        END-IF                                                    EHA0006
CQ1343     END-IF.                                                      EHA0006
AL1224*----------------------------------------------------------------*EHA0010
AL1224 5320-99END019TO01-CARDEC.                                        EHA0010
AL1224*----------------------------------------------------------------*EHA0010
AL1224     IF SW-CODEUDOR = ZEROS                                       EHA0010
AL1224        IF IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1                    EHA0010
AL1224           IF IND-VALORES-VALVLR = 1                              EHA0010
AL1224* SE ACUMULA SALDO MORA                                           EHA0010
AL1224              IF VEC-VALOR-VALVLR (5) = 1                         EHA0010
AL1224                 ADD VALOR-SALDO-MORAM-ABD07 TO                   EHA0010
AL1224                     99END019TO01                                 EHA0010
AL1224              END-IF                                              EHA0010
AL1224           END-IF                                                 EHA0010
AL1224        END-IF                                                    EHA0010
AL1224     END-IF.                                                      EHA0010
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343 5320-99END020EX61-CARDEC.                                        EHA0006
CQ1343*----------------------------------------------------------------*EHA0006
CQ1343     IF  FINCRE-CARDEC  =  0                                      EHA0006
CQ1343       IF  SW-CODEUDOR  =  ZEROS                                  EHA0006
CQ1343* SE ESTABLECE EL TOTAL CUOTAS DEL SECTOR FINANCIERO              EHA0006
AL2393        IF NOMBRE-PROGRAMA = "ICGD62"                             EHA0024
AL2393         IF  IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 *> SI PERTENECE  EHA0024
AL2393           IF IND-VALORES-VALVLR  =  1                            EHA0024
AL2393             IF COD-CTA-ABD07 = 02 OR COD-CTA-ABD07 = 03          EHA0024
AL2393* SI ES TDC O ROTATIVO SE MUEVE LA CUANTIA A CERO PARA QUE LA     EHA0024
AL2393* CUOTA SE CALCULE SIEMPRE.                                       EHA0024
AL2393                MOVE ZEROS TO CUANTIA-ABD07                       EHA0024
AL2393             END-IF                                               EHA0024
AL2393             IF  VEC-VALOR-VALVLR (1) = 1  AND *> CUOTAS          EHA0024
AL2393                 CUANTIA-ABD07  >  ZEROS                          EHA0024
AL2393                 EVALUATE PERIODICIDAD-PAGO-ABD07                 EHA0024
AL2393                    WHEN 1 *> MENSUAL                             EHA0024
AL2393                       CONTINUE                                   EHA0024
AL2393                    WHEN 2 *> BIMESTRAL                           EHA0024
AL2393                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 / 2  EHA0024
AL2393                    WHEN 3 *> TRIMESTRAL                          EHA0024
AL2393                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 / 3  EHA0024
AL2393                    WHEN 4 *> SEMESTRAL                           EHA0024
AL2393                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 / 6  EHA0024
AL2393                    WHEN 5 *> ANUAL                               EHA0024
AL2393                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 / 12 EHA0024
AL2393                    WHEN 6 *> AL VENCIMIENTO                      EHA0024
AL2393                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 /    EHA0024
AL2393                                      W-MESES-OBLIGACION-CARDEC   EHA0024
AL2393                 END-EVALUATE                                     EHA0024
AL2393                 ADD   CUANTIA-ABD07 TO  CUOTAS-99END020EX61      EHA0024
AL2393             ELSE                                                 EHA0024
AL2393               IF  VEC-VALOR-VALVLR(2)  =  1  *> CUPO             EHA0024
AL2393                 EVALUATE  COD-CTA-ABD07                          EHA0024
AL2393                   WHEN 02 *> TDC                                 EHA0024
CQ1343                    IF VEC-VALOR-VALVLR(3) = 1 AND *> SALDO DEUDA EHA0024
CQ1343                       VALOR-SALDO-DEUDAM-ABD07  >  ZEROS         EHA0024
AL2393                     COMPUTE CUANTIA-ABD07 =                      EHA0024
AL2393             (VALOR-SALDO-DEUDAM-ABD07 * TASA-99END020EX61) /     EHA0024
AL2393                  (1 - (1 / ((1 + TASA-99END020EX61) ** 24)))     EHA0024
AL2393                    END-IF                                        EHA0024
AL2393*                                                                 EHA0024
AL2393                   WHEN 03 *> ROTATIVOS                           EHA0024
CQ1343                    IF VEC-VALOR-VALVLR(3) = 1 AND *> SALDO DEUDA EHA0024
CQ1343                       VALOR-SALDO-DEUDAM-ABD07  >  ZEROS         EHA0024
AL2393                     COMPUTE CUANTIA-ABD07 =                      EHA0024
AL2393             (VALOR-SALDO-DEUDAM-ABD07 * TASA-99END020EX61) /     EHA0024
AL2393                  (1 - (1 / ((1 + TASA-99END020EX61) ** 36)))     EHA0024
AL2393                    END-IF                                        EHA0024
AL2393*                                                                 EHA0024
AL2393                   WHEN 13 *> CAV                                 EHA0024
AL2393                     COMPUTE CUANTIA-ABD07 =                      EHA0024
AL2393                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0024
AL2393                 (1 - (1 / ((1 + TASA-99END020EX61) **            EHA0024
AL2393                                      W-MESES-OBLIGACION-CARDEC)))EHA0024
AL2393*                                                                 EHA0024
AL2393                   WHEN OTHER                                     EHA0024
AL2393                     COMPUTE CUANTIA-ABD07 =                      EHA0024
AL2393                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0024
AL2393                  (1 - (1 / ((1 + TASA-99END020EX61) **           EHA0024
AL2393                                      W-MESES-OBLIGACION-CARDEC)))EHA0024
AL2393                 END-EVALUATE                                     EHA0024
AL2393                 ADD   CUANTIA-ABD07 TO CUOTAS-99END020EX61       EHA0024
AL2393               END-IF                                             EHA0024
AL2393             END-IF                                               EHA0024
AL2393           END-IF                                                 EHA0024
AL2393         END-IF                                                   EHA0024
AL2393        ELSE                                                      EHA0024
RQ2394* SE INCLUYE CALCULO DE LAS CUOTAS PARA PROGRAMA ICGD61           EHA0025
RQ2394        IF NOMBRE-PROGRAMA = "ICGD61"                             EHA0025
RQ2394         IF  IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 *> SI PERTENECE  EHA0025
RQ2394           IF IND-VALORES-VALVLR  =  1                            EHA0025
RQ2394             IF COD-CTA-ABD07 = 02 OR COD-CTA-ABD07 = 03          EHA0025
RQ2394* SI ES TDC O ROTATIVO SE MUEVE LA CUANTIA A CERO PARA QUE LA     EHA0025
RQ2394* CUOTA SE CALCULE SIEMPRE.                                       EHA0025
RQ2394                MOVE ZEROS TO CUANTIA-ABD07                       EHA0025
RQ2394             END-IF                                               EHA0025
RQ2394             IF  VEC-VALOR-VALVLR (1) = 1  AND *> CUOTAS          EHA0025
RQ2394                 CUANTIA-ABD07  >  ZEROS                          EHA0025
RQ2394                 EVALUATE PERIODICIDAD-PAGO-ABD07                 EHA0025
RQ2394                    WHEN 1 *> MENSUAL                             EHA0025
RQ2394                       CONTINUE                                   EHA0025
RQ2394                    WHEN 2 *> BIMESTRAL                           EHA0025
RQ2394                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 / 2  EHA0025
RQ2394                    WHEN 3 *> TRIMESTRAL                          EHA0025
RQ2394                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 / 3  EHA0025
RQ2394                    WHEN 4 *> SEMESTRAL                           EHA0025
RQ2394                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 / 6  EHA0025
RQ2394                    WHEN 5 *> ANUAL                               EHA0025
RQ2394                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 / 12 EHA0025
RQ2394                    WHEN 6 *> AL VENCIMIENTO                      EHA0025
RQ2394                       COMPUTE CUANTIA-ABD07 = CUANTIA-ABD07 /    EHA0025
RQ2394                                      W-MESES-OBLIGACION-CARDEC   EHA0025
RQ2394                 END-EVALUATE                                     EHA0025
RQ2394                 ADD   CUANTIA-ABD07 TO  CUOTAS-99END020EX61      EHA0025
RQ2394             ELSE                                                 EHA0025
RQ2394               IF  VEC-VALOR-VALVLR(2)  =  1  *> CUPO             EHA0025
RQ2394                 EVALUATE  COD-CTA-ABD07                          EHA0025
RQ2394                   WHEN 02 *> TDC                                 EHA0025
RQ2394                     COMPUTE CUANTIA-ABD07 =                      EHA0025
RQ2394                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0025
RQ2394                  (1 - (1 / ((1 + TASA-99END020EX61) ** 24)))     EHA0025
CQ5860                     ADD   CUANTIA-ABD07        TO  99END003TO00  DLM0030
CQ5860                     ADD   VALOR-INICIAL-ABD07  TO  99END004TO00  DLM0030
RQ2394*                                                                 EHA0025
RQ2394                   WHEN 03 *> ROTATIVOS                           EHA0025
RQ2394                     COMPUTE CUANTIA-ABD07 =                      EHA0025
RQ2394                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0025
RQ2394                  (1 - (1 / ((1 + TASA-99END020EX61) ** 36)))     EHA0025
CQ5860                     ADD   CUANTIA-ABD07        TO  99END003TO00  DLM0030
CQ5860                     ADD   VALOR-INICIAL-ABD07  TO  99END004TO10  DLM0030
RQ2394*                                                                 EHA0025
RQ2394                   WHEN 13 *> CAV                                 EHA0025
RQ2394                     COMPUTE CUANTIA-ABD07 =                      EHA0025
RQ2394                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0025
RQ2394                 (1 - (1 / ((1 + TASA-99END020EX61) **            EHA0025
RQ2394                                      W-MESES-OBLIGACION-CARDEC)))EHA0025
RQ2394*                                                                 EHA0025
RQ2394                   WHEN OTHER                                     EHA0025
RQ2394                     COMPUTE CUANTIA-ABD07 =                      EHA0025
RQ2394                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0025
RQ2394                  (1 - (1 / ((1 + TASA-99END020EX61) **           EHA0025
RQ2394                                      W-MESES-OBLIGACION-CARDEC)))EHA0025
RQ2394                 END-EVALUATE                                     EHA0025
RQ2394                 ADD   CUANTIA-ABD07 TO CUOTAS-99END020EX61       EHA0025
RQ2394               END-IF                                             EHA0025
RQ2394             END-IF                                               EHA0025
RQ2394           END-IF                                                 EHA0025
RQ2394         END-IF                                                   EHA0025
RQ2394        ELSE                                                      EHA0025
RQ2394*                                                                 EHA0025
CQ1343         IF  IND-SECTOR-CARTERA(W-CTA-BDCUE) = 1 *> SI PERTENECE  EHA0006
CQ1343           IF IND-VALORES-VALVLR  =  1                            EHA0006
CQ1343             IF  VEC-VALOR-VALVLR (1) = 1  AND *> CUOTAS          EHA0006
CQ1343                 CUANTIA-ABD07  >  ZEROS                          EHA0006
CQ1343               ADD   CUANTIA-ABD07 TO  CUOTAS-99END020EX61        EHA0006
CQ1343             ELSE                                                 EHA0006
CQ1343               IF  VEC-VALOR-VALVLR(2)  =  1  AND *> CUPO         EHA0006
CQ3535*CQ1343            VEC-VALOR-VALVLR(3)  =  1  AND *> SALDO DEUDA  DLM0028
CQ3535*CQ1343            VALOR-SALDO-DEUDAM-ABD07  >  ZEROS             DLM0028
CQ3535                 ((VEC-VALOR-VALVLR(3)  =  1  AND *> SALDO DEUDA  DLM0028
CQ3535                   VALOR-SALDO-DEUDAM-ABD07  >  ZEROS)  OR        DLM0028
CQ3535                  (NOMBRE-PROGRAMA = "ICGD65"  AND                DLM0028
CQ3535                   VALOR-SALDO-DEUDAM-ABD07  =  ZEROS))           DLM0028
CQ1343                 EVALUATE  COD-CTA-ABD07                          EHA0006
CQ1343                   WHEN 13 *> CAV                                 EHA0006
CQ1343                     COMPUTE CUANTIA-ABD07 =                      EHA0006
CQ1343                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0006
CQ1343                 (1 - (1 / ((1 + TASA-99END020EX61) ** 180)))     EHA0006
CQ1343                   WHEN 02 *> TDC                                 EHA0006
CQ1343                     COMPUTE CUANTIA-ABD07 =                      EHA0006
CQ1343                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0006
CQ1343                  (1 - (1 / ((1 + TASA-99END020EX61) ** 24)))     EHA0006
CQ3535                   WHEN 03 *> CBR                                 DLM0028
CQ3535                     COMPUTE CUANTIA-ABD07 =                      DLM0028
CQ3535                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     DLM0028
CQ3535                  (1 - (1 / ((1 + TASA-99END020EX61) ** 36)))     DLM0028
CQ1343                   WHEN OTHER                                     EHA0006
CQ1343                     COMPUTE CUANTIA-ABD07 =                      EHA0006
CQ1343                  (VALOR-INICIAL-ABD07 * TASA-99END020EX61) /     EHA0006
CQ1343                  (1 - (1 / ((1 + TASA-99END020EX61) **           EHA0006
CQ1343                                      W-MESES-OBLIGACION-CARDEC)))EHA0006
CQ1343                 END-EVALUATE                                     EHA0006
CQ1343                 ADD   CUANTIA-ABD07 TO CUOTAS-99END020EX61       EHA0006
CQ1343               END-IF                                             EHA0006
CQ1343             END-IF                                               EHA0006
CQ1343           END-IF                                                 EHA0006
CQ1343         END-IF                                                   EHA0006
AL2393        END-IF                                                    EHA0024
RQ2394        END-IF                                                    EHA0025
CQ1343       END-IF                                                     EHA0006
CQ1343     ELSE                                                         EHA0006
CQ1343*      CONTINUE                                                   EHA0006
1342V1       IF NOMBRE-PROGRAMA = "ICGD62"                              EHA0013
RQ2394          OR NOMBRE-PROGRAMA = "ICGD61"                           EHA0025
RQ2393*       EVALUATE  ACTIVID99END020EX61                             EHA0023
RQ2393*         WHEN  1                                                 EHA0023
RQ2393*           COMPUTE INGREAL99END020EX61 = INGRESO99END020EX61  *  EHA0023
RQ2393*                   0.70                                          EHA0023
RQ2393*         WHEN  OTHER                                             EHA0023
RQ2393*           COMPUTE INGREAL99END020EX61 = INGRESO99END020EX61 * 1 EHA0023
RQ2393*       END-EVALUATE                                              EHA0023
RQ2393        MOVE W-INGREAL99END020EX61 TO INGREAL99END020EX61         EHA0023
1342V1       ELSE                                                       EHA0013
CQ1342        EVALUATE  ACTIVID99END020EX61                             DLM0007
CQ1343          WHEN  1                                                 EHA0006
CQ1342            COMPUTE INGREAL99END020EX61 = INGRESO99END020EX61  *  DLM0007
CQ1342                    0.67                                          DLM0007
CQ1343          WHEN  4                                                 EHA0006
CQ1342            COMPUTE INGREAL99END020EX61 = INGRESO99END020EX61  *  DLM0007
CQ1342                    0.72                                          DLM0007
CQ1343          WHEN  OTHER                                             EHA0006
CQ1342            COMPUTE INGREAL99END020EX61 = INGRESO99END020EX61 * 1 DLM0007
CQ1343        END-EVALUATE                                              EHA0006
1342V1       END-IF                                                     EHA0013
RQ1648       IF NOMBRE-PROGRAMA = "ICGD65"                              CIG0012
RQ1648          EVALUATE  ACTIVID99END020EX65                           CIG0012
RQ1648             WHEN  1                                              CIG0012
RQ1648                IF INGRESO99END020EX65 < 1700000                  CIG0012
RQ1648                   EVALUATE TRUE                                  CIG0012
RQ1648                      WHEN ACTIIND99END020EX65 = 1 OR 6           CIG0012
RQ1648                         COMPUTE INGREAL99END020EX61 =            CIG0012
RQ1648                                 INGRESO99END020EX65  * 0.8       CIG0012
RQ1648                      WHEN ACTIIND99END020EX65 = 2                CIG0012
RQ1648                         COMPUTE INGREAL99END020EX61 =            CIG0012
RQ1648                                 INGRESO99END020EX65  * 0.7041    CIG0012
RQ1648                      WHEN ACTIIND99END020EX65 = 3                CIG0012
RQ1648                         COMPUTE INGREAL99END020EX61 =            CIG0012
RQ1648                                 INGRESO99END020EX65  * 0.7387    CIG0012
RQ1648                      WHEN ACTIIND99END020EX65 = 4 OR 5           CIG0012
RQ1648                         COMPUTE INGREAL99END020EX61 =            CIG0012
RQ1648                                 INGRESO99END020EX65  * 0.7016    CIG0012
RQ1648                      WHEN ACTIIND99END020EX65 = 7                CIG0012
RQ1648                           COMPUTE INGREAL99END020EX61 =          CIG0012
RQ1648                                 INGRESO99END020EX65  * 0.7933    CIG0012
RQ1648                      WHEN ACTIIND99END020EX65 = 8                CIG0012
RQ1648                         COMPUTE INGREAL99END020EX61 =            CIG0012
RQ1648                                 INGRESO99END020EX65  * 1         CIG0012
RQ1648                   END-EVALUATE                                   CIG0012
RQ1648                ELSE                                              CIG0012
RQ1648                   IF INGRESO99END020EX65 <= 2400000              CIG0012
RQ1648                      EVALUATE TRUE                               CIG0012
RQ1648                         WHEN ACTIIND99END020EX65 = 1 OR 6        CIG0012
RQ1648                            COMPUTE INGREAL99END020EX61 =         CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.8    CIG0012
RQ1648                         WHEN ACTIIND99END020EX65 = 2             CIG0012
RQ1648                            COMPUTE INGREAL99END020EX61 =         CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.5595 CIG0012
RQ1648                         WHEN ACTIIND99END020EX65 = 3             CIG0012
RQ1648                            COMPUTE INGREAL99END020EX61 =         CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.6752 CIG0012
RQ1648                         WHEN ACTIIND99END020EX65 = 4 OR 5        CIG0012
RQ1648                            COMPUTE INGREAL99END020EX61 =         CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.6054 CIG0012
RQ1648                         WHEN ACTIIND99END020EX65 = 7             CIG0012
RQ1648                            COMPUTE INGREAL99END020EX61 =         CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.6874 CIG0012
RQ1648                         WHEN ACTIIND99END020EX65 = 8             CIG0012
RQ1648                            COMPUTE INGREAL99END020EX61 =         CIG0012
RQ1648                                    INGRESO99END020EX65  * 1      CIG0012
RQ1648                      END-EVALUATE                                CIG0012
RQ1648                   ELSE                                           CIG0012
RQ1648                      IF INGRESO99END020EX65 <= 6000000           CIG0012
RQ1648                         EVALUATE TRUE                            CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 1 OR 6     CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.8    CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 2          CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.5136 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 3          CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.6421 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 4 OR 5     CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.5550 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 7          CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.6048 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 8          CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                       INGRESO99END020EX65  * 1   CIG0012
RQ1648                         END-EVALUATE                             CIG0012
RQ1648                      ELSE     *> MAYORES A 6 MILLONES            CIG0012
RQ1648                         EVALUATE TRUE                            CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 1 OR 6     CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                       INGRESO99END020EX65  * 0.8 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 2          CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.4282 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 3          CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.5752 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 4 OR 5     CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.4815 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 7          CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                    INGRESO99END020EX65  * 0.4713 CIG0012
RQ1648                            WHEN ACTIIND99END020EX65 = 8          CIG0012
RQ1648                               COMPUTE INGREAL99END020EX61 =      CIG0012
RQ1648                                       INGRESO99END020EX65  * 1   CIG0012
RQ1648                         END-EVALUATE                             CIG0012
RQ1648                      END-IF                                      CIG0012
RQ1648                   END-IF                                         CIG0012
RQ1648                END-IF                                            CIG0012
RQ1648             WHEN  OTHER                                          CIG0012
RQ1648                COMPUTE INGREAL99END020EX61 =                     CIG0012
RQ1648                                        INGRESO99END020EX65 * 1   CIG0012
RQ1648          END-EVALUATE                                            CIG0012
RQ1648       END-IF                                                     CIG0012
AL1342       COMPUTE 99END020EX61  =  ((CUOTAS-99END020EX61 * 1000) /   EHA0009
AL1342               INGREAL99END020EX61) * 100                         EHA0009
CQ1343     END-IF.                                                      EHA0006                                                         
      *
       5320-ENDEUD-PROCES-CARDEC.        
           MOVE 1 TO I-CARDEC        
CQ1812     MOVE  0                     TO  SW-UNA-VEZ-MAESTRO           DLM0014
           PERFORM UNTIL I-CARDEC > 499 OR         
                         C-EST-ENDEUD-CARDEC(I-CARDEC) = SPACES        
              IF FINEND-CARDEC = 1        
                 MOVE ALL "$" TO VAL-VAR-CARDEC        
                 MOVE C-EST-ENDEUD-CARDEC(I-CARDEC) TO NOM-VAR-CARDEC        
              END-IF        
              EVALUATE C-EST-ENDEUD-CARDEC(I-CARDEC)        
                 WHEN "CD99END002TO00"        
                   IF FINEND-CARDEC = 0        
                      PERFORM 5320-99END002TO00-CARDEC        
                   ELSE
AL1342                IF 99END002TO00 = SPACES                          EHA0009
AL1342                   MOVE "T" TO 99END002TO00                       EHA0009
AL1342                END-IF                                            EHA0009
                      MOVE 99END002TO00      TO STR01-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF        
                 WHEN "CEND0DES"        
                   IF WS-FUTEND-SCODRU = 0        
                      MOVE BDIEMSUP-FECHA(1:6) TO WS-FUTEND-SCODRU         
                   END-IF        
                   IF FINEND-CARDEC = 0        
                      PERFORM 5400-PROCESE-REG-ENDEUD-SCODRU        
                   END-IF        
                 WHEN ANY         
CQ1812             MOVE  1             TO  ERR-EST-ENDEUD-CARDEC        DLM0014
              END-EVALUATE        
RQ2252        PERFORM  5000-CALCULAR-ENDEUD-PROG                        CIG0018
              ADD 1 TO I-CARDEC        
           END-PERFORM.        
CQ1812     IF  SW-UNA-VEZ-MAESTRO  =  1                                 DLM0014
CQ1812       MOVE  1                   TO  FINEND-CARDEC                DLM0014
CQ1812     END-IF.                                                      DLM0014
      *----------------------------------------------------------------*        
       5320-99END002TO00-CARDEC.        
      *----------------------------------------------------------------*        
      * VERIFICA EL ENDEUDAMIENTO Y CALIFICA        
           IF BDIEMSUP-IND-BLOQ IS NOT NUMERIC        
              MOVE 0      TO BDIEMSUP-IND-BLOQ        
           END-IF        
           IF BDIEMSUP-IND-BLOQ NOT = 1        
              MOVE ZEROS           TO IND-E        
              IF BDIEMSUP-FECHA > ZEROS        
                  PERFORM VARYING IND-E FROM 1 BY 1 UNTIL IND-E > 8        
                          IF BDIEMSUP-CALIFICA = TAB-END-COD(IND-E)        
                             IF BDIEMSUP-FECHA > W-FECHA-SUP        
                                MOVE BDIEMSUP-FECHA    TO W-FECHA-SUP        
                                MOVE BDIEMSUP-CALIFICA TO 99END002TO00        
                             END-IF        
                             IF BDIEMSUP-FECHA = W-FECHA-SUP        
                                IF BDIEMSUP-CALIFICA > 99END002TO00        
                                   MOVE BDIEMSUP-CALIFICA        
                                                       TO 99END002TO00        
                                END-IF        
                             END-IF        
                             ADD  7   TO  IND-E        
                          END-IF        
                  END-PERFORM        
              END-IF        
           END-IF.        
       5320-CEND0002-CARDEC.        
       5320-CEND0003-CARDEC.        
       5320-CEND0004-CARDEC.        
       5320-CEND0005-CARDEC.        
CQ1812*                                                                 DLM0014
       5320-CONSUL-PROCES-CARDEC.        
           MOVE 1 TO I-CARDEC        
CQ1812     MOVE  0                     TO  SW-UNA-VEZ-MAESTRO           DLM0014
           PERFORM UNTIL I-CARDEC > 499 OR         
                         C-EST-CONSUL-CARDEC(I-CARDEC) = SPACES        
              IF FINCON-CARDEC = 1        
                 MOVE ALL "$" TO VAL-VAR-CARDEC        
                 MOVE C-EST-CONSUL-CARDEC(I-CARDEC) TO NOM-VAR-CARDEC        
              END-IF        
              EVALUATE C-EST-CONSUL-CARDEC(I-CARDEC)        
                 WHEN "CD99INQ001EX36"        
                   IF FINCON-CARDEC = 0        
                      PERFORM 5320-99INQ001EX36-CARDEC        
                   ELSE        
                      MOVE 99INQ001EX36      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
                 WHEN "CD99INQ002TO00"        
                   IF FINCON-CARDEC = 0        
                      PERFORM 5320-99INQ002TO00-CARDEC        
                   ELSE        
                      MOVE 99INQ002TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                   END-IF
MOD734           WHEN "CD99INQ002TO01"                                  EHA0005
MOD734             IF FINCON-CARDEC = 0                                 EHA0005
MOD734                PERFORM 5320-99INQ002TO01-CARDEC                  EHA0005
MOD734             ELSE                                                 EHA0005
MOD734                MOVE 99INQ002TO01      TO VAL5-VAR-CARDEC         EHA0005
MOD734                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0005
MOD734             END-IF                                               EHA0005
MOD734           WHEN "CD99INQ002TO02"                                  EHA0005
MOD734             IF FINCON-CARDEC = 0                                 EHA0005
MOD734                PERFORM 5320-99INQ002TO02-CARDEC                  EHA0005
MOD734             ELSE                                                 EHA0005
MOD734                MOVE 99INQ002TO02      TO VAL5-VAR-CARDEC         EHA0005
MOD734                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0005
MOD734             END-IF                                               EHA0005
MOD734           WHEN "CD99INQ002TO03"                                  EHA0005
MOD734             IF FINCON-CARDEC = 0                                 EHA0005
MOD734                PERFORM 5320-99INQ002TO03-CARDEC                  EHA0005
MOD734             ELSE                                                 EHA0005
MOD734                MOVE 99INQ002TO03      TO VAL5-VAR-CARDEC         EHA0005
MOD734                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0005
MOD734             END-IF                                               EHA0005
MOD734           WHEN "CD99INQ002TO04"                                  EHA0005
MOD734             IF FINCON-CARDEC = 0                                 EHA0005
MOD734                PERFORM 5320-99INQ002TO04-CARDEC                  EHA0005
MOD734             ELSE                                                 EHA0005
MOD734                MOVE 99INQ002TO04      TO VAL5-VAR-CARDEC         EHA0005
MOD734                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0005
MOD734             END-IF                                               EHA0005
MD1033           WHEN "CD99INQ003EX58"                                  EHA0003
MD1033             IF FINCON-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99INQ003EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99INQ003EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033           WHEN "CD99INQ004EX58"                                  EHA0003
MD1033             IF FINCON-CARDEC = 0                                 EHA0003
MD1033                PERFORM 5320-99INQ004EX58-CARDEC                  EHA0003
MD1033             ELSE                                                 EHA0003
MD1033                MOVE 99INQ004EX58      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MD1033             END-IF                                               EHA0003
RQ1947           WHEN "CD99INQ005TO00"                                  CIG0019
RQ1947             IF FINCON-CARDEC = 0                                 CIG0019
RQ1947                PERFORM 5320-99INQ005TO00-CARDEC                  CIG0019
RQ1947             ELSE                                                 CIG0019
RQ1947                MOVE 99INQ005TO00      TO VAL5-VAR-CARDEC         CIG0019
RQ1947                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 CIG0019
RQ1947             END-IF                                               CIG0019
                 WHEN "CCON0DES"        
                   IF FINCON-CARDEC = 0        
                      PERFORM 5450-PROCESE-REG-CONSUL-SCODRU        
                   END-IF        
                 WHEN ANY         
CQ1812             MOVE  1             TO  ERR-EST-CONSUL-CARDEC        DLM0014
              END-EVALUATE        
RQ2252        PERFORM  5000-CALCULAR-CONSUL-PROG                        CIG0018
              ADD 1 TO I-CARDEC        
           END-PERFORM.        
CQ1812     IF  SW-UNA-VEZ-MAESTRO  =  1                                 DLM0014
CQ1812       MOVE  1                   TO  FINCON-CARDEC                DLM0014
CQ1812     END-IF.                                                      DLM0014
CQ1812*                                                                 DLM0014
       5320-99INQ001EX36-CARDEC.        
      *     INITIALIZE   LLAVE-INDEX        
      *                  TABLA-CONSULTAS-CARDEC        
      *     MOVE    1        TO  X-CARDEC        
      *     MOVE TIPIDE-CARDEC TO  TIP-ID-IND        
      *     MOVE NUMIDE-CARDEC TO  NUM-ID-IND        
      *     START INDEXADO KEY NOT < LLAVE-INDEX INVALID KEY        
      *           MOVE 9 TO TIP-ID-IND        
      *      NOT INVALID KEY        
      *          READ INDEXADO NEXT AT END        
      *               MOVE 9 TO TIP-ID-IND        
      *          END-READ        
      *     END-START        
      *     PERFORM UNTIL  TIP-ID-IND NOT = TIPIDE-CARDEC OR        
      *                    NUM-ID-IND NOT = NUMIDE-CARDEC        
                  MOVE COD-SUSCRIP-IND TO COD-SUSCRIP-ABD02        
                  READ SUSCRIPTOR  IGNORE LOCK  INVALID KEY        
                        MOVE 0 TO ESTADO-ABD02        
                  END-READ        
                  IF COD-TIPCTA-ABD02 = 02 OR 03 OR 05 OR 07        
                               OR 13 OR 14 OR 15 OR 17 OR 18        
                               OR 04 OR 45 OR 06 OR 08 OR 27        
                     IF COD-SUSCRIP-IND < 700000        
                        PERFORM 0080-ACUM-99INQ001EX36-CARDEC        
                     END-IF        
                  END-IF.
      *            READ INDEXADO NEXT AT END        
      *                 MOVE 9 TO TIP-ID-IND        
      *            END-READ        
      *      END-PERFORM. 
      
CARDEC*----------------------------------------------------------------*
CARDEC 5320-99INQ002TO00-CARDEC.
CARDEC* ACUMULA LAS CONSULTAS DE LOS ULTIMOS DOS MESES
CARDEC*----------------------------------------------------------------*
CARDEC      IF  RAZCON-IND  NOT =  22
CARDEC      AND RAZCON-IND  NOT =  23
CARDEC         MOVE  COD-SUSCRIP-IND    TO  COD-SUSCRIP-ABD02
CARDEC         READ SUSCRIPTOR WITH IGNORE LOCK
CARDEC            INVALID KEY
CARDEC               MOVE 0             TO  NIT-SUSCRIP-S-ABD02
CARDEC         END-READ
CARDEC         MOVE  FUNCTION CURRENT-DATE
CARDEC                                  TO  W-FECHA-HOY
CARDEC         MOVE  FEC-CONSUL-IND(5:2) TO W-FMILENIO-ANIO
CARDEC         MOVE  FEC-CONSUL-IND(3:2) TO W-FMILENIO-MES
CARDEC         MOVE  FEC-CONSUL-IND(1:2) TO W-FMILENIO-DIA
CARDEC         IF  W-FMILENIO-ANIO  <  50
CARDEC           MOVE  20               TO  W-FMILENIO-SIGLO
CARDEC         ELSE
CARDEC           MOVE  19               TO  W-FMILENIO-SIGLO
CARDEC         END-IF
CARDEC         COMPUTE  WS-NRO-DIAS-CARDEC    =
CARDEC               (((W-ANIO-HOY * 360) + (W-MES-HOY * 30)   +
CARDEC                  W-DIA-HOY)  -
CARDEC                ((W-FMILENIO-SSAA * 360) + (W-FMILENIO-MES * 30)  
CARDEC                  + W-FMILENIO-DIA))
CARDEC         IF  WS-NRO-DIAS-CARDEC  <=  60
CARDEC         AND COD-SUSCRIP-IND  <  800000
CARDEC           ADD   1                TO  99INQ002TO00
CARDEC         END-IF
CARDEC      END-IF.
CARDEC*
MOD734*----------------------------------------------------------------*EHA0005
MOD734 5320-99INQ002TO01-CARDEC.                                        EHA0005
MOD734* ACUMULA LAS CONSULTAS DE LOS ULTIMOS DOS MESES SECTOR FINANCIEROEHA0005
MOD734*----------------------------------------------------------------*EHA0005
MOD734      IF  RAZCON-IND  NOT =  22                                   EHA0005
MOD734      AND RAZCON-IND  NOT =  23                                   EHA0005
MOD734         MOVE  COD-SUSCRIP-IND    TO  COD-SUSCRIP-ABD02           EHA0005
MOD734         READ SUSCRIPTOR WITH IGNORE LOCK                         EHA0005
MOD734            INVALID KEY                                           EHA0005
MOD734               MOVE 0             TO  NIT-SUSCRIP-S-ABD02         EHA0005
MOD734         END-READ                                                 EHA0005
MOD734         MOVE  FUNCTION CURRENT-DATE                              EHA0005
MOD734                                  TO  W-FECHA-HOY                 EHA0005
MOD734         MOVE  FEC-CONSUL-IND(5:2) TO W-FMILENIO-ANIO             EHA0005
MOD734         MOVE  FEC-CONSUL-IND(3:2) TO W-FMILENIO-MES              EHA0005
MOD734         MOVE  FEC-CONSUL-IND(1:2) TO W-FMILENIO-DIA              EHA0005
MOD734         IF  W-FMILENIO-ANIO  <  50                               EHA0005
MOD734           MOVE  20               TO  W-FMILENIO-SIGLO            EHA0005
MOD734         ELSE                                                     EHA0005
MOD734           MOVE  19               TO  W-FMILENIO-SIGLO            EHA0005
MOD734         END-IF                                                   EHA0005
MOD734         COMPUTE  WS-NRO-DIAS-CARDEC    =                         EHA0005
MOD734               (((W-ANIO-HOY * 360) + (W-MES-HOY * 30)   +        EHA0005
MOD734                  W-DIA-HOY)  -                                   EHA0005
MOD734                ((W-FMILENIO-SSAA * 360) + (W-FMILENIO-MES * 30)  EHA0005
MOD734                  + W-FMILENIO-DIA))                              EHA0005
MOD734         IF  WS-NRO-DIAS-CARDEC  <=  60                           EHA0005
MOD734         AND COD-SUSCRIP-IND  <  800000                           EHA0005
MOD734             IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 1             EHA0005
MOD734                ADD   1                TO  99INQ002TO01           EHA0005
MOD734             END-IF                                               EHA0005
MOD734         END-IF                                                   EHA0005
MOD734      END-IF.                                                     EHA0005
MOD734*                                                                 EHA0005
MOD734*----------------------------------------------------------------*EHA0005
MOD734 5320-99INQ002TO02-CARDEC.                                        EHA0005
MOD734* ACUMULA LAS CONSULTAS DE LOS ULTIMOS DOS MESES SECTOR REAL      EHA0005
MOD734*----------------------------------------------------------------*EHA0005
MOD734      IF  RAZCON-IND  NOT =  22                                   EHA0005
MOD734      AND RAZCON-IND  NOT =  23                                   EHA0005
MOD734         MOVE  COD-SUSCRIP-IND    TO  COD-SUSCRIP-ABD02           EHA0005
MOD734         READ SUSCRIPTOR WITH IGNORE LOCK                         EHA0005
MOD734            INVALID KEY                                           EHA0005
MOD734               MOVE 0             TO  NIT-SUSCRIP-S-ABD02         EHA0005
MOD734         END-READ                                                 EHA0005
MOD734         MOVE  FUNCTION CURRENT-DATE                              EHA0005
MOD734                                  TO  W-FECHA-HOY                 EHA0005
MOD734         MOVE  FEC-CONSUL-IND(5:2) TO W-FMILENIO-ANIO             EHA0005
MOD734         MOVE  FEC-CONSUL-IND(3:2) TO W-FMILENIO-MES              EHA0005
MOD734         MOVE  FEC-CONSUL-IND(1:2) TO W-FMILENIO-DIA              EHA0005
MOD734         IF  W-FMILENIO-ANIO  <  50                               EHA0005
MOD734           MOVE  20               TO  W-FMILENIO-SIGLO            EHA0005
MOD734         ELSE                                                     EHA0005
MOD734           MOVE  19               TO  W-FMILENIO-SIGLO            EHA0005
MOD734         END-IF                                                   EHA0005
MOD734         COMPUTE  WS-NRO-DIAS-CARDEC    =                         EHA0005
MOD734               (((W-ANIO-HOY * 360) + (W-MES-HOY * 30)   +        EHA0005
MOD734                  W-DIA-HOY)  -                                   EHA0005
MOD734                ((W-FMILENIO-SSAA * 360) + (W-FMILENIO-MES * 30)  EHA0005
MOD734                  + W-FMILENIO-DIA))                              EHA0005
MOD734         IF  WS-NRO-DIAS-CARDEC  <=  60                           EHA0005
MOD734         AND COD-SUSCRIP-IND  <  800000                           EHA0005
MOD734             IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 2 AND         EHA0005
MOD734                COD-CTA-ABD07 NOT = 23 AND                        EHA0005
MOD734                COD-CTA-ABD07 NOT = 24                            EHA0005
MOD734                ADD   1                TO  99INQ002TO02           EHA0005
MOD734             END-IF                                               EHA0005
MOD734         END-IF                                                   EHA0005
MOD734      END-IF.                                                     EHA0005
MOD734*                                                                 EHA0005
MOD734*----------------------------------------------------------------*EHA0005
MOD734 5320-99INQ002TO03-CARDEC.                                        EHA0005
MOD734* ACUMULA LAS CONSULTAS DE LOS ULTIMOS DOS MESES SECTOR COOPERATI EHA0005
MOD734*----------------------------------------------------------------*EHA0005
MOD734      IF  RAZCON-IND  NOT =  22                                   EHA0005
MOD734      AND RAZCON-IND  NOT =  23                                   EHA0005
MOD734         MOVE  COD-SUSCRIP-IND    TO  COD-SUSCRIP-ABD02           EHA0005
MOD734         READ SUSCRIPTOR WITH IGNORE LOCK                         EHA0005
MOD734            INVALID KEY                                           EHA0005
MOD734               MOVE 0             TO  NIT-SUSCRIP-S-ABD02         EHA0005
MOD734         END-READ                                                 EHA0005
MOD734         MOVE  FUNCTION CURRENT-DATE                              EHA0005
MOD734                                  TO  W-FECHA-HOY                 EHA0005
MOD734         MOVE  FEC-CONSUL-IND(5:2) TO W-FMILENIO-ANIO             EHA0005
MOD734         MOVE  FEC-CONSUL-IND(3:2) TO W-FMILENIO-MES              EHA0005
MOD734         MOVE  FEC-CONSUL-IND(1:2) TO W-FMILENIO-DIA              EHA0005
MOD734         IF  W-FMILENIO-ANIO  <  50                               EHA0005
MOD734           MOVE  20               TO  W-FMILENIO-SIGLO            EHA0005
MOD734         ELSE                                                     EHA0005
MOD734           MOVE  19               TO  W-FMILENIO-SIGLO            EHA0005
MOD734         END-IF                                                   EHA0005
MOD734         COMPUTE  WS-NRO-DIAS-CARDEC    =                         EHA0005
MOD734               (((W-ANIO-HOY * 360) + (W-MES-HOY * 30)   +        EHA0005
MOD734                  W-DIA-HOY)  -                                   EHA0005
MOD734                ((W-FMILENIO-SSAA * 360) + (W-FMILENIO-MES * 30)  EHA0005
MOD734                  + W-FMILENIO-DIA))                              EHA0005
MOD734         IF  WS-NRO-DIAS-CARDEC  <=  60                           EHA0005
MOD734         AND COD-SUSCRIP-IND  <  800000                           EHA0005
MOD734             IF IND-SECTOR-CARTERA(COD-CTA-ABD07) = 3             EHA0005
MOD734                ADD   1                TO  99INQ002TO03           EHA0005
MOD734             END-IF                                               EHA0005
MOD734         END-IF                                                   EHA0005
MOD734      END-IF.                                                     EHA0005
MOD734*                                                                 EHA0005
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947 5320-99INQ005TO00-CARDEC.                                        CIG0019
RQ1947*----------------------------------------------------------------*CIG0019
RQ1947      IF  RAZCON-IND  NOT =  22                                   CIG0019
RQ1947      AND RAZCON-IND  NOT =  23                                   CIG0019
RQ1947         MOVE  COD-SUSCRIP-IND    TO  COD-SUSCRIP-ABD02           CIG0019
RQ1947         READ SUSCRIPTOR WITH IGNORE LOCK                         CIG0019
RQ1947            INVALID KEY                                           CIG0019
RQ1947               MOVE 0             TO  NIT-SUSCRIP-S-ABD02         CIG0019
RQ1947         END-READ                                                 CIG0019
RQ1947         MOVE  FUNCTION CURRENT-DATE                              CIG0019
RQ1947                                   TO  W-FECHA-HOY                CIG0019
RQ1947         MOVE  FEC-CONSUL-IND(5:2) TO W-FMILENIO-ANIO             CIG0019
RQ1947         MOVE  FEC-CONSUL-IND(3:2) TO W-FMILENIO-MES              CIG0019
RQ1947         MOVE  FEC-CONSUL-IND(1:2) TO W-FMILENIO-DIA              CIG0019
RQ1947         IF  W-FMILENIO-ANIO  <  50                               CIG0019
RQ1947           MOVE  20               TO  W-FMILENIO-SIGLO            CIG0019
RQ1947         ELSE                                                     CIG0019
RQ1947           MOVE  19               TO  W-FMILENIO-SIGLO            CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947         COMPUTE  WS-NRO-DIAS-CARDEC    =                         CIG0019
RQ1947               (((W-ANIO-HOY * 360) + (W-MES-HOY * 30)   +        CIG0019
RQ1947                  W-DIA-HOY)  -                                   CIG0019
RQ1947                ((W-FMILENIO-SSAA * 360) + (W-FMILENIO-MES * 30)  CIG0019
RQ1947                  + W-FMILENIO-DIA))                              CIG0019
RQ1947         IF  WS-NRO-DIAS-CARDEC  <=  90                           CIG0019
RQ1947         AND COD-SUSCRIP-IND  <  800000                           CIG0019
RQ1947           ADD   1                TO  99INQ005TO00                CIG0019
RQ1947         END-IF                                                   CIG0019
RQ1947      END-IF                                                      CIG0019
RQ1947      .                                                           CIG0019
MOD734*----------------------------------------------------------------*EHA0005
MOD734 5320-99INQ002TO04-CARDEC.                                        EHA0005
MOD734* ACUMULA LAS CONSULTAS DE LOS ULTIMOS DOS MESES SECTOR TELCOS    EHA0005
MOD734*----------------------------------------------------------------*EHA0005
MOD734      IF  RAZCON-IND  NOT =  22                                   EHA0005
MOD734      AND RAZCON-IND  NOT =  23                                   EHA0005
MOD734         MOVE  COD-SUSCRIP-IND    TO  COD-SUSCRIP-ABD02           EHA0005
MOD734         READ SUSCRIPTOR WITH IGNORE LOCK                         EHA0005
MOD734            INVALID KEY                                           EHA0005
MOD734               MOVE 0             TO  NIT-SUSCRIP-S-ABD02         EHA0005
MOD734         END-READ                                                 EHA0005
MOD734         MOVE  FUNCTION CURRENT-DATE                              EHA0005
MOD734                                  TO  W-FECHA-HOY                 EHA0005
MOD734         MOVE  FEC-CONSUL-IND(5:2) TO W-FMILENIO-ANIO             EHA0005
MOD734         MOVE  FEC-CONSUL-IND(3:2) TO W-FMILENIO-MES              EHA0005
MOD734         MOVE  FEC-CONSUL-IND(1:2) TO W-FMILENIO-DIA              EHA0005
MOD734         IF  W-FMILENIO-ANIO  <  50                               EHA0005
MOD734           MOVE  20               TO  W-FMILENIO-SIGLO            EHA0005
MOD734         ELSE                                                     EHA0005
MOD734           MOVE  19               TO  W-FMILENIO-SIGLO            EHA0005
MOD734         END-IF                                                   EHA0005
MOD734         COMPUTE  WS-NRO-DIAS-CARDEC    =                         EHA0005
MOD734               (((W-ANIO-HOY * 360) + (W-MES-HOY * 30)   +        EHA0005
MOD734                  W-DIA-HOY)  -                                   EHA0005
MOD734                ((W-FMILENIO-SSAA * 360) + (W-FMILENIO-MES * 30)  EHA0005
MOD734                  + W-FMILENIO-DIA))                              EHA0005
MOD734         IF  WS-NRO-DIAS-CARDEC  <=  60                           EHA0005
MOD734         AND COD-SUSCRIP-IND  <  800000                           EHA0005
MOD734             IF COD-CTA-ABD07 = 23 OR                             EHA0005
MOD734                COD-CTA-ABD07 = 24                                EHA0005
MOD734                ADD   1                TO  99INQ002TO04           EHA0005
MOD734             END-IF                                               EHA0005
MOD734         END-IF                                                   EHA0005
MOD734      END-IF.                                                     EHA0005
MOD734*                                                                 EHA0005
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99INQ003EX58-CARDEC.                                        EHA0003
MD1033* ACUMULA LAS CONSULTAS DE CAJASAN ULTIMO MES                     EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033      IF  RAZCON-IND  NOT =  22                                   EHA0003
MD1033      AND RAZCON-IND  NOT =  23                                   EHA0003
MD1033         MOVE  FUNCTION CURRENT-DATE                              EHA0003
MD1033                                  TO  W-FECHA-HOY                 EHA0003
MD1033         MOVE  FEC-CONSUL-IND(5:2) TO W-FMILENIO-ANIO             EHA0003
MD1033         MOVE  FEC-CONSUL-IND(3:2) TO W-FMILENIO-MES              EHA0003
MD1033         MOVE  FEC-CONSUL-IND(1:2) TO W-FMILENIO-DIA              EHA0003
MD1033         IF  W-FMILENIO-ANIO  <  50                               EHA0003
MD1033           MOVE  20               TO  W-FMILENIO-SIGLO            EHA0003
MD1033         ELSE                                                     EHA0003
MD1033           MOVE  19               TO  W-FMILENIO-SIGLO            EHA0003
MD1033         END-IF                                                   EHA0003
MD1033         COMPUTE  WS-NRO-DIAS-CARDEC    =                         EHA0003
MD1033               (((W-ANIO-HOY * 360) + (W-MES-HOY * 30)   +        EHA0003
MD1033                  W-DIA-HOY)  -                                   EHA0003
MD1033                ((W-FMILENIO-SSAA * 360) + (W-FMILENIO-MES * 30)  EHA0003
MD1033                  + W-FMILENIO-DIA))                              EHA0003
MD1033* cuenta consultas en ultimos 30 dias de cajasan                  EHA0003
MD1033         IF  WS-NRO-DIAS-CARDEC  <=  30                           EHA0003
MD1033             MOVE  COD-SUSCRIP-IND    TO  COD-SUSCRIP-ABD02       EHA0003
MD1033             READ SUSCRIPTOR WITH IGNORE LOCK                     EHA0003
MD1033             INVALID KEY                                          EHA0003
MD1033                MOVE 0             TO  NIT-SUSCRIP-S-ABD02        EHA0003
MD1033             END-READ                                             EHA0003
MD1033             IF NIT-SUSCRIP-S-ABD02 = 00890200106 *> nit cajasan  EHA0003
MD1033                ADD   1          TO  99INQ003EX58                 EHA0003
MD1033             END-IF                                               EHA0003
MD1033         END-IF                                                   EHA0003
MD1033      END-IF.                                                     EHA0003
MD1033*                                                                 EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033 5320-99INQ004EX58-CARDEC.                                        EHA0003
MD1033* ACUMULA LAS CONSULTAS DE CAJASAN ULTIMO MES                     EHA0003
MD1033*----------------------------------------------------------------*EHA0003
MD1033      IF  RAZCON-IND  NOT =  22                                   EHA0003
MD1033      AND RAZCON-IND  NOT =  23                                   EHA0003
MD1033         MOVE  FUNCTION CURRENT-DATE                              EHA0003
MD1033                                  TO  W-FECHA-HOY                 EHA0003
MD1033         MOVE  FEC-CONSUL-IND(5:2) TO W-FMILENIO-ANIO             EHA0003
MD1033         MOVE  FEC-CONSUL-IND(3:2) TO W-FMILENIO-MES              EHA0003
MD1033         MOVE  FEC-CONSUL-IND(1:2) TO W-FMILENIO-DIA              EHA0003
MD1033         IF  W-FMILENIO-ANIO  <  50                               EHA0003
MD1033           MOVE  20               TO  W-FMILENIO-SIGLO            EHA0003
MD1033         ELSE                                                     EHA0003
MD1033           MOVE  19               TO  W-FMILENIO-SIGLO            EHA0003
MD1033         END-IF                                                   EHA0003
MD1033         COMPUTE  WS-NRO-DIAS-CARDEC    =                         EHA0003
MD1033               (((W-ANIO-HOY * 360) + (W-MES-HOY * 30)   +        EHA0003
MD1033                  W-DIA-HOY)  -                                   EHA0003
MD1033                ((W-FMILENIO-SSAA * 360) + (W-FMILENIO-MES * 30)  EHA0003
MD1033                  + W-FMILENIO-DIA))                              EHA0003
MD1033* consultas ultimos 90 dias entidades diferentes a cajasan        EHA0003
MD1033          IF  WS-NRO-DIAS-CARDEC  <=  90                          EHA0003
MD1033              MOVE  COD-SUSCRIP-IND    TO  W-SUSCRIPTOR           EHA0003
MD1033                                           COD-SUSCRIP-ABD02      EHA0003
MD1033              READ SUSCRIPTOR WITH IGNORE LOCK                    EHA0003
MD1033              INVALID KEY                                         EHA0003
MD1033                 MOVE 0             TO  NIT-SUSCRIP-S-ABD02       EHA0003
MD1033              END-READ                                            EHA0003
MD1033              IF NIT-SUSCRIP-S-ABD02 <> 00890200106 AND *>cajasan EHA0003
MD1033                 NIT-SUSCRIP-S-ABD02 <> ZEROS                     EHA0003
MD1033                 ADD   1          TO  99INQ004EX58                EHA0003
MD1033              END-IF                                              EHA0003
MD1033          END-IF                                                  EHA0003
MD1033                                                                  EHA0003
MD1033      END-IF.                                                     EHA0003
MD1033*                                                                 EHA0003
       5320-CCON0002-CARDEC.        
       5320-CCON0003-CARDEC.        
       5320-CCON0004-CARDEC.        
       5320-CCON0005-CARDEC.        
       5320-NATURAL-PROCES-CARDEC.        
           MOVE 1 TO I-CARDEC        
           PERFORM UNTIL I-CARDEC > 499 OR         
                         C-EST-IDENTI-CARDEC(I-CARDEC) = SPACES        
              MOVE ALL "$" TO VAL-VAR-CARDEC        
              MOVE C-EST-IDENTI-CARDEC(I-CARDEC) TO NOM-VAR-CARDEC        
              EVALUATE C-EST-IDENTI-CARDEC(I-CARDEC)        
                 WHEN "CD99DEM001TO00"        
                      PERFORM 5320-99DEM001TO00-CARDEC        
                      MOVE 99DEM001TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
                 WHEN "CD99DEM004TO00"        
                      PERFORM 5320-99DEM004TO00-CARDEC        
                      MOVE 99DEM004TO00      TO VAL5-VAR-CARDEC        
                      PERFORM 5400-ARMAR-BOM-CAR-CARDEC        
MD1033           WHEN "CD99DEM005TO00"                                  EHA0003
MD1033                PERFORM 5320-99DEM005TO00-CARDEC                  EHA0003
MD1033                MOVE 99DEM005TO00      TO VAL5-VAR-CARDEC         EHA0003
MD1033                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0003
MOD734           WHEN "CD99DEM006TO00"                                  EHA0005
MOD734                PERFORM 5320-99DEM006TO00-CARDEC                  EHA0005
MOD734                MOVE 99DEM006TO00      TO VAL10-VAR-CARDEC        EHA0005
MOD734                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 EHA0005
CQ1342           WHEN "CD99DEM009TO00"                                  DLM0007
CQ1342                PERFORM 5320-99DEM009TO00-CARDEC                  DLM0007
CQ1342                MOVE 99DEM009TO00      TO VAL10-VAR-CARDEC        DLM0007
CQ1342                PERFORM 5400-ARMAR-BOM-CAR-CARDEC                 DLM0007
                 WHEN ANY         
CQ1812             MOVE  1             TO  ERR-EST-IDENTI-CARDEC        DLM0014
              END-EVALUATE        
RQ2252        PERFORM  5000-CALCULAR-IDENTI-PROG                        CIG0018
              ADD 1 TO I-CARDEC        
           END-PERFORM.        
      *----------------------------------------------------------------*        
       5320-99DEM001TO00-CARDEC.        
      *----------------------------------------------------------------*        
           MOVE ESTADO-VIG-BDIIREGI TO 99DEM001TO00.        
      *----------------------------------------------------------------*        
       5320-99DEM004TO00-CARDEC.        
      *----------------------------------------------------------------*        
           MOVE  ZEROS                 TO  99DEM004TO00        
           IF FECHA-EXPEDI-BDIIREGI <> ZEROS        
              MOVE  FECHA-EXPEDI-BDIIREGI TO  W-FECHA-MILENIO        
              IF  W-FMILENIO-SSAA  >=  1975                                     
                COMPUTE 99DEM004TO00 =                                         
                  ((W-ANIO-HOY - W-FMILENIO-SSAA) + 18)                         
              ELSE                                                              
                 COMPUTE 99DEM004TO00 =                                        
                  ((W-ANIO-HOY - W-FMILENIO-SSAA) + 21)                         
              END-IF
           END-IF.
      *----------------------------------------------------------------*        
       5320-99DEM005TO00-CARDEC.        
      *----------------------------------------------------------------*
RQ1947     INITIALIZE LLAVE-BDIIALE                                     CIG0019
RQ1947     MOVE TIPIDE-CARDEC    TO TIP-IDE-BDIIALE                     CIG0019
RQ1947     MOVE NUMIDE-CARDEC    TO NUM-IDE-BDIIALE                     CIG0019
           MOVE ZEROS          TO FUENTE-BDIIALE
           MOVE SPACES         TO LLASEC-BDIIALE
           MOVE 0              TO FIN-BDIIALE.
           START BDIIALE KEY > LLAVE-BDIIALE INVALID KEY
                 MOVE 1 TO FIN-BDIIALE
            NOT INVALID KEY
                 READ BDIIALE  NEXT RECORD AT END
                      MOVE 1 TO FIN-BDIIALE
                 END-READ
           END-START
RQ1947     PERFORM UNTIL  NUM-IDE-BDIIALE NOT = NUMIDE-CARDEC OR        CIG0019
RQ1947                    TIP-IDE-BDIIALE NOT = TIPIDE-CARDEC OR        CIG0019
                          FIN-BDIIALE = 1
                   MOVE  FUNCTION CURRENT-DATE TO  W-FECHA-HOY
                   IF FEC-VEN-BDIIALE NOT  < W-FECHA-HOY
                      IF COD-ALERTA-BDIIALE = 01
                         ADD 1 TO 99DEM005TO00
                      END-IF
                   END-IF
                   READ BDIIALE NEXT RECORD AT END
                        MOVE 1 TO FIN-BDIIALE
                   END-READ
           END-PERFORM.
MOD734*----------------------------------------------------------------*EHA0005
MOD734 5320-99DEM006TO00-CARDEC.                                        EHA0005
MOD734*----------------------------------------------------------------*EHA0005
MOD734     MOVE  ZEROS                 TO  99DEM006TO00                 EHA0005
MOD734     IF FECHA-EXPEDI-BDIIREGI <> ZEROS                            EHA0005
MOD734        MOVE  FECHA-EXPEDI-BDIIREGI TO  99DEM006TO00              EHA0005
MOD734     END-IF.                                                      EHA0005
CQ1342*----------------------------------------------------------------*DLM0007
CQ1342 5320-99DEM009TO00-CARDEC.                                        DLM0007
CQ1342*----------------------------------------------------------------*DLM0007
CQ1342     MOVE  ZEROS                  TO  99DEM009TO00                DLM0007
CQ1342     MOVE  W-SALARIO-99DEM006TO00 TO  99DEM009TO00.               DLM0007
      *        
       5320-NIT-PROCES-CARDEC.        
       5320-EXTRANJERO-PROCES-CARDEC.        
       5320-NOHAYIDE-PROCES-CARDEC.        
       5400-ARMAR-BOM-CAR-CARDEC.        
           STRING BOM-CAR-CARDEC         DELIMITED BY "           "        
                  "["        
                  NOM-VAR-CARDEC         DELIMITED BY "    "        
                  "="        
                  VAL-VAR-CARDEC         DELIMITED BY "$$$$$$$$$$"        
                  "]"        
           INTO   BOM-CAR-CARDEC.        
      *----------------------------------------------------------------*        
       0080-ACUM-99INQ001EX36-CARDEC.        
            IF X-CARDEC = 1        
               MOVE NIT-SUSCRIP-S-ABD02 TO        
                                        W-NIT-SUS-CONS-CARDEC(X-CARDEC)        
               ADD    1           TO   X-CARDEC        
               MOVE   X-CARDEC    TO   TOPE-CONS-CARDEC        
               MOVE   1           TO   99INQ001EX36        
            ELSE        
               PERFORM VARYING X-CARDEC FROM 1 BY 1 UNTIL        
                               X-CARDEC > TOPE-CONS-CARDEC        
                    IF NIT-SUSCRIP-S-ABD02 =        
                                        W-NIT-SUS-CONS-CARDEC(X-CARDEC)        
                       MOVE  49 TO  X-CARDEC        
                    ELSE        
                       IF W-NIT-SUS-CONS-CARDEC(X-CARDEC) = ZEROS        
                          MOVE NIT-SUSCRIP-S-ABD02 TO        
                                        W-NIT-SUS-CONS-CARDEC(X-CARDEC)        
                          ADD    1    TO   99INQ001EX36        
                          ADD    1    TO   X-CARDEC        
                          MOVE   X-CARDEC    TO   TOPE-CONS-CARDEC        
                          MOVE   49   TO   X-CARDEC        
                       END-IF        
                    END-IF        
               END-PERFORM        
            END-IF.        
