      * MODESTJUR,PROC,v,01.0005
      ******************************************************************
      * PROCEDIMIENTO PARA CALCULAR MODELO DE PERSONAS JURIDICAS.      *
      * - 2009-06-01,                                                  *
      ******************************************************************
      * DLM0002    | MOESJU * IMPLEMENTACION DEL MODELO PARA PERSONAS  *
      * DARIO LASSO|   JURIDICAS. COMENZO CON EL 215 Y SE REVERSO.     *
      * 05-JUN-2009|   REQ. 239.                                       *
      ******************************************************************
      * DLM0003    | INICIA * INICIALIZACION DE VARIABLES PARA CALIFI- *
      * DARIO LASSO|   CACIONES.                                       *
      * 08-JUL-2009|   REQ. 80526.                                     *
      ******************************************************************
      * DLM0004    | MODIF1 * RECLASIFICACION NODO 14 Y 24 DE "L" A "K"*
      * DARIO LASSO| Y MODELO ESTADISTICO CON AMNISTIA.                *
      * 31-AGO-2009| REQ. 270.                                         *
      ******************************************************************
      * DLM0005    | CQ1781 * MODIFICACIONES AL MODELO DE PERSONAS     *
      * DARIO LASSO|   JURIDICAS.                                      *
      * 20-ABR-2011|   RQ. CQ 1781.                                    *
      *----------------------------------------------------------------*
      * CIG0005    | MODCAR - MODIFICACIONES AL CALCULO DE CARACTERIS- *
      * C. GAONA   |          TICAS UTILIZANDO UN ARCHIVO INDEXADO.    *
      * 02-04-2011 |                                                   *        
      ******************************************************************
       1500-CARACTERISTICAS-HIBRIDAS.
            IF  FUNCTION NUMVAL(01ACP003RO)  <  0
              MOVE  0                  TO  A-01ACP003RO
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP003RO) TO  A-01ACP003RO
            END-IF

            IF  FUNCTION NUMVAL(01ACP003IN)  <  0
              MOVE  0                  TO  A-01ACP003IN
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP003IN) TO  A-01ACP003IN
            END-IF

            IF  FUNCTION NUMVAL(01ACP003OT)  <  0
              MOVE  0                  TO  A-01ACP003OT
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP003OT) TO  A-01ACP003OT
            END-IF

            IF  FUNCTION NUMVAL(01ACP003VE)  <  0
              MOVE  0                  TO  A-01ACP003VE
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP003VE) TO  A-01ACP003VE
            END-IF

            IF  FUNCTION NUMVAL(01ACP003CC)  <  0
              MOVE  0                  TO  A-01ACP003CC
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP003CC) TO  A-01ACP003CC
            END-IF

            IF  FUNCTION NUMVAL(01ACP003CO)  <  0
              MOVE  0                  TO  A-01ACP003CO
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP003CO) TO  A-01ACP003CO
            END-IF

            IF  FUNCTION NUMVAL(01ACP003HP)  <  0
              MOVE  0                  TO  A-01ACP003HP
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP003HP) TO  A-01ACP003HP
            END-IF

            COMPUTE  OPEN12  =  A-01ACP003RO + A-01ACP003IN +
                 A-01ACP003OT + A-01ACP003VE + A-01ACP003CO +
                 A-01ACP003CC + A-01ACP003HP

            IF  FUNCTION NUMVAL(01ACP007RO)  <  0
              MOVE  0                  TO  A-01ACP007RO
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP007RO) TO  A-01ACP007RO
            END-IF

            IF  FUNCTION NUMVAL(01ACP007IN)  <  0
              MOVE  0                  TO  A-01ACP007IN
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP007IN) TO  A-01ACP007IN
            END-IF

            IF  FUNCTION NUMVAL(01ACP007OT)  <  0
              MOVE  0                  TO  A-01ACP007OT
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP007OT) TO  A-01ACP007OT
            END-IF

            IF  FUNCTION NUMVAL(01ACP007VE)  <  0
              MOVE  0                  TO  A-01ACP007VE
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP007VE) TO  A-01ACP007VE
            END-IF

            IF  FUNCTION NUMVAL(01ACP007CC)  <  0
              MOVE  0                  TO  A-01ACP007CC
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP007CC) TO  A-01ACP007CC
            END-IF

            IF  FUNCTION NUMVAL(01ACP007CO)  <  0
              MOVE  0                  TO  A-01ACP007CO
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP007CO) TO  A-01ACP007CO
            END-IF

            IF  FUNCTION NUMVAL(01ACP007HP)  <  0
              MOVE  0                  TO  A-01ACP007HP
            ELSE
              MOVE  FUNCTION NUMVAL(01ACP007HP) TO  A-01ACP007HP
            END-IF

            COMPUTE  OPEN48  =   A-01ACP007RO + A-01ACP007IN +
                  A-01ACP007OT + A-01ACP007VE + A-01ACP007CO +
                  A-01ACP007CC + A-01ACP007HP

            IF  FUNCTION NUMVAL(01EXP011RO)  <  0
              MOVE  0                  TO  A-01EXP011RO
            ELSE
              MOVE  FUNCTION NUMVAL(01EXP011RO) TO  A-01EXP011RO
            END-IF

            IF  FUNCTION NUMVAL(01EXP011IN)  <  0
              MOVE  0                  TO  A-01EXP011IN
            ELSE
              MOVE  FUNCTION NUMVAL(01EXP011IN) TO  A-01EXP011IN
            END-IF


            IF  FUNCTION NUMVAL(01EXP011OT)  <  0
              MOVE  0                  TO  A-01EXP011OT
            ELSE
              MOVE  FUNCTION NUMVAL(01EXP011OT) TO  A-01EXP011OT
            END-IF

            IF  FUNCTION NUMVAL(01EXP011VE)  <  0
              MOVE  0                  TO  A-01EXP011VE
            ELSE
              MOVE  FUNCTION NUMVAL(01EXP011VE) TO  A-01EXP011VE
            END-IF

            IF  FUNCTION NUMVAL(01EXP011CC)  <  0
              MOVE  0                  TO  A-01EXP011CC
            ELSE
              MOVE  FUNCTION NUMVAL(01EXP011CC) TO  A-01EXP011CC
            END-IF

            IF  FUNCTION NUMVAL(01EXP011CO)  <  0
              MOVE  0                  TO  A-01EXP011CO
            ELSE
              MOVE  FUNCTION NUMVAL(01EXP011CO) TO  A-01EXP011CO
            END-IF

            IF  FUNCTION NUMVAL(01EXP011HP)  <  0
              MOVE  0                  TO  A-01EXP011HP
            ELSE
              MOVE  FUNCTION NUMVAL(01EXP011HP) TO  A-01EXP011HP
            END-IF

MOESJU*     COMPUTE  MOB48  =  A-01EXP011RO + A-01EXP011IN +            DLM0002
MOESJU*              A-01EXP011OT + A-01EXP011VE + A-01EXP011CC +       DLM0002
MOESJU*              A-01EXP011CO + A-01EXP011HP                        DLM0002
MOESJU      MOVE FUNCTION NUMVAL(01EXP013RO) TO  A-01EXP013RO           DLM0002
MOESJU      MOVE FUNCTION NUMVAL(01EXP013IN) TO  A-01EXP013IN           DLM0002
MOESJU      MOVE FUNCTION NUMVAL(01EXP013OT) TO  A-01EXP013OT           DLM0002
MOESJU      MOVE FUNCTION NUMVAL(01EXP013VE) TO  A-01EXP013VE           DLM0002
MOESJU      MOVE FUNCTION NUMVAL(01EXP013CC) TO  A-01EXP013CC           DLM0002
MOESJU      MOVE FUNCTION NUMVAL(01EXP013CO) TO  A-01EXP013CO           DLM0002
MOESJU      MOVE FUNCTION NUMVAL(01EXP013HP) TO  A-01EXP013HP           DLM0002
MOESJU      COMPUTE  MOB48  =  A-01EXP013RO + A-01EXP013IN +            DLM0002
MOESJU               A-01EXP013OT + A-01EXP013VE + A-01EXP013CC +       DLM0002
MOESJU               A-01EXP013CO + A-01EXP013HP                        DLM0002

            IF  FUNCTION NUMVAL(01MOR075RO)  <  0
              MOVE  999                TO  A-01MOR075RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR075RO) TO  A-01MOR075RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR075IN)  <  0
              MOVE  999                TO  A-01MOR075IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR075IN) TO  A-01MOR075IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR075OT)  <  0
              MOVE  999                TO  A-01MOR075OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR075OT) TO  A-01MOR075OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR075CO)  <  0
              MOVE  999                TO  A-01MOR075CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR075CO) TO  A-01MOR075CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR075VE)  <  0
              MOVE  999                TO  A-01MOR075VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR075VE) TO  A-01MOR075VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR075CC)  <  0
              MOVE  999                TO  A-01MOR075CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR075CC) TO  A-01MOR075CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR075HP)  <  0
              MOVE  999                TO  A-01MOR075HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR075HP) TO  A-01MOR075HP
            END-IF

            COMPUTE  RECMORA30 = FUNCTION MIN(A-01MOR075RO,A-01MOR075IN,
       A-01MOR075OT,A-01MOR075CO,A-01MOR075VE,A-01MOR075CC,A-01MOR075HP)

            IF  FUNCTION NUMVAL(01MOR076RO)  <  0
              MOVE  999                TO  A-01MOR076RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR076RO) TO  A-01MOR076RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR076IN)  <  0
              MOVE  999                TO  A-01MOR076IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR076IN) TO  A-01MOR076IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR076OT)  <  0
              MOVE  999                TO  A-01MOR076OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR076OT) TO  A-01MOR076OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR076CO)  <  0
              MOVE  999                TO  A-01MOR076CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR076CO) TO  A-01MOR076CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR076VE)  <  0
              MOVE  999                TO  A-01MOR076VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR076VE) TO  A-01MOR076VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR076CC)  <  0
              MOVE  999                TO  A-01MOR076CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR076CC) TO  A-01MOR076CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR076HP)  <  0
              MOVE  999                TO  A-01MOR076HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR076HP) TO  A-01MOR076HP
            END-IF

            COMPUTE  RECMORA60 = FUNCTION MIN(A-01MOR076RO,A-01MOR076IN,
       A-01MOR076OT,A-01MOR076CO,A-01MOR076VE,A-01MOR076CC,A-01MOR076HP)

            IF  FUNCTION NUMVAL(01MOR077RO)  <  0
              MOVE  999                TO  A-01MOR077RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR077RO) TO  A-01MOR077RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR077IN)  <  0
              MOVE  999                TO  A-01MOR077IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR077IN) TO  A-01MOR077IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR077OT)  <  0
              MOVE  999                TO  A-01MOR077OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR077OT) TO  A-01MOR077OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR077CO)  <  0
              MOVE  999                TO  A-01MOR077CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR077CO) TO  A-01MOR077CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR077VE)  <  0
              MOVE  999                TO  A-01MOR077VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR077VE) TO  A-01MOR077VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR077CC)  <  0
              MOVE  999                TO  A-01MOR077CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR077CC) TO  A-01MOR077CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR077HP)  <  0
              MOVE  999                TO  A-01MOR077HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR077HP) TO  A-01MOR077HP
            END-IF

            COMPUTE  RECMORA90 = FUNCTION MIN(A-01MOR077RO,A-01MOR077IN,
       A-01MOR077OT,A-01MOR077CO,A-01MOR077VE,A-01MOR077CC,A-01MOR077HP)

            IF  FUNCTION NUMVAL(01MOR078RO)  <  0
              MOVE  999                TO  A-01MOR078RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR078RO) TO  A-01MOR078RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR078IN)  <  0
              MOVE  999                TO  A-01MOR078IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR078IN) TO  A-01MOR078IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR078OT)  <  0
              MOVE  999                TO  A-01MOR078OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR078OT) TO  A-01MOR078OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR078CO)  <  0
              MOVE  999                TO  A-01MOR078CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR078CO) TO  A-01MOR078CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR078VE)  <  0
              MOVE  999                TO  A-01MOR078VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR078VE) TO  A-01MOR078VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR078CC)  <  0
              MOVE  999                TO  A-01MOR078CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR078CC) TO  A-01MOR078CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR078HP)  <  0
              MOVE  999                TO  A-01MOR078HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR078HP) TO  A-01MOR078HP
            END-IF

            COMPUTE RECMORA120 = FUNCTION MIN(A-01MOR078RO,A-01MOR078IN,
       A-01MOR078OT,A-01MOR078CO,A-01MOR078VE,A-01MOR078CC,A-01MOR078HP)

            IF  FUNCTION NUMVAL(01MOR079RO)  <  0
              MOVE  999                TO  A-01MOR079RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR079RO) TO  A-01MOR079RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR079IN)  <  0
              MOVE  999                TO  A-01MOR079IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR079IN) TO  A-01MOR079IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR079OT)  <  0
              MOVE  999                TO  A-01MOR079OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR079OT) TO  A-01MOR079OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR079CO)  <  0
              MOVE  999                TO  A-01MOR079CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR079CO) TO  A-01MOR079CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR079VE)  <  0
              MOVE  999                TO  A-01MOR079VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR079VE) TO  A-01MOR079VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR079CC)  <  0
              MOVE  999                TO  A-01MOR079CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR079CC) TO  A-01MOR079CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR079HP)  <  0
              MOVE  999                TO  A-01MOR079HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR079HP) TO  A-01MOR079HP
            END-IF

            COMPUTE  RECMORCC =  FUNCTION MIN(A-01MOR079RO,A-01MOR079IN,
       A-01MOR079OT,A-01MOR079CO,A-01MOR079VE,A-01MOR079CC,A-01MOR079HP)

            COMPUTE  RECMORACC = FUNCTION MIN(RECMORA30,RECMORA60,
                                          RECMORA90,RECMORA120,RECMORCC)

            IF  FUNCTION NUMVAL(01MOR056RO)  <  0
              MOVE  0                  TO  A-01MOR056RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056RO) TO  A-01MOR056RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR056IN)  <  0
              MOVE  0                  TO  A-01MOR056IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056IN) TO  A-01MOR056IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR056OT)  <  0
              MOVE  0                  TO  A-01MOR056OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056OT) TO  A-01MOR056OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR056CO)  <  0
              MOVE  0                  TO  A-01MOR056CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056CO) TO  A-01MOR056CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR056VE)  <  0
              MOVE  0                  TO  A-01MOR056VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056VE) TO  A-01MOR056VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR056CC)  <  0
              MOVE  0                  TO  A-01MOR056CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056CC) TO  A-01MOR056CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR056HP)  <  0
              MOVE  0                  TO  A-01MOR056HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056HP) TO  A-01MOR056HP
            END-IF

            COMPUTE  EVER6024P  =   A-01MOR056RO + A-01MOR056IN +
                     A-01MOR056OT + A-01MOR056CO + A-01MOR056VE +
                     A-01MOR056CC + A-01MOR056HP

            IF  FUNCTION NUMVAL(01MOR057RO)  <  0
              MOVE  0                  TO  A-01MOR057RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057RO) TO  A-01MOR057RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR057IN)  <  0
              MOVE  0                  TO  A-01MOR057IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057IN) TO  A-01MOR057IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR057OT)  <  0
              MOVE  0                  TO  A-01MOR057OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057OT) TO  A-01MOR057OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR057CO)  <  0
              MOVE  0                  TO  A-01MOR057CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057CO) TO  A-01MOR057CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR057VE)  <  0
              MOVE  0                  TO  A-01MOR057VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057VE) TO  A-01MOR057VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR057CC)  <  0
              MOVE  0                  TO  A-01MOR057CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057CC) TO  A-01MOR057CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR057HP)  <  0
              MOVE  0                  TO  A-01MOR057HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057HP) TO  A-01MOR057HP
            END-IF

            COMPUTE  EVER9024P  =   A-01MOR057RO + A-01MOR057IN +
                     A-01MOR057OT + A-01MOR057CO + A-01MOR057VE +
                     A-01MOR057CC + A-01MOR057HP

            IF  FUNCTION NUMVAL(01MOR058RO)  <  0
              MOVE  0                  TO  A-01MOR058RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058RO) TO  A-01MOR058RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR058IN)  <  0
              MOVE  0                  TO  A-01MOR058IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058IN) TO  A-01MOR058IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR058OT)  <  0
              MOVE  0                  TO  A-01MOR058OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058OT) TO  A-01MOR058OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR058CO)  <  0
              MOVE  0                  TO  A-01MOR058CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058CO) TO  A-01MOR058CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR058VE)  <  0
              MOVE  0                  TO  A-01MOR058VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058VE) TO  A-01MOR058VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR058CC)  <  0
              MOVE  0                  TO  A-01MOR058CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058CC) TO  A-01MOR058CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR058HP)  <  0
              MOVE  0                  TO  A-01MOR058HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058HP) TO  A-01MOR058HP
            END-IF

            COMPUTE  EVER12024P  =  A-01MOR058RO + A-01MOR058IN +
                     A-01MOR058OT + A-01MOR058CO + A-01MOR058VE +
                     A-01MOR058CC + A-01MOR058HP

            IF  FUNCTION NUMVAL(01MOR055RO)  <  0
              MOVE  0                  TO  A-01MOR055RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR055RO) TO  A-01MOR055RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR055IN)  <  0
              MOVE  0                  TO  A-01MOR055IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR055IN) TO  A-01MOR055IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR055OT)  <  0
              MOVE  0                  TO  A-01MOR055OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR055OT) TO  A-01MOR055OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR055CO)  <  0
              MOVE  0                  TO  A-01MOR055CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR055CO) TO  A-01MOR055CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR055VE)  <  0
              MOVE  0                  TO  A-01MOR055VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR055VE) TO  A-01MOR055VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR055CC)  <  0
              MOVE  0                  TO  A-01MOR055CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR055CC) TO  A-01MOR055CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR055HP)  <  0
              MOVE  0                  TO  A-01MOR055HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR055HP) TO  A-01MOR055HP
            END-IF

            IF  FUNCTION NUMVAL(01MOR056RO)  <  0
              MOVE  0                  TO  A-01MOR056RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056RO) TO  A-01MOR056RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR056IN)  <  0
              MOVE  0                  TO  A-01MOR056IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056IN) TO  A-01MOR056IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR056OT)  <  0
              MOVE  0                  TO  A-01MOR056OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056OT) TO  A-01MOR056OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR056CO)  <  0
              MOVE  0                  TO  A-01MOR056CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056CO) TO  A-01MOR056CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR056VE)  <  0
              MOVE  0                  TO  A-01MOR056VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056VE) TO  A-01MOR056VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR056CC)  <  0
              MOVE  0                  TO  A-01MOR056CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056CC) TO  A-01MOR056CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR056HP)  <  0
              MOVE  0                  TO  A-01MOR056HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR056HP) TO  A-01MOR056HP
            END-IF

            IF  FUNCTION NUMVAL(01MOR057RO)  <  0
              MOVE  0                  TO  A-01MOR057RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057RO) TO  A-01MOR057RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR057IN)  <  0
              MOVE  0                  TO  A-01MOR057IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057IN) TO  A-01MOR057IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR057OT)  <  0
              MOVE  0                  TO  A-01MOR057OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057OT) TO  A-01MOR057OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR057CO)  <  0
              MOVE  0                  TO  A-01MOR057CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057CO) TO  A-01MOR057CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR057VE)  <  0
              MOVE  0                  TO  A-01MOR057VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057VE) TO  A-01MOR057VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR057CC)  <  0
              MOVE  0                  TO  A-01MOR057CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057CC) TO  A-01MOR057CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR057HP)  <  0
              MOVE  0                  TO  A-01MOR057HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR057HP) TO  A-01MOR057HP
            END-IF

            IF  FUNCTION NUMVAL(01MOR058RO)  <  0
              MOVE  0                  TO  A-01MOR058RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058RO) TO  A-01MOR058RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR058IN)  <  0
              MOVE  0                  TO  A-01MOR058IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058IN) TO  A-01MOR058IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR058OT)  <  0
              MOVE  0                  TO  A-01MOR058OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058OT) TO  A-01MOR058OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR058CO)  <  0
              MOVE  0                  TO  A-01MOR058CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058CO) TO  A-01MOR058CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR058VE)  <  0
              MOVE  0                  TO  A-01MOR058VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058VE) TO  A-01MOR058VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR058CC)  <  0
              MOVE  0                  TO  A-01MOR058CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058CC) TO  A-01MOR058CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR058HP)  <  0
              MOVE  0                  TO  A-01MOR058HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR058HP) TO  A-01MOR058HP
            END-IF

            IF  FUNCTION NUMVAL(01MOR059RO)  <  0
              MOVE  0                  TO  A-01MOR059RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR059RO) TO  A-01MOR059RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR059IN)  <  0
              MOVE  0                  TO  A-01MOR059IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR059IN) TO  A-01MOR059IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR059OT)  <  0
              MOVE  0                  TO  A-01MOR059OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR059OT) TO  A-01MOR059OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR059CO)  <  0
              MOVE  0                  TO  A-01MOR059CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR059CO) TO  A-01MOR059CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR059VE)  <  0
              MOVE  0                  TO  A-01MOR059VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR059VE) TO  A-01MOR059VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR059CC)  <  0
              MOVE  0                  TO  A-01MOR059CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR059CC) TO  A-01MOR059CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR059HP)  <  0
              MOVE  0                  TO  A-01MOR059HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR059HP) TO  A-01MOR059HP
            END-IF

            COMPUTE  EVER24P  =     A-01MOR055RO + A-01MOR055IN +
                     A-01MOR055OT + A-01MOR055CO + A-01MOR055VE +
                     A-01MOR055CC + A-01MOR055HP + A-01MOR056RO +
                     A-01MOR056IN + A-01MOR056OT + A-01MOR056CO +
                     A-01MOR056VE + A-01MOR056CC + A-01MOR056HP +
                     A-01MOR057RO + A-01MOR057IN + A-01MOR057OT +
                     A-01MOR057CO + A-01MOR057VE + A-01MOR057CC +
                     A-01MOR057HP + A-01MOR058RO + A-01MOR058IN +
                     A-01MOR058OT + A-01MOR058CO + A-01MOR058VE +
                     A-01MOR058CC + A-01MOR058HP + A-01MOR059RO +
                     A-01MOR059IN + A-01MOR059OT + A-01MOR059CO +
                     A-01MOR059VE + A-01MOR059CC + A-01MOR059HP

            COMPUTE  EVER24P60  =  EVER6024P - EVER9024P

            IF  FUNCTION NUMVAL(01MOR069RO)  <  0
              MOVE  0                  TO  A-01MOR069RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR069RO) TO  A-01MOR069RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR069IN)  <  0
              MOVE  0                  TO  A-01MOR069IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR069IN) TO  A-01MOR069IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR069OT)  <  0
              MOVE  0                  TO  A-01MOR069OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR069OT) TO  A-01MOR069OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR069CO)  <  0
              MOVE  0                  TO  A-01MOR069CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR069CO) TO  A-01MOR069CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR069VE)  <  0
              MOVE  0                  TO  A-01MOR069VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR069VE) TO  A-01MOR069VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR069CC)  <  0
              MOVE  0                  TO  A-01MOR069CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR069CC) TO  A-01MOR069CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR069HP)  <  0
              MOVE  0                  TO  A-01MOR069HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR069HP) TO  A-01MOR069HP
            END-IF

            COMPUTE  EVER3048P  =   A-01MOR069RO + A-01MOR069IN +
                     A-01MOR069OT + A-01MOR069CO + A-01MOR069VE +
                     A-01MOR069CC + A-01MOR058HP

            IF  FUNCTION NUMVAL(01MOR072RO)  <  0
              MOVE  0                  TO  A-01MOR072RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR072RO) TO  A-01MOR072RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR072IN)  <  0
              MOVE  0                  TO  A-01MOR072IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR072IN) TO  A-01MOR072IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR072OT)  <  0
              MOVE  0                  TO  A-01MOR072OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR072OT) TO  A-01MOR072OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR072CO)  <  0
              MOVE  0                  TO  A-01MOR072CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR072CO) TO  A-01MOR072CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR072VE)  <  0
              MOVE  0                  TO  A-01MOR072VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR072VE) TO  A-01MOR072VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR072CC)  <  0
              MOVE  0                  TO  A-01MOR072CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR072CC) TO  A-01MOR072CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR072HP)  <  0
              MOVE  0                  TO  A-01MOR072HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR072HP) TO  A-01MOR072HP
            END-IF

            COMPUTE  EVER12048P  =  A-01MOR072RO + A-01MOR072IN +
                     A-01MOR072OT + A-01MOR072CO + A-01MOR072VE +
                     A-01MOR072CC + A-01MOR072HP

            IF  FUNCTION NUMVAL(01MOR073RO)  <  0
              MOVE  0                  TO  A-01MOR073RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR073RO) TO  A-01MOR073RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR073IN)  <  0
              MOVE  0                  TO  A-01MOR073IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR073IN) TO  A-01MOR073IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR073OT)  <  0
              MOVE  0                  TO  A-01MOR073OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR073OT) TO  A-01MOR073OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR073CO)  <  0
              MOVE  0                  TO  A-01MOR073CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR073CO) TO  A-01MOR073CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR073VE)  <  0
              MOVE  0                  TO  A-01MOR073VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR073VE) TO  A-01MOR073VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR073CC)  <  0
              MOVE  0                  TO  A-01MOR073CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR073CC) TO  A-01MOR073CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR073HP)  <  0
              MOVE  0                  TO  A-01MOR073HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR073HP) TO  A-01MOR073HP
            END-IF

            COMPUTE  EVERCC48P  =  A-01MOR073RO + A-01MOR073IN +
                    A-01MOR073OT + A-01MOR073CO + A-01MOR073VE +
                    A-01MOR073CC + A-01MOR073HP

MOESJU      COMPUTE  EVER48P120  =  EVER12048P - EVERCC48P              DLM0002

            IF  FUNCTION NUMVAL(01MOR001RO)  <  0
              MOVE  0                  TO  A-01MOR001RO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR001RO) TO  A-01MOR001RO
            END-IF

            IF  FUNCTION NUMVAL(01MOR001IN)  <  0
              MOVE  0                  TO  A-01MOR001IN
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR001IN) TO  A-01MOR001IN
            END-IF

            IF  FUNCTION NUMVAL(01MOR001OT)  <  0
              MOVE  0                  TO  A-01MOR001OT
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR001OT) TO  A-01MOR001OT
            END-IF

            IF  FUNCTION NUMVAL(01MOR001CO)  <  0
              MOVE  0                  TO  A-01MOR001CO
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR001CO) TO  A-01MOR001CO
            END-IF

            IF  FUNCTION NUMVAL(01MOR001VE)  <  0
              MOVE  0                  TO  A-01MOR001VE
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR001VE) TO  A-01MOR001VE
            END-IF

            IF  FUNCTION NUMVAL(01MOR001CC)  <  0
              MOVE  0                  TO  A-01MOR001CC
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR001CC) TO  A-01MOR001CC
            END-IF

            IF  FUNCTION NUMVAL(01MOR001HP)  <  0
              MOVE  0                  TO  A-01MOR001HP
            ELSE
              MOVE  FUNCTION NUMVAL(01MOR001HP) TO  A-01MOR001HP
            END-IF

            COMPUTE  QALDIA  =  A-01MOR001RO + A-01MOR001IN +
                 A-01MOR001OT + A-01MOR001CO + A-01MOR001VE +
                 A-01MOR001CC + A-01MOR001HP.
      *
       1500-ARBOL-DECISION.
           PERFORM  1500-CARACTERISTICAS-HIBRIDAS
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  <= 0
           AND FUNCTION NUMVAL(02EXP013TO)  > 10.100
             MOVE  312                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  <= 0
           AND OPEN12  <= 3
           AND FUNCTION NUMVAL(01MOR048CC)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 15
           AND 02EXP001TO  > 12
             MOVE  379                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  <= 0
           AND OPEN12  <= 3
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
             MOVE  402                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  <= 0
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 1                        DLM0002
           AND FUNCTION NUMVAL(02EXP007CC)  <= 75
           AND 01INQ002  <= 1
           AND FUNCTION NUMVAL(01ACP004CT)  <= 0
           AND FUNCTION NUMVAL(01EXP010CT)  <= 0
           AND 02EXP004TO  > 39
             MOVE  460                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  <= 0
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 1                        DLM0002
           AND FUNCTION NUMVAL(02EXP007CC)  <= 75
           AND 01INQ002  <= 1
           AND FUNCTION NUMVAL(01ACP004CT)  <= 0
           AND FUNCTION NUMVAL(01EXP010CT)  > 0
             MOVE  297                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  <= 0
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 1                        DLM0002
           AND FUNCTION NUMVAL(02EXP007CC)  <= 75
           AND 01INQ002  <= 1
           AND FUNCTION NUMVAL(01ACP004CT)  > 0
           AND 02EXP002TO  <= 9
             MOVE  302                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  <= 0
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 1                        DLM0002
           AND FUNCTION NUMVAL(02EXP007CC)  > 75
             MOVE  353                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  > 0
           AND FUNCTION NUMVAL(01EXP001CT)  <= 2
             MOVE  376                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  > 0
           AND FUNCTION NUMVAL(01EXP001CT)  > 2
           AND FUNCTION NUMVAL(01EXP001CT)  > 4
           AND 01INQ002  > 1
             MOVE  383                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  > -1
             MOVE  254                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  > -1
           AND 02EXP006TO  > 41
             MOVE  345                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  > 0
             MOVE  269                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  > 21.250
             MOVE  294                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  > 1
             MOVE  333                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  > 1
           AND FUNCTION NUMVAL(01MOR027CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 79.870
           AND FUNCTION NUMVAL(01MOR040CC)  <= 2
           AND 01INQ002  <= 1
           AND FUNCTION NUMVAL(02EXP007CC)  <= 45
             MOVE  208                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  > 1
           AND FUNCTION NUMVAL(01MOR027CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 79.870
           AND FUNCTION NUMVAL(01MOR040CC)  <= 2
           AND 01INQ002  > 1
             MOVE  174                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  > 1
           AND FUNCTION NUMVAL(01MOR027CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  > 79.870
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  > 0
             MOVE  289                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  > 3
             MOVE  136                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  > 1
             MOVE  283                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  > 3
           AND FUNCTION NUMVAL(01EXP006CC)  > 11
             MOVE  415                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  > 8
             MOVE  227                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  > 20
           AND 02EXP006TO  <= 22
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  > 20
           AND 02EXP006TO  > 22
           AND FUNCTION NUMVAL(02EXP010AH)  <= 37.500
           AND FUNCTION NUMVAL(01MOR053OT)  <= -1
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  > 20
           AND 02EXP006TO  > 22
           AND FUNCTION NUMVAL(02EXP010AH)  <= 37.500
           AND FUNCTION NUMVAL(01MOR053OT)  > -1
           AND FUNCTION NUMVAL(02EXP008TO)  <= 25.830
             MOVE  216                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(02EXP013AH)  <= -1                       DLM0002
           AND FUNCTION NUMVAL(01ACP008OT)  <= 0
           AND FUNCTION NUMVAL(01ACP007CT)  <= 1
           AND 01INQ001  <= 2
             MOVE  213                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(02EXP013AH)  <= -1                       DLM0002
           AND FUNCTION NUMVAL(01ACP008OT)  <= 0
           AND FUNCTION NUMVAL(01ACP007CT)  <= 1
           AND 01INQ001  > 2
           AND QALDIA  <= 1
             MOVE  423                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(02EXP013AH)  <= -1                       DLM0002
           AND FUNCTION NUMVAL(01ACP008OT)  <= 0
           AND FUNCTION NUMVAL(01ACP007CT)  > 1
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(02EXP013AH)  > -1                        DLM0002
           AND 01INQ001  <= 2
           AND FUNCTION NUMVAL(01ACP007CT)  > 0
             MOVE  368                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  > 92
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  > 177
             MOVE  273                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  > 3
             MOVE  229                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  > 5
           AND FUNCTION NUMVAL(01EXP001RO)  <= 62
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  > 61
             MOVE  163                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  > 115
             MOVE  148                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  > 1
           AND 02EXP003TO  > 11
           AND 01INQ005  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 10
             MOVE  190                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  > 2
             MOVE  179                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  > 11
             MOVE  186                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  > 15
             MOVE  212                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  > 77
           AND FUNCTION NUMVAL(01EXP003CC)  <= 82
           AND RECMORA90  > 40
           AND FUNCTION NUMVAL(01EXP002CC)  <= 5
           AND FUNCTION NUMVAL(02EXP007TO)  <= 40
           AND FUNCTION NUMVAL(02EXP007CC)  <= 18.180
           AND FUNCTION NUMVAL(01EXP002IN)  <= 0
           AND 02EXP001TO  > 104
             MOVE  290                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  > 77
           AND FUNCTION NUMVAL(01EXP003CC)  <= 82
           AND RECMORA90  > 40
           AND FUNCTION NUMVAL(01EXP002CC)  <= 5
           AND FUNCTION NUMVAL(02EXP007TO)  <= 40
           AND FUNCTION NUMVAL(02EXP007CC)  <= 18.180
           AND FUNCTION NUMVAL(01EXP002IN)  > 0
             MOVE  137                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  > 77
           AND FUNCTION NUMVAL(01EXP003CC)  <= 82
           AND RECMORA90  > 40
           AND FUNCTION NUMVAL(01EXP002CC)  <= 5
           AND FUNCTION NUMVAL(02EXP007TO)  <= 40
           AND FUNCTION NUMVAL(02EXP007CC)  > 18.180
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  > 77
           AND FUNCTION NUMVAL(01EXP003CC)  <= 82
           AND RECMORA90  > 40
           AND FUNCTION NUMVAL(01EXP002CC)  > 5
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  > 77
           AND FUNCTION NUMVAL(01EXP003CC)  > 82
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  > 24
             MOVE  129                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  <= 12
           AND FUNCTION NUMVAL(01EXP001CC)  > 54
           AND EVER48P120  <= 1
             MOVE  167                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  <= 13
           AND FUNCTION NUMVAL(01MOR040CC)  <= -1
             MOVE  157                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  <= 13
           AND FUNCTION NUMVAL(01MOR040CC)  > -1
           AND FUNCTION NUMVAL(01EXP004CC)  <= 31
           AND FUNCTION NUMVAL(01ACP008CC)  <= 3
           AND RECMORA30  > 5
           AND RECMORA30  <= 10
           AND FUNCTION NUMVAL(01ACP004CC)  <= 1
             MOVE  212                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  <= 13
           AND FUNCTION NUMVAL(01MOR040CC)  > -1
           AND FUNCTION NUMVAL(01EXP004CC)  <= 31
           AND FUNCTION NUMVAL(01ACP008CC)  > 3
             MOVE  324                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  <= 13
           AND FUNCTION NUMVAL(01MOR040CC)  > -1
           AND FUNCTION NUMVAL(01EXP004CC)  > 31
             MOVE  268                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  <= 3
           AND OPEN12  <= 4
           AND FUNCTION NUMVAL(01MOR069CC)  > -1
             MOVE  383                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  <= 3
           AND OPEN12  > 4
             MOVE  138                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  <= 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 37
           AND FUNCTION NUMVAL(01ACP013CC)  <= 0
           AND OPEN48  <= 2
             MOVE  269                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  <= 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 37
           AND FUNCTION NUMVAL(01ACP013CC)  > 0
             MOVE  115                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  <= -1
             MOVE  115                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  <= -1
           AND 02EXP004TO  <= 20
             MOVE  423                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
           AND FUNCTION NUMVAL(01MOR054CC)  <= 1
           AND 02EXP001TO  > 10
           AND FUNCTION NUMVAL(01EXP001CC)  <= 32
           AND 02EXP005TO  <= 30
           AND 02EXP006TO  <= 21
           AND FUNCTION NUMVAL(01MOR093CC)  <= -1
           AND 02EXP001TO  <= 19
             MOVE  263                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
           AND FUNCTION NUMVAL(01MOR054CC)  <= 1
           AND 02EXP001TO  > 10
           AND FUNCTION NUMVAL(01EXP001CC)  <= 32
           AND 02EXP005TO  <= 30
           AND 02EXP006TO  <= 21
           AND FUNCTION NUMVAL(01MOR093CC)  > -1
             MOVE  252                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
           AND FUNCTION NUMVAL(01MOR054CC)  <= 1
           AND 02EXP001TO  > 10
           AND FUNCTION NUMVAL(01EXP001CC)  <= 32
           AND 02EXP005TO  <= 30
           AND 02EXP006TO  > 21
             MOVE  199                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
           AND FUNCTION NUMVAL(01MOR054CC)  <= 1
           AND 02EXP001TO  > 10
           AND FUNCTION NUMVAL(01EXP001CC)  > 32
             MOVE  93                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  > 0
             MOVE  137                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  > -1
             MOVE  94                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  > 3
           AND 01INQ005  > -1
             MOVE  337                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  > 2
           AND 02EXP002TO  <= 19
             MOVE  356                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  > 98.380
             MOVE  99                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  > 3.330
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  > 26.670
           AND FUNCTION NUMVAL(01EXP010IN)  > 0
             MOVE  400                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  > 71
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  > 0
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  > 89
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  > 175
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  > 13
           AND FUNCTION NUMVAL(01EXP006CT)  <= 120
           AND FUNCTION NUMVAL(02EXP007TO)  <= 19.470
             MOVE  229                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  > 14
             MOVE  138                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  > 6
           AND 02EXP002TO  <= 9
             MOVE  389                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  > 4
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  > 5
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  > 1
           AND FUNCTION NUMVAL(01MOR075CC)  <= 30
             MOVE  288                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  > 7
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  > 45
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  > 4
             MOVE  77                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  > 2
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  > 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 1
             MOVE  361                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  > 294
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  > 78
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  > 8
           AND FUNCTION NUMVAL(01MOR027CC)  <= 0
             MOVE  426                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  > 3                         DLM0002
             MOVE  75                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  > 4
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  > 114
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  > 175
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  <= 11
           AND FUNCTION NUMVAL(01MOR046OT)  <= 0
           AND FUNCTION NUMVAL(01MOR098CC)  <= 93.620
           AND EVER24P60  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01ACP004CT)  <= 0
           AND FUNCTION NUMVAL(01ACP003CC)  <= 2
           AND 02EXP006TO  <= 32
             MOVE  227                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  <= 11
           AND FUNCTION NUMVAL(01MOR046OT)  <= 0
           AND FUNCTION NUMVAL(01MOR098CC)  > 93.620
             MOVE  442                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  > 47
           AND FUNCTION NUMVAL(01MOR034CC)  <= 1
           AND FUNCTION NUMVAL(01ACP008OT)  <= 12
           AND FUNCTION NUMVAL(01EXP003CC)  > 90
             MOVE  242                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  > 47
           AND FUNCTION NUMVAL(01MOR034CC)  > 1
             MOVE  263                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  > 0
           AND FUNCTION NUMVAL(01EXP003CC)  > 102
             MOVE  403                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  > 0
           AND FUNCTION NUMVAL(01MOR075CC)  > 17
           AND FUNCTION NUMVAL(01EXP001CC)  > 75
           AND FUNCTION NUMVAL(02EXP008TO)  <= 22.580
           AND 02EXP005TO  <= 18
             MOVE  206                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  > 0
           AND FUNCTION NUMVAL(01MOR075CC)  > 17
           AND FUNCTION NUMVAL(01EXP001CC)  > 75
           AND FUNCTION NUMVAL(02EXP008TO)  > 22.580
             MOVE  0                   TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  <= 0
           AND FUNCTION NUMVAL(02EXP013TO)  <= 10.100
             MOVE  852                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  <= 1
             MOVE  808                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  <= 0
             MOVE  705                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  <= 0
           AND OPEN12  <= 3
           AND FUNCTION NUMVAL(01MOR048CC)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 15
           AND 02EXP001TO  <= 12
             MOVE  609                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  <= 0
           AND OPEN12  <= 3
           AND FUNCTION NUMVAL(01MOR048CC)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  > 15
             MOVE  855                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  <= 0
           AND OPEN12  > 3
             MOVE  806                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  <= 0
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 1                        DLM0002
           AND FUNCTION NUMVAL(02EXP007CC)  <= 75
           AND 01INQ002  <= 1
           AND FUNCTION NUMVAL(01ACP004CT)  <= 0
           AND FUNCTION NUMVAL(01EXP010CT)  <= 0
           AND 02EXP004TO  <= 39
             MOVE  728                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  <= 0
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 1                        DLM0002
           AND FUNCTION NUMVAL(02EXP007CC)  <= 75
           AND 01INQ002  <= 1
           AND FUNCTION NUMVAL(01ACP004CT)  > 0
           AND 02EXP002TO  > 9
             MOVE  669                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  <= 0
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 1                        DLM0002
           AND FUNCTION NUMVAL(02EXP007CC)  <= 75
           AND 01INQ002  > 1
             MOVE  541                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  <= 0
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  > 1                         DLM0002
             MOVE  694                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  > 0
           AND FUNCTION NUMVAL(01EXP001CT)  > 2
           AND FUNCTION NUMVAL(01EXP001CT)  <= 4
             MOVE  735                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  <= -1
           AND FUNCTION NUMVAL(01ACP001IN)  <= -1
           AND FUNCTION NUMVAL(01EXP007CT)  > 0
           AND FUNCTION NUMVAL(01EXP001CT)  > 2
           AND FUNCTION NUMVAL(01EXP001CT)  > 4
           AND 01INQ002  <= 1
             MOVE  598                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  <= -1
           AND FUNCTION NUMVAL(02EXP010AH)  > -1
           AND 02EXP006TO  <= 41
             MOVE  629                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 21.250
           AND FUNCTION NUMVAL(01MOR021CC)  <= 0
           AND FUNCTION NUMVAL(01MOR021CC)  > -1
             MOVE  667                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  <= 0
           AND FUNCTION NUMVAL(01ACP007CC)  > 2
             MOVE  710                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  <= 4
           AND OPEN12  <= 1
           AND 01INQ005  > 0
             MOVE  598                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  <= 1
           AND OPEN48  > 4
             MOVE  660                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  > 1
           AND FUNCTION NUMVAL(01MOR027CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 79.870
           AND FUNCTION NUMVAL(01MOR040CC)  <= 2
           AND 01INQ002  <= 1
           AND FUNCTION NUMVAL(02EXP007CC)  > 45
             MOVE  682                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  > 1
           AND FUNCTION NUMVAL(01MOR027CC)  <= 2
           AND FUNCTION NUMVAL(01MOR098CC)  <= 79.870
           AND FUNCTION NUMVAL(01MOR040CC)  > 2
             MOVE  633                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  <= 0
           AND FUNCTION NUMVAL(01ACP005IN)  <= 1
           AND 02EXP003TO  > 0
           AND FUNCTION NUMVAL(01EXP002OT)  <= 3
           AND FUNCTION NUMVAL(01ACP001IN)  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01MOR015CC)  > 1
           AND FUNCTION NUMVAL(01MOR027CC)  > 2
             MOVE  617                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  <= 3
           AND FUNCTION NUMVAL(01ACP001AH)  > 0
             MOVE  685                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  <= 20
           AND FUNCTION NUMVAL(01ACP007CC)  <= 8
           AND 01INQ002  > 3
           AND FUNCTION NUMVAL(01EXP006CC)  <= 11
             MOVE  720                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  > 20
           AND 02EXP006TO  > 22
           AND FUNCTION NUMVAL(02EXP010AH)  <= 37.500
           AND FUNCTION NUMVAL(01MOR053OT)  > -1
           AND FUNCTION NUMVAL(02EXP008TO)  > 25.830
             MOVE  723                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  <= 1
           AND FUNCTION NUMVAL(01EXP002OT)  > 20
           AND 02EXP006TO  > 22
           AND FUNCTION NUMVAL(02EXP010AH)  > 37.500
             MOVE  818                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  <= 74
           AND FUNCTION NUMVAL(01ACP001IN)  > 1
             MOVE  726                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 69
           AND FUNCTION NUMVAL(01EXP005IN)  > 74
             MOVE  780                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  > 69
             MOVE  755                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(02EXP013AH)  <= -1                       DLM0002
           AND FUNCTION NUMVAL(01ACP008OT)  <= 0
           AND FUNCTION NUMVAL(01ACP007CT)  <= 1
           AND 01INQ001  > 2
           AND QALDIA  > 1
             MOVE  685                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(02EXP013AH)  <= -1                       DLM0002
           AND FUNCTION NUMVAL(01ACP008OT)  > 0
             MOVE  621                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(02EXP013AH)  > -1                        DLM0002
           AND 01INQ001  <= 2
           AND FUNCTION NUMVAL(01ACP007CT)  <= 0
             MOVE  623                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(02EXP013AH)  > -1                        DLM0002
           AND 01INQ001  > 2
             MOVE  730                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  <= 4
           AND 02EXP001TO  <= 177
           AND RECMORACC  > 1
           AND FUNCTION NUMVAL(01EXP010OT)  > 0
           AND 02EXP003TO  <= 92
           AND FUNCTION NUMVAL(01ACP014CC)  > 2
             MOVE  765                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  <= 2
           AND FUNCTION NUMVAL(01MOR001IN)  <= 3
           AND FUNCTION NUMVAL(01MOR027CC)  > 4
             MOVE  783                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  <= 5
           AND FUNCTION NUMVAL(01MOR074CC)  > 2
             MOVE  754                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  <= 11
           AND FUNCTION NUMVAL(01EXP002RO)  <= 61
           AND FUNCTION NUMVAL(01ACP015IN)  > 5
           AND FUNCTION NUMVAL(01EXP001RO)  > 62
             MOVE  600                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  <= 1
           AND FUNCTION NUMVAL(01EXP002AH)  <= 115
           AND FUNCTION NUMVAL(01ACP002IN)  > 11
             MOVE  869                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  > 1
           AND 02EXP003TO  <= 11
             MOVE  746                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  > 1
           AND 02EXP003TO  > 11
           AND 01INQ005  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  > 10
             MOVE  623                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  <= 10
           AND EVER3048P  <= 2
           AND FUNCTION NUMVAL(01ACP006RO)  > 1
           AND 02EXP003TO  > 11
           AND 01INQ005  > 2
             MOVE  685                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  <= 1
           AND FUNCTION NUMVAL(01ACP005CC)  > 10
             MOVE  730                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  <= 5
           AND FUNCTION NUMVAL(01MOR001CC)  <= 11
           AND EVER12024P  > 1
             MOVE  754                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  <= 4.380
           AND FUNCTION NUMVAL(01ACP014CC)  <= 15
           AND FUNCTION NUMVAL(01ACP001CC)  > 5
             MOVE  784                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  <= 77
           AND RECMORACC  > 0
           AND FUNCTION NUMVAL(01MOR099CC)  > 4.380
             MOVE  720                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  > 77
           AND FUNCTION NUMVAL(01EXP003CC)  <= 82
           AND RECMORA90  <= 40
             MOVE  706                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  > 77
           AND FUNCTION NUMVAL(01EXP003CC)  <= 82
           AND RECMORA90  > 40
           AND FUNCTION NUMVAL(01EXP002CC)  <= 5
           AND FUNCTION NUMVAL(02EXP007TO)  <= 40
           AND FUNCTION NUMVAL(02EXP007CC)  <= 18.180
           AND FUNCTION NUMVAL(01EXP002IN)  <= 0
           AND 02EXP001TO  <= 104
             MOVE  655                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  <= 48
           AND FUNCTION NUMVAL(01EXP002CT)  > 77
           AND FUNCTION NUMVAL(01EXP003CC)  <= 82
           AND RECMORA90  > 40
           AND FUNCTION NUMVAL(01EXP002CC)  <= 5
           AND FUNCTION NUMVAL(02EXP007TO)  > 40
             MOVE  663                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  <= 9
           AND FUNCTION NUMVAL(01EXP010IN)  <= 24
           AND FUNCTION NUMVAL(01ACP015CC)  > 48
             MOVE  802                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  <= 12
           AND FUNCTION NUMVAL(01EXP001CC)  <= 54
             MOVE  781                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  <= 12
           AND FUNCTION NUMVAL(01EXP001CC)  > 54
           AND EVER48P120  > 1
             MOVE  667                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  <= 13
           AND FUNCTION NUMVAL(01MOR040CC)  > -1
           AND FUNCTION NUMVAL(01EXP004CC)  <= 31
           AND FUNCTION NUMVAL(01ACP008CC)  <= 3
           AND RECMORA30  <= 5
             MOVE  923                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  <= 13
           AND FUNCTION NUMVAL(01MOR040CC)  > -1
           AND FUNCTION NUMVAL(01EXP004CC)  <= 31
           AND FUNCTION NUMVAL(01ACP008CC)  <= 3
           AND RECMORA30  > 5
           AND RECMORA30  <= 10
           AND FUNCTION NUMVAL(01ACP004CC)  > 1
             MOVE  672                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  <= 13
           AND FUNCTION NUMVAL(01MOR040CC)  > -1
           AND FUNCTION NUMVAL(01EXP004CC)  <= 31
           AND FUNCTION NUMVAL(01ACP008CC)  <= 3
           AND RECMORA30  > 5
           AND RECMORA30  > 10
             MOVE  762                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  <= 15
             MOVE  562                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  <= 3
           AND OPEN12  <= 4
           AND FUNCTION NUMVAL(01MOR069CC)  <= -1
             MOVE  843                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  <= 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 37
           AND FUNCTION NUMVAL(01ACP013CC)  <= 0
           AND OPEN48  > 2
             MOVE  702                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  <= 35
           AND FUNCTION NUMVAL(01EXP004CT)  > 37
             MOVE  823                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  <= -1
           AND 02EXP004TO  > 20
             MOVE  657                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
           AND FUNCTION NUMVAL(01MOR054CC)  <= 1
           AND 02EXP001TO  <= 10
             MOVE  529                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
           AND FUNCTION NUMVAL(01MOR054CC)  <= 1
           AND 02EXP001TO  > 10
           AND FUNCTION NUMVAL(01EXP001CC)  <= 32
           AND 02EXP005TO  <= 30
           AND 02EXP006TO  <= 21
           AND FUNCTION NUMVAL(01MOR093CC)  <= -1
           AND 02EXP001TO  > 19
             MOVE  629                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
           AND FUNCTION NUMVAL(01MOR054CC)  <= 1
           AND 02EXP001TO  > 10
           AND FUNCTION NUMVAL(01EXP001CC)  <= 32
           AND 02EXP005TO  > 30
             MOVE  620                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  <= 59
           AND FUNCTION NUMVAL(01MOR068CC)  <= 0
           AND FUNCTION NUMVAL(01MOR055CC)  > -1
           AND FUNCTION NUMVAL(01MOR048CC)  > -1
           AND FUNCTION NUMVAL(01MOR054CC)  > 1
             MOVE  564                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  <= 3
           AND FUNCTION NUMVAL(01MOR046OT)  <= -1
           AND FUNCTION NUMVAL(01EXP005CC)  > 59
             MOVE  544                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  <= 2
           AND FUNCTION NUMVAL(01MOR040CC)  > 3
           AND 01INQ005  <= -1
             MOVE  760                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  <= 26.670
           AND FUNCTION NUMVAL(02EXP007TO)  <= 3.330
           AND FUNCTION NUMVAL(01MOR098CC)  <= 98.380
           AND 01INQ002  > 2
           AND 02EXP002TO  > 19
             MOVE  759                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  <= 81
           AND FUNCTION NUMVAL(01EXP006CT)  <= 71
           AND FUNCTION NUMVAL(02EXP007TO)  > 26.670
           AND FUNCTION NUMVAL(01EXP010IN)  <= 0
             MOVE  690                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  <= 13
           AND 02EXP001TO  <= 175
           AND RECMORA30  > 35
           AND FUNCTION NUMVAL(01EXP004CT)  <= 89
           AND FUNCTION NUMVAL(01ACP002OT)  <= 0
           AND FUNCTION NUMVAL(01EXP002CT)  > 81
             MOVE  679                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  > 13
           AND FUNCTION NUMVAL(01EXP006CT)  <= 120
           AND FUNCTION NUMVAL(02EXP007TO)  > 19.470
             MOVE  717                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  <= 6
           AND RECMORA120  > 15
           AND RECMORACC  > 3
           AND FUNCTION NUMVAL(01MOR076RO)  <= 14
           AND FUNCTION NUMVAL(01EXP005IN)  > 13
           AND FUNCTION NUMVAL(01EXP006CT)  > 120
             MOVE  823                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  <= 1
           AND FUNCTION NUMVAL(01ACP013CC)  <= 5
           AND MOB48  <= 4
           AND FUNCTION NUMVAL(01MOR061CC)  > 6
           AND 02EXP002TO  > 9
             MOVE  820                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01ACP008CT)  <= 7
           AND FUNCTION NUMVAL(01MOR069CC)  > 1
           AND FUNCTION NUMVAL(01MOR075CC)  > 30
             MOVE  780                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  <= 2
MOESJU     AND FUNCTION NUMVAL(01EXP011CT)  > 3                         DLM0002
             MOVE  527                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  <= 70
           AND FUNCTION NUMVAL(01EXP005IN)  <= 45
           AND FUNCTION NUMVAL(01EXP008CC)  > 2
             MOVE  549                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  <= 1
           AND EVER24P  <= 4
           AND FUNCTION NUMVAL(01EXP002IN)  > 70
             MOVE  547                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  <= 2
           AND FUNCTION NUMVAL(01ACP004CT)  <= 2
           AND FUNCTION NUMVAL(01MOR046OT)  > 1
             MOVE  542                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  <= 6
           AND 02EXP003TO  <= 294
           AND FUNCTION NUMVAL(01ACP007AH)  > 2
           AND FUNCTION NUMVAL(01ACP004CT)  > 1
             MOVE  763                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  <= 8
           AND FUNCTION NUMVAL(01EXP002OT)  <= 78
           AND FUNCTION NUMVAL(01ACP004CC)  > 6
             MOVE  559                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  <= 94
MOESJU     AND FUNCTION NUMVAL(01EXP012OT)  <= 3                        DLM0002
           AND FUNCTION NUMVAL(01MOR075CC)  > 13
           AND EVER24P  > 8
           AND FUNCTION NUMVAL(01MOR027CC)  > 0
             MOVE  720                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  <= 0
           AND FUNCTION NUMVAL(01EXP002CC)  > 9
           AND FUNCTION NUMVAL(01EXP004CT)  <= 175
           AND FUNCTION NUMVAL(01EXP005IN)  <= 114
           AND FUNCTION NUMVAL(01ACP001OT)  <= 4
           AND RECMORA90  > 12
           AND 02EXP002TO  > 94
             MOVE  704                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  <= 11
           AND FUNCTION NUMVAL(01MOR046OT)  <= 0
           AND FUNCTION NUMVAL(01MOR098CC)  <= 93.620
           AND EVER24P60  <= 0
           AND 01INQ001  <= 0
             MOVE  888                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  <= 11
           AND FUNCTION NUMVAL(01MOR046OT)  <= 0
           AND FUNCTION NUMVAL(01MOR098CC)  <= 93.620
           AND EVER24P60  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01ACP004CT)  <= 0
           AND FUNCTION NUMVAL(01ACP003CC)  <= 2
           AND 02EXP006TO  > 32
             MOVE  720                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  <= 11
           AND FUNCTION NUMVAL(01MOR046OT)  <= 0
           AND FUNCTION NUMVAL(01MOR098CC)  <= 93.620
           AND EVER24P60  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01ACP004CT)  <= 0
           AND FUNCTION NUMVAL(01ACP003CC)  > 2
             MOVE  778                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  <= 11
           AND FUNCTION NUMVAL(01MOR046OT)  <= 0
           AND FUNCTION NUMVAL(01MOR098CC)  <= 93.620
           AND EVER24P60  <= 0
           AND 01INQ001  > 0
           AND FUNCTION NUMVAL(01ACP004CT)  > 0
             MOVE  851                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  <= 11
           AND FUNCTION NUMVAL(01MOR046OT)  <= 0
           AND FUNCTION NUMVAL(01MOR098CC)  <= 93.620
           AND EVER24P60  > 0
             MOVE  829                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  <= 11
           AND FUNCTION NUMVAL(01MOR046OT)  > 0
             MOVE  871                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  <= 47
           AND FUNCTION NUMVAL(01ACP008CT)  > 11
             MOVE  967                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  > 47
           AND FUNCTION NUMVAL(01MOR034CC)  <= 1
           AND FUNCTION NUMVAL(01ACP008OT)  <= 12
           AND FUNCTION NUMVAL(01EXP003CC)  <= 90
             MOVE  665                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  <= 4
           AND FUNCTION NUMVAL(01MOR034CC)  > 0
           AND FUNCTION NUMVAL(01MOR076RO)  > 47
           AND FUNCTION NUMVAL(01MOR034CC)  <= 1
           AND FUNCTION NUMVAL(01ACP008OT)  > 12
             MOVE  864                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  <= 0
           AND EVER24P60  > 4
             MOVE  794                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  <= 391
           AND FUNCTION NUMVAL(01MOR008CC)  > 0
           AND FUNCTION NUMVAL(01EXP003CC)  <= 102
             MOVE  817                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  <= 0
           AND OPEN12  > 391
             MOVE  857                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  > 0
           AND FUNCTION NUMVAL(01MOR075CC)  <= 17
             MOVE  831                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  > 0
           AND FUNCTION NUMVAL(01MOR075CC)  > 17
           AND FUNCTION NUMVAL(01EXP001CC)  <= 75
             MOVE  807                 TO  WS-ARB-SCORE
           ELSE
           IF  FUNCTION NUMVAL(01MOR035CC)  > 0
           AND FUNCTION NUMVAL(01MOR075CC)  > 17
           AND FUNCTION NUMVAL(01EXP001CC)  > 75
           AND FUNCTION NUMVAL(02EXP008TO)  <= 22.580
           AND 02EXP005TO  > 18
             MOVE  647                 TO  WS-ARB-SCORE
           ELSE
             MOVE "J"                  TO  WS-CODEVA-SCODRU
             MOVE "J86h"               TO  W-TEM-RAZON-NUEVA
             PERFORM  7500-REUBICA-RAZONES
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF
           END-IF.
      *
       2000-MODELO-ESTADISTICO-JUR.
INICIA     MOVE  ZEROS                 TO  WS-ARB-SCORE                 DLM0003
CQ1781*    IF (W-NUM-ACT-SINEXP  +  W-NUM-ACT-CONEXP)  >  0  AND        DLM0005
CQ1781*        W-CONT-REPOR-MODEST  >=  6                               DLM0005
CQ1781     IF (W-NUM-ACT-SINEXP  +  W-NUM-ACT-CONEXP)  >  0  AND        DLM0005
CQ1781       ((W-CONT-REPOR-MODEST  >=  6  AND                          DLM0005
CQ1781         PROGRAMA-EMAIL(1:6)  =  "ICGS07")  OR                    DLM0005
CQ1781        (W-CONT-REPOR-MODEST  >=  9  AND                          DLM0005
CQ1781         PROGRAMA-EMAIL(1:6)  =  "ICGS06"))                       DLM0005
             MOVE  ENT-TIPO-ID         TO  TIPO-ID-CARACT
             MOVE  ENT-NUME-ID         TO  NRO-ID-CARACT
             MOVE  PARAM-FECHA(1:6)    TO  FECHA-RUN-CARACT
             MOVE  ZEROS               TO
                   GEN-NUM-CARACT  GEN-END-CARACT
             MOVE  1                   TO
                   GEN-INQ-CARACT  GEN-MOR-CARACT  GEN-EXP-CARACT
                   GEN-DEM-CARACT  GEN-ACP-CARACT
             MOVE  SPACES              TO  WS-CODEVA-SCODRU
MOESJU       MOVE  AMNISTIA21-LEEMSTRS TO  AMNISTIA21-LEEMSTRS-AUX      DLM0002
MOESJU       MOVE  SW-ART13-AMNIST21   TO  SW-ART13-AMNIST21-AUX        DLM0002
MODIF1*      MOVE  0                   TO  AMNISTIA21-LEEMSTRS          DLM0004
MODIF1*      MOVE  0                   TO  SW-ART13-AMNIST21            DLM0004
MODIF1       MOVE  1                   TO  AMNISTIA21-LEEMSTRS          DLM0004
MODIF1       MOVE  1                   TO  SW-ART13-AMNIST21            DLM0004
MODCAR       PERFORM 0045-CONSULTA-CARACT                               CIG0005
MODCAR       IF SW-CALCULA-CAR = 1                                      CIG0005
MODCAR          PERFORM  1000-CALCULAR-CARACTERISTICAS                  CIG0005
MODCAR       END-IF                                                     CIG0005
MOESJU       MOVE  AMNISTIA21-LEEMSTRS-AUX TO AMNISTIA21-LEEMSTRS       DLM0002
MOESJU       MOVE  SW-ART13-AMNIST21-AUX   TO SW-ART13-AMNIST21         DLM0002
             PERFORM  1500-ARBOL-DECISION
             IF  WS-CODEVA-SCODRU  =  SPACES
               IF  WS-ARB-SCORE  <  79
                 MOVE "A"              TO  WS-CODEVA-SCODRU
               ELSE
                 IF  WS-ARB-SCORE  <  293
                   MOVE "B"            TO  WS-CODEVA-SCODRU
                 ELSE
                   IF  WS-ARB-SCORE  <  528
                     MOVE "C"          TO  WS-CODEVA-SCODRU
CQ1781               IF  PROGRAMA-EMAIL(1:6)  =  "ICGS06"               DLM0005
CQ1781                 MOVE "D"        TO  WS-CODEVA-SCODRU             DLM0005
CQ1781               END-IF                                             DLM0005
                   ELSE
                     IF  WS-ARB-SCORE  <  650
                       MOVE "D"        TO  WS-CODEVA-SCODRU
                     ELSE
                       IF  WS-ARB-SCORE  <  746
                         MOVE "E"      TO  WS-CODEVA-SCODRU
                       ELSE
                         MOVE "P"      TO  WS-CODEVA-SCODRU
                       END-IF
                     END-IF
                   END-IF
                 END-IF
               END-IF
INICIA         STRING                                                   DLM0003
INICIA            WS-CODEVA-SCODRU                    DELIMITED BY SIZE DLM0003
INICIA           "86s"                                DELIMITED BY SIZE DLM0003
INICIA                               INTO  W-TEM-RAZON-NUEVA            DLM0003
INICIA         END-STRING                                               DLM0003
INICIA         PERFORM  7500-REUBICA-RAZONES                            DLM0003
             END-IF
             MOVE "PRO"                TO  OTRO-PRO-EXT
             MOVE  ZEROS               TO  V-CUAL-PRO-EXT
MOESJU       MOVE  66                  TO  CUAL-PRO-EXT(01)             DLM0002
             MOVE  WS-ARB-SCORE        TO  WS-CALIF-DEF-SCODRU
           ELSE
             MOVE "J"                  TO  WS-CODEVA-SCODRU
INICIA       MOVE "J86i"               TO  W-TEM-RAZON-NUEVA            DLM0003
             PERFORM  7500-REUBICA-RAZONES
           END-IF
           PERFORM  3000-RECLA-MODELO-JUR.
      *
       3000-RECLA-MODELO-JUR.
           IF  SW-DESCALIFICA  =  1  OR
               SW-ENDEUDA-GLO  =  1
             MOVE "P"                  TO  WS-CODEVA-SCODRU
             MOVE "P86a"               TO  W-TEM-RAZON-NUEVA
             PERFORM  7500-REUBICA-RAZONES
           END-IF
           IF (W-NUM-ACT-SINEXP  +  W-NUM-ACT-CONEXP)  =
               W-NUM-ACT-MENOS-12MESES            AND
               W-NUM-ACT-MENOS-12MESES  >  ZEROS  AND
               WS-CODEVA-SCODRU  =  "A"
             MOVE "B"                  TO  WS-CODEVA-SCODRU
             MOVE "B86b"               TO  W-TEM-RAZON-NUEVA
             PERFORM  7500-REUBICA-RAZONES
           END-IF
           IF (W-NUM-ACT-SINEXP  +  W-NUM-ACT-CONEXP)  =  ZEROS  AND
               WS-CODEVA-SCODRU  =  "A"                          AND
               W-ACU-NRO-CTACTEAHO  >  ZEROS
             MOVE "B"                  TO  WS-CODEVA-SCODRU
             MOVE "B86c"               TO  W-TEM-RAZON-NUEVA
             PERFORM  7500-REUBICA-RAZONES
           END-IF
           IF  WS-CODEVA-SCODRU  = "A"    AND
               W-CALIFICA-END    = "B"
             MOVE "B"                  TO  WS-CODEVA-SCODRU
             MOVE "B86d"               TO  W-TEM-RAZON-NUEVA
             PERFORM  7500-REUBICA-RAZONES
           END-IF
           IF (WS-CODEVA-SCODRU  = "A"  OR  "B")    AND
               W-CALIFICA-END   >= "C"
             MOVE "B"                  TO  WS-CODEVA-SCODRU
             MOVE "B86e"               TO  W-TEM-RAZON-NUEVA
CQ1781       IF  PROGRAMA-EMAIL(1:6)  =  "ICGS06"                       DLM0005
CQ1781         MOVE "E"                TO  WS-CODEVA-SCODRU             DLM0005
CQ1781         MOVE "E86e"             TO  W-TEM-RAZON-NUEVA            DLM0005
CQ1781       END-IF                                                     DLM0005
             PERFORM  7500-REUBICA-RAZONES
           END-IF
           IF  WS-CODEVA-SCODRU  = "A"    AND
               SW-MORA-90MAS-MESES  =  1
             MOVE "B"                  TO  WS-CODEVA-SCODRU
             MOVE "B86f"               TO  W-TEM-RAZON-NUEVA
             PERFORM  7500-REUBICA-RAZONES
           END-IF
CQ1781     IF  PROGRAMA-EMAIL(1:6)  =  "ICGS06"  AND                    DLM0005
CQ1781         W-TEM-RAZON-NUEVA  =  "P86a"                             DLM0005
CQ1781       IF  WS-ARB-SCORE  <  746                                   DLM0005
CQ1781         MOVE "E"                TO  WS-CODEVA-SCODRU             DLM0005
CQ1781         MOVE "E86a"             TO  W-TEM-RAZON-NUEVA            DLM0005
CQ1781         PERFORM  7500-REUBICA-RAZONES                            DLM0005
CQ1781       END-IF                                                     DLM0005
CQ1781     END-IF.                                                      DLM0005
      *
MODCAR*================================================================*CIG0005
MODCAR 0045-CONSULTA-CARACT.                                            CIG0005
MODCAR*================================================================*CIG0005
MODCAR        INITIALIZE SW-CALCULA-CAR SW-ERROR FIN-IND                CIG0005
MODCAR        INITIALIZE LLAVE-CARIND                                   CIG0005
MODCAR        MOVE TIPO-ID-CARACT TO TIPO-ID-CARIND                     CIG0005
MODCAR        MOVE NRO-ID-CARACT  TO NRO-ID-CARIND                      CIG0005
MODCAR        START CARACT-IND  KEY >= LLAVE-CARIND                     CIG0005
MODCAR              INVALID KEY                                         CIG0005
MODCAR                 MOVE 1 TO SW-ERROR                               CIG0005
MODCAR              NOT INVALID KEY                                     CIG0005
MODCAR                  READ CARACT-IND NEXT AT END                     CIG0005
MODCAR                       MOVE 1 TO FIN-IND                          CIG0005
MODCAR                  END-READ                                        CIG0005
MODCAR        END-START                                                 CIG0005
MODCAR        IF SW-ERROR = 0                                           CIG0005
MODCAR           IF TIPO-ID-CARACT = TIPO-ID-CARIND AND                 CIG0005
MODCAR              NRO-ID-CARACT  = NRO-ID-CARIND  AND                 CIG0005
MODCAR              IND-MATCH-CARIND = "M"                              CIG0005
MODCAR              MOVE 0    TO  SW-ERROR                              CIG0005
MODCAR$             IF  HACERMATCH = "NO"                               CIG0005
MODCAR                  MOVE 1    TO  SW-ERROR                          CIG0005
MODCAR$             END                                                 CIG0005
MODCAR           END-IF                                                 CIG0005
MODCAR        END-IF                                                    CIG0005
MODCAR        IF SW-ERROR = 0                                           CIG0005
MODCAR           IF TIPO-ID-CARACT = TIPO-ID-CARIND AND                 CIG0005
MODCAR              NRO-ID-CARACT  = NRO-ID-CARIND                      CIG0005
MODCAR              PERFORM UNTIL FIN-IND = 1 OR                        CIG0005
MODCAR                      TIPO-ID-CARACT <> TIPO-ID-CARIND OR         CIG0005
MODCAR                      NRO-ID-CARACT  <> NRO-ID-CARIND             CIG0005
MODCAR                IF NIVEL-CARIND = 01 AND TIPOL-CARIND = "NUM"     CIG0005
MODCAR                   MOVE REG-CARIND TO VAR-01NUM                   CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 01 AND TIPOL-CARIND = "INQ"     CIG0005
MODCAR                   MOVE REG02-CARIND TO VAR-01INQ                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 01 AND TIPOL-CARIND = "MOR"     CIG0005
MODCAR                   MOVE REG03-CARIND TO VAR-01MOR                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 01 AND TIPOL-CARIND = "ACP"     CIG0005
MODCAR                   MOVE REG04-CARIND TO VAR-01ACP                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 01 AND TIPOL-CARIND = "EXP"     CIG0005
MODCAR                   MOVE REG05-CARIND TO VAR-01EXP                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 01 AND TIPOL-CARIND = "DEM"     CIG0005
MODCAR                   MOVE REG06-CARIND TO VAR-01DEM                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 01 AND TIPOL-CARIND = "END"     CIG0005
MODCAR                 MOVE REG07-CARINDRO TO 01ENDRO-EDITADOS          CIG0005
MODCAR                 MOVE REG07-CARINDIN TO 01ENDIN-EDITADOS          CIG0005
MODCAR                 MOVE REG07-CARINDVE TO 01ENDVE-EDITADOS          CIG0005
MODCAR                 MOVE REG07-CARINDHP TO 01ENDHP-EDITADOS          CIG0005
MODCAR                 MOVE REG07-CARINDOT TO 01ENDOT-EDITADOS          CIG0005
MODCAR                 MOVE REG07-CARINDCC TO 01ENDCC-EDITADOS          CIG0005
MODCAR                 MOVE REG07-CARINDCO TO 01ENDCO-EDITADOS          CIG0005
MODCAR                 MOVE REG07-CARINDAH TO FILLER-01-ENDAH(1:981)    CIG0005
MODCAR                 MOVE REG07-CARINDCT TO FILLER-01-ENDCT(1:981)    CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 02 AND TIPOL-CARIND = "NUM"     CIG0005
MODCAR                   MOVE REG08-CARIND TO VAR-02MUN                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 02 AND TIPOL-CARIND = "INQ"     CIG0005
MODCAR                   MOVE REG09-CARIND TO VAR-02INQ                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 02 AND TIPOL-CARIND = "ACP"     CIG0005
MODCAR                   MOVE REG10-CARIND TO VAR-02ACP                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 02 AND TIPOL-CARIND = "EXP"     CIG0005
MODCAR                   MOVE REG11-CARIND TO VAR-02EXP                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR                IF NIVEL-CARIND = 02 AND TIPOL-CARIND = "END"     CIG0005
MODCAR                   MOVE REG12-CARIND TO VAR-02END                 CIG0005
MODCAR                END-IF                                            CIG0005
MODCAR               READ CARACT-IND NEXT AT END                        CIG0005
MODCAR                    MOVE 1 TO FIN-IND                             CIG0005
MODCAR               END-READ                                           CIG0005
MODCAR              END-PERFORM                                         CIG0005
MODCAR           ELSE                                                   CIG0005
MODCAR              MOVE 1 TO SW-CALCULA-CAR                            CIG0005
MODCAR           END-IF                                                 CIG0005 
MODCAR        ELSE                                                      CIG0005
MODCAR           MOVE 1 TO SW-CALCULA-CAR                               CIG0005
MODCAR        END-IF.                                                   CIG0005
