      * REACCESO-FD.v.0001.
      * ARCHIVO QUE CON TIENE LAS IDENTIFICACIONES QUE FALLARON POR LO MENOS DOS
      * PREGUNTAS DE UN CUESTIONARIO EN UN DIA PARA PODER CALCULAR EL REACCESO 
      * PARA LA RED NEURONAL
       FD  REACCESO.
       01  REG-REACCESO.
           03 LLAVE-REACCESO.
              05 TIPIDE-REACCESO           PIC 9(01).
              05 NUMIDE-REACCESO           PIC 9(11).
              05 FECHA-REACCESO            PIC 9(08).
