REMARK*   VERSION REVISADA PARA MILENIO - VHF                          
REMARK*   SCODRU-PROC.v.0012
REMARK*** REVISADO PARA MEJORAMIENTO OPERATIVO - VHF
REMARK******************************************************************
REMARK*             DEFINICION DE RUTINAS PARA SCORING                 *
REMARK******************************************************************
REMARK*VHF0002    *SE ADICIONA COMO PARAMETRO LA ALTURA TOTAL DE MORA  *
REMARK*VICTOR HUGO*                                                    *
REMARK*FORERO     *                                                    *
REMARK*JUL.11/2000*                                                    *
REMARK******************************************************************
REMARK*VHF0004    * SE CONTROLA PARA QUE UNA RAZON SEA MOSTRADA SOLO   *
REMARK*VICTOR HUGO* UNA VEZ, PARA ELLO SE VERIFICA EN UN ARREGLO DE    *
REMARK*FORERO     * RAZONES DESPLEGADAS.                               *
REMARK*FEB.13/2001*                                                    *
REMARK******************************************************************
REMARK*VHF0005    * VALCLA - SE CORRIGEN RUTINAS PARA VALIDAR QUE      *
REMARK*VICTOR HUGO*          EXISTEN PARAMETROS PARA DCIFRA            *
REMARK*FORERO     * VALCON - SE CONTROLAN LOS INDICES PARA VECTORES DE *
REMARK*MAR.09/2001*          CUENTAS VIGENTES Y CONSULTAS REALIZADAS   *
REMARK******************************************************************
REMARK*VHF0006    * TIPO6  - SE MODIFICA SCODRU.PROC1 PARA DETERMINAR  *
REMARK*VICTOR HUGO*          TIPO6 EN VALIDACION DE PROGRAMAS QUE NO   *
REMARK*FORERO     *          TIENEN VALIDACION PROPIA. SE ELIMINA DE   *
REMARK*JUL.10/2001*          SCODRU.PROC LA RECLASIFICACION PARA TIPO 6*
REMARK*           *          YA QUE SE ESTABA GENERANDO INCONSISTENCIA *
REMARK*           *          SE INCLUYE COMO PARAMETRO EL PRIVILEGIO DE*
REMARK*           *          VALIDAR APELLIDO DE LA CLAVE PARA USARLO  *
REMARK*           *          EN LA VALIDACION MENCIONADA.              *
REMARK******************************************************************
REMARK*VHF0007    * REGEND - SE INTRODUCE DENTRO DE LA RUTINA LA       *
REMARK*VICTOR HUGO*          SELECCION DE LOS REGISTROS A PROCESAR PARA*
REMARK*FORERO     *          ENDEUDAMIENTO. SE OMITEN LOS REGISTROS DE *
REMARK*AGO.01/2001*          CALIFICACIONES T (CUPOS), N (NO           *
REMARK*           *          CALIFICADOS) Y R (DESCONOCIDO).           *
REMARK******************************************************************
REMARK*VHF0008    * BLQMAE - SE VERIFICA SI LOS REGISTROS A PROCESAR   *
REMARK*VICTOR HUGO*    NO ESTAN BLOQUEADOS, DE LOS MAESTROS DE CARTERA,*
REMARK*FORERO     *    CUENTAS CORRIENTES Y ENDEUDAMIENTO.             *
REMARK*AGO.27/2001*                                                    *
REMARK******************************************************************
REMARK*FAC0009    * BDIEND - MODIFICACION COPYS DE ENDEUDAMIENTO       *
REMARK*F.CUADROS  * MODIFICAN VARIABLES                                *
REMARK*OCT.21/2002*                                                    *
REMARK******************************************************************
REMARK* RMB0010     * CLAS01 - SE IMPLEMENTA LA OPCION DE CLASIFICACION*
REMARK* R.MARTINEZ  *          PARA LOS SCORES GENERICO.               *
REMARK* MAR.20/2003 *                                                  *
REMARK******************************************************************
REMARK* GJC0011     * MICROC - MICROCREDITO TIPO-DEUDA = "C" SE ASOCIA *
REMARK* G.JIMENEZ   *          A CREDITO DE CONSUMO TIPO-DEUDA = "M"   *
REMARK* AGO./2003   *          ESTO PARA NO TENER QUE CAMBIAR LOS CAL- *
REMARK*             *          CULOS EN LOS SCOR                       *
REMARK******************************************************************
REMARK* VHF0012     * ENDEUD - SE VERIFICA SI ES EL PRIMER REGISTRO DE *
REMARK* VICTOR HUGO *          ENDEUDAMIENTO, CASO EN EL CUAL SE UBICA *
REMARK* FORERO      *          EL TRIMESTRE RESPECTIVO                 *
REMARK* MAR.30/2005 * IDENTI - SE VERIFICA QUE LA IDENTIFICACION TENGA *
REMARK*             *          UN ESTADO VALIDO                        *
REMARK******************************************************************

       5000-CARGAR-ESQUEMA-SCODRU.
REMARK******************************************************************
REMARK*5000-CARGAR-ESQUEMA-SCODRU.                                     *
REMARK*    CARGA TABLAS DE EVALUACION Y ARCHIVO DE PARAMETROS PARA     *
REMARK*    SCORE, SE MANEJA UNA MATRIZ DE DOS DIMENSIONES, DONDE LA    *
REMARK*    PRIMERA POSICION INDICA LA TABLA A PROCESAR Y LA SEGUNDA    *
REMARK*    EL ITEM DENTRO DE ELLA                                      *
REMARK******************************************************************
REMARK**** SE CALCULA LA FECHA DE HACE UN ANO PARA VERIFICACION DE
REMARK**** CONSULTAS
VALCON     MOVE FUNCTION CURRENT-DATE TO WS-FECCON-SCODRU               VHF0005
VALCON     COMPUTE WS-ANOCON-SCODRU = WS-ANOCON-SCODRU - 1              VHF0005
REMARK**** SE DETERMINA EL NIT DEL SUSCRIPTOR PARA VALIDAR LAS CONSULTAS
REMARK**** VALIDAS POSTERIORMENTE DEL ARCHIVO ICBCON
           MOVE WS-CODSUS-SCODRU TO COD-SUSCRIP-ABD02
           READ SUSCRIPTOR WITH IGNORE LOCK
              INVALID KEY
                 MOVE 0 TO NIT-SUSCRIP-S-ABD02
           END-READ
           MOVE NIT-SUSCRIP-S-ABD02 TO WS-SUSCON-SCODRU
           MOVE WS-EXITOSO-SCODRU TO WS-CODRET-SCODRU
           OPEN INPUT SCODTB
           PERFORM 5010-CARGAR-PARAMETROS-SCODRU
           IF WS-CODRET-SCODRU = WS-EXITOSO-SCODRU
              PERFORM 5045-CARGAR-TABLAS-SCODRU
           END-IF
           CLOSE SCODTB.

       5010-CARGAR-PARAMETROS-SCODRU.
REMARK******************************************************************
REMARK*5010-CARGAR-PARAMETROS-SCODRU.                                  *
REMARK*    CARGA LOS PARAMETROS INDEPENDIENTES PARA EVALUACION         *
REMARK******************************************************************
REMARK**** PARA OBTENER LOS VALORES DE LOS PARAMETROS INDEPENDIENTES SE
REMARK**** DEBEN TENER EN CUENTA LAS SIGUIENTES CONSIDERACIONES:
REMARK**** - EN EL ARCHIVO DE PARAMETROS DE SUSCRIPTORES, LOS PARAMETROS
REMARK****   TIENEN UN PRIMER REGISTRO DONDE SE ENCUENTRA EL NOMBRE DE
REMARK****   LA SECCION A LA QUE PERTENECE ENCERRADA EN CORCHETES "[]".
REMARK**** - EL SIGUIENTE REGISTRO CORRESPONDE AL NOMBRE DEL PARAMETRO,
REMARK****   REMATADO CON UN SIGNO IGUAL "=".
REMARK**** - EN UN SIGUIENTE REGISTRO SE HALLA EL VALOR DEL PARAMETRO.
REMARK**** - SE SIGUEN SERIES DE DOS REGISTROS DE NOMBRE Y VALOR DE
REMARK****   PARAMETRO HASTA UNA NUEVA SECCION, Y EN ELLA SE REPITE EL
REMARK****   CICLO PARA TODOS SUS PARAMETROS.
           PERFORM 5015-PARAM-TIPPER-SCODRU
           IF WS-CODRET-SCODRU = WS-EXITOSO-SCODRU
              PERFORM 5020-PARAM-EVAVAL-SCODRU
           END-IF.

       5015-PARAM-TIPPER-SCODRU.
REMARK******************************************************************
REMARK*5015-PARAM-TIPPER-SCODRU.                                       *
REMARK*    SE BUSCA EL VALOR PARA DETERMINAR SI SE UTILIZAN TABLAS DE  *
REMARK*    EVALUACION INDEPENDIENTES POR TIPO DE PERSONA O UNA GENERAL.*
REMARK*    EL VALOR POR POR OMISION ES "TABLA GENERAL"                 *
REMARK******************************************************************
REMARK**** SE ARMAN LOS PARAMETROS PARA BUSQUEDA: TITULO DE LA SECCION,
REMARK**** NOMBRE DEL PARAMETRO, LONGITUD DEL TITULO DE LA SECCION Y
REMARK**** LONGITUD DEL NOMBRE DEL PARAMETRO.
           INITIALIZE WS-ENCPAR-SCODRU
           STRING "["                  DELIMITED BY SIZE,
                  WS-ENC-TIPPER-SCODRU DELIMITED BY SIZE,
                  "]"                  DELIMITED BY SIZE
                  INTO WS-ENCPAR-SCODRU
           MOVE WS-LON-TIPPER-SCODRU TO WS-LONENC-SCODRU
           INITIALIZE WS-NOMPAR-SCODRU
           STRING WS-PAR-APLSCO-SCODRU DELIMITED BY SIZE,
                  "="               DELIMITED BY SIZE
                  INTO WS-NOMPAR-SCODRU
           MOVE WS-LON-APLSCO-SCODRU TO WS-LONNOM-SCODRU
REMARK**** SE ASIGNA EL VALOR POR OMISION
           MOVE WS-VAL-GENERAL-SCODRU TO WS-VALPAR-SCODRU
           PERFORM 5030-RESOLVER-PARAM-SCODRU
REMARK**** SE ANALIZA SI EL VALOR RECIBIDO COMO RESULTADO DE LA BUSQUEDA
REMARK**** CORRESPONDE A TABLA GENERAL
VALCLA     IF WS-CODRET-SCODRU = WS-EXITOSO-SCODRU                      VHF0005
              INITIALIZE WS-I-SCODRU
              INSPECT WS-VALPAR-SCODRU TALLYING WS-I-SCODRU
                      FOR ALL WS-VAL-GENERAL-SCODRU
              IF WS-I-SCODRU > 0
                 MOVE WS-TABGEN-SCODRU TO WS-IND-TABEVA-SCODRU
              ELSE
REMARK******* SE ANALIZA SI EL VALOR RECIBIDO COMO RESULTADO DE LA
REMARK******* BUSQUEDA CORRESPONDE A TABLA DIFERENCIADA
                 INITIALIZE WS-I-SCODRU
                 INSPECT WS-VALPAR-SCODRU TALLYING WS-I-SCODRU
                         FOR ALL WS-VAL-DIFERENC-SCODRU
                 IF WS-I-SCODRU > 0
                    MOVE WS-TABDIF-SCODRU TO WS-IND-TABEVA-SCODRU
                 ELSE
REMARK********** SE RETORNA ERROR SI NO SE ENCONTRO UN VALOR
REMARK********** VALIDO ASIGNADO AL PARAMETRO
                    MOVE WS-ERR-PARTIPPER-SCODRU  TO WS-CODRET-SCODRU
                 END-IF
              END-IF
VALCLA     END-IF.                                                      VHF0005

       5020-PARAM-EVAVAL-SCODRU.
REMARK******************************************************************
REMARK*5020-PARAM-EVAVAL-SCODRU.                                       *
REMARK*    SE BUSCA EL VALOR PARA DETERMINAR COMO PROCESAR LOS VALORES *
REMARK*    CUANDO UNA ENTIDAD DE LAS REPORTANTES NO LO ENVIA. EL VALOR *
REMARK*    POR OMISION ES "APLICAR UNICAMENTE SI EXISTEN TODOS"        *
REMARK******************************************************************
REMARK**** SE ARMAN LOS PARAMETROS PARA BUSQUEDA: TITULO DE LA SECCION,
REMARK**** NOMBRE DEL PARAMETRO, LONGITUD DEL TITULO DE LA SECCION Y DEL
REMARK**** NOMBRE DEL PARAMETRO.
           INITIALIZE WS-ENCPAR-SCODRU
           STRING "["                   DELIMITED BY SIZE,
                  WS-ENC-EVAVAL-SCODRU  DELIMITED BY SIZE,
                  "]"                   DELIMITED BY SIZE
                  INTO WS-ENCPAR-SCODRU
           MOVE WS-LON-EVAVAL-SCODRU TO WS-LONENC-SCODRU
           INITIALIZE WS-NOMPAR-SCODRU
           STRING WS-PAR-VALNREP-SCODRU DELIMITED BY SIZE,
                  "="                   DELIMITED BY SIZE
                  INTO WS-NOMPAR-SCODRU
           MOVE WS-LON-VALNREP-SCODRU TO WS-LONNOM-SCODRU
REMARK**** SE ASIGNA EL VALOR POR OMISION
           MOVE WS-VAL-EXTODOS-SCODRU TO WS-VALPAR-SCODRU
           PERFORM 5030-RESOLVER-PARAM-SCODRU
REMARK**** SE ANALIZA EL VALOR RECIBIDO COMO RESULTADO DE LA BUSQUEDA
REMARK**** PARA VERIFICAR SI CORRESPONDE A TOMAR VALORES NO REPORTADOS
REMARK**** COMO CEROS
VALCLA     IF WS-CODRET-SCODRU = WS-EXITOSO-SCODRU                      VHF0005
              INITIALIZE WS-I-SCODRU
              INSPECT WS-VALPAR-SCODRU TALLYING WS-I-SCODRU
                      FOR ALL WS-VAL-CEROS-SCODRU
              IF WS-I-SCODRU > 0
                 MOVE WS-VALCER-SCODRU TO WS-IND-EVAVAL-SCODRU
              ELSE
REMARK******* SE ANALIZA EL VALOR RECIBIDO COMO RESULTADO DE LA BUSQUEDA
REMARK******* PARA VERIFICAR SI CORRESPONDE A TOMAR VALORES NO
REMARK******* REPORTADOS COMO EL PROMEDIO DE LOS SI REPORTADOS
                 INITIALIZE WS-I-SCODRU
                 INSPECT WS-VALPAR-SCODRU TALLYING WS-I-SCODRU
                         FOR ALL WS-VAL-PROMEDIO-SCODRU
                 IF WS-I-SCODRU > 0
                    MOVE WS-VALPRO-SCODRU TO WS-IND-EVAVAL-SCODRU
                 ELSE
REMARK********** SE ANALIZA EL VALOR RECIBIDO COMO RESULTADO DE LA
REMARK********** BUSQUEDA PARA VERIFICAR SI CORRESPONDE A TOMAR VALORES
REMARK********** SOLO SI SON REPORTADOS TODOS
                    INITIALIZE WS-I-SCODRU
                    INSPECT WS-VALPAR-SCODRU TALLYING WS-I-SCODRU
                            FOR ALL WS-VAL-EXTODOS-SCODRU
                    IF WS-I-SCODRU > 0
REMARK************* COMO SE SOLICITO VERIFICAR TODOS LOS VALORES SE
REMARK************* UTILIZA UNA VARIABLE INDICADORA INICIALIZADA EN
REMARK************* VERDADERO, QUE POSTERIORMENTE CAMBIARA A FALSO SI
REMARK************* ALGUN VALOR ES NO REPORTADO.
                       MOVE WS-SI-SCODRU TO WS-TODVAL-SCODRU
                       MOVE WS-VALEXT-SCODRU TO WS-IND-EVAVAL-SCODRU
                    ELSE
REMARK************* SE RETORNA ERROR SI NO SE ENCONTRO UN VALOR
REMARK************* VALIDO ASIGNADO AL PARAMETRO
                       MOVE WS-ERR-PAREVAVAL-SCODRU TO WS-CODRET-SCODRU
                    END-IF
                 END-IF
              END-IF
VALCLA     END-IF.                                                      VHF0005

       5030-RESOLVER-PARAM-SCODRU.
REMARK******************************************************************
REMARK*5030-RESOLVER-PARAM-SCODRU.                                     *
REMARK*    UBICA Y RETORNA EL VALOR DEL PARAMETRO SOLICTADO EN LAS     *
REMARK*    VARIABLES WS-ENCPAR-SCODRU, WS-NOMPAR-SCODRU,               *
REMARK*    WS-LONNOM-SCODRU  Y WS-LONENC-SCODRU.                       *
REMARK******************************************************************
REMARK**** SE RECORRE EL ARCHIVO DE PARAMETROS DE SUSCRIPTORES PARA
REMARK**** UBICAR LO REFERENTE A LOS PARAMETROS INDEPENDIENTES
           MOVE WS-CODSUS-SCODRU  TO CODSUS-SCODTB
           MOVE WS-TIPSCO-SCODRU  TO TIPSCO-SCODTB
           MOVE WS-CODSCO-SCODRU  TO CODSCO-SCODTB
           MOVE WS-ARCH-PARAMETROS-SCODRU TO SUBTAB-SCODTB
           MOVE 0                 TO INDSUB-SCODTB
           MOVE WS-NO-SCODRU      TO WS-FDA-SCODTB-SCODRU
           START SCODTB KEY IS >= LLAVE-SCODTB
              INVALID KEY
                 MOVE WS-SI-SCODRU TO WS-FDA-SCODTB-SCODRU
                 MOVE WS-ERR-SINARI-SCODRU TO WS-CODRET-SCODRU
           END-START
           IF WS-FDA-SCODTB-SCODRU = WS-NO-SCODRU
              PERFORM 5100-LEER-SCODTB-SCODRU
              IF WS-FDA-SCODTB-SCODRU = WS-SI-SCODRU
                 MOVE WS-ERR-SINARI-SCODRU TO WS-CODRET-SCODRU
VALCLA        ELSE                                                      VHF0005
VALCLA           IF WS-CODSUS-SCODRU <> CODSUS-SCODTB OR                VHF0005
VALCLA              WS-TIPSCO-SCODRU <> TIPSCO-SCODTB OR                VHF0005
VALCLA              WS-CODSCO-SCODRU <> CODSCO-SCODTB OR                VHF0005
VALCLA              WS-ARCH-PARAMETROS-SCODRU <> SUBTAB-SCODTB          VHF0005
VALCLA              MOVE WS-ERR-SINARI-SCODRU TO WS-CODRET-SCODRU       VHF0005
VALCLA           END-IF                                                 VHF0005
              END-IF
VALCLA        IF WS-CODRET-SCODRU = WS-EXITOSO-SCODRU                   VHF0005
                 PERFORM 5033-UBICAR-ENCAB-SCODRU                       
VALCLA        END-IF                                                    VHF0005
           END-IF.
             
       5033-UBICAR-ENCAB-SCODRU.
REMARK******************************************************************
REMARK*5033-UBICAR-ENCAB-SCODRU.                                       *
REMARK*    UBICA EL ENCABEZADO DE LA SECCION INDICADA EN LAS VARIABLES *
REMARK*    DE LLAMADO WS-ENCPAR-SCODRU Y WS-LONENC-SCODRU              *
REMARK******************************************************************
           MOVE WS-NO-SCODRU TO WS-ENCENC-SCODRU
REMARK**** SE PROCESA HASTA FINALIZAR EL ARCHIVO O CAMBIAR EL ANALISIS
REMARK**** DE LOS REGISTROS CORRESPONDIENTES AL SCORING SOLICITADO O
REMARK**** ENCONTRAR LA SECCION BUSCADA
           PERFORM UNTIL WS-FDA-SCODTB-SCODRU = WS-SI-SCODRU OR
              CODSUS-SCODTB <> WS-CODSUS-SCODRU OR
              TIPSCO-SCODTB <> WS-TIPSCO-SCODRU OR
              CODSCO-SCODTB <> WS-CODSCO-SCODRU OR
              SUBTAB-SCODTB <> WS-ARCH-PARAMETROS-SCODRU OR
              WS-ENCENC-SCODRU  = WS-SI-SCODRU
REMARK******* SE INSPECCIONA EL CAMPO EN EL ARCHIVO PARA VERIFICAR SI
REMARK******* CORRESPONDE AL TITULO DE LA SECCION BUSCADA
              MOVE 0 TO WS-I-SCODRU
              INSPECT VALPAR-SCODTB TALLYING WS-I-SCODRU
                      FOR ALL WS-ENCPAR-SCODRU(1:WS-LONENC-SCODRU)
              PERFORM 5100-LEER-SCODTB-SCODRU
              IF WS-I-SCODRU > 0
                 MOVE WS-SI-SCODRU TO WS-ENCENC-SCODRU
VALCLA           IF WS-CODRET-SCODRU = WS-EXITOSO-SCODRU                VHF0005
                    PERFORM 5036-UBICAR-PARAM-SCODRU
VALCLA           END-IF                                                 VHF0005
              END-IF
           END-PERFORM.

       5036-UBICAR-PARAM-SCODRU.
REMARK******************************************************************
REMARK*5036-UBICAR-PARAM-SCODRU.                                       *
REMARK*    UBICA EL NOMBRE DEL PARAMETRO SOLICITADO                    *
REMARK******************************************************************
           MOVE WS-NO-SCODRU TO WS-ENCNPA-SCODRU
REMARK**** SE PROCESA HASTA FINALIZAR EL ARCHIVO O CAMBIAR EL ANALISIS
REMARK**** DE LOS REGISTROS CORRESPONDIENTES AL SCORING SOLICITADO O
REMARK**** ENCONTRAR EL NOMBRE DEL PARAMETRO BUSCADO
           PERFORM UNTIL WS-FDA-SCODTB-SCODRU = WS-SI-SCODRU OR
              CODSUS-SCODTB <> WS-CODSUS-SCODRU OR
              TIPSCO-SCODTB <> WS-TIPSCO-SCODRU OR
              CODSCO-SCODTB <> WS-CODSCO-SCODRU OR
              SUBTAB-SCODTB <> WS-ARCH-PARAMETROS-SCODRU OR
              WS-ENCNPA-SCODRU  = WS-SI-SCODRU
REMARK******* SE VERIFICA SI SE EL REGISTRO LEIDO CORREPONDE AL NOMBRE
REMARK******* DEL PARAMETRO BUSCADO
              MOVE 0 TO WS-I-SCODRU
              INSPECT VALPAR-SCODTB TALLYING WS-I-SCODRU
                      FOR ALL WS-NOMPAR-SCODRU(1:WS-LONNOM-SCODRU)
              IF WS-I-SCODRU > 0
                 MOVE WS-SI-SCODRU TO WS-ENCNPA-SCODRU
REMARK********** SE INICIA LA BUSQUEDA DEL VALOR DEL PARAMETRO
                 PERFORM 5100-LEER-SCODTB-SCODRU
                 IF WS-FDA-SCODTB-SCODRU = WS-NO-SCODRU     AND
                    CODSUS-SCODTB     = WS-CODSUS-SCODRU AND
                    TIPSCO-SCODTB     = WS-TIPSCO-SCODRU AND
                    CODSCO-SCODTB     = WS-CODSCO-SCODRU AND
                    SUBTAB-SCODTB     = WS-ARCH-PARAMETROS-SCODRU
REMARK************* SI EL REGISTRO LEIDO CORRESPONDE A UN NUEVO
REMARK************* ENCABEZADO SE ASUME QUE NO SE DEFINIO EL VALOR DEL
REMARK************* PARAMETRO BUSCADO
                    MOVE 0 TO WS-I-SCODRU
                    INSPECT VALPAR-SCODTB TALLYING WS-I-SCODRU
                            FOR ALL "["
                    IF WS-I-SCODRU = 0
                       INSPECT VALPAR-SCODTB TALLYING WS-I-SCODRU
                               FOR ALL "="
REMARK**************** SI EL REGISTRO LEIDO CORRESPONDE A UN NUEVO
REMARK**************** NOMBRE DE PARAMETRO SE ASUME QUE NO SE DEFINIO EL
REMARK**************** VALOR DEL PARAMETRO BUSCADO
                       IF WS-I-SCODRU = 0
REMARK******************* SE TOMA EL VALOR DE PARAMETRO
                          MOVE VALPAR-SCODTB TO WS-VALPAR-SCODRU
                       ELSE
                          MOVE SPACES TO WS-VALPAR-SCODRU
                       END-IF
                    ELSE
                       MOVE SPACES TO WS-VALPAR-SCODRU
                    END-IF
                 END-IF
              ELSE
REMARK********** SI EL REGISTRO LEIDO NO CORRESPONDIA AL NOMBRE DEL
REMARK********** PARAMETRO BUSCADO, SE VERIFICA QUE NO SEA UNA NUEVA
REMARK********** SECCION, CASO EN EL CUAL TERMINARIA LA BUSQUEDA. EN
REMARK********** CASO CONTRARIO SE ASUME QUE ES OTRO PARAMETRO DE LA
REMARK********** MISMA SECCION Y SE LEE EL SIGUIENTE REGISTRO PARA
REMARK********** BUSCAR EL NOMBRE SOLICITADO
                 INSPECT VALPAR-SCODTB TALLYING WS-I-SCODRU
                         FOR ALL "["
                 IF WS-I-SCODRU > 0
                    MOVE WS-SI-SCODRU TO WS-FDA-SCODTB-SCODRU
                 ELSE
                    PERFORM 5100-LEER-SCODTB-SCODRU
                 END-IF
              END-IF
           END-PERFORM.

       5045-CARGAR-TABLAS-SCODRU.
REMARK******************************************************************
REMARK*5045-CARGAR-TABLAS-SCODRU.                                      *
REMARK*    CARGA TABLAS DE EVALUACION DEL ARCHIVO DE PARAMETROS PARA   *
REMARK*    EL SUSCRIPTOR RESPECTIVO. ESTA TABLA CORRESPONDE A LA MATRIZ*
REMARK*    DE DOS DIMENSIONES MENCIONADA ANTERIORMENTE EN LA RUTINA QUE*
REMARK*    HACE EL LLAMADO.                                            *
REMARK******************************************************************
REMARK**** SE INICIALIZA LA TABLA
           MOVE SPACES TO WS-ESQEVA-SCODRU
           MOVE WS-CODSUS-SCODRU  TO CODSUS-SCODTB
           MOVE WS-TIPSCO-SCODRU  TO TIPSCO-SCODTB
           IF WS-IND-TABEVA-SCODRU = WS-TABDIF-SCODRU
REMARK******* SE APLICA LA TABLA DE ACUERDO AL TIPO DE PERSONA SI ASI LO
REMARK******* INDICA EL PARAMETRO, EN CASO CONTRARIO SE SELECCIONA LA
REMARK******* TABLA GENERAL
              IF WS-TABPER-SCODRU (WS-TIDCIU-SCODRU) =
                 WS-PJURIDICA-SCODRU
REMARK********** LA TABLA DE PERSONAS JURIDICAS SE DIFERENCIA DE LA
REMARK********** TABLA DE PERSONAS NATURALES EN QUE EL CODIGO DE SCORE
REMARK********** ES 10 UNIDADES MAYOR ASI: PARA UNA TABLA NATURAL CON
REMARK********** CODIGO SCORE 03 LE CORRESPONDIENTE LA TABLA JURIDICA 13
REMARK********** AQUI SE HACE LA CONVERSION
                 ADD 10 TO WS-CODSCO-SCODRU
              END-IF
           END-IF
           MOVE WS-CODSCO-SCODRU  TO CODSCO-SCODTB
           MOVE 0                 TO SUBTAB-SCODTB
           MOVE 0                 TO INDSUB-SCODTB
           MOVE WS-EXITOSO-SCODRU TO WS-CODRET-SCODRU
           MOVE WS-NO-SCODRU      TO WS-FDA-SCODTB-SCODRU
           START SCODTB KEY IS >= LLAVE-SCODTB
              INVALID KEY
                 MOVE WS-SI-SCODRU TO WS-FDA-SCODTB-SCODRU
                 MOVE WS-ERR-SINTBL-SCODRU TO WS-CODRET-SCODRU
           END-START
           IF WS-FDA-SCODTB-SCODRU = WS-NO-SCODRU
              PERFORM 5100-LEER-SCODTB-SCODRU
              IF WS-FDA-SCODTB-SCODRU = WS-SI-SCODRU
                 MOVE WS-ERR-SINTBL-SCODRU TO WS-CODRET-SCODRU
VALCLA        ELSE                                                        VHF0005
VALCLA           IF CODSUS-SCODTB <> WS-CODSUS-SCODRU OR                  VHF0005
VALCLA              TIPSCO-SCODTB <> WS-TIPSCO-SCODRU OR                  VHF0005
VALCLA              CODSCO-SCODTB <> WS-CODSCO-SCODRU                     VHF0005
VALCLA              MOVE WS-ERR-SINTBL-SCODRU TO WS-CODRET-SCODRU         VHF0005
VALCLA           END-IF                                                   VHF0005
              END-IF
           END-IF
           PERFORM UNTIL WS-FDA-SCODTB-SCODRU = WS-SI-SCODRU OR
              CODSUS-SCODTB <> WS-CODSUS-SCODRU OR
              TIPSCO-SCODTB <> WS-TIPSCO-SCODRU OR
              CODSCO-SCODTB <> WS-CODSCO-SCODRU
REMARK******* SE PROCESAN LAS TABLAS SOLO SI EL CODIGO DE SUBTABLA Y EL
REMARK******* INDICE SON VALIDOS
              IF SUBTAB-SCODTB > 0 AND SUBTAB-SCODTB <= 20 AND
                 INDSUB-SCODTB > 0
REMARK********** SE ALMACENA EN LA MATRIZ DE TABLAS DE EVALUACION EL
REMARK********** TIPO DE TABLA LEIDO
                 MOVE TIPTAB-SCODTB TO WS-TIPTAB-SCODRU (SUBTAB-SCODTB)
REMARK********** SE PROCESA EL REGISTRO DE ACUERDO AL TIPO DE TABLA
                 EVALUATE TIPTAB-SCODTB
REMARK************* TABLA PARA TIPOS DE EVALUACION
                    WHEN WS-TT-TIPEVA-SCODRU
REMARK**************** SE CAPTURA CON LA SIGUIENTE INSTRUCCION EL
REMARK**************** NUMERO DE EVALUACIONES UTILIZADOS POR EL
REMARK**************** SUSCRIPTOR, BASADOS EN QUE LA PRIMERA DESCRIPCION
REMARK**************** EN BLANCO YA NO ES EVALUACION HABILITADA
                       IF IDEEVA-SCODTB <> SPACES
                          MOVE INDSUB-SCODTB TO WS-NUMEVA-SCODRU
                       END-IF
REMARK**************** SE MUEVEN ESPACIOS PARA INICIALIZAR EL REGISTRO
REMARK**************** EN BLANCOS INCLUYENDO LOS FILLER, Y LUEGO SE
REMARK**************** INICIALIZA PARA QUE LOS VALORES NUMERICOS QUEDEN
REMARK**************** EN CEROS.
                       MOVE SPACES
                       TO WS-INDTEV-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       INITIALIZE
                          WS-INDTEV-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE IDEEVA-SCODTB
                       TO WS-IDEEVA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE DESEVA-SCODTB
                       TO WS-DESEVA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE MINEVA-SCODTB
                       TO WS-MINEVA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE DEFEVA-SCODTB
                       TO WS-DEFEVA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
REMARK************* TABLAS PARA TIPO DE CUENTA
                    WHEN WS-TT-TIPCTA-SCODRU
REMARK**************** SE MUEVEN ESPACIOS PARA INICIALIZAR EL REGISTRO
REMARK**************** EN BLANCOS INCLUYENDO LOS FILLER, Y LUEGO SE
REMARK**************** INICIALIZA PARA QUE LOS VALORES NUMERICOS QUEDEN
REMARK**************** EN CEROS.
                       MOVE SPACES
                       TO WS-INDTCT-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       INITIALIZE
                          WS-INDTCT-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE PESCTA-SCODTB
                       TO WS-PESCTA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE MINCTA-SCODTB
                       TO WS-MINCTA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE PSNCTA-SCODTB
                       TO WS-PSNCTA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
REMARK************* TABLAS DE CALIFICACION
                    WHEN WS-TT-CALIFI-SCODRU
REMARK**************** SE MUEVEN ESPACIOS PARA INICIALIZAR EL REGISTRO
REMARK**************** EN BLANCOS INCLUYENDO LOS FILLER, Y LUEGO SE
REMARK**************** INICIALIZA PARA QUE LOS VALORES NUMERICOS QUEDEN
REMARK**************** EN CEROS.
                       MOVE SPACES
                       TO WS-INDTCA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       INITIALIZE
                          WS-INDTCA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE NOTCAL-SCODTB
                       TO WS-NOTCAL-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE EVACAL-SCODTB
                       TO WS-EVACAL-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE MAXCAL-SCODTB
                       TO WS-MAXCAL-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE ESNCAL-SCODTB
                       TO WS-ESNCAL-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
CLAS01              WHEN WS-TT-TIPREC-SCODRU                            RMB0010 
REMARK*                SE GUARDAN LAS CLASIFICACINES EN MEMORIA
CLAS01                 MOVE "SI" TO                                     RMB0010 
CLAS01                    WS-HAYCLA-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)RMB0010 
CLAS01                 MOVE RANINI-SCODTB TO                            RMB0010 
CLAS01                    WS-RANINI-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)RMB0010 
CLAS01                 MOVE RANFIN-SCODTB TO                            RMB0010 
CLAS01                    WS-RANFIN-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)RMB0010 
CLAS01                 MOVE CLASIF-SCODTB TO                            RMB0010 
CLAS01                    WS-CLASIF-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)RMB0010 
CLAS01                 MOVE RECLAS-SCODTB TO                            RMB0010 
CLAS01                    WS-RECLAS-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)RMB0010 
CLAS01                 MOVE RECRAZ-SCODTB TO                            RMB0010 
CLAS01                    WS-RECRAZ-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)RMB0010 
REMARK************* TABLAS DE ESTADOS
                    WHEN WS-TT-ESTUVO-SCODRU
REMARK**************** SE MUEVEN ESPACIOS PARA INICIALIZAR EL REGISTRO
REMARK**************** EN BLANCOS INCLUYENDO LOS FILLER, Y LUEGO SE
REMARK**************** INICIALIZA PARA QUE LOS VALORES NUMERICOS QUEDEN
REMARK**************** EN CEROS.
                       MOVE SPACES
                       TO WS-INDIES-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       INITIALIZE
                          WS-INDIES-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE ACTEST-SCODTB
                       TO WS-ACTEST-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                       MOVE HISEST-SCODTB
                       TO WS-HISEST-SCODRU (SUBTAB-SCODTB,INDSUB-SCODTB)
                 END-EVALUATE
              ELSE
REMARK********** SE FORZA EL FIN DE ARCHIVO Y SE RETORNA CODIGO DE ERROR
                 MOVE WS-SI-SCODRU TO WS-FDA-SCODTB-SCODRU
                 IF SUBTAB-SCODTB = 0 OR SUBTAB-SCODTB > 20
                    MOVE WS-ERRCOD-SUBTAB-SCODRU TO WS-CODRET-SCODRU
                 ELSE
                    MOVE WS-ERRIND-SUBTAB-SCODRU TO WS-CODRET-SCODRU
                 END-IF
              END-IF
              PERFORM 5100-LEER-SCODTB-SCODRU
           END-PERFORM.

       5050-INI-VAR-EVAL-SCODRU.
REMARK******************************************************************
REMARK*5050-INI-VAR-EVAL-SCODRU.                                       *
REMARK*    SE INICIALIZAN VARIABLES, CONTADORES Y ACUMULADORES QUE     *
REMARK*    PARTICIPAN EN LA EVALUACION INDIVIDUAL DE CIUDADANOS        *
REMARK******************************************************************
           PERFORM VARYING WS-I-SCODRU FROM 1 BY 1
              UNTIL WS-I-SCODRU > 20
              PERFORM VARYING WS-J-SCODRU FROM 1 BY 1
                 UNTIL WS-J-SCODRU > 99
                 INITIALIZE WS-ACUEVA-SCODRU (WS-I-SCODRU,WS-J-SCODRU)
                 INITIALIZE WS-ESTCTA-SCODRU (WS-I-SCODRU,WS-J-SCODRU)
                 INITIALIZE WS-ACUCAL-SCODRU (WS-I-SCODRU,WS-J-SCODRU)
              END-PERFORM
           END-PERFORM
           INITIALIZE WS-ACUM-VALORES-SCODRU
           INITIALIZE WS-VCORAZ-SCODRU
           INITIALIZE WS-TABRXE-SCODRU
           INITIALIZE WS-RAZONESDEF-SCODRU
           INITIALIZE WS-TABCONSUL-SCODRU
           INITIALIZE WS-TABCAP-SCODRU
           INITIALIZE WS-EVAL-DEF-SCODRU
           INITIALIZE WS-CALIF-DEF-SCODRU
           INITIALIZE WS-SUM-CAL-X-PESO-SCODRU
           INITIALIZE WS-SUM-PESO-SCODRU
           INITIALIZE WS-CTAAPR-SCODRU
           INITIALIZE WS-CONCON-SCODRU
           INITIALIZE WS-ALMORACT-SCODRU                                VHF0002 
           INITIALIZE WS-ALMORHIS-SCODRU                                VHF0002 
ENDEUD     INITIALIZE WS-PRIMER-REG-SCODRU                              VHF0012 
           MOVE WS-NO-SCODRU TO WS-IND-CONSULTA-SCODRU
                                WS-IND-TIPO1-SCODRU.

       5100-LEER-SCODTB-SCODRU.
REMARK******************************************************************
REMARK*5100-LEER-SCODTB-SCODRU.                                        *
REMARK*    LEE ARCHIVO DE PARAMETROS DE SUSCRIPTORES PARA SCORE,       *
REMARK*    ADICIONALMENTE SE VALIDA SI HUBO ALGUN REGISTRO RECHAZADO   *
REMARK*    EN EL PROCESO DE CARGA DE PARAMETROS DEL ARCHIVO PLANO (SI  *
REMARK*    EL INDICADOR DE BLOQUEO ESTA EN 1)                          *
REMARK******************************************************************
           READ SCODTB NEXT RECORD
              AT END
                 MOVE WS-SI-SCODRU TO WS-FDA-SCODTB-SCODRU
           END-READ
           IF WS-FDA-SCODTB-SCODRU = WS-NO-SCODRU
REMARK******* SE VERIFICA SI HUBO ERROR EN EL CARGUE DE PARAMETROS, CASO
REMARK******* EN EL CUAL SE FORZA EL FIN DE ARCHIVO Y SE REGISTRA EL
REMARK******* ERROR
VALCLA        IF WS-CODSUS-SCODRU = CODSUS-SCODTB AND                   VHF0005
VALCLA           WS-TIPSCO-SCODRU = TIPSCO-SCODTB AND                   VHF0005
VALCLA           WS-CODSCO-SCODRU = CODSCO-SCODTB AND                   VHF0005
VALCLA           INDBLO-SCODTB = 1                                      VHF0005
                 MOVE WS-SI-SCODRU TO WS-FDA-SCODTB-SCODRU
                 MOVE WS-ERRBLQ-SCORE-SCODRU TO WS-CODRET-SCODRU
              END-IF
           END-IF.

       5200-PROCESE-REG-CREDIT-SCODRU.                          
REMARK******************************************************************
REMARK*5200-PROCESE-REG-CREDIT-SCODRU.                                 *
REMARK*    SE RECIBE UN REGISTRO DEL ARCHIVO MAESTRO-CREDIT (ICBCRE),  *VHF0008
REMARK*    SE VERIFICA SI ESTA BLOQUEADO Y SE PROCESA.                 *VHF0008
REMARK******************************************************************VHF0008
BLQMAE     IF IND-BLOQUEO-ABD07 = 0                                     VHF0008
BLQMAE        PERFORM 5205-PROCESAR-REGCAR-SCODRU                       VHF0008
BLQMAE     END-IF.                                                      VHF0008

BLQMAE 5205-PROCESAR-REGCAR-SCODRU.                                     VHF0008
REMARK******************************************************************VHF0008
REMARK*5205-PROCESAR-REGCAR-SCODRU.                                    *VHF0008
REMARK*    SE RECIBE UN REGISTRO DEL ARCHIVO MAESTRO-CREDIT (ICBCRE),  *VHF0008
REMARK*    SE BUSCA SU PEOR EVALUACION DE ACUERDO A SU ESTADO ACTUAL,  *VHF0008
REMARK*    ESTUVO Y ADJETIVO. SE ACUMULA SU CALIFICACION EN SU         *VHF0008
REMARK*    RESPECTIVO TIPO DE CUENTA.                                  *VHF0008
REMARK******************************************************************VHF0008
REMARK**** SE INDICA QUE SE PROCESO UNA CUENTA DE CARTERA PARA EFECTOS
REMARK**** DE RESULTADO DE CONSULTA
           MOVE WS-SI-SCODRU TO WS-IND-TIPO1-SCODRU
REMARK**** SE INICIALIZAN LOS PARAMETROS PARA LAS RUTINAS DE SELECCIONAR
REMARK**** LA EVALUACION POR CUENTA Y PARA LA SELECCION DE LA PEOR
REMARK**** EVALUACION POR TIPO CUENTA
           MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                WS-IND-ADJETIVO-SCODRU
           MOVE 0 TO WS-CALIF-SCODRU
           MOVE 0 TO WS-NUM-A-PROM-SCODRU
REMARK**** SE TOMAN LAS TABLAS DE CALIFICACION, TIPO-CUENTA Y ESTADO,
REMARK**** ADEMAS DE LOS INDICES DENTRO DE ELLAS DE ACUERDO AL ESTADO
REMARK**** DEL REGISTRO EN ANALISIS
           MOVE WS-CALIF-CARTERA-SCODRU  TO WS-TABCAL-SCODRU
           MOVE WS-ESTADO-CARTERA-SCODRU TO WS-TABEST-SCODRU
           MOVE WS-TIPCTA-HABPAGO-SCODRU TO WS-TABCTA-SCODRU
           MOVE NOV-REPORT-ABD07         TO WS-INDEST-SCODRU
           MOVE COD-CTA-ABD07            TO WS-INDCTA-SCODRU
           MOVE WS-ACTEST-SCODRU (WS-TABEST-SCODRU,WS-INDEST-SCODRU)
                TO WS-INDCAL-SCODRU
REMARK**** SE GUARDAN DATOS DE LA CUENTA VIGENTE PARA VERIFICACION
REMARK**** ICBCON (CONSULTAS VS CUENTAS APROBADAS), SE ACUMULAN VALORES
           IF NOV-REPORT-ABD07 = 01 OR 45 OR 47 OR
              (NOV-REPORT-ABD07 > 12 AND NOV-REPORT-ABD07 < 42)
              MOVE COD-SUS-ABD07 TO COD-SUSCRIP-ABD02
              READ SUSCRIPTOR WITH IGNORE LOCK
                 INVALID KEY
                    MOVE 0 TO IND-AMPLIACION-ABD02
                    MOVE 0 TO NIT-SUSCRIP-S-ABD02
              END-READ
              PERFORM 5220-ACUMULAR-VALORES-SCODRU
REMARK******* SE PROCEDE A VERIFICAR SI LA FECHA DE APERTURA ESTA       VHF0005
REMARK******* INCLUIDA EN EL ULTIMO ANO PARA VERIFICAR CONSULTAS        VHF0005
VALCON        MOVE FECHA-APERT-ABD07 TO WS-FAPAUX-SCODRU                VHF0005
VALCON        IF WS-AAPAUX-SCODRU > 70                                  VHF0005
VALCON           MOVE 19 TO WS-SGAAMM-SCODRU                            VHF0005
VALCON        ELSE                                                      VHF0005
VALCON           MOVE 20 TO WS-SGAAMM-SCODRU                            VHF0005
VALCON        END-IF                                                    VHF0005
VALCON        MOVE WS-AAPAUX-SCODRU TO WS-ANAAMM-SCODRU                 VHF0005
VALCON        MOVE WS-MAPAUX-SCODRU TO WS-MEAAMM-SCODRU                 VHF0005
VALCON        IF WS-FCAAMM-SCODRU >= WS-ANMECO-SCODRU                   VHF0005
VALCON           IF WS-CTAAPR-SCODRU < 10000                            VHF0005
REMARK******* LOS SIGUIENTES DATOS SE ALMACENAN PARA VERIFICAR SI UNA
REMARK******* CONSULTA FUE APROBADA
                    ADD 1 TO WS-CTAAPR-SCODRU
VALCON              MOVE WS-FCAAMM-SCODRU                               VHF0005
                         TO WS-FECAPR-SCODRU (WS-CTAAPR-SCODRU)
                    MOVE NIT-SUSCRIP-S-ABD02
                         TO WS-NSUAPR-SCODRU (WS-CTAAPR-SCODRU)
                    MOVE COD-CTA-ABD07
                         TO WS-TCTAPR-SCODRU (WS-CTAAPR-SCODRU)
                    MOVE WS-NO-SCODRU
                         TO WS-INDAPR-SCODRU (WS-CTAAPR-SCODRU)
VALCON           END-IF                                                 VHF0005
VALCON        END-IF                                                    VHF0005
           END-IF
           MOVE MORA-MAXIMA-ABD07 TO WS-MMX-O-EMBAR-SCODRU
           MOVE 1 TO WS-ACUCTA-TMP-SCODRU
           PERFORM 5720-EVAL-CUENTA-SCODRU.

       5210-EVALUE-ADJETIVO-SCODRU.
REMARK******************************************************************
REMARK*5210-EVALUE-ADJETIVO-SCODRU.                                    *
REMARK*    SE ACUMULA LA CALIFICACION POR ADJETIVO Y EL NUMERO DE      *
REMARK*    ADJETIVOS DADOS, TAMBIEN SE ESCOGE LA EVALUACION Y SI ES    *
REMARK*    PEOR A LA ACTUAL SE REEMPLAZA, FINALMENTE LA CALIFICACION   *
REMARK*    ACUMULADA SE PROMEDIA CON LA DEL ESTADO PARA OBTENER LA     *
REMARK*    DEFINITIVA DE LA CUENTA                                     *
REMARK******************************************************************
REMARK**** SE VERIFICA SI SE DESEA EVALUAR EL ADJETIVO
           IF WS-EVACAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU) > 0
              MOVE WS-SI-SCODRU TO WS-IND-ADJETIVO-SCODRU
REMARK******* SE CUENTA EL CASO PARA INCLUIRLO EN EL PROMEDIO DE LA NOTA
REMARK******* DE LA CUENTA, TABMBIEN LA NOTA SE ACUMULA PARA LO MISMO
              ADD 1 TO WS-NUM-A-PROM-SCODRU
              ADD WS-NOTCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                  TO WS-CALIF-SCODRU
REMARK******* SE HACE EL CONTEO PARA VERIFICAR CON EL MAXIMO PERMITIDO
              ADD 1
                 TO WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
              PERFORM 5530-ACUMULA-PUNTAJE-SCODRU
           END-IF.

       5220-ACUMULAR-VALORES-SCODRU.
REMARK******************************************************************
REMARK*5220-ACUMULAR-VALORES-SCODRU.                                   *
REMARK*    SE ACUMULAN LOS VALORES ENTREGADOS POR LOS SUSCRIPTORES DE  *
REMARK*    ACUERDO AL PARAMETRO "EVALUACION DE VALORES NO REPORTADO".  *
REMARK*    CUANDO SE INDICA TOMAR COMO CEROS LOS VALORES NO REPORTADOS *
REMARK*    UNICAMENTE SE HACE EL CONTEO, LO QUE EQUIVALE A SUMAR CERO  *
REMARK******************************************************************
REMARK**** SE VERIFICA SI EL SUSCRIPTOR ESTA ENVIANDO VALORES
           IF IND-AMPLIACION-ABD02 = 5 AND
              FECHA-ACTUALIZ-VALOR-ABD07 > 0
REMARK******* SE ACUMULA VALOR DISPONIBLE SOLO PARA TARJETAS DE CREDITO,
REMARK******* EN LAS DEMAS CUENTAS NO TIENE SENTIDO (EXCEPTO PARA
REMARK******* CREDITOS ROTATORIOS QUE NO PODEMOS DISTINGUIR DE LOS
REMARK******* NORMALES)
              IF COD-CTA-ABD07 = 02 OR COD-CTA-ABD07 = 03
                 ADD VALOR-DISPONIBLEM-ABD07 TO WS-VALDIS-SCODRU
              END-IF
REMARK******* SE ACUMULA VALOR SALDO
              ADD VALOR-SALDO-DEUDAM-ABD07 TO WS-VALSAL-SCODRU
REMARK******* SE VERIFICA QUE LOS ESTADOS AL DIA NO TENGAN SALDO EN MORA
              IF NOV-REPORT-ABD07 = 01 OR 13 OR 14 OR 15 OR 16
                 MOVE 0 TO VALOR-SALDO-MORAM-ABD07
              ELSE
REMARK********** SE VERIFICA QUE LOS ESTADOS MOROSOS SI TENGAN SALDO EN
REMARK********** MORA
                 IF VALOR-SALDO-MORAM-ABD07 = 0
                    EVALUATE WS-IND-EVAVAL-SCODRU
                       WHEN WS-VALPRO-SCODRU
REMARK******************* SE LLEVA EL CONTEO SI SE PIDE DETERMINAR
REMARK******************* PROMEDIO DE VALORES NO REPORTADOS
                          ADD 1 TO WS-MORNRE-SCODRU
                       WHEN WS-VALEXT-SCODRU
REMARK******************* SE INDICA MEDIANTE UN VARIABLE DE CONTROL QUE
REMARK******************* NO ESTAN REPORTADOS TODOS LOS VALORES CUANDO
REMARK******************* SE EXIGE QUE ESTEN TODOS PARA SU EVALUACION
                          MOVE WS-NO-SCODRU TO WS-TODVAL-SCODRU
                    END-EVALUATE
                 ELSE
                    ADD VALOR-SALDO-MORAM-ABD07 TO WS-VALMOR-SCODRU
                 END-IF
              END-IF
REMARK******* SE ACUMULA VALOR CUOTA MENSUAL
              ADD CUANTIA-ABD07 TO WS-VALCUO-SCODRU
           ELSE
REMARK******* SE PROCESAN SUSCRIPTORES QUE NO REPORTAN VALORES
              EVALUATE WS-IND-EVAVAL-SCODRU
                 WHEN WS-VALPRO-SCODRU
REMARK************* SE LLEVA EL CONTEO SI SE PIDE DETERMINAR PROMEDIO DE
REMARK************* VALORES NO REPORTADOS
                    ADD 1 TO WS-CTANRE-SCODRU
                 WHEN WS-VALEXT-SCODRU
REMARK************* SE INDICA MEDIANTE UN VARIABLE DE CONTROL QUE NO
REMARK************* ESTAN REPORTADOS TODOS LOS VALORES CUANDO SE EXIGE
REMARK************* QUE ESTEN TODOS PARA SU EVALUACION
                    MOVE WS-NO-SCODRU TO WS-TODVAL-SCODRU
              END-EVALUATE
           END-IF
           ADD 1 TO WS-CTAVAL-SCODRU.

       5300-PROCESE-REG-CHECK-SCODRU.
REMARK******************************************************************
REMARK*5300-PROCESE-REG-CHECK-SCODRU.                                  *
REMARK*    SE RECIBE UN REGISTRO DEL ARCHIVO MAESTRO-CHECK  (ICBCHK),  *VHF0008
REMARK*    SE VERIFICA SI ESTA BLOQUEADO Y SE PROCESA.                 *VHF0008
REMARK******************************************************************VHF0008
BLQMAE     IF IND-BLOQUEO-ABD06 = 0                                     VHF0008
BLQMAE        PERFORM 5305-PROCESAR-REGCTE-SCODRU                       VHF0008
BLQMAE     END-IF.                                                      VHF0008

BLQMAE 5305-PROCESAR-REGCTE-SCODRU.                                     VHF0008
REMARK******************************************************************VHF0008
REMARK*5305-PROCESAR-REGCTE-SCODRU.                                    *VHF0008
REMARK*    SE RECIBE UN REGISTRO DEL ARCHIVO MAESTRO-CHECK (ICBCHK),   *VHF0008
REMARK*    SE BUSCA SU PEOR EVALUACION DE ACUERDO A SU ESTADO ACTUAL,  *VHF0008
REMARK*    ESTUVO Y ADJETIVO SE ACUMULA SU CALIFICACION EN SU          *VHF0008
REMARK*    RESPECTIVO TIPO DE CUENTA.                                  *VHF0008
REMARK******************************************************************VHF0008
REMARK**** SE INDICA QUE SE PROCESO UNA CUENTA CORRIENTE PARA EFECTOS
REMARK**** DE RESULTADO DE CONSULTA
           MOVE WS-SI-SCODRU TO WS-IND-TIPO1-SCODRU
REMARK**** SE INICIALIZAN LOS PARAMETROS PARA LAS RUTINAS DE SELECCIONAR
REMARK**** LA EVALUACION POR CUENTA Y PARA LA SELECCION DE LA PEOR
REMARK**** EVALUACION POR TIPO CUENTA
           MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                WS-IND-ADJETIVO-SCODRU
           MOVE 0 TO WS-CALIF-SCODRU
           MOVE 0 TO WS-NUM-A-PROM-SCODRU
REMARK**** SE TOMAN LAS TABLAS DE CALIFICACION, TIPO-CUENTA Y ESTADO,
REMARK**** ADEMAS DE LOS INDICES DENTRO DE ELLAS DE ACUERDO AL ESTADO
REMARK**** DEL REGISTRO EN ANALISIS
           MOVE WS-CALIF-CTACTE-SCODRU   TO WS-TABCAL-SCODRU
           MOVE WS-ESTADO-CTACTE-SCODRU  TO WS-TABEST-SCODRU
           MOVE WS-TIPCTA-HABPAGO-SCODRU  TO WS-TABCTA-SCODRU
           MOVE NOV-REPORT-ABD06         TO WS-INDEST-SCODRU
           MOVE COD-CTA-ABD06            TO WS-INDCTA-SCODRU
           MOVE WS-ACTEST-SCODRU (WS-TABEST-SCODRU,WS-INDEST-SCODRU)
                TO WS-INDCAL-SCODRU
REMARK**** SE GUARDAN DATOS DE LA CUENTA VIGENTE PARA VERIFICACION
REMARK**** ICBCON (CONSULTAS VS CUENTAS APROBADAS)
           IF NOV-REPORT-ABD06 = 01 OR 06 OR 07
              MOVE COD-SUS-ABD06 TO COD-SUSCRIP-ABD02
              READ SUSCRIPTOR WITH IGNORE LOCK
                 INVALID KEY
                    MOVE 0 TO NIT-SUSCRIP-S-ABD02
              END-READ
REMARK******* SE PROCEDE A VERIFICAR SI LA FECHA DE APERTURA ESTA       VHF0005
REMARK******* INCLUIDA EN EL ULTIMO ANO PARA VERIFICAR CONSULTAS        VHF0005
VALCON        MOVE FECHA-APERT-ABD06 TO WS-FAPAUX-SCODRU                VHF0005
VALCON        IF WS-AAPAUX-SCODRU > 70                                  VHF0005
VALCON           MOVE 19 TO WS-SGAAMM-SCODRU                            VHF0005
VALCON        ELSE                                                      VHF0005
VALCON           MOVE 20 TO WS-SGAAMM-SCODRU                            VHF0005
VALCON        END-IF                                                    VHF0005
VALCON        MOVE WS-AAPAUX-SCODRU TO WS-ANAAMM-SCODRU                 VHF0005
VALCON        MOVE WS-MAPAUX-SCODRU TO WS-MEAAMM-SCODRU                 VHF0005
VALCON        IF WS-FCAAMM-SCODRU >= WS-ANMECO-SCODRU                   VHF0005
VALCON           IF WS-CTAAPR-SCODRU < 10000                            VHF0005
REMARK******* LOS SIGUIENTES DATOS SE ALMACENAN PARA VERIFICAR SI UNA
REMARK******* CONSULTA FUE APROBADA
                    ADD 1 TO WS-CTAAPR-SCODRU
VALCON              MOVE WS-FCAAMM-SCODRU                               VHF0005
                         TO WS-FECAPR-SCODRU (WS-CTAAPR-SCODRU)
                    MOVE NIT-SUSCRIP-S-ABD02
                         TO WS-NSUAPR-SCODRU (WS-CTAAPR-SCODRU)
                    MOVE COD-CTA-ABD06
                         TO WS-TCTAPR-SCODRU (WS-CTAAPR-SCODRU)
                    MOVE WS-NO-SCODRU
                         TO WS-INDAPR-SCODRU (WS-CTAAPR-SCODRU)
VALCON           END-IF                                                 VHF0005
VALCON        END-IF                                                    VHF0005
           END-IF
           MOVE NUM-EMBARGO-ABD06 TO WS-MMX-O-EMBAR-SCODRU
           MOVE 1 TO WS-ACUCTA-TMP-SCODRU
           PERFORM 5720-EVAL-CUENTA-SCODRU.

       5400-PROCESE-REG-ENDEUD-SCODRU.                                  VHF0007
REMARK******************************************************************VHF0007
REMARK*5400-PROCESE-REG-ENDEUD-SCODRU.                                 *VHF0007
REMARK*    SE RECIBE UN REGISTRO DEL ARCHIVO BDIEMSUP Y SE PROCESA     *VHF0007
REMARK******************************************************************VHF0007
REMARK**** SE SELECCIONAN LOS REGISTROS DE ENDEUDAMIENTO PARA PROCESO   VHF0007
BDIEND     IF BDIEMSUP-FECHA > 0 AND                                    FAC0009 
BDIEND        (BDIEMSUP-CALIFICA = "A" OR "B" OR "C" OR                 FAC0009 
BLQMAE        "D" OR "E") AND BDIEMSUP-IND-BLOQ = 0 AND                 VHF0008
BDIEND        (BDIEMSUP-VALOR > 0 OR BDIEMSUP-INTERES > 0)              FAC0009 
ENDEUD        IF WS-PRIMER-REG-SCODRU = 0                               VHF0012 
ENDEUD           MOVE BDIEMSUP-FECHA(1:6) TO WS-FUTEND-SCODRU           VHF0012 
ENDEUD           MOVE 1 TO WS-PRIMER-REG-SCODRU                         VHF0012 
ENDEUD        END-IF                                                    VHF0012 
REGEND        PERFORM 5405-PROREG-ENDEUD-SCODRU                         VHF0007
REGEND     END-IF.                                                      VHF0007

       5405-PROREG-ENDEUD-SCODRU.                                       VHF0007
REMARK******************************************************************VHF0007
REMARK*5405-PROREG-ENDEUD-SCODRU.                                      *VHF0007
REMARK*    SE TOMA LA EVALUACION DEL REGISTRO DE ENDEUDAMIENTO         *VHF0007
REMARK*    SELECCIONADO SI ES PEOR QUE LA ALMACENADA HASTA AHORA Y SE  *VHF0007
REMARK*    REEMPLAZA, SE ACUMULA LA CALIFICACION EN SU RESPECTIVO TIPO *VHF0007
REMARK*    DE CUENTA                                                   *VHF0007
REMARK******************************************************************VHF0007
REMARK**** SE INDICA QUE SE PROCESO UNA CUENTA DE ENDEUDAMIENTO PARA
REMARK**** EFECTOS DE RESULTADO DE CONSULTA
           MOVE WS-SI-SCODRU TO WS-IND-TIPO1-SCODRU
REMARK**** SE INICIALIZAN LOS PARAMETROS PARA LAS RUTINAS DE SELECCIONAR
REMARK**** LA EVALUACION POR CUENTA Y PARA LA SELECCION DE LA PEOR
REMARK**** EVALUACION POR TIPO CUENTA
           MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                WS-IND-ADJETIVO-SCODRU
           MOVE 0 TO WS-CALIF-SCODRU
           MOVE 0 TO WS-NUM-A-PROM-SCODRU
REMARK**** SE TOMAN LAS TABLAS DE CALIFICACION Y TIPO-CUENTA,
REMARK**** ADEMAS DE LOS INDICES DENTRO DE ELLAS DE ACUERDO A LA
REMARK**** CALIFICACION DEL REGISTRO EN ANALISIS
           MOVE WS-TIPCTA-ENDEUDAM-SCODRU TO WS-TABCTA-SCODRU
           MOVE WS-CALIF-ENDEUDAM-SCODRU  TO WS-TABCAL-SCODRU
REMARK**** PARA TOMAR EL INDICE DE LA CALIFICACION SE VERIFICA LA
REMARK**** CALIFICACION DEL REGISTRO ACTUAL VS UN VECTOR DE
REMARK**** CALIFICACIONES VALIDAS, Y LA POSICION EN DICHO VECTOR
REMARK**** ES EL INDICE EN LA TABLA CALIFICACIONES DE ENDEUDAMIENTO
           INITIALIZE WS-INDCAL-SCODRU
           INSPECT WS-CALEND-SCODRU TALLYING WS-INDCAL-SCODRU
BDIEND             FOR CHARACTERS BEFORE BDIEMSUP-CALIFICA              FAC0009 
           ADD 1 TO WS-INDCAL-SCODRU
           IF WS-INDCAL-SCODRU > WS-NCAEND-SCODRU
REMARK******* NO SE ENCONTRO CALIFICACION
              MOVE 0 TO WS-INDCAL-SCODRU
           ELSE
REMARK******* SE DETERMINA SI CORRESPONDE A ENDEUDAMIENTO HISTORICO O
REMARK******* ACTUAL, EN CASO DE SER HISTORICO SE ADICIONA EL NUMERO
REMARK******* ACTUAL DE CALIFICACIONES PARA QUE EL INDICE APUNTE A LA
REMARK******* CALIFICACION HISTORICA
BDIEND        IF BDIEMSUP-FECHA(1:6) <> WS-FUTEND-SCODRU                FAC0009 
REMARK********** LA CONSTANTE WS-NCAEND-SCODRU POSEE EL NUMERO
REMARK********** CALIFICACIONES DE CUENTAS DE ENDEUDAMIENTO ACTUAL, AL
REMARK********** SUMAR ESTA AL INDICE DE CALIFICACION ACTUAL SE OBTIENE
REMARK********** EL HISTORICO
                 ADD WS-NCAEND-SCODRU TO WS-INDCAL-SCODRU
              END-IF
           END-IF
           IF WS-INDCAL-SCODRU > 0
REMARK******* PARA TOMAR EL INDICE DE TIPO DE CUENTA SE VERIFICA EL
REMARK******* TIPO CUENTA DEL REGISTRO ACTUAL VS UN VECTOR DE
REMARK******* GRUPOS DE CUENTA VALIDOS, Y LA POSICION EN DICHO VECTOR
REMARK******* ES EL INDICE EN LA TABLA TIPOS CUENTA DE ENDEUDAMIENTO
              INITIALIZE WS-INDCTA-SCODRU
MICROC        IF BDIEMSUP-TIP-DEUDA = "C"                               GJC0011 
MICROC           MOVE "M" TO BDIEMSUP-TIP-DEUDA                         GJC0011 
MICROC        END-IF                                                    GJC0011 
              INSPECT WS-GRPEND-SCODRU TALLYING WS-INDCTA-SCODRU
BDIEND                FOR CHARACTERS BEFORE BDIEMSUP-TIP-DEUDA          FAC0009 
              ADD 1 TO WS-INDCTA-SCODRU
              IF WS-INDCTA-SCODRU > 3
                 MOVE 0 TO WS-INDCTA-SCODRU
              END-IF
REMARK******* SE PROCESA SOLO SI EL TIPO DE CUENTA ES VALIDO Y
REMARK******* SI SE DEFINIO UN PESO PARA EL 'GRUPO DE CUENTA', DE LO
REMARK******* CONTRARIO SE DEBE IGNORAR ESE GRUPO DE CUENTA
              IF WS-INDCTA-SCODRU > 0
                 COMPUTE WS-ACUCTA-TMP-SCODRU
BDIEND           = (BDIEMSUP-VALOR + BDIEMSUP-INTERES) / WS-MILES-SCODRUFAC0009 
                 PERFORM 5720-EVAL-CUENTA-SCODRU
              END-IF
           END-IF.

      *5425-PROCESAR-REG-SREAL-SCODRU.
REMARK******************************************************************
REMARK*5425-PROCESAR-REG-SREAL-SCODRU.                                 *
REMARK*    SE RECIBE UN REGISTRO DEL ARCHIVO DE SECTOR REAL, SE TOMA LA*
REMARK*    EVALUACION SI ES PEOR QUE LA ALMACENADA HASTA AHORA Y SE    *
REMARK*    REEMPLAZA, SE ACUMULA SU CALIFICACION EN SU RESPECTIVO TIPO *
REMARK*    DE CUENTA.                                                  *
REMARK******************************************************************
REMARK**** SE INDICA QUE SE PROCESO UNA CUENTA DEL SECTOR REAL PARA
REMARK**** EFECTOS DE RESULTADO DE CONSULTA
      *    MOVE WS-SI-SCODRU TO WS-IND-TIPO1-SCODRU
REMARK**** SE INICIALIZAN LOS PARAMETROS PARA LAS RUTINAS DE SELECCIONAR
REMARK**** LA EVALUACION POR CUENTA Y PARA LA SELECCION DE LA PEOR
REMARK**** EVALUACION POR TIPO CUENTA
      *    MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
      *                         WS-IND-ADJETIVO-SCODRU
      *    MOVE 0 TO WS-CALIF-SCODRU
      *    MOVE 0 TO WS-NUM-A-PROM-SCODRU
REMARK**** SE TOMAN LAS TABLAS DE CALIFICACION Y TIPO-CUENTA,
REMARK**** ADEMAS DE LOS INDICES DENTRO DE ELLAS DE ACUERDO A LA
REMARK**** EDAD DE CARTERA DEL REGISTRO EN ANALISIS
      *    MOVE WS-TIPCTA-SECREAL-SCODRU TO WS-TABCTA-SCODRU
      *    MOVE WS-CALIF-SECREAL-SCODRU  TO WS-TABCAL-SCODRU
      *    MOVE MORA-BDIRMAE TO WS-INDCAL-SCODRU
REMARK**** SE ADICIONA UNO AL INDICE DE EDAD DE CARTERA PARA TENER EL
REMARK**** INDICE REAL, YA QUE EDAD CARTERA CORRIENTE TIENE VALOR 0 Y
REMARK**** ASI PARA LAS DEMAS EDADES
      *    ADD 1 TO WS-INDCAL-SCODRU
REMARK**** SE DETERMINA SI CORRESPONDE A UNA CUENTA HISTORICA O
REMARK**** ACTUAL, EN CASO DE SER HISTORICA SE ADICIONA EL NUMERO
REMARK**** ACTUAL DE EDADES DE CARTERA PARA QUE EL INDICE APUNTE A LA
REMARK**** EDAD DE CARTERA HISTORICA
      *    IF FECHA-BDIRMAE <> WS-FUMSRE-SCODRU
      *       ADD WS-NECSRE-SCODRU TO WS-INDCAL-SCODRU
      *    END-IF
      *    MOVE PLAZO-BDIRMAE TO WS-INDCTA-SCODRU
REMARK**** SE ADICIONA UNO PARA CORREGIR EL INDICE DE PLAZOS QUE EMPIEZA
REMARK**** EN CERO
      *    ADD 1 TO WS-INDCTA-SCODRU
REMARK**** SE GUARDAN DATOS DE LA CUENTA MES ACTUAL (VIGENTES) PARA
REMARK**** VERIFICACION ICBCON (CONSULTAS VS CUENTAS APROBADAS)
      *    IF FECHA-BDIRMAE = WS-FUMSRE-SCODRU
      *       MOVE SUSCRIPTOR-BDIRMAE TO COD-SUSCRIP-ABD02
      *       READ SUSCRIPTOR WITH IGNORE LOCK
      *          INVALID KEY
      *             MOVE 0 TO NIT-SUSCRIP-S-ABD02
      *       END-READ
REMARK******* SE PROCEDE A VERIFICAR SI LA FECHA DE APERTURA ESTA       VHF0005
REMARK******* INCLUIDA EN EL ULTIMO ANO PARA VERIFICAR CONSULTAS        VHF0005
VALCON*       MOVE FECHA-APERT-ABD03 TO WS-FAPAUX-SCODRU                VHF0005
VALCON*       IF WS-AAPAUX-SCODRU > 70                                  VHF0005
VALCON*          MOVE 19 TO WS-SGAAMM-SCODRU                            VHF0005
VALCON*       ELSE                                                      VHF0005
VALCON*          MOVE 20 TO WS-SGAAMM-SCODRU                            VHF0005
VALCON*       END-IF                                                    VHF0005
VALCON*       MOVE WS-AAPAUX-SCODRU TO WS-ANAAMM-SCODRU                 VHF0005
VALCON*       MOVE WS-MAPAUX-SCODRU TO WS-MEAAMM-SCODRU                 VHF0005
VALCON*       IF WS-FCAAMM-SCODRU >= WS-ANMECO-SCODRU                   VHF0005
VALCON*          IF WS-CTAAPR-SCODRU < 10000                            VHF0005
REMARK******* LOS SIGUIENTES DATOS PERMITEN VERIFICAR SI UNA CONSULTA
REMARK******* FUE APROBADA
      *       ADD 1 TO WS-CTAAPR-SCODRU
      *       MOVE FEC-VINCULADO-BDIRMAE
      *            TO WS-FECAPR-SCODRU (WS-CTAAPR-SCODRU)
      *       MOVE NIT-SUSCRIP-S-ABD02
      *            TO WS-NSUAPR-SCODRU (WS-CTAAPR-SCODRU)
      *       MOVE TIPCTA-BDIRMAE
      *            TO WS-TCTAPR-SCODRU (WS-CTAAPR-SCODRU)
      *       MOVE WS-NO-SCODRU
      *            TO WS-INDAPR-SCODRU (WS-CTAAPR-SCODRU)
      *    END-IF
      *    MOVE VALOR-BDIRMAE TO WS-ACUCTA-TMP-SCODRU
      *    PERFORM 5720-EVAL-CUENTA-SCODRU.

       5450-PROCESE-REG-CONSUL-SCODRU.
REMARK******************************************************************
REMARK*5450-PROCESE-REG-CONSUL-SCODRU.                                 *
REMARK*    SE RECIBE UN REGISTRO DEL ARCHIVO INDEXADO                  *
REMARK*    (ICBCON-CONSULTAS), SE VERIFICA QUE NO SEA CONSULTA DE      *
REMARK*    PROCESO ESPECIAL O C.A.C., SE VALIDA QUE NO CORRESPONDA A   *
REMARK*    CUENTA APROBADA, SE VERIFICA DUPLICIDAD, SE CUENTA Y SI ES  *
REMARK*    NECESARIO SE TOMA LA EVALUACION Y SE ACUMULA LA CALIFICACION*
REMARK******************************************************************
REMARK**** SE VERIFICA QUE NO SEAN CONSULTAS GENERADAS POR DATACREDITO O
REMARK**** PROCESOS ESPECIALES, ADICIONALMENTE SI YA SE SUPERO EL MAXIMO
REMARK**** NO SE DEBEN EVALUAR MAS CONSULTAS
           IF COD-SUSCRIP-IND < 500000 AND
              WS-IND-CONSULTA-SCODRU = WS-NO-SCODRU
              MOVE COD-SUSCRIP-IND TO COD-SUSCRIP-ABD02
              READ SUSCRIPTOR WITH IGNORE LOCK
                 INVALID KEY
                    MOVE 0 TO NIT-SUSCRIP-S-ABD02
              END-READ
REMARK******* SE DESCARTAN LAS CONSULTAS DEL MISMO SUSCRIPTOR QUE HACE EL
REMARK******* SCORING
              IF NIT-SUSCRIP-S-ABD02 <> WS-SUSCON-SCODRU
                 PERFORM 5455-VALIDAR-CONSULTA-SCODRU
                 IF WS-CONVAL-SCODRU = WS-SI-SCODRU
REMARK************* SE PROCESA CONSULTA
REMARK************* SE INICIALIZAN LOS PARAMETROS PARA LAS RUTINAS DE
REMARK************* SELECCIONAR LA EVALUACION POR CUENTA Y PARA LA
REMARK************* SELECCION DE LA PEOR EVALUACION POR TIPO CUENTA
                    MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                         WS-IND-ADJETIVO-SCODRU
                    MOVE 0 TO WS-CALIF-SCODRU
                    MOVE 0 TO WS-NUM-A-PROM-SCODRU
REMARK************* SE TOMAN LAS TABLAS DE CALIFICACION, TIPO-CUENTA Y
REMARK************* ESTADO, ADEMAS DE LOS INDICES DENTRO DE ELLAS PARA
REMARK************* CONSULTA
                    MOVE WS-TIPCTA-ESPECIAL-SCODRU TO WS-TABCTA-SCODRU
                    MOVE WS-CALIF-ESPECIAL-SCODRU  TO WS-TABCAL-SCODRU
                    MOVE WS-INDCON-SCODRU          TO WS-INDCAL-SCODRU
                                                      WS-INDCTA-SCODRU
REMARK************* SE DAN VALORES PARA PASAR A LA RUTINA DE SELECCION
REMARK************* DE EVALUACION, SE RECIBE COMO RETORNO EL INDICADOR
REMARK************* DE MAXIMO DE CONSULTAS ALCANZADO
                    MOVE 1 TO WS-ACUCAL-TMP-SCODRU
                    MOVE 1 TO WS-ACUCTA-TMP-SCODRU
                    MOVE WS-IND-CONSULTA-SCODRU TO WS-IND-TMP-SCODRU
                    PERFORM 5700-EVALUAR-CTAXMAXIMO-SCODRU
                    MOVE WS-IND-TMP-SCODRU TO WS-IND-CONSULTA-SCODRU
                 END-IF
              END-IF
           END-IF.

       5455-VALIDAR-CONSULTA-SCODRU.
REMARK******************************************************************
REMARK*5455-VALIDAR-CONSULTA-SCODRU.                                   *
REMARK*    SE VERIFICA QUE LA CONSULTA NO ESTE DUPLICADA, QUE NO HAYA  *
REMARK*    OTRA CON EL MISMO SUSCRIPTOR Y TIPO CUENTA, Y QUE NO HAYA   *
REMARK*    SIDO APROBADA. ESTA VALIDACION EXCLUYE DUPLICIDIDAD         *
REMARK******************************************************************
           MOVE WS-SI-SCODRU TO WS-CONVAL-SCODRU
REMARK***  SE TOMA LA FECHA DE CONSULTA Y SE CONVIERTE EM FORMATO       VHF0005
REMARK***  AAAAMM PARA PODERLA COMPARAR                                 VHF0005
VALCON     MOVE FEC-CONSUL-IND TO WS-FCBCON-SCODRU                      VHF0005
VALCON     MOVE WS-MCBCON-SCODRU  TO WS-MEAAMM-SCODRU                   VHF0005
VALCON     MOVE WS-ACBCON-SCODRU  TO WS-ANAAMM-SCODRU                   VHF0005
VALCON     IF WS-ACBCON-SCODRU > 70                                     VHF0005
VALCON        MOVE 19 TO WS-SGAAMM-SCODRU                               VHF0005
VALCON     ELSE                                                         VHF0005
VALCON        MOVE 20 TO WS-SGAAMM-SCODRU                               VHF0005
VALCON     END-IF                                                       VHF0005
REMARK**** SE RECORRE EL VECTOR DE CUENTAS VIGENTES PARA VERIFICAR SI
REMARK**** LA CONSULTA EN ANALISIS CORRESPONDE A UNA DE ELLAS, Y SI ES
REMARK**** ASI QUE NO HAYA SIDO RELACIONADA CON OTRA CONSULTA YA
           PERFORM VARYING WS-I-SCODRU FROM 1 BY 1
                   UNTIL WS-I-SCODRU > WS-CTAAPR-SCODRU OR
                         WS-CONVAL-SCODRU = WS-NO-SCODRU
              IF WS-TCTAPR-SCODRU (WS-I-SCODRU) = COD-TIPCTA-ABD02 AND
VALCON           WS-NSUAPR-SCODRU (WS-I-SCODRU) = NIT-SUSCRIP-S-ABD02   VHF0005
VALCON           AND WS-FECAPR-SCODRU (WS-I-SCODRU) >= WS-FCAAMM-SCODRU VHF0005
VALCON           AND WS-INDAPR-SCODRU (WS-I-SCODRU) = WS-NO-SCODRU      VHF0005
                 MOVE WS-SI-SCODRU TO WS-INDAPR-SCODRU (WS-I-SCODRU)
                 MOVE WS-NO-SCODRU TO WS-CONVAL-SCODRU
              END-IF
           END-PERFORM
REMARK**** SE RECORRE VECTOR DE CONSULTAS YA ANALIZADAS PARA VERIFICAR
REMARK**** QUE NO EXISTA UNA CON EL MISMO SUSCRIPTOR Y TIPO CUENTA, QUE
REMARK**** DE ACUERDO A LAS ESPECIFICACIONES DEL PROYECTO SE EXCLUYEN
           PERFORM VARYING WS-I-SCODRU FROM 1 BY 1
                   UNTIL WS-I-SCODRU > WS-CONCON-SCODRU OR
                         WS-CONVAL-SCODRU = WS-NO-SCODRU
              IF WS-TCTCON-SCODRU (WS-I-SCODRU) = COD-TIPCTA-ABD02 AND
                 WS-CSUCON-SCODRU (WS-I-SCODRU) = COD-SUSCRIP-IND
                 MOVE WS-NO-SCODRU TO WS-CONVAL-SCODRU
              END-IF
           END-PERFORM
           IF WS-CONVAL-SCODRU = WS-SI-SCODRU
REMARK******* SI LA CONSULTA FUE APROBADA PARA ANALIZAR SE INCLUYE EN
REMARK******* LAS TABLAS DE CONSULTAS YA ANALIZADAS
VALCON        IF WS-CONCON-SCODRU < 10000                               VHF0005
                 ADD 1 TO WS-CONCON-SCODRU
                 MOVE COD-TIPCTA-ABD02
                      TO WS-TCTCON-SCODRU (WS-CONCON-SCODRU)
                 MOVE COD-SUSCRIP-IND
                      TO WS-CSUCON-SCODRU (WS-CONCON-SCODRU)
VALCON        END-IF                                                    VHF0005            
           END-IF.

       5500-EVALUAR-ESTADO-SCODRU.
REMARK******************************************************************
REMARK*5500-EVALUAR-ESTADO-SCODRU.                                     *
REMARK*    RUTINA ENCARGADA DE TENIENDO EN CUENTA EL ESTADO ACTUAL Y EL*
REMARK*    ESTUVO, ACUMULAR LA CALIFICACION QUE CORRESPONDA A LA PEOR  *
REMARK*    EVALUACION DE LA CUENTA Y COMPARARLA CON LA GLOBAL PARA     *
REMARK*    REEMPLAZARLA SI ES SUPERADA                                 *
REMARK******************************************************************
REMARK**** SE TOMA EL INDICE DEL ESTADO HISTORICO
           EVALUATE WS-HISEST-SCODRU (WS-TABEST-SCODRU,WS-INDEST-SCODRU)
              WHEN 00
REMARK********** ESTADOS SIMPLES QUE NO REQUIEREN EVALUACIONES
REMARK********** COMPLEMENTARIAS
REMARK********** SE CUENTA PARA VERIFICAR EL MAXIMO PERMITIDO
                 ADD 1
                 TO WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                 PERFORM 5530-ACUMULA-PUNTAJE-SCODRU
              WHEN 99
REMARK********** ESTADOS QUE REQUIEREN ANALIZAR EL CAMPO MORA MAXIMA
REMARK********** (CARTERA) 0 NUMERO DE EMBARGOS (CTA CTE)
                 PERFORM 5510-EVALUAR-EST-ANEXO-SCODRU
              WHEN OTHER
REMARK********** SE PROCESAN LOS ESTADOS QUE TIENEN IMPLICITA LA
REMARK********** LA MORA MAXIMA EN SU DEFINICION
                 PERFORM 5520-EVALUE-ESTADO-COMP-SCODRU
           END-EVALUATE.

       5510-EVALUAR-EST-ANEXO-SCODRU.
REMARK******************************************************************
REMARK*5510-EVALUAR-EST-ANEXO-SCODRU.                                  *
REMARK*    RUTINA QUE SELECCIONAR PEOR EVALUACION ENTRE ESTADO ACTUAL Y*
REMARK*    MORA MAXIMA (CARTERA) O ESTUVO EMBARGADO (CTAS-CTES) TAMBIEN*
REMARK*    TOMA LA RESPECTIVA CALIFICACION.                            *
REMARK******************************************************************
REMARK**** SE GUARDA EL INDICE DE ESTADO ACTUAL
           MOVE WS-INDCAL-SCODRU TO WS-INDCAL-TMP-SCODRU
REMARK**** DE ACUERDO AL TIPO DE CUENTA SE SELECCIONA INDICE DE MORA
REMARK**** MAXIMA (CARTERA) O ESTUVO EMBARGADA (CUENTAS CORRIENTES)
           IF WS-TABEST-SCODRU = WS-ESTADO-CTACTE-SCODRU
              IF NUM-EMBARGO-ABD06 > 0
                 MOVE WS-INDEMB-SCODRU TO WS-INDCAL-SCODRU
              END-IF
           ELSE
              IF MORA-MAXIMA-ABD07 > 0
                 MOVE WS-TABESM-SCODRU (MORA-MAXIMA-ABD07)
                      TO WS-INDCAL-SCODRU
              END-IF
           END-IF
           IF WS-MMX-O-EMBAR-SCODRU > 0
REMARK******* SE VALIDA QUE LA MORA MAXIMA O EL ESTUVO EMBARGADO HAYA
REMARK******* GENERADO UN INDICE CORRECTO
              IF WS-INDCAL-SCODRU > 0
REMARK********** CUENTA LA OCURRENCIA PARA VERIFICAR EL MAXIMO PERMITIDO
REMARK********** DEL ESTADO HISTORICO
                 ADD 1
                 TO WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                 PERFORM 5530-ACUMULA-PUNTAJE-SCODRU
              END-IF
REMARK******* SE REESTABLECE EL INDICE DEL ESTADO ACTUAL
              MOVE WS-INDCAL-TMP-SCODRU TO WS-INDCAL-SCODRU
           END-IF
REMARK**** CUENTA LA OCURRENCIA PARA VERIFICAR EL MAXIMO PERMITIDO DEL
REMARK**** ESTADO ACTUAL
           ADD 1 TO WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
           PERFORM 5530-ACUMULA-PUNTAJE-SCODRU.

       5520-EVALUE-ESTADO-COMP-SCODRU.
REMARK******************************************************************
REMARK*5520-EVALUE-ESTADO-COMP-SCODRU.                                 *
REMARK*    RUTINA QUE SELECCIONAR PEOR EVALUACION ENTRE ESTADO ACTUAL  *
REMARK*    Y EL ESTUVO IMPLICITO (EJ. FM60 ESTA M30). SE TOMA LA       *
REMARK*    RESPECTIVA CALIFICACION.                                    *
REMARK******************************************************************
REMARK**** SE GUARDA EL ESTADO ACTUAL
           MOVE WS-INDCAL-SCODRU TO WS-INDCAL-TMP-SCODRU
REMARK**** DE LA TABLA DE ESTADOS SE TOMA EL INDICE DEL ESTADO HISTORICO
           MOVE WS-HISEST-SCODRU (WS-TABEST-SCODRU,WS-INDEST-SCODRU)
                TO WS-INDCAL-SCODRU
REMARK**** SE CUENTA PARA VERIFICAR EL MAXIMO DEL ESTADO HISTORICO
           ADD 1 TO WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
           PERFORM 5530-ACUMULA-PUNTAJE-SCODRU
REMARK**** SE RETOMA EL INDICE DEL ESTADO ACTUAL
           MOVE WS-INDCAL-TMP-SCODRU TO WS-INDCAL-SCODRU
REMARK**** SE CUENTA PARA VERIFICAR EL MAXIMO DEL ESTADO ACTUAL
           ADD 1 TO WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
           PERFORM 5530-ACUMULA-PUNTAJE-SCODRU.

       5530-ACUMULA-PUNTAJE-SCODRU.
REMARK******************************************************************
REMARK*5530-ACUMULA-PUNTAJE-SCODRU.                                    *
REMARK*    EN ESTA RUTINA SE SELECCIONA LA PEOR EVALUACION ENTRE LA    *
REMARK*    ACTUAL Y  LA PRESELECCIONADA PARA LA CUENTA EN PROCESO,     *
REMARK*    TAMBIEN SE TOMA LA CALIFICACION CORREPONDIENTE. EN CASO DE  *
REMARK*    DOS EVALUACIONES IGUALES  SE TOMA LA CALIFICACION MENOR     *
REMARK******************************************************************
REMARK**** SE VERIFICA SI SE EXCEDIO EL 'MAXIMO' DE CUENTAS X ESTADO
REMARK**** PARA TOMAR LA EVALUACION SINO
           IF WS-MAXCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU) > 0
              AND WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU) >
              WS-MAXCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
              MOVE WS-ESNCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                   TO WS-EVAL-SCODRU
           ELSE
              MOVE WS-EVACAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                   TO WS-EVAL-SCODRU
           END-IF
REMARK**** SI LA CUENTA TIENE VARIOS ITEMS PARA ANALIZAR SE TOMA LA
REMARK**** EVALUACION DEL ESTADO ACTUAL
           IF WS-IND-MULT-EVAL-SCODRU = WS-SI-SCODRU
              MOVE WS-EVAL-SCODRU TO WS-EVAL-ACTUAL-SCODRU
           ELSE
REMARK******* EN CASO DE SER UN SOLO ITEM A EVALUAR POR CUENTA O SI ES
REMARK******* EL PRIMER ITEM A EVALUAR SE TOMAN EVALUACIONES ACTUAL QUE
REMARK******* A SU VEZ ES EL MAYOR, LA NOTA COMO NOTA DEL MAYOR Y SE
REMARK******* REGISTRA COMO MULTIEVALUACION POR SI HAY OTRO ITEM A
REMARK******* EVALUAR
              MOVE WS-SI-SCODRU TO WS-IND-MULT-EVAL-SCODRU
              MOVE WS-EVAL-SCODRU TO WS-EVAL-MAYOR-SCODRU
                                     WS-EVAL-ACTUAL-SCODRU
              MOVE WS-NOTCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                   TO WS-CALIF-DE-MAYOR-SCODRU
           END-IF
REMARK**** SI LA EVALUACION EN PROCESO ES MAYOR A LA MAYOR DE LA CUENTA
REMARK**** SE CAMBIA
           IF WS-EVAL-ACTUAL-SCODRU >= WS-EVAL-MAYOR-SCODRU
REMARK******* PARA EVALUACIONES QUE NO CORRESPONDEN A ADJETIVOS SI LA
REMARK******* ACTUAL Y LA MAYOR SON IGUALES SE DEBE ESCOGER LA MENOR
REMARK******* CALIFICACION. EN EL CASO DE ADJETIVOS ESTA NOTA SE SUMA Y
REMARK******* PROMEDIA, POR LO TANTO NO SE EVALUA AQUI
              IF WS-IND-ADJETIVO-SCODRU = WS-NO-SCODRU
                 IF WS-EVAL-ACTUAL-SCODRU > WS-EVAL-MAYOR-SCODRU
                    MOVE
                    WS-NOTCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                    TO WS-CALIF-DE-MAYOR-SCODRU
                 ELSE
                    IF WS-NOTCAL-SCODRU
                          (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU) <
                       WS-CALIF-DE-MAYOR-SCODRU
                       MOVE
                       WS-NOTCAL-SCODRU
                         (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                       TO WS-CALIF-DE-MAYOR-SCODRU
                    END-IF
                 END-IF
              END-IF
REMARK******* SE HACEN LAS SIGUIENTES PREGUNTAS PARA CONSERVAR LAS
REMARK******* RAZONES DEL ESTADO DE LA CUENTA SI SE EVALUA ACTUALMENTE
REMARK******* ADJETIVO, EVITANDO UN PRESENTACION ERRONEA EN CASO DE QUE
REMARK******* ESTADO Y ADJETIVO TENGAN LA MISMA EVALUACION.
              IF WS-IND-ADJETIVO-SCODRU = WS-NO-SCODRU OR
                 (WS-IND-ADJETIVO-SCODRU = WS-SI-SCODRU AND
                  WS-EVAL-ACTUAL-SCODRU  > WS-EVAL-MAYOR-SCODRU)
REMARK********** SE TOMAN LAS RAZONES DE LA EVALUACION
                 MOVE WS-INDCAL-SCODRU TO WS-INDRAZ-TMP-SCODRU
                 MOVE WS-TABCAL-SCODRU TO WS-TABRAZ-TMP-SCODRU
              END-IF
REMARK******* SE TOMA LA EVALUACION MAYOR DE LA CUENTA
              MOVE WS-EVAL-ACTUAL-SCODRU TO WS-EVAL-MAYOR-SCODRU
           END-IF.

       5535-ACUMULA-PUNT-ESP-SCODRU.
REMARK******************************************************************
REMARK*5535-ACUMULA-PUNT-ESP-SCODRU.                                   *
REMARK*    SE VERIFICA SI SE EXCEDIO EL MAXIMO DE CUENTAS X ESTADO PARA*
REMARK*    TOMAR LA EVALUACION SINO Y SU CALIFICACION, SE USA PARA     *
REMARK*    CONTINGENCIAS Y CONSULTAS                                   *
REMARK******************************************************************
REMARK**** SE VERIFICA SI SE ALCANZA EL MAXIMO
           IF WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU) >
              WS-MAXCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
REMARK******* SE TOMA LA EVALUACION SINO Y LA CALIFICACION Y SE COLOCA
REMARK******* EN VERDADERO EL INDICADOR DE MAXIMO
              MOVE WS-ESNCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                   TO WS-EVAL-MAYOR-SCODRU
              MOVE WS-NOTCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                   TO WS-CALIF-DE-MAYOR-SCODRU
              MOVE WS-SI-SCODRU TO WS-IND-TMP-SCODRU
REMARK******* SE TOMAN LAS RAZONES PARA EL ESTADO
              MOVE WS-INDCAL-SCODRU TO WS-INDRAZ-TMP-SCODRU
              MOVE WS-TABCAL-SCODRU TO WS-TABRAZ-TMP-SCODRU
           END-IF.

       5540-SELECCION-EVAL-SCODRU.
REMARK******************************************************************
REMARK*5540-SELECCION-EVAL-SCODRU.                                     *
REMARK*    ESTA RUTINA COMPARA LA PEOR EVALUACION GLOBAL POR TIPO      *
REMARK*    CUENTA Y LA OBTENIDA DE LA CUENTA ACTUAL, EN CASO DE        *
REMARK*    SUPERARLA, SE REEMPLAZA. TAMBIEN SE ACUMULA LA CALIFICACION *
REMARK*    GLOBAL                                                      *
REMARK******************************************************************
REMARK**** SE CUENTA PARA CALCULAR CALIFICACION PROMEDIO EN LOS CASOS
REMARK**** QUE LO REQUIEREN (ADJETIVOS), PARA LOS DEMAS SERA UNO (1)
           ADD 1 TO WS-NUM-A-PROM-SCODRU
REMARK**** SE ACUMUAL CALIFICACION PARA CALIFICACION PROMEDIO EN LOS
REMARK**** CASOS QUE LO REQUIEREN
           ADD WS-CALIF-DE-MAYOR-SCODRU TO WS-CALIF-SCODRU
           IF WS-EVAL-MAYOR-SCODRU > 0
              PERFORM 5750-ALMACENAR-RAZONES-SCODRU
REMARK******* SE CUENTAN LAS OCURRENCIAS DE CADA EVALUACION PARA
REMARK******* COMPARAR CON EL MINIMO DE TIPOS DE EVALUACION
              ADD 1 TO
              WS-ACUEVA-SCODRU
                (WS-TIPO-EVALUACION-SCODRU,WS-EVAL-MAYOR-SCODRU)
REMARK******* SE SELECCIONA LA MAYOR EVALUACION DEL TIPO DE CUENTA
              IF WS-EVAL-MAYOR-SCODRU >
                 WS-MEVCTA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
                 MOVE WS-EVAL-MAYOR-SCODRU
                 TO WS-MEVCTA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
              END-IF
           END-IF
REMARK**** SE CALCULA LA CALIFICACION PROMEDIO Y SE ACUMULA EN LA DEL
REMARK**** TIPO DE CUENTA
           COMPUTE WS-CALCTA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
                 = WS-CALCTA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
                 + (WS-CALIF-SCODRU / WS-NUM-A-PROM-SCODRU).

       5600-CALCULE-CALIFIC-SCODRU.
REMARK******************************************************************
REMARK*5600-CALCULE-CALIFIC-SCODRU.                                    *
REMARK*    SE RECORRE LAS TABLA DE ACUMULADOS Y CONTEO POR TIPO CUENTA,*
REMARK*    SE SELECCIONA EL PESO DE ACUERDO AL 'MINIMO' Y SE CALCULA   *
REMARK*    LA SUMATORIA DE PESOS POR CALIFICACIONES Y LA DE PESOS PARA *
REMARK*    EL CALCULO DEFINITIVO                                       *
REMARK******************************************************************
           PERFORM 5610-EVALUAR-ALTMORAS-SCODRU                         VHF0002 
           PERFORM 5620-DETERMINAR-RCONSUL-SCODRU
REMARK**** SI SE POSEE EL RESULTADO DE LA CONSULTA SE EVALUA, EN CASO
REMARK**** CONTRARIO SE IGNORA
           IF WS-RESCON-SCODRU > 0
              PERFORM 5670-EVALUAR-RCONSULTA-SCODRU
           END-IF
REMARK**** SI EXISTEN REGISTROS DE VALORES PROCESADOS SE EVALUAN DE
REMARK**** ACUERDO EN LO ESTABLECIDO EN LOS PARAMETROS
           IF WS-CTAVAL-SCODRU > 0
              INITIALIZE WS-CALCULODEF-SCODRU
              PERFORM 5650-EVALUAR-VALORES-SCODRU
           END-IF
REMARK**** SE RECORRE LA MATRIZ DE TABLAS DE EVALUACION
           PERFORM VARYING WS-I-SCODRU FROM 1 BY 1
                   UNTIL WS-I-SCODRU > WS-NUMTAB-SCODRU
REMARK******* SE PROCESAN UNICAMENTE LAS TABLAS DE TIPO CUENTA
              IF WS-TIPTAB-SCODRU (WS-I-SCODRU) = WS-TT-TIPCTA-SCODRU
REMARK********** SE REVISAN TODOS LOS ITEMS POR TABLA
                 PERFORM VARYING WS-J-SCODRU FROM 1 BY 1
                         UNTIL WS-J-SCODRU > 99
                    INITIALIZE WS-PESO-SCODRU
REMARK************* SE VERIFICA SI SE SOLICITO TENER EN CUENTA EL MINIMO
                    IF WS-MINCTA-SCODRU (WS-I-SCODRU,WS-J-SCODRU) > 0
                       IF WS-ACUCTA-SCODRU (WS-I-SCODRU,WS-J-SCODRU) <
                          WS-MINCTA-SCODRU (WS-I-SCODRU,WS-J-SCODRU)
REMARK******************* SI NO SE ALCANZO EL MINIMO SE TOMA EL PESO
REMARK******************* SINO SI ES DADO EN CASO CONTRARIO NO SE EVALUA
                          IF WS-PSNCTA-SCODRU (WS-I-SCODRU,WS-J-SCODRU)
                             > 0
                             MOVE WS-PSNCTA-SCODRU
                                    (WS-I-SCODRU,WS-J-SCODRU)
                                  TO WS-PESO-SCODRU
                          END-IF
                       ELSE
REMARK******************* SI SE ALCANZA EL MINIMO SE TOMA EL PESO NORMAL
                          MOVE WS-PESCTA-SCODRU
                                 (WS-I-SCODRU,WS-J-SCODRU)
                               TO WS-PESO-SCODRU
                       END-IF
                    ELSE
REMARK**************** UN MINIMO EN CERO INDICA QUE NO IMPORTA LA
REMARK**************** CANTIDAD DE CUENTAS, POR TANTO SIEMPRE SE TOMA EL
REMARK**************** PESO NORMAL SI ES MAYOR A CERO DE LO CONTRARIO NO
REMARK**************** SE EVALUA
                       IF WS-PESCTA-SCODRU (WS-I-SCODRU,WS-J-SCODRU) > 0
                          MOVE WS-PESCTA-SCODRU
                                 (WS-I-SCODRU,WS-J-SCODRU)
                               TO WS-PESO-SCODRU
                       END-IF
                    END-IF
REMARK************* SI SE DETERMINO EVALUAR (PESO > 0) SE SELECCIONA
REMARK************* LA PEOR EVALUACION Y SE ACUMULAN PESOS Y
REMARK************* CALIFICACIONES POR PESO
                    IF WS-PESO-SCODRU > 0
                       IF WS-MEVCTA-SCODRU (WS-I-SCODRU,WS-J-SCODRU) >
                          WS-EVAL-DEF-SCODRU
                          MOVE WS-MEVCTA-SCODRU
                                 (WS-I-SCODRU,WS-J-SCODRU)
                               TO WS-EVAL-DEF-SCODRU
                       END-IF
                       COMPUTE
                          WS-SUM-CAL-X-PESO-SCODRU
                            = WS-SUM-CAL-X-PESO-SCODRU
                            + (WS-CALCTA-SCODRU
                                 (WS-I-SCODRU,WS-J-SCODRU)
                            * WS-PESO-SCODRU)
                       COMPUTE
                          WS-SUM-PESO-SCODRU
                            = WS-SUM-PESO-SCODRU
                            + WS-NUMCTA-SCODRU (WS-I-SCODRU,WS-J-SCODRU)
                            * WS-PESO-SCODRU
                    END-IF
                 END-PERFORM
              END-IF
           END-PERFORM
REMARK**** SE CALCULA LA CALIFICACION GENERAL
           IF WS-SUM-PESO-SCODRU > 0
              COMPUTE WS-CALIF-DEF-SCODRU
                      = WS-SUM-CAL-X-PESO-SCODRU / WS-SUM-PESO-SCODRU
           END-IF
           IF WS-EVAL-DEF-SCODRU > 0
              PERFORM 5680-EVALUAR-MINEVAL-SCODRU
              PERFORM 5800-DETERMINAR-RAZONES-SCODRU
           ELSE
REMARK******* SI LA EVALUACION DEFINITIVA ES CERO POR DEFINICION SE
REMARK******* RETORNA SALTO
              MOVE "SALTO" TO WS-EVALUACION-SCODRU
              MOVE "S"     TO WS-CODEVA-SCODRU
           END-IF
REMARK**** SE CALCULA LA CALIFICACION RELATIVA QUE HACE QUE LA NOTA Y LA
REMARK**** EVALUACION ESTEN ACORDE
           IF WS-NUMEVA-SCODRU > 0 AND WS-CALIF-DEF-SCODRU > 0 AND
              WS-EVAL-DEF-SCODRU > 0
              COMPUTE WS-CALIF-REL-SCODRU
                      = WS-CALIF-DEF-SCODRU
                      * ((WS-NUMEVA-SCODRU - WS-EVAL-DEF-SCODRU + 1)
                      * (1 / WS-NUMEVA-SCODRU))
           ELSE
              MOVE 0 TO WS-CALIF-REL-SCODRU
           END-IF.

       5610-EVALUAR-ALTMORAS-SCODRU.                                    VHF0002 
 EMARK******************************************************************VHF0002 
 EMARK*5610-EVALUAR-ALTMORAS-SCODRU.                                   *VHF0002 
 EMARK*    SE RECORREN TABLA DE CALIFICACIONES DE CARTERA Y SE CALCULA *VHF0002 
 EMARK*    LA ALTURA DE MORA TANTO ACTUAL COMO HISTORICA, LUEGO SE     *VHF0002 
 EMARK*    PROCEDE A EVALUAR                                           *VHF0002 
 EMARK******************************************************************VHF0002 
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100                  VHF0002 
              COMPUTE WS-ALMORACT-SCODRU =                              VHF0002 
                      WS-ALMORACT-SCODRU +                              VHF0002 
                      WS-ACUCAL-SCODRU (WS-CALIF-CARTERA-SCODRU,I) *    VHF0002 
                      WS-ALMOAC-SCODRU (I)                              VHF0002 
              COMPUTE WS-ALMORHIS-SCODRU =                              VHF0002 
                      WS-ALMORHIS-SCODRU +                              VHF0002 
                      WS-ACUCAL-SCODRU (WS-CALIF-CARTERA-SCODRU,I) *    VHF0002 
                      WS-ALMOHI-SCODRU (I)                              VHF0002 
           END-PERFORM                                                  VHF0002 
           MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU                 VHF0002 
                                WS-IND-ADJETIVO-SCODRU                  VHF0002 
           MOVE 0 TO WS-CALIF-SCODRU                                    VHF0002 
           MOVE 0 TO WS-NUM-A-PROM-SCODRU                               VHF0002 
           MOVE WS-CALIF-ESPECIAL-SCODRU  TO WS-TABCAL-SCODRU           VHF0002 
           MOVE WS-TIPCTA-ESPECIAL-SCODRU TO WS-TABCTA-SCODRU           VHF0002 
           MOVE WS-INDAMA-SCODRU TO WS-INDCAL-SCODRU                    VHF0002 
                                    WS-INDCTA-SCODRU                    VHF0002 
           MOVE WS-ALMORACT-SCODRU TO WS-ACUCAL-TMP-SCODRU              VHF0002 
           MOVE WS-ALMORACT-SCODRU TO WS-ACUCTA-TMP-SCODRU              VHF0002 
           MOVE WS-NO-SCODRU TO WS-IND-TMP-SCODRU                       VHF0002 
           PERFORM 5700-EVALUAR-CTAXMAXIMO-SCODRU                       VHF0002 
           MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU                 VHF0002 
                                WS-IND-ADJETIVO-SCODRU                  VHF0002 
           MOVE 0 TO WS-CALIF-SCODRU                                    VHF0002 
           MOVE 0 TO WS-NUM-A-PROM-SCODRU                               VHF0002 
           MOVE WS-INDAMH-SCODRU TO WS-INDCAL-SCODRU                    VHF0002 
                                    WS-INDCTA-SCODRU                    VHF0002 
           MOVE WS-ALMORHIS-SCODRU TO WS-ACUCAL-TMP-SCODRU              VHF0002 
           MOVE WS-ALMORHIS-SCODRU TO WS-ACUCTA-TMP-SCODRU              VHF0002 
           MOVE WS-NO-SCODRU TO WS-IND-TMP-SCODRU                       VHF0002 
           PERFORM 5700-EVALUAR-CTAXMAXIMO-SCODRU.                      VHF0002 

       5620-DETERMINAR-RCONSUL-SCODRU.
REMARK******************************************************************
REMARK*5620-DETERMINAR-RCONSUL-SCODRU.                                 *
REMARK*    RUTINA ENCARGADA DE RECALCULAR EL TIPO O RESULTADO DE       *
REMARK*    CONSULTA. PARA EL PROGRAMA DE CONSULTAS ICGCON ESTOS        *
REMARK*    PARAMETROS SON DADOS, PARA OTRO PROGRAMA DEBE LLAMARSE EN EL*
REMARK*    LA RUTINA 6000-EVALUAR-IDENTID-SCODRU QUE ESTA EN EL COPY   *
REMARK*    SCODRU.PROC1 EL CUAL SE INCLUIRA DENTRO DEL MENCIONADO      *
REMARK*    PROGRAMA                                                    *
REMARK******************************************************************
REMARK**** SE RECALCULA EL RESULTADO DE CONSULTA DE ACUERDO AL PROCESO
REMARK**** DE LAS CUENTAS
           IF WS-RESCON-SCODRU = 5
REMARK******* SE VERIFICA SI SE PROCESO POR LO MENOS UNA CUENTA PARA
REMARK******* DETERMINAR CONSULTA TIPO-1
              IF WS-IND-TIPO1-SCODRU = WS-SI-SCODRU
                 MOVE 1 TO WS-RESCON-SCODRU
              END-IF
           END-IF.

       5650-EVALUAR-VALORES-SCODRU.
REMARK******************************************************************
REMARK*5650-EVALUAR-VALORES-SCODRU.                                    *
REMARK*    RUTINA ENCARGADA DE EVALUAR LOS VALORES GENERALES           *
REMARK******************************************************************
REMARK**** SE RECALCULAN VALORES CUANDO SE ELIGE PROMEDIO PARA VALORES
REMARK**** NO REPORTADOS
           IF WS-IND-EVAVAL-SCODRU = WS-VALPRO-SCODRU
REMARK******* AL NUMERO TOTAL DE VALORES PROCESADOS SE LE RESTA EL
REMARK******* NUMERO DE VALORES NO REPORTADOS, SE CALCULAN VALORES
REMARK******* PROMEDIOS Y LUEGO SE ADICIONA EL PROMEDIO MULTIPLICADO POR
REMARK******* EL NUMERO DE CUENTAS NO REPORTADO
              COMPUTE WS-CTAVAL-TMP-SCODRU
                        = WS-CTAVAL-SCODRU - WS-CTANRE-SCODRU
              COMPUTE WS-VALDIS-SCODRU
                      = WS-VALDIS-SCODRU
                      + ((WS-VALDIS-SCODRU / WS-CTAVAL-TMP-SCODRU)
                      * WS-CTANRE-SCODRU)
              COMPUTE WS-VALSAL-SCODRU
                      = WS-VALSAL-SCODRU
                      + ((WS-VALSAL-SCODRU / WS-CTAVAL-TMP-SCODRU)
                      * WS-CTANRE-SCODRU)
              COMPUTE WS-VALCUO-SCODRU
                      = WS-VALCUO-SCODRU
                      + ((WS-VALCUO-SCODRU / WS-CTAVAL-TMP-SCODRU)
                      * WS-CTANRE-SCODRU)
REMARK******* ADEMAS DE LOS SUSCRIPTORES QUE NO REPORTAN VALORES SE
REMARK******* DEBEN INCLUIR EN EL PROMEDIO AQUELLOS QUE SI REPORTAN
REMARK******* VALORES, PERO QUE ENVIARON CUENTAS CON UN ESTADO DE MORA
REMARK******* Y SU SALDO MORA EN CERO
              COMPUTE WS-CTAVAL-TMP-SCODRU
                      = WS-CTAVAL-SCODRU
                      - WS-CTANRE-SCODRU
                      - WS-MORNRE-SCODRU
              COMPUTE WS-VALMOR-SCODRU
                      = WS-VALMOR-SCODRU
                      + ((WS-VALMOR-SCODRU / WS-CTAVAL-TMP-SCODRU)
                      * (WS-CTANRE-SCODRU + WS-MORNRE-SCODRU))
           END-IF
REMARK**** SE EVALUAN VALORES SI SON PROMEDIO O CERO O SI SE EXIGE QUE
REMARK**** EXISTEN TODOS Y EN EFECTO ESTAN TODOS (WS-TODVAL-SCODRU = SI),
REMARK**** PARA VALORES NO REPORTADOS
           IF WS-IND-EVAVAL-SCODRU <> WS-VALEXT-SCODRU OR
              (WS-IND-EVAVAL-SCODRU = WS-VALEXT-SCODRU AND
               WS-TODVAL-SCODRU     = WS-SI-SCODRU)
              MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                   WS-IND-ADJETIVO-SCODRU
              MOVE 0 TO WS-CALIF-SCODRU
              MOVE 0 TO WS-NUM-A-PROM-SCODRU
              MOVE WS-CALIF-ESPECIAL-SCODRU  TO WS-TABCAL-SCODRU
              MOVE WS-TIPCTA-ESPECIAL-SCODRU TO WS-TABCTA-SCODRU
              MOVE WS-INDDIS-SCODRU TO WS-INDCAL-SCODRU
                                       WS-INDCTA-SCODRU
              MOVE WS-VALDIS-SCODRU TO WS-ACUCAL-TMP-SCODRU
              MOVE WS-VALDIS-SCODRU TO WS-ACUCTA-TMP-SCODRU
              MOVE WS-NO-SCODRU TO WS-IND-TMP-SCODRU
              PERFORM 5700-EVALUAR-CTAXMAXIMO-SCODRU
              MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                   WS-IND-ADJETIVO-SCODRU
              MOVE 0 TO WS-CALIF-SCODRU
              MOVE 0 TO WS-NUM-A-PROM-SCODRU
              MOVE WS-INDSAL-SCODRU TO WS-INDCAL-SCODRU
                                       WS-INDCTA-SCODRU
              MOVE WS-VALSAL-SCODRU TO WS-ACUCAL-TMP-SCODRU
              MOVE WS-VALSAL-SCODRU TO WS-ACUCTA-TMP-SCODRU
              MOVE WS-NO-SCODRU TO WS-IND-TMP-SCODRU
              PERFORM 5700-EVALUAR-CTAXMAXIMO-SCODRU
              MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                   WS-IND-ADJETIVO-SCODRU
              MOVE 0 TO WS-CALIF-SCODRU
              MOVE 0 TO WS-NUM-A-PROM-SCODRU
              MOVE WS-INDMOR-SCODRU TO WS-INDCAL-SCODRU
                                       WS-INDCTA-SCODRU
              MOVE WS-VALMOR-SCODRU TO WS-ACUCAL-TMP-SCODRU
              MOVE WS-VALMOR-SCODRU TO WS-ACUCTA-TMP-SCODRU
              MOVE WS-NO-SCODRU TO WS-IND-TMP-SCODRU
              PERFORM 5700-EVALUAR-CTAXMAXIMO-SCODRU
              MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                   WS-IND-ADJETIVO-SCODRU
              MOVE 0 TO WS-CALIF-SCODRU
              MOVE 0 TO WS-NUM-A-PROM-SCODRU
              MOVE WS-INDCUO-SCODRU TO WS-INDCAL-SCODRU
                                       WS-INDCTA-SCODRU
              MOVE WS-VALCUO-SCODRU TO WS-ACUCAL-TMP-SCODRU
              MOVE WS-VALCUO-SCODRU TO WS-ACUCTA-TMP-SCODRU
              MOVE WS-NO-SCODRU TO WS-IND-TMP-SCODRU
              PERFORM 5700-EVALUAR-CTAXMAXIMO-SCODRU
           END-IF.

       5670-EVALUAR-RCONSULTA-SCODRU.
REMARK******************************************************************
REMARK*5670-EVALUAR-RCONSULTA-SCODRU.                                  *
REMARK*    EVALUA EL RESULTADO DE LA CONSULTA                          *
REMARK******************************************************************
REMARK**** SE INICIALIZAN LOS PARAMETROS PARA LAS RUTINAS DE SELECCIONAR
REMARK**** LA EVALUACION POR CUENTA Y PARA LA SELECCION DE LA PEOR
REMARK**** EVALUACION POR TIPO CUENTA
           MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                WS-IND-ADJETIVO-SCODRU
           MOVE 0 TO WS-CALIF-SCODRU
           MOVE 0 TO WS-NUM-A-PROM-SCODRU
REMARK**** SE TOMAN LAS TABLAS DE CALIFICACION Y TIPO-CUENTA,
REMARK**** ADEMAS DE LOS INDICES DENTRO DE ELLAS DE ACUERDO AL
REMARK**** RESULTADO DE LA CONSULTA
           MOVE WS-TIPCTA-ESPECIAL-SCODRU TO WS-TABCTA-SCODRU
           MOVE WS-CALIF-ESPECIAL-SCODRU  TO WS-TABCAL-SCODRU
REMARK**** SE SELECCIONA EL INDICE DE ACUERDO AL RESULTADO DE CONSULTA
           MOVE WS-INDRCO-SCODRU (WS-RESCON-SCODRU) TO WS-INDCAL-SCODRU
                                                       WS-INDCTA-SCODRU
           IF WS-INDCTA-SCODRU > 0
              MOVE 1 TO WS-ACUCTA-TMP-SCODRU
              PERFORM 5720-EVAL-CUENTA-SCODRU
           END-IF
REMARK**** SE PROCEDE A EVALUAR SI EL ESTADO DE LA IDENTIFICACION ES 
REMARK**** VIGENTE (00 VIGENTE O 12 PERDIDA DE DERECHOS)
REMARK**** SE INICIALIZAN LOS PARAMETROS PARA LAS RUTINAS DE SELECCIONAR
REMARK**** LA EVALUACION POR CUENTA Y PARA LA SELECCION DE LA PEOR
REMARK**** EVALUACION POR TIPO CUENTA
IDENTI     IF WS-TIDCIU-SCODRU = 1 AND                                  VHF0012 
IDENTI        WS-VIGCED-SCODRU <> 00 AND WS-VIGCED-SCODRU <> 12         VHF0012 
              MOVE WS-NO-SCODRU TO WS-IND-MULT-EVAL-SCODRU
                                   WS-IND-ADJETIVO-SCODRU
              MOVE 0 TO WS-CALIF-SCODRU
              MOVE 0 TO WS-NUM-A-PROM-SCODRU
REMARK******* SE TOMAN LAS TABLAS DE CALIFICACION Y TIPO-CUENTA,
REMARK******* ADEMAS DE LOS INDICES DENTRO DE ELLAS DE ACUERDO A LA
REMARK******* VIGENCIA DE LA CEDULA
              MOVE WS-TIPCTA-ESPECIAL-SCODRU TO WS-TABCTA-SCODRU
              MOVE WS-CALIF-ESPECIAL-SCODRU  TO WS-TABCAL-SCODRU
REMARK******* SE SELECCIONA EL INDICE DE ACUERDO AL RESULTADO DE CONSULTA
              MOVE WS-INDFAL-SCODRU          TO WS-INDCAL-SCODRU
                                                WS-INDCTA-SCODRU
              MOVE 1 TO WS-ACUCTA-TMP-SCODRU
              PERFORM 5720-EVAL-CUENTA-SCODRU
           END-IF.

       5680-EVALUAR-MINEVAL-SCODRU.
REMARK******************************************************************
REMARK*5680-EVALUAR-MINEVAL-SCODRU.                                    *
REMARK*    EVALUA SI SE TIENE EL MINIMO NUMERO DE CUENTAS POR          *
REMARK*    EVALUACION, DE LO CONTRARIO SE TOMARA LA EVLUACION SINO COMO*
REMARK*    DEFINITIVA.                                                 *
REMARK******************************************************************
REMARK**** SE SELECCIONA TABLA DE TIPOS DE EVALUACION Y EL INDICE
REMARK**** CORRESPONDIENTE A LA EVALUACION DEFINITIVA DEL CIUDADANO
           MOVE WS-TIPO-EVALUACION-SCODRU TO WS-TABCTA-SCODRU
           MOVE WS-EVAL-DEF-SCODRU TO WS-INDCTA-SCODRU
REMARK**** SE DETERMINA SI SE REQUIERE VERIFICAR MINIMO, Y SI SE CUMPLIO
REMARK**** CON EL PARA TOMA EVALUACION SINO (DENOMINADA EVALDEF)
           IF WS-MINEVA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU) > 0
              AND WS-ACUEVA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU) <
              WS-MINEVA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
              MOVE WS-DEFEVA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
                   TO WS-EVAL-DEF-SCODRU
REMARK******* SE GUARDAN RAZONES DE EVALUACION
              MOVE WS-EVAL-DEF-SCODRU TO WS-EVAL-MAYOR-SCODRU
              MOVE WS-TABCTA-SCODRU TO WS-TABRAZ-TMP-SCODRU
              MOVE WS-INDCTA-SCODRU TO WS-INDRAZ-TMP-SCODRU
              PERFORM 5750-ALMACENAR-RAZONES-SCODRU
           END-IF
           MOVE WS-DESEVA-SCODRU (WS-TABCTA-SCODRU,WS-EVAL-DEF-SCODRU)
                TO WS-EVALUACION-SCODRU
           MOVE WS-IDEEVA-SCODRU (WS-TABCTA-SCODRU,WS-EVAL-DEF-SCODRU)
                TO WS-CODEVA-SCODRU.

       5700-EVALUAR-CTAXMAXIMO-SCODRU.
REMARK******************************************************************
REMARK*5700-EVALUAR-CTAXMAXIMO-SCODRU.                                 *
REMARK*    HACE LA EVALUACION DE LA TABLA DE CUENTAS QUE SOLO SE       *
REMARK*    EVALUAN UNA VEZ SOBREPASAN EL MAXIMO)                       *
REMARK******************************************************************
REMARK**** SE PROCESA SOLO SI SE DEFINIO UN PESO PARA EL 'TIPO DE
REMARK**** CUENTA' EN CASO CONTRARIO SE ASUME QUE SE ELIGIO NO PROCESAR
REMARK**** ESE TIPO DE CUENTA
           IF WS-PESCTA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU) > 0
REMARK******* SE PROCESA SOLO SI SE DEFINIO EVALUACION-SINO PARA EL
REMARK******* 'ESTADO DE LA CUENTA' DE LO CONTRARIO SE ASUME QUE SE
REMARK******* DECIDIO NO EVALUAR EL ESTADO
              IF WS-ESNCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                 > 0
REMARK********** SE ACUMULA VALOR DE ACUERDO AL PARAMETRO ENVIADO DE LA
REMARK********** RUTINA QUE HACE EL LLAMADO PARA VERIFICAR MAXIMO
                 ADD WS-ACUCAL-TMP-SCODRU
                 TO WS-ACUCAL-SCODRU (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                 PERFORM 5535-ACUMULA-PUNT-ESP-SCODRU
                 IF WS-IND-TMP-SCODRU = WS-SI-SCODRU
REMARK************* SE ACUMULA VALOR DE ACUERDO AL PARAMETRO ENVIADO DE
REMARK************* LA RUTINA QUE HACE EL LLAMADO PARA VERIFICAR MINIMO
                    ADD WS-ACUCTA-TMP-SCODRU
                    TO WS-ACUCTA-SCODRU
                         (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
REMARK************* SE HACE CONTEO PARA ACUMULADO DE CALIFICACION
                    ADD 1 TO
                    WS-NUMCTA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
                    PERFORM 5540-SELECCION-EVAL-SCODRU
                 END-IF
              END-IF
           END-IF.

       5720-EVAL-CUENTA-SCODRU.
REMARK******************************************************************
REMARK*5720-EVAL-CUENTA-SCODRU.                                        *
REMARK*    SE RECIBE LLAMADO DE ACUERDO AL TIPO DE CUENTA Y SE PROCESA *
REMARK*    HACIENDO LAS CONSIDERACIONES PARTICULARES SEGUN CADA TIPO   *
REMARK******************************************************************
REMARK**** SE PROCESA SOLO SI SE DEFINIO UN PESO PARA EL 'TIPO DE
REMARK**** CUENTA, DE LO CONTRARIO SE ASUME QUE SE DESEA IGNORAR
REMARK**** ESE TIPO DE CUENTA
           IF WS-PESCTA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU) > 0
REMARK******* SE PROCESA SOLO SI SE DEFINIO UNA EVALUACION PARA EL
REMARK******* 'ESTADO DE LA CUENTA' DE LO CONTRARIO SE ASUME QUE SE
REMARK******* DESEA IGNORAR ESE ESTADO PARA EVALUACION
              IF WS-EVACAL-SCODRU
                   (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU) > 0
                 EVALUATE WS-TABCTA-SCODRU
                    WHEN WS-TIPCTA-HABPAGO-SCODRU
                       IF WS-TABCAL-SCODRU = WS-CALIF-CARTERA-SCODRU
                          PERFORM 5722-DESGLOSAR-ESTCART-SCODRU
                       ELSE
                          PERFORM 5724-DESGLOSAR-ESTCTE-SCODRU
                       END-IF
                    WHEN WS-TIPCTA-ENDEUDAM-SCODRU
REMARK**************** ACUMULA EL VALOR DE LA DEUDA PARA COMPARAR CON EL
REMARK**************** 'MAXIMO' POR ESTADO
                       COMPUTE WS-ACUCAL-SCODRU
                                 (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                         = WS-ACUCAL-SCODRU
                             (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
BDIEND                   + (BDIEMSUP-VALOR + BDIEMSUP-INTERES) /        FAC0009 
BDIEND                      WS-MILES-SCODRU                             FAC0009 
                       PERFORM 5530-ACUMULA-PUNTAJE-SCODRU
      *             WHEN WS-TIPCTA-SECREAL-SCODRU
REMARK**************** ACUMULA EL VALOR DE LA DEUDA PARA COMPARAR CON EL
REMARK**************** 'MAXIMO' POR EDAD
      *                COMPUTE WS-ACUCAL-SCODRU
      *                          (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
      *                  = WS-ACUCAL-SCODRU
      *                      (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
      *                  + VALOR-BDIRMAE
      *                PERFORM 5530-ACUMULA-PUNTAJE-SCODRU
                    WHEN WS-TIPCTA-ESPECIAL-SCODRU
REMARK*************** CUENTA LA OCURRENCIA PARA COMPARAR CON EL 'MAXIMO'
                       ADD 1 TO WS-ACUCAL-SCODRU
                                  (WS-TABCAL-SCODRU,WS-INDCAL-SCODRU)
                       PERFORM 5530-ACUMULA-PUNTAJE-SCODRU
                 END-EVALUATE
REMARK********** SE ACTUALIZA ACUMULADO U OCURRENCIAS PARA VERIFICACION
REMARK********** DE MINIMO DE CUENTAS POR TIPO DE CUENTA
                 ADD WS-ACUCTA-TMP-SCODRU
                 TO WS-ACUCTA-SCODRU (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
REMARK********** SE ACTUALIZA NUMERO DE OCURRENCIAS PARA CALCULO DE
REMARK********** CALIFICACION
                 ADD 1
                    TO WS-NUMCTA-SCODRU
                         (WS-TABCTA-SCODRU,WS-INDCTA-SCODRU)
                 PERFORM 5540-SELECCION-EVAL-SCODRU
              END-IF
           END-IF.

       5722-DESGLOSAR-ESTCART-SCODRU.
REMARK******************************************************************
REMARK*5722-DESGLOSAR-ESTCART-SCODRU.                                  *
REMARK*    EVALUA LOS POSIBLES ESTADOS DE UNA DE CARTERA: ACTUAL,      *
REMARK*    ESTUVO Y ADJETIVO SEGUN EL CASO PARA DETERMINAR LA          *
REMARK*    EVALUACION DE LA CUENTA                                     *
REMARK******************************************************************
           PERFORM 5500-EVALUAR-ESTADO-SCODRU
           MOVE WS-CALIF-ADJCAR-SCODRU TO WS-TABCAL-SCODRU
REMARK**** SE PROCESAN LOS ADJETIVOS SI LOS HAY
           IF ADJETIVO1-ABD07 > 0
REMARK**** SE SELECCIONA INDICE PARA ADJETIVO CORRESPONDIENTE
              MOVE ADJETIVO1-ABD07 TO WS-INDCAL-SCODRU
              PERFORM 5210-EVALUE-ADJETIVO-SCODRU
           END-IF
           IF ADJETIVO2-ABD07 > 0
REMARK******* SE SELECCIONA INDICE PARA ADJETIVO CORRESPONDIENTE
              MOVE ADJETIVO2-ABD07 TO WS-INDCAL-SCODRU
              PERFORM 5210-EVALUE-ADJETIVO-SCODRU
           END-IF
           IF ADJETIVO3-ABD07 > 0
REMARK******* SE SELECCIONA INDICE PARA ADJETIVO CORRESPONDIENTE
              MOVE ADJETIVO3-ABD07 TO WS-INDCAL-SCODRU
              PERFORM 5210-EVALUE-ADJETIVO-SCODRU
           END-IF.

       5724-DESGLOSAR-ESTCTE-SCODRU.
REMARK******************************************************************
REMARK*5724-DESGLOSAR-ESTCTE-SCODRU.                                   *
REMARK*    EVALUA LOS POSIBLES ESTADOS DE UNA CUENTA CORRIENTE: ACTUAL,*
REMARK*    ESTUVO Y ADJETIVO SEGUN EL CASO PARA DETERMINAR LA          *
REMARK*    EVALUACION DE LA CUENTA                                     *
REMARK******************************************************************
           PERFORM 5500-EVALUAR-ESTADO-SCODRU
REMARK**** SE PROCESAN LOS ADJETIVO SI LOS HAY
           IF ADJETIVO-ABD06 > 0
REMARK******* SE SELECCIONA TABLA E INDICE PARA ADJETIVO
REMARK******* CORRESPONDIENTE
              MOVE WS-CALIF-ADJCTE-SCODRU TO WS-TABCAL-SCODRU
              MOVE ADJETIVO-ABD06 TO WS-INDCAL-SCODRU
              PERFORM 5210-EVALUE-ADJETIVO-SCODRU
           END-IF.

       5750-ALMACENAR-RAZONES-SCODRU.
REMARK******************************************************************
REMARK*5750-ALMACENAR-RAZONES-SCODRU.                                  *
REMARK*    SE TOMA LA EVALUACION Y SI HAY ESPACIO PARA ALMACENAR EN LA *
REMARK*    TABLA RESPECTIVA SE GUARDAN LOS CODIGOS DE TABLA E INDICE   *
REMARK*    PARA INDICAR PORQUE SE OBTUVO UNA EVALUACION                *
REMARK******************************************************************
REMARK**** SE VERIFICA QUE NO SE HAYA COMPLETADO EL NUMERO DE RAZONES
REMARK**** PARA LA EVALUACION EN PROCESO PARA ALMACENARLA ACTUAL
           IF WS-CONRAZ-SCODRU (WS-EVAL-MAYOR-SCODRU) < 10
              ADD 1 TO WS-CONRAZ-SCODRU (WS-EVAL-MAYOR-SCODRU)
              MOVE WS-CONRAZ-SCODRU (WS-EVAL-MAYOR-SCODRU)
                   TO WS-I-SCODRU
              MOVE WS-INDRAZ-TMP-SCODRU
                 TO WS-INDRAZ-SCODRU (WS-EVAL-MAYOR-SCODRU, WS-I-SCODRU)
              MOVE WS-TABRAZ-TMP-SCODRU
                 TO WS-TABRAZ-SCODRU (WS-EVAL-MAYOR-SCODRU, WS-I-SCODRU)
           END-IF.

       5800-DETERMINAR-RAZONES-SCODRU.
REMARK******************************************************************
REMARK*5800-DETERMINAR-RAZONES-SCODRU.                                 *
REMARK*    SE SELECCIONAN LA DIEZ PRIMERAS RAZONES DE PEOR A MEJOR     *
REMARK*    EVALUACION.                                                 *
REMARK******************************************************************
           MOVE 0 TO WS-K-SCODRU
           INITIALIZE WS-TABDRZ-SCODRU                                  VHF0004
           MOVE 0 TO WS-M-SCODRU                                        VHF0004
REMARK**** SE RECORRE EL VECTOR DE RAZONES PARA ESCOGER LAS 10 PEORES
           PERFORM VARYING WS-I-SCODRU FROM 9 BY -1
              UNTIL WS-I-SCODRU < 1 OR
              WS-K-SCODRU >= 10
              PERFORM VARYING WS-J-SCODRU FROM 1 BY 1
                      UNTIL WS-J-SCODRU > WS-CONRAZ-SCODRU (WS-I-SCODRU)
                            OR WS-K-SCODRU >= 10
                 PERFORM 5810-VERIFICAR-RAZDUPLICADA                    VHF0004
                 IF WS-IND-RAZDUP-SCODRU = WS-NO-SCODRU                 VHF0004
                    ADD 1 TO WS-K-SCODRU
                    MOVE WS-IDEEVA-SCODRU (WS-TIPO-EVALUACION-SCODRU,
                                           WS-I-SCODRU)
                         TO WS-IDERAZDF-SCODRU (WS-K-SCODRU)
                    MOVE WS-TABRAZ-SCODRU (WS-I-SCODRU,WS-J-SCODRU)
                         TO WS-TABRAZDF-SCODRU (WS-K-SCODRU)
                    MOVE WS-INDRAZ-SCODRU (WS-I-SCODRU,WS-J-SCODRU)
                         TO WS-ITEM-AUX-SCODRU
                    MOVE WS-ITEM-TAB-SCODRU (WS-ITEM-AUX-SCODRU)
                         TO WS-ITERAZDF-SCODRU (WS-K-SCODRU)
                 END-IF                                                 VHF0004
              END-PERFORM
           END-PERFORM.

       5810-VERIFICAR-RAZDUPLICADA.
REMARK******************************************************************
REMARK*5810-VERIFICAR-RAZDUPLICADA.                                    *
REMARK*    SE VERIFICA QUE LA RAZON EN PROCESO NO ESTE DUPLICADA       *
REMARK******************************************************************
           MOVE WS-NO-SCODRU TO WS-IND-RAZDUP-SCODRU                    VHF0004
           MOVE 1 TO WS-L-SCODRU                                        VHF0004
           PERFORM UNTIL WS-L-SCODRU > 90 OR                            VHF0004
              WS-TABRDU-SCODRU (WS-L-SCODRU) = 0 OR                     VHF0004
              WS-IND-RAZDUP-SCODRU = WS-SI-SCODRU                       VHF0004
              IF WS-TABRAZ-SCODRU (WS-I-SCODRU,WS-J-SCODRU) =           VHF0004
                 WS-TABRDU-SCODRU (WS-L-SCODRU) AND                     VHF0004
                 WS-INDRAZ-SCODRU (WS-I-SCODRU,WS-J-SCODRU) =           VHF0004
                 WS-INDRDU-SCODRU (WS-L-SCODRU)                         VHF0004
                 MOVE WS-SI-SCODRU TO WS-IND-RAZDUP-SCODRU              VHF0004
              END-IF                                                    VHF0004
              ADD 1 TO WS-L-SCODRU                                      VHF0004
           END-PERFORM                                                  VHF0004
           IF WS-IND-RAZDUP-SCODRU = WS-NO-SCODRU                       VHF0004
              ADD 1 TO WS-M-SCODRU                                      VHF0004
              MOVE WS-TABRAZ-SCODRU (WS-I-SCODRU,WS-J-SCODRU)           VHF0004
                   TO WS-TABRDU-SCODRU (WS-M-SCODRU)                    VHF0004
              MOVE WS-INDRAZ-SCODRU (WS-I-SCODRU,WS-J-SCODRU)           VHF0004
                   TO WS-INDRDU-SCODRU (WS-M-SCODRU)                    VHF0004
           END-IF.
