      * SCOT16-PROC.v.0028
MATCH1$SET CONSTANT HACERMATCH"NO"                                      RMB0023 
MATCH1$IF HACERMATCH = "SI"                                             RMB0023 
MATCH1$DISPLAY ".............COMPILANDO SCOT16 CON MATCH **********     RMB0023 
MATCH1$ELSE                                                             RMB0023 
MATCH1$DISPLAY ".............COMPILANDO SCOT16 SIN MATCH **********     RMB0023 
MATCH1$END                                                              RMB0023 
OPTOPE******          REVISADO MEJORAMIENTO OPERATIVO     **************RMB0003
REMARK**********************************************************************
REMARK* CONJUNTO DE RUTINAS QUE PERMITE CALCULAR EL SCORE GENERICO DE RIESGO
REMARK* PREDICTA. ESTAS RUTINAS CALCULAN DE FORMA INTEGRA TODO EL SCORE,   *
REMARK* CALCULANDO PRIMERO TODAS LAS 340 CARACTERISTICAS INICIALES DEL MODE*
REMARK* LO, LUEGO TOMA LAS 40 QUE FUERON PREDICTIVAS Y CON ESTAS CALCULA EL*
REMARK* SCORE. SU FORMA DE LLAMADO ES:
REMARK* PERFORM 5000-TRU-SCORING-TOTAL                                     *
REAMRK*         PARAMETROS DE ENTRADA:
REMARK*            TIP-ID-ALE  (TIPO DE IDENTIFICACION)
REMARK*            NUM-ID-ALE  (NUMERO DE IDENTIFICACION)
REMARK*            FECHA-RUN-TIME (FECHA DIA DE CORRIDA AAAAMM )          
PATCH**            ( MOVE FUNCTION CURRENT-DATE(1:6) TO FECHA-RUN-DATE)
REMARK*            FECHA-TRI      (FECHA DIA DE CORRIDA AAAAMMDD )          
PATCH**                 (MOVE FUNCTION CURRENT-DATE(1:8) TO ULTIMO-TRI)
REMARK*         VARIABLES DE SALIDA
REMARK*            SCORE       (CALIFICACION PREDICTA)
REMARK*            ADVERSE-RAZON(1)  (CODIGO DE ACCION ADVERSA #1)
REMARK*            ADVERSE-RAZON(2)  (CODIGO DE ACCION ADVERSA #2)
REMARK*            ADVERSE-RAZON(3)  (CODIGO DE ACCION ADVERSA #3)
REMARK*            ADVERSE-RAZON(4)  (CODIGO DE ACCION ADVERSA #4)
REMARK*            SCORE-CARD        (NUMERO DEL SCORE CARD CLASIFICADO)
REMARK* (ESTRUCT)  REG-ALE O REG-CARACTERISTICAS (340 CARACTERSITICAS)
REMARK* (ESTRUCT)  VARIABLES-INTERMEDIAS       (VARIABLES DEL MODELO)
REMARK* (ESTRUCT)  VARIABLES-AA                (VARIABLES EXCLUCION AAA)
REMARK* (ESTRUCT)  VARIABLES-ECUACION          (VARIABLES CALCULO SCORE)
REMARK* CORRE1  SE ELIMINAN LAS VARIABLES CRD13P,SUM054,OPOT24 Y CK00s POR *
REMARK*         VARIAR ANORMALMENTE EL SCORE (ABRIL 13/2000)               *
REMARK* CORRE2  SE MODIFICAN LOS AAC         (ABRIL 13/2000)
REMARK* CORRE3  SE QUITA LA PREGUNTA POR 999 (ABRIL 17/2000) POR CHICAGO   *
REMARK******************************************************************
REMARK* VHF0003     * BLQEND - SE INTRODUCE CODIGO PARA ELIMINAR       *
REMARK* VICTOR HUGO *   LOS REGISTROS DE ENDEUDAMIENTO BLOQUEADOS.     *
REMARK* FORERO      *                                                  *
REMARK* RMB0003     * OPTOPE - SE HACE EL COMENTARIO DE QUE LA RUTINA  *
REMARK* RICARDO     *   FUE REVISADA PARA MEJORAMIENTO OPERATIVO,      *
REMARK* MARTINEZ    *   TAMBIEN SE INDICA EL PUNTO DONDE SE PUEDE HACER*
REMARK* AGO.27.2001 *   OPTIMIZACION UTILIZANDO EL MEJORTAMIENTO.      *
REMARK******************************************************************
REMARK* RMB0004     * ACIERT - MODIFICACIONES GLOBALES DE ACIERTA      *
REMARK* MARTINEZ    * ACIE01 - SCORECARD 1                             *
REMARK* OCT.5.2002  * ACIE02 - SCORECARD 1                             *
REMARK*             * ACIE03 - SCORECARD 1                             *
REMARK*             * ACIE04 - SCORECARD 1                             *
REMARK*             * ACIE05 - SCORECARD 1                             *
REMARK*             * NEWPRE - CARACTERISTICAS NUEVAS PARA ACIERTA     *
REMARK*             * NEWPR1 - MANEJO DE VALORES PARA ACIERTA          *
REMARK******************************************************************
REMARK* FAC0005     * BDIEND * MODIFICACION COPYS ENDEUDAMIENTO GLOBAL
REMARK* RMB0005     * ARRA01 - SE DEJA QUE LA FECHA DE LOS REGISTROS   *
REMARK* MARTINEZ    *        - QUE ESTAN AL DIA SEA ESTA Y NO LA DEL   *
REMARK* OCT.29.2002 *        - SUSCRIPTOR A PARTIR DE NOVIEMBRE 2002   *
REMARK******************************************************************
REMARK* RMB0006     * AC2003 - SE CORRIGEN PROBLEMAS DE ACIERTA DE     *
REMARK* MARTINEZ    *        - ENDEUDAMIENTO GLOBAL,SCORE-CARD2 Y      *
REMARK* ENE.30.2003 *        - MOVIMIENTOS DE VARIABLES REDEFINIDAS    *
REMARK**********************************************************************   
REMARK* RMB0007     * REAL01 - REALINEAMIENTO ACIERTA VERSION # 1      *
REMARK* MARTINEZ    * REAL02 - REALINEAMIENTO ACIERTA VERSION # 2      *
REMARK* ENE.30.2003 * REAL03 - REALINEAMIENTO ACIERTA VERSION # 3      *
REMARK**********************************************************************   
REMARK* FAC0008     * MODBDI * CAMBIO COPYS REGISTRADURIA COMO BDIIREGI*
REMARK* F.CUADROS   *        - AMPLIACION DE LA ESTRUCTURA. SE DEFINIO *
REMARK* ABR.29.2003 *        - COMO ARCHIVO TIPO 8                     *
REMARK******************************************************************
REMARK* RMB0009     * MICROC * SE ASIMILA MICROCREDITO A DEUDA DE      *
REMARK* R.MARTINEZ  *        - CONSUMO                                 *
REMARK* AGO.06.2003 *        -                                         *
REMARK******************************************************************
REMARK* RMB0010     * CONS01 * SE TOMA EN CUENTA CUANTO EL VALOR DE    *
REMARK* R.MARTINEZ  *        - LA VARIABLE IQ014 ES NEGATIVA           *
REMARK* MAY-11-2004 *        -                                         *
REMARK******************************************************************
REMARK* FAC0011     * NUIP01 * LLAMADO A RUTINA BDIIVIDE PARA VALIDAR  *
REMARK* F.CUADROS   *        * LA IDENTIFICACION                       *
REMARK* JUL. 01/2004*        *                                         *
REMARK******************************************************************
REMARK* FAC0012     * NUIP02 * ANTES DE LLAMAR LA RUTINA BDIIVIDE SE   *
REMARK* F.CUADROS   *        * VALIDA QUE LA IDENTIFICACION SOLO SEA   *
REMARK* JUL. 27/2004*        * TIPO 1-CEDULA                           *
REMARK******************************************************************
REMARK* RMB0013     * MICR01 * SE IMPLEMENTA LA SEGMENTACION DE MICRO- *
REMARK* R.MARTINEZ  *        * CREDITO BASADO EN ACIERTA . SU RESULTADO*
REMARK* MAR. 29 2005*        * SON LETRAS DE LA A A LA G               *
REMARK******************************************************************
REMARK* RMB0014     * MICR02 * SE IMPLEMENTA EL SCORE        DE MICRO- *
REMARK* R.MARTINEZ  *        * CREDITO BASADO EN ACIERTA . SU RESULTADO*
REMARK* MAY. 18 2005*        * SON SON UN NUMERO DE 1 A 999 PREFILTRADO*
REMARK******************************************************************
REMARK* RMB0015        * FILT01 : SE APLICA EL FILTRO PARA ACIERTA Y ASIGNA*
REMARK* RICARDO MARTINE*          EN CASO DE CUMPLIRLO, SE MANEJAN LOS     *
REMARK* JUNI. 23 2005  *          CODIGOS DE RAZON 42 Y 72 (SCORE = 0)
REMARK**********************************************************************
REMARK* RMB0016        * MICR03 : SE IMPLEMENTA LA 3 REPROGRAMACION DEL    *
REMARK* RICARDO MARTINE*          SCORE MICROCREDITO BASICO, DONDE SE ELIMI*
REMARK* SEPT. 10 2005  *          NA EL USO DE ACIERTA                     *
REMARK*                * CANC01 : SE ADAPTA LA CARACTERISTICA XX003 COMO   *
REMARK*                *          MESES DE LA CANCELACION MAS RECIENTE     *
REMARK**********************************************************************
REMARK* GJC0017        * LECCON : EN LA LECTURA DEL ARCHIVO DE CONSULTAS   *
REMARK* G. JIMENEZ     *          ICBCON, SE ADICIONA IGNORE LOCK PARA QUE *
REMARK* ENE 16/2006    *          LOS PROGRAMS NO ABORTEN                  *
REMARK* RMB0017        * MOD120 : SE CALCULA EL SCORE A PERSONAS QUE ACTUAL*
REMARK*                *          MENTE PRESENTAN MORA DE 120 DIAS O MAYOR *
REMARK**********************************************************************
REMARK* RMB0018        * GENE01 : SE CORRIGE ERROR DE ASIGNAR LOS VALORES  *
REMARK* RICARDO MARTINE*          A LA CARACTERISTICA ID005 DEL GENERO     *
REMARK* ABRI. 05 2006  *          (ESTABA AL CONTRARIO)
REMARK* SEPT. 2006     *          (ESTABA AL CONTRARIO)
REMARK*                * MICR04 : SE ELIMINAN DOS DE LOS FILTROS DE BASICO *
REMARK*                *          POR PROBLEMAS CON BANCO DE BOGOTA        *
REMARK**********************************************************************
REMARK* RMB0019        * MICR05 : SE CAMBIA LA PROGRAMACIÓN DEL SCORE Básico
REMARK* RICARDO MARTINE* PARA QUE SE IDENTIFIQUE CON CÓDIGO RAZÓN 72 A LOS *
REMARK* OCT. 2006      * PERFILES ACIERTA QUE NO CUMPLEN CON TENER EL MÍNIMO
REMARK*                * DE EXPERCIENCIA PARA RECIBIR UN PUNTAJE.
REMARK**********************************************************************
REMARK* RMB0020        * MICR06 : SE AMPLIA EL RANGO PARA PERFIL ALTO EN
REMARK* RICARDO MARTINE* BASICO,AFINANDO EL PATCH MICR05 , DEJANDO LOS     *
REMARK* MARZO 6 2007   * CODIGOS DE ACCION ADVERSA SEGUN EL DISEÑO INICIAL *
REMARK**********************************************************************
REMARK* RMB0021        * ACIEME:  IMPLEMENTACION CARACTERISTICAS DE ACIERTA*
REMARK* RICARDO MARTINE*          PLUS CON LAS MODIFICACIONES A LOS ANTERIO*
REMARK* MARZ30-2007    *          RES PARA CONSERVAR COMPATIBILIDAD
REMARK*                * ACIEM1:  ACIERTA-PLUS SCORE-CARD 1
REMARK*                * ACIEM2:  ACIERTA-PLUS SCORE-CARD 2
REMARK*                * ACIEM3:  ACIERTA-PLUS SCORE-CARD 3
REMARK*                * ACIEM4:  ACIERTA-PLUS SCORE-CARD 4
REMARK*                * ACIEM5:  ACIERTA-PLUS SCORE-CARD 5
REMARK*                * ACIEM6:  ACIERTA-PLUS SCORE-CARD 6
REMARK*                * ACIEM7:  ACIERTA-PLUS SCORE-CARD 7
REMARK*                * NO TODAS LAS LINEAS TIENEN CORRECTAMENTE EL PATCH
REMARK*                * DEBIDO A LOS MULTIPLES CAMBIOS PARA ACIERTA M, LOS
REMARK*                * CUALES NO TIENEN EL COMPLETO CONTROL
REMARK**********************************************************************
REMARK* RMB0022        * ACIEM8:  INICIALIZACION YA QUE EN ALGUNOS CASOS SE*
REMARK* RICARDO MARTINE*          TOMAN LOS VALORES DEL REGISTRO ANTERIOR  *
REMARK* SEPT-2007      *          
REMARK**********************************************************************
REMARK* RMB0023        * MATCH1:  SE INCLUYE CONDICIONALMENTE EL MANEJO DE *
REMARK* RICARDO MARTINE*          MATCH DE NOMBRES                         *
REMARK* OCT-2007       *          
REMARK**********************************************************************
REMARK* GDT0024     *LEY001 - PROCESO DE AMNISTIA SEGUN ARTICULO 0021  *
REMARK* ENE.23/2008 *   QUE INCLUYE EL VECTOR DE 48 POSICIONES.        *
REMARK* GER.DESARR. *CTRCAS - CONTROL DE CASCARAS. VERIFICANDO SUSCRIP-*
REMARK*             *        TORES SUFICIENTES PARA GENERAR CASCARAS   *
      ******************************************************************|
REMARK* RMB0025        * ACIEM9:  CAMBIO DEL USO DE CBAT120 POR CBAT120P *   
REMARK* RICARDO MARTINE*          EN EL SCORE CARD 2                     *  
REMARK* OCT-2008       *          
REMARK**********************************************************************
REMARK* RMB0026        * DELTA0:  SE ADICIONA MANEJO PARA DELTA SCORE ES   *
REMARK* RICARDO MARTINE*          DECIR CALCULO DE SCORE CON Y SIN AMNISTIA*
REMARK* OCT-2008       *          Y MOSTRAR O NO EL SCORE DE ACUERDO A LO- *
REMARK*                *          GICA DEFINIDA POR USA. INICIALMENTE OFF  *
REMARK**********************************************************************
REMARK* GJC0027        * RAZ001:  SE ELIMINAN LAS RAZONES AVERSAS CUANDO NO*
REMARK* G.JIMENEZ      *          ESTAN AUTORIZADAS PARA EL CASO DE BASICO *
REMARK* FEB-11-2009    *                                                   *
REMARK**********************************************************************
REMARK* GJC0028        * ARTI13:  MANEJO PARA APLICACION DE ARTICULO 13    *
REMARK* G.JIMENEZ      *          SE APAGA SWITCH ANTES DE CALCULAR Y SE   *
REMARK* MAY-6-2009     *          VUELVE A PRENDER DESPUÉS DE CALCULADO    *
REMARK**********************************************************************

FILT01 2000-FIL-POCA-HISTORIA-P.                                        RMB0015 
REMARK******************************************************************
REMARK*2000-FILTRAR-POCA-HISTORIA-P.
REMARK*    ESTA RUTINA EXAMINA SI SE COLOICA EN CERO EL SCORE EN CASO DE
REMARK*    TENER POCA HISTORIA DE CREDITO
REMARK******************************************************************
FILT01     IF TCR001 = 0 AND TBS001 = 0                                 RMB0015 
FILT01        PERFORM 7897-A-AOT                                        RMB0015 
FILT01        IF A-AOT < 6 AND A-AOT NUMERIC                            RMB0015 
FILT01           MOVE 0 TO SCORE                                        RMB0015 
FILT01           MOVE 42 TO ADVERSE-RAZON(1)                            RMB0015 
FILT01           MOVE 0  TO ADVERSE-RAZON(2)                            RMB0015 
FILT01           MOVE 0  TO ADVERSE-RAZON(3)                            RMB0015 
FILT01           MOVE 0  TO ADVERSE-RAZON(4)                            RMB0015 
FILT01        END-IF                                                    RMB0015 
FILT01     END-IF.                                                      RMB0015 
FILT01 2000-FIL-POCA-HISTORIA-A.                                        RMB0015 
REMARK******************************************************************
REMARK*2000-FILTRAR-POCA-HISTORIA-P.
REMARK*    ESTA RUTINA EXAMINA SI SE COLOICA EN CERO EL SCORE EN CASO DE
REMARK*    TENER POCA HISTORIA DE CREDITO
REMARK******************************************************************
FILT01     IF TCR001 = 0 AND TBS001 = 0                                 RMB0015 
FILT01        PERFORM 7897-A-AOT                                        RMB0015 
FILT01        IF A-AOT < 6 AND A-AOT NUMERIC                            RMB0015 
FILT01           MOVE 0 TO A-SCORE                                      RMB0015 
FILT01           MOVE 72 TO A-ADVERSE-RAZON(1)                          RMB0015 
FILT01           MOVE 0  TO A-ADVERSE-RAZON(2)                          RMB0015 
FILT01           MOVE 0  TO A-ADVERSE-RAZON(3)                          RMB0015 
FILT01           MOVE 0  TO A-ADVERSE-RAZON(4)                          RMB0015 
FILT01        END-IF                                                    RMB0015 
FILT01     END-IF.                                                      RMB0015 
TRANS  5000-TRU-SCORING-TOTAL.     
REMARK******************************************************************
REMARK*5000-TRU-SCORING-TOTAL.     
REMARK* SE INICIALIZAN TODAS LAS VARIABLES INVOLUCRADAS EN EL MODELO, SE   *
REMARK* PROCEDE A CALCULAR LAS CARACTERISTICAS DE LA PERSONA, RECORRIENDO  *
REMARK* CARTERA,ENDEUDAMIENTO,CONSULTAS,CUENTAS CORRIENTES Y  REGISTRADURIA*
REMARK* SE CONSOLIDA FINALMENTE LAS VARIABLES CALCULANDO LOS VALORES (-)   *
REMARK* DE ACUERDO A LAS ESPECIFICACIONES. FINALMENTE SE CALCULA EL SCORE  *
REMARK* CON BASE A LAS CARACTERISTICAS HALLADAS                            *
REMARK* AUNQUE LAS RAZONES ADVESAS SE CALCULARON. SE DEJAN EN CEROS.
REMARK******************************************************************
DELTA0      MOVE AMNISTIA21-LEEMSTRS TO AMNISTIA21-LEEMSTRS-AUX         RMB0026
ARTI13      MOVE SW-ART13-AMNIST21   TO SW-ART13-AMNIST21-AUX           GJC0028
ARTI13      MOVE SW-NOV-48-LEEMSTRS  TO SW-NOV-48-AUX                   GJC0028
DELTA0      MOVE 0 TO AMNISTIA21-LEEMSTRS *> ELIMINAR SI SCORE TOMA AMNIRMB0026
ARTI13      MOVE 0 TO SW-ART13-AMNIST21   *>ELIMINAR SI SCORE TOMA ART13GJC0028
ARTI13      MOVE 0 TO SW-NOV-48-LEEMSTRS  *>ELIMINAR SI SCORE TOM 48MESEGJC0028
DELTA0      PERFORM 5000-TRU-SCORING-GENERAL.                           RMB0026
DELTA0      PERFORM 5000-TRU-ALMACENAR-SCORES.                          RMB0026
DELTA0      IF HACER-SCO-DELTA = 1   *> EL DEFAULT DEBE ESTAR EN 1      RMB0026
DELTA0         PERFORM 5000-TRU-SCORING-DELTA                           RMB0026
DELTA0      END-IF.                                                     RMB0026
DELTA0      MOVE  AMNISTIA21-LEEMSTRS-AUX TO AMNISTIA21-LEEMSTRS        RMB0026
ARTI13      MOVE  SW-ART13-AMNIST21-AUX   TO SW-ART13-AMNIST21          GJC0028
ARTI13      MOVE  SW-NOV-48-AUX           TO SW-NOV-48-LEEMSTRS         GJC0028
DELTA0           IF ADVERSE-RAZON(1) < 40                               RMB0026
DELTA0              MOVE 99 TO ADVERSE-RAZON(1)                         RMB0026
DELTA0              MOVE  0 TO ADVERSE-RAZON(2)                         RMB0026
DELTA0              MOVE  0 TO ADVERSE-RAZON(3)                         RMB0026
DELTA0              MOVE  0 TO ADVERSE-RAZON(4)                         RMB0026
DELTA0           END-IF                                                 RMB0026
DELTA0           IF A-ADVERSE-RAZON(1) < 70                             RMB0026
DELTA0              MOVE 99 TO A-ADVERSE-RAZON(1)                       RMB0026
DELTA0              MOVE  0 TO A-ADVERSE-RAZON(2)                       RMB0026
DELTA0              MOVE  0 TO A-ADVERSE-RAZON(3)                       RMB0026
DELTA0              MOVE  0 TO A-ADVERSE-RAZON(4)                       RMB0026
DELTA0           END-IF                                                 RMB0026
DELTA0           IF M-ADVERSE-RAZON(1) < 70                             RMB0026
DELTA0              MOVE 99 TO M-ADVERSE-RAZON(1)                       RMB0026
DELTA0              MOVE  0 TO M-ADVERSE-RAZON(2)                       RMB0026
DELTA0              MOVE  0 TO M-ADVERSE-RAZON(3)                       RMB0026
DELTA0              MOVE  0 TO M-ADVERSE-RAZON(4)                       RMB0026
RAZ001           ELSE                                                   GJC0027
RAZ001              MOVE  0 TO M-ADVERSE-RAZON(2)                       GJC0027
RAZ001              MOVE  0 TO M-ADVERSE-RAZON(3)                       GJC0027
RAZ001              MOVE  0 TO M-ADVERSE-RAZON(4)                       GJC0027
DELTA0           END-IF                                                 RMB0026
DELTA0           IF P-ADVERSE-RAZON(1) < 70                             RMB0026
DELTA0              MOVE 99 TO P-ADVERSE-RAZON(1)                       RMB0026
DELTA0              MOVE  0 TO P-ADVERSE-RAZON(2)                       RMB0026
DELTA0              MOVE  0 TO P-ADVERSE-RAZON(3)                       RMB0026
DELTA0              MOVE  0 TO P-ADVERSE-RAZON(4)                       RMB0026
DELTA0           END-IF.                                                RMB0026

TRANS  5000-TRU-SCORING-TOTAL-CONRAZ.     
REMARK******************************************************************
REMARK*5000-TRU-SCORING-TOTAL-CON-RAZONES.     
REMARK* SE INICIALIZAN TODAS LAS VARIABLES INVOLUCRADAS EN EL MODELO, SE   *
REMARK* PROCEDE A CALCULAR LAS CARACTERISTICAS DE LA PERSONA, RECORRIENDO  *
REMARK* CARTERA,ENDEUDAMIENTO,CONSULTAS,CUENTAS CORRIENTES Y  REGISTRADURIA*
REMARK* SE CONSOLIDA FINALMENTE LAS VARIABLES CALCULANDO LOS VALORES (-)   *
REMARK* DE ACUERDO A LAS ESPECIFICACIONES. FINALMENTE SE CALCULA EL SCORE  *
REMARK* CON BASE A LAS CARACTERISTICAS HALLADAS                            *
REMARK* LA UNICA DIFERENCIA CON EL 5000-TRU-SCORING-TOTAL ES QUE RESPETA
REMARK* LOS CODIGOS DE RAZONES QUE SE CALCULARON
REMARK******************************************************************
DELTA0      MOVE AMNISTIA21-LEEMSTRS TO AMNISTIA21-LEEMSTRS-AUX         RMB0026
ARTI13      MOVE SW-ART13-AMNIST21   TO SW-ART13-AMNIST21-AUX           GJC0028
ARTI13      MOVE SW-NOV-48-LEEMSTRS  TO SW-NOV-48-AUX                   GJC0028
DELTA0      MOVE 0 TO AMNISTIA21-LEEMSTRS *> ELIMINAR SI SCORE TOMA AMNIRMB0026
ARTI13      MOVE 0 TO SW-ART13-AMNIST21   *>ELIMINAR SI SCORE TOMA ART13GJC0028
ARTI13      MOVE 0 TO SW-NOV-48-LEEMSTRS  *>ELIMINAR SI SCORE TOM 48MESEGJC0028
DELTA0      PERFORM 5000-TRU-SCORING-GENERAL.                           RMB0026
DELTA0      PERFORM 5000-TRU-ALMACENAR-SCORES.                          RMB0026
DELTA0      IF HACER-SCO-DELTA = 1   *> EL DEFAULT DEBE ESTAR EN 1      RMB0026
DELTA0         PERFORM 5000-TRU-SCORING-DELTA                           RMB0026
DELTA0      END-IF.                                                     RMB0026
DELTA0      MOVE  AMNISTIA21-LEEMSTRS-AUX  TO  AMNISTIA21-LEEMSTRS.     RMB0026
ARTI13      MOVE  SW-ART13-AMNIST21-AUX   TO SW-ART13-AMNIST21.         GJC0028
ARTI13      MOVE  SW-NOV-48-AUX           TO SW-NOV-48-LEEMSTRS.        GJC0028
DELTA0 5000-TRU-SCORING-GENERAL.                                        RMB0026
PATCH4      MOVE TAGS-ALE TO PARTE1-REG-INP.
CARTER      PERFORM 5000-TRU-INI-VAR.         
PATCH4      MOVE PARTE1-REG-INP TO TAGS-ALE.
PATCH4      MOVE PARTE2-REG-INP TO MASTAGS-ALE.
CARTER      INITIALIZE LLAVE-MAES-CREDIT.
CARTER      MOVE NUM-ID-ALE TO  NUM-ID-ABD07  
CARTER      MOVE TIP-ID-ALE TO  TIPO-ID-ABD07  
CARTER      MOVE 0 TO FIN-CAR.
LEY001      PERFORM 0500-ASIGNA-ID-ICMCRE-START.                        GDT0024 
CARTER      START MAESTRO-CREDIT KEY > LLAVE-MAES-CREDIT
CARTER         INVALID KEY MOVE 1 TO FIN-CAR   
CARTER         NOT INVALID KEY 
LEY001*           READ MAESTRO-CREDIT NEXT RECORD AT END                GDT0024 
LEY001*                MOVE 1 TO FIN-CAR                                GDT0024 
LEY001*           END-READ                                              GDT0024 
LEY001            PERFORM  1000-LEE-ICMCRE-SECUENCIAL                   GDT0024 
LEY001            IF  SW-LECTURA-MAESTROS  =  1                         GDT0024 
LEY001              MOVE  1         TO  FIN-CAR                         GDT0024 
LEY001            END-IF                                                GDT0024 
CARTER      END-START.
CARTER      MOVE NUM-ID-ALE   TO CEDULA-ANT 
CARTER      MOVE TIP-ID-ALE   TO TIP-ID-ANT 
CARTER      PERFORM 5000-TRU-BUS-CRBSCCOT UNTIL 
CARTER                NUM-ID-ABD07 NOT = CEDULA-ANT 
CARTER            OR  TIPO-ID-ABD07 NOT = TIP-ID-ANT OR FIN-CAR = 1.
CARTER      PERFORM  5500-TRU-CAR-FIN-CRBSCCOT.
BDIEND      INITIALIZE BDIEMSUP-LLAVE.                                  FAC0005 
BDIEND      MOVE TIP-ID-ANT TO BDIEMSUP-TIP-ID.                         FAC0005 
BDIEND      MOVE CEDULA-ANT TO BDIEMSUP-NUM-ID.                         FAC0005 
BDIEND      MOVE ULTIMO-TRI TO BDIEMSUP-FECHA.                          FAC0005 
AC2003      MOVE ULTIMO-TRI TO ULTIMO-TRI-AUX.                          RMB0006 
ENDEUD      MOVE 0 TO FIN-MSUP.
BDIEND      START BDIEMSUP KEY <= BDIEMSUP-LLAVE                        FAC0005 
ENDEUD         INVALID KEY MOVE 1 TO FIN-MSUP
ENDEUD         NOT INVALID KEY 
BDIEND            READ BDIEMSUP PREVIOUS RECORD AT END                  FAC0005 
ENDEUD                 MOVE 1 TO FIN-MSUP
ENDEUD            NOT AT END 
BDIEND                IF BDIEMSUP-FECHA > 0                             FAC0005 
BDIEND                   MOVE BDIEMSUP-FECHA TO ULTIMO-TRI              FAC0005 
ENDEUD                END-IF    
ENDEUD            END-READ
ENDEUD      END-START.
ENDEUD      PERFORM 5000-TRU-BUS-GDXXX UNTIL TIP-ID-ANT 
BDIEND         NOT = BDIEMSUP-TIP-ID OR CEDULA-ANT NOT =                FAC0005 
BDIEND               BDIEMSUP-NUM-ID OR                                 FAC0005 
BDIEND         FIN-MSUP = 1 OR BDIEMSUP-FECHA(1:6) NOT =                FAC0005 
                     ULTIMO-TRI(1:6).
AC2003      MOVE ULTIMO-TRI-AUX TO ULTIMO-TRI.                          RMB0006 
CONSUL      INITIALIZE LLAVE-INDEX.
CONSUL      MOVE TIP-ID-ANT TO TIP-ID-IND. 
CONSUL      MOVE CEDULA-ANT TO NUM-ID-IND.   
CONSUL      MOVE 0 TO FIN-CON.
CONSUL      START INDEXADO KEY > LLAVE-INDEX
CONSUL         INVALID KEY MOVE 1 TO FIN-CON 
CONSUL         NOT INVALID KEY 
LECCON            READ INDEXADO NEXT RECORD WITH IGNORE LOCK            GJC0017 
LECCON                 AT END                                           GJC0017 
CONSUL                 MOVE 1 TO FIN-CON    
CONSUL            END-READ
CONSUL      END-START.
CONSUL      PERFORM 5000-TRU-BUS-IQXXX UNTIL TIP-ID-ANT 
CONSUL         NOT = TIP-ID-IND  OR CEDULA-ANT NOT = NUM-ID-IND  OR
CONSUL         FIN-CON  = 1.
CHECK       INITIALIZE LLAVE-MAES-CHECK.
CHECK       MOVE TIP-ID-ANT TO TIPO-ID-ABD06
CHECK       MOVE CEDULA-ANT TO NUM-ID-ABD06. 
CHECK       MOVE 0 TO FIN-CHK.
LEY001      PERFORM 0600-ASIGNA-ID-ICMCHK-START.                        GDT0024 
CHECK       START MAESTRO-CHECK KEY > LLAVE-MAES-CHECK
CHECK          INVALID KEY MOVE 1 TO FIN-CHK 
CHECK          NOT INVALID KEY 
LEY001*           READ MAESTRO-CHECK NEXT RECORD AT END                 GDT0024 
LEY001*                MOVE 1 TO FIN-CHK                                GDT0024 
LEY001*           END-READ                                              GDT0024 
LEY001            PERFORM  3000-LEE-ICMCHK-SECUENCIAL                   GDT0024 
LEY001            IF  SW-LECTURA-MAESTROS  =  1                         GDT0024 
LEY001              MOVE 1 TO FIN-CHK                                   GDT0024 
LEY001            END-IF                                                GDT0024 
CHECK       END-START.
CHECK       PERFORM 5000-TRU-BUS-CKXXX UNTIL TIP-ID-ANT 
CHECK          NOT = TIPO-ID-ABD06 OR CEDULA-ANT NOT = NUM-ID-ABD06 OR
CHECK          FIN-CHK  = 1.
NEWSCO      PERFORM 5000-TRU-USU-FINSCO.
SCOT16*     PERFORM 5000-TRU-BUS-IDENTIDAD.
SCOT16*     PERFORM 5000-TRU-CAR-CONSOLIDAR.
SCOT16*     PERFORM 5800-TRU-REALIZAR-SCORE.        
DELTA0 5000-TRU-ALMACENAR-SCORES.                                       RMB0026
DELTA0      MOVE SCORE TO SCORE-DELTA(1).                               RMB0026
DELTA0      MOVE ADVERSE-RAZON(1) TO ADVERSE-RAZON1-DELTA(1).           RMB0026
DELTA0      MOVE ADVERSE-RAZON(2) TO ADVERSE-RAZON2-DELTA(1).           RMB0026
DELTA0      MOVE ADVERSE-RAZON(3) TO ADVERSE-RAZON3-DELTA(1).           RMB0026
DELTA0      MOVE ADVERSE-RAZON(4) TO ADVERSE-RAZON4-DELTA(1).           RMB0026
DELTA0      MOVE A-SCORE TO SCORE-DELTA(4).                             RMB0026
DELTA0      MOVE A-ADVERSE-RAZON(1) TO ADVERSE-RAZON1-DELTA(4).         RMB0026
DELTA0      MOVE A-ADVERSE-RAZON(2) TO ADVERSE-RAZON2-DELTA(4).         RMB0026
DELTA0      MOVE A-ADVERSE-RAZON(3) TO ADVERSE-RAZON3-DELTA(4).         RMB0026
DELTA0      MOVE A-ADVERSE-RAZON(4) TO ADVERSE-RAZON4-DELTA(4).         RMB0026
DELTA0      MOVE M-SCORE TO SCORE-DELTA(6).                             RMB0026
DELTA0      MOVE M-ADVERSE-RAZON(1) TO ADVERSE-RAZON1-DELTA(6).         RMB0026
DELTA0      MOVE M-ADVERSE-RAZON(2) TO ADVERSE-RAZON2-DELTA(6).         RMB0026
DELTA0      MOVE M-ADVERSE-RAZON(3) TO ADVERSE-RAZON3-DELTA(6).         RMB0026
DELTA0      MOVE M-ADVERSE-RAZON(4) TO ADVERSE-RAZON4-DELTA(6).         RMB0026
DELTA0      MOVE P-SCORE TO SCORE-DELTA(8).                             RMB0026
DELTA0      MOVE P-ADVERSE-RAZON(1) TO ADVERSE-RAZON1-DELTA(8).         RMB0026
DELTA0      MOVE P-ADVERSE-RAZON(2) TO ADVERSE-RAZON2-DELTA(8).         RMB0026
DELTA0      MOVE P-ADVERSE-RAZON(3) TO ADVERSE-RAZON3-DELTA(8).         RMB0026
DELTA0      MOVE P-ADVERSE-RAZON(4) TO ADVERSE-RAZON4-DELTA(8).         RMB0026
DELTA0 5000-TRU-SCORING-DELTA.                                          RMB0026
DELTA0      IF SW-AMNIST21 = 1                                          RMB0026
DELTA0         MOVE 0 TO SW-AMNIST21                                    RMB0026
DELTA0         PERFORM 5000-TRU-SCORING-GENERAL                         RMB0026
DELTA0         MOVE 1 TO SW-AMNIST21                                    RMB0026
DELTA0         EVALUATE TIP-SCO-GENERICO                                RMB0026
DELTA0            WHEN 1                                                RMB0026
DELTA0              IF SCORE <> SCORE-DELTA(1)                          RMB0026
DELTA0                 *>INSERTAR LOGICA DE EXCLUSION                   RMB0026
DELTA0                 IF SCORE = 3                                     RMB0026
DELTA0                    MOVE 76 TO A-ADVERSE-RAZON(1)                 RMB0026
DELTA0                    MOVE  0 TO A-ADVERSE-RAZON(2)                 RMB0026
DELTA0                    MOVE  0 TO A-ADVERSE-RAZON(3)                 RMB0026
DELTA0                    MOVE  0 TO A-ADVERSE-RAZON(4)                 RMB0026
DELTA0                 ELSE                                             RMB0026
DELTA0                    MOVE SCORE-DELTA(1) TO SCORE                  RMB0026
DELTA0                    MOVE ADVERSE-RAZON1-DELTA(1) TO               RMB0026
DELTA0                         ADVERSE-RAZON(1)                         RMB0026
DELTA0                    MOVE ADVERSE-RAZON2-DELTA(1) TO               RMB0026
DELTA0                         ADVERSE-RAZON(2)                         RMB0026
DELTA0                    MOVE ADVERSE-RAZON3-DELTA(1) TO               RMB0026
DELTA0                         ADVERSE-RAZON(3)                         RMB0026
DELTA0                    MOVE ADVERSE-RAZON4-DELTA(1) TO               RMB0026
DELTA0                         ADVERSE-RAZON(4)                         RMB0026
DELTA0                 END-IF                                           RMB0026
DELTA0              END-IF                                              RMB0026
DELTA0            WHEN 4                                                RMB0026
DELTA0              IF A-SCORE <> SCORE-DELTA(4)                        RMB0026
DELTA0                 EVALUATE A-SCORE   *> SIN AMNISTIA               RMB0026
DELTA0                   WHEN 150 THRU 200                              RMB0026
DELTA0                     IF SCORE-DELTA(4) > 250                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 201 THRU 250                              RMB0026
DELTA0                     IF SCORE-DELTA(4) > 300                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 251 THRU 400                              RMB0026
DELTA0                     IF SCORE-DELTA(4) > 400                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 401 THRU 450                              RMB0026
DELTA0                     IF SCORE-DELTA(4) > 450                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 451 THRU 550                              RMB0026
DELTA0                     IF SCORE-DELTA(4) > 550                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 551 THRU 600                              RMB0026
DELTA0                     IF SCORE-DELTA(4) > 750                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 601 THRU 850  *> SIEMPRE DEJA ACIERTA     RMB0026
DELTA0                     IF SCORE-DELTA(4) > 850                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                 END-EVALUATE                                     RMB0026
DELTA0                 IF A-SCORE = 3                                   RMB0026
DELTA0                    MOVE 76 TO A-ADVERSE-RAZON(1)                 RMB0026
DELTA0                    MOVE  0 TO A-ADVERSE-RAZON(2)                 RMB0026
DELTA0                    MOVE  0 TO A-ADVERSE-RAZON(3)                 RMB0026
DELTA0                    MOVE  0 TO A-ADVERSE-RAZON(4)                 RMB0026
DELTA0                 ELSE                                             RMB0026
DELTA0                    MOVE SCORE-DELTA(4) TO A-SCORE                RMB0026
DELTA0                    MOVE ADVERSE-RAZON1-DELTA(4) TO               RMB0026
DELTA0                         A-ADVERSE-RAZON(1)                       RMB0026
DELTA0                    MOVE ADVERSE-RAZON2-DELTA(4) TO               RMB0026
DELTA0                         A-ADVERSE-RAZON(2)                       RMB0026
DELTA0                    MOVE ADVERSE-RAZON3-DELTA(4) TO               RMB0026
DELTA0                         A-ADVERSE-RAZON(3)                       RMB0026
DELTA0                    MOVE ADVERSE-RAZON4-DELTA(4) TO               RMB0026
DELTA0                         A-ADVERSE-RAZON(4)                       RMB0026
DELTA0                 END-IF                                           RMB0026
DELTA0              END-IF                                              RMB0026
DELTA0            WHEN 6                                                RMB0026
DELTA0              IF M-SCORE <> SCORE-DELTA(6)                        RMB0026
DELTA0                 IF M-ADVERSE-RAZON(1) = 80  *> ACIERTA           RMB0026
DELTA0                    EVALUATE M-SCORE   *> SIN AMNISTIA            RMB0026
DELTA0                      WHEN 150 THRU 200                           RMB0026
DELTA0                        IF SCORE-DELTA(6) > 250                   RMB0026
DELTA0                           MOVE 3 TO M-SCORE                      RMB0026
DELTA0                        END-IF                                    RMB0026
DELTA0                      WHEN 201 THRU 250                           RMB0026
DELTA0                        IF SCORE-DELTA(6) > 300                   RMB0026
DELTA0                           MOVE 3 TO M-SCORE                      RMB0026
DELTA0                        END-IF                                    RMB0026
DELTA0                      WHEN 251 THRU 400                           RMB0026
DELTA0                        IF SCORE-DELTA(6) > 400                   RMB0026
DELTA0                           MOVE 3 TO M-SCORE                      RMB0026
DELTA0                        END-IF                                    RMB0026
DELTA0                      WHEN 401 THRU 450                           RMB0026
DELTA0                        IF SCORE-DELTA(6) > 450                   RMB0026
DELTA0                           MOVE 3 TO M-SCORE                      RMB0026
DELTA0                        END-IF                                    RMB0026
DELTA0                      WHEN 451 THRU 550                           RMB0026
DELTA0                        IF SCORE-DELTA(6) > 550                   RMB0026
DELTA0                           MOVE 3 TO M-SCORE                      RMB0026
DELTA0                        END-IF                                    RMB0026
DELTA0                      WHEN 551 THRU 600                           RMB0026
DELTA0                        IF SCORE-DELTA(6) > 750                   RMB0026
DELTA0                           MOVE 3 TO M-SCORE                      RMB0026
DELTA0                        END-IF                                    RMB0026
DELTA0                      WHEN 601 THRU 850  *> SIEMPRE DEJA ACIERTA  RMB0026
DELTA0                        IF SCORE-DELTA(6) > 850                   RMB0026
DELTA0                           MOVE 3 TO M-SCORE                      RMB0026
DELTA0                        END-IF                                    RMB0026
DELTA0                    END-EVALUATE                                  RMB0026
DELTA0                    IF M-SCORE = 3                                RMB0026
DELTA0                       MOVE 76 TO M-ADVERSE-RAZON(1)              RMB0026
DELTA0                       MOVE  0 TO M-ADVERSE-RAZON(2)              RMB0026
DELTA0                       MOVE  0 TO M-ADVERSE-RAZON(3)              RMB0026
DELTA0                       MOVE  0 TO M-ADVERSE-RAZON(4)              RMB0026
DELTA0                    ELSE                                          RMB0026
DELTA0                       MOVE SCORE-DELTA(6) TO M-SCORE             RMB0026
DELTA0                       MOVE ADVERSE-RAZON1-DELTA(6) TO            RMB0026
DELTA0                            M-ADVERSE-RAZON(1)                    RMB0026
DELTA0                       MOVE ADVERSE-RAZON2-DELTA(6) TO            RMB0026
DELTA0                            M-ADVERSE-RAZON(2)                    RMB0026
DELTA0                       MOVE ADVERSE-RAZON3-DELTA(6) TO            RMB0026
DELTA0                            M-ADVERSE-RAZON(3)                    RMB0026
DELTA0                       MOVE ADVERSE-RAZON4-DELTA(6) TO            RMB0026
DELTA0                            M-ADVERSE-RAZON(4)                    RMB0026
DELTA0                    END-IF                                        RMB0026
DELTA0                 ELSE                                             RMB0026
DELTA0                    *>INSERTAR LOGICA DE EXCLUSION                RMB0026
DELTA0                    IF M-SCORE = 3                                RMB0026
DELTA0                       MOVE 76 TO M-ADVERSE-RAZON(1)              RMB0026
DELTA0                       MOVE  0 TO M-ADVERSE-RAZON(2)              RMB0026
DELTA0                       MOVE  0 TO M-ADVERSE-RAZON(3)              RMB0026
DELTA0                       MOVE  0 TO M-ADVERSE-RAZON(4)              RMB0026
DELTA0                    ELSE                                          RMB0026
DELTA0                       MOVE SCORE-DELTA(6) TO M-SCORE             RMB0026
DELTA0                       MOVE ADVERSE-RAZON1-DELTA(6) TO            RMB0026
DELTA0                            M-ADVERSE-RAZON(1)                    RMB0026
DELTA0                       MOVE ADVERSE-RAZON2-DELTA(6) TO            RMB0026
DELTA0                            M-ADVERSE-RAZON(2)                    RMB0026
DELTA0                       MOVE ADVERSE-RAZON3-DELTA(6) TO            RMB0026
DELTA0                            M-ADVERSE-RAZON(3)                    RMB0026
DELTA0                       MOVE ADVERSE-RAZON4-DELTA(6) TO            RMB0026
DELTA0                            M-ADVERSE-RAZON(4)                    RMB0026
DELTA0                    END-IF                                        RMB0026
DELTA0                 END-IF                                           RMB0026
DELTA0              END-IF                                              RMB0026
DELTA0            WHEN 8                                                RMB0026
DELTA0              IF P-SCORE <> SCORE-DELTA(8)                        RMB0026
DELTA0                 EVALUATE A-SCORE   *> SIN AMNISTIA               RMB0026
DELTA0                   WHEN 150 THRU 200                              RMB0026
DELTA0                     IF SCORE-DELTA(8) > 250                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 201 THRU 250                              RMB0026
DELTA0                     IF SCORE-DELTA(8) > 300                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 251 THRU 350                              RMB0026
DELTA0                     IF SCORE-DELTA(8) > 400                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 351 THRU 400                              RMB0026
DELTA0                     IF SCORE-DELTA(8) > 450                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 401 THRU 450                              RMB0026
DELTA0                     IF SCORE-DELTA(8) > 500                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 451 THRU 550                              RMB0026
DELTA0                     IF SCORE-DELTA(8) > 550                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 551 THRU 600                              RMB0026
DELTA0                     IF SCORE-DELTA(8) > 750                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                   WHEN 601 THRU 850  *> SIEMPRE DEJA ACIERTA     RMB0026
DELTA0                     IF SCORE-DELTA(8) > 850                      RMB0026
DELTA0                        MOVE 3 TO A-SCORE                         RMB0026
DELTA0                     END-IF                                       RMB0026
DELTA0                 END-EVALUATE                                     RMB0026
DELTA0                 IF P-SCORE = 3                                   RMB0026
DELTA0                    MOVE 76 TO P-ADVERSE-RAZON(1)                 RMB0026
DELTA0                    MOVE  0 TO P-ADVERSE-RAZON(2)                 RMB0026
DELTA0                    MOVE  0 TO P-ADVERSE-RAZON(3)                 RMB0026
DELTA0                    MOVE  0 TO P-ADVERSE-RAZON(4)                 RMB0026
DELTA0                 ELSE                                             RMB0026
DELTA0                    MOVE SCORE-DELTA(8) TO P-SCORE                RMB0026
DELTA0                    MOVE ADVERSE-RAZON1-DELTA(8) TO               RMB0026
DELTA0                         P-ADVERSE-RAZON(1)                       RMB0026
DELTA0                    MOVE ADVERSE-RAZON2-DELTA(8) TO               RMB0026
DELTA0                         P-ADVERSE-RAZON(2)                       RMB0026
DELTA0                    MOVE ADVERSE-RAZON3-DELTA(8) TO               RMB0026
DELTA0                         P-ADVERSE-RAZON(3)                       RMB0026
DELTA0                    MOVE ADVERSE-RAZON4-DELTA(8) TO               RMB0026
DELTA0                         P-ADVERSE-RAZON(4)                       RMB0026
DELTA0                 END-IF                                           RMB0026
DELTA0              END-IF                                              RMB0026
DELTA0         END-EVALUATE                                             RMB0026
DELTA0      END-IF.                                                     RMB0026
TRANS  5000-TRU-INI-VAR.         
REMARK**********************************************************************
REMARK*5000-TRU-INI-VAR.         
REMARK* SE INICIALIZAN LAS VARIABLES INTERNAS, SE ESTABLECE LA FECHA DE LA *
REMARK* LA CORRIDA (LA ACTUAL) Y LA FECHA PARA EL ULTIMO TRIMESTRE DE      *
REMARK* ENDEUDAMIENTO GLOBAL . TODAS LAS CARACTERISTICAS CON VALOR 999 SON *
REMARK* INICIALIZADAS AQUI.
REMARK**********************************************************************
NEWSCO      MOVE 0 TO SCORE-CARD.
PATCH**     MOVE FUNCTION CURRENT-DATE(1:6) TO FECHA-RUN-DATE.
ACIEME      INITIALIZE REG-ALE-WORK.                                    RMB0021 
TRANS       INITIALIZE VECTORES-GENERALES.
TRANS       MOVE 1 TO I .
ACIEME      PERFORM UNTIL I > 6                                         RMB0021 
CANC01         MOVE 999 TO V-WORK(I,03)                                 RMB0016 
TRANS          MOVE 999 TO V-WORK(I,41)
TRANS          MOVE 100 TO J
TRANS          PERFORM UNTIL J > 103 
TRANS            MOVE 999 TO V-WORK(I,J)
TRANS            ADD 1 TO J
TRANS          END-PERFORM
ACIEME         MOVE 999 TO V-104(I)                                     RMB0021 
ACIEME         MOVE 999 TO V-105(I)                                     RMB0021 
TRANS          ADD 1 TO I
TRANS       END-PERFORM. 
ACIEME      MOVE 999 TO CK006.                                          RMB0021 
ACIEME      MOVE 999 TO AH004.                                          RMB0021 
CONSUL      MOVE 999 TO IQ00X(5).
PATCH**     MOVE FUNCTION CURRENT-DATE(1:8) TO ULTIMO-TRI       .
PROPIO      MOVE "32" TO ULTIMO-TRI(7:2).
TRANS       INITIALIZE VARIABLES-INTERMEDIAS
TRANS                VARIABLES-AA
TRANS                VARIABLES-ECUACION.
ACIEME*              VARIABLES-ADVERSAS.                                RMB0021 
ACIEME*              MOVE 0 TO ADVERSE-RAZON(1)                         RMB0021 
ACIEME*              MOVE 0 TO ADVERSE-RAZON(2)                         RMB0021 
ACIEME*              MOVE 0 TO ADVERSE-RAZON(3)                         RMB0021 
ACIEME*              MOVE 0 TO ADVERSE-RAZON(4)                         RMB0021 
ACIEME*   INITIALIZE RAZONES V-ADVERSOS.                                RMB0021 
ACIEME*   MOVE 0 TO A-ADVERSE-RAZON(1)                                  RMB0021 
ACIEME*   MOVE 0 TO A-ADVERSE-RAZON(2)                                  RMB0021 
ACIEME*   MOVE 0 TO A-ADVERSE-RAZON(3)                                  RMB0021 
ACIEME*   MOVE 0 TO A-ADVERSE-RAZON(4).                                 RMB0021 
ACIEME****SE INICIAN ADVERSE CODE DE ACIERTA PLUS *************         RMB0021 
ACIEME*   MOVE 0 TO P-ADVERSE-RAZON(1)                                  RMB0021 
ACIEME*   MOVE 0 TO P-ADVERSE-RAZON(2)                                  RMB0021 
ACIEME*   MOVE 0 TO P-ADVERSE-RAZON(3)                                  RMB0021 
ACIEME*   MOVE 0 TO P-ADVERSE-RAZON(4).                                 RMB0021 
TRANS  5000-TRU-BUS-CKXXX.     
REMARK**********************************************************************
REMARK*5000-TRU-BUS-CKXXX.                                                 *
REMARK* SE REALIZA EL RECORRIDO POR TODAS LAS CUENTAS BANCARIAS  DE LA     *
REMARK* PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS CARACTERISTICAS        *
REMARK**********************************************************************
LEY001*     IF HACERMATCH = "SI"                                        GDT0024 
LEY001*     PERFORM 8000-U-VER-CTAABD06-BDAMATCH                        GDT0024 
LEY001*     END                                                         GDT0024 
TRANS       MOVE 0 TO VALIDA.
TRANS       IF IND-BLOQUEO-ABD06 = 0   
TRANS          MOVE COD-SUS-ABD06 TO COD-SUSCRIP-ABD02  
@RANS          READ SUSCRIPTOR WITH IGNORE LOCK                 
TRANS             NOT INVALID KEY 
TRANS                 IF ESTADO-ABD02 = 1 
TRANS                    MOVE 1 TO VALIDA
TRANS                 END-IF                           
TRANS          END-READ                           
TRANS       END-IF.
TRANS      IF VALIDA = 1 
CHECK         PERFORM 5000-TRU-USU-CKXXX.
LEY001*    READ MAESTRO-CHECK NEXT RECORD AT END                        GDT0024 
LEY001*         MOVE 1 TO FIN-CHK                                       GDT0024 
LEY001*    END-READ.                                                    GDT0024 
LEY001     PERFORM  3000-LEE-ICMCHK-SECUENCIAL                          GDT0024 
LEY001     IF  SW-LECTURA-MAESTROS  =  1                                GDT0024 
LEY001       MOVE 1 TO FIN-CHK                                          GDT0024 
LEY001     END-IF.                                                      GDT0024 
ENDEUD 5000-TRU-BUS-GDXXX.     
REMARK**********************************************************************
REMARK*5000-TRU-BUS-GDXXX.                                                 *
REMARK* SE REALIZA EL RECORRIDO POR TODAS LAS CUENTAS DE ENDEUDAMIENTO DEL *
REMARK* ULTIMO TRIMESTRE A LA PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS  *
REMARK* CARACTERISTICAS                                                    *
REMARK**********************************************************************
REMARK***   NO SE HACE LA VALIDACION DE VALORES NI DE CALIFICACIONES    VHF0003
REMARK***   COMO EN LA RUTINA SCODRU Y EN ICGCON, YA QUE EL ENVIO A EU  VHF0003
REMARK***   TAMPOCO LOS CONTENIA                                        VHF0003
BDIEND      IF BDIEMSUP-IND-BLOQ <> 1                                   FAC0005 
BLQEND         PERFORM 5000-TRU-USU-GDXXX                               VHF0003
BLQEND      END-IF.                                                     VHF0003
BDIEND      READ BDIEMSUP PREVIOUS RECORD AT END                        FAC0005 
ENDEUD           MOVE 1 TO FIN-MSUP
ENDEUD      END-READ.
CONSUL 5000-TRU-BUS-IQXXX.     
REMARK**********************************************************************
REMARK*5000-TRU-BUS-IQXXX.     
REMARK* SE REALIZA EL RECORRIDO POR TODAS LAS CONSULTAS REALIZADAS A LA    *
REMARK* PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS CARACTERISTICAS        *
REMARK**********************************************************************
LEXCON     PERFORM 5000-TRU-USU-IQXXX.
LECCON     READ INDEXADO NEXT RECORD WITH IGNORE LOCK                   GJC0017 
LECCON          AT END                                                  GJC0017 
CONSUL          MOVE 1 TO FIN-CON    
CONSUL     END-READ.
TRANS  5000-TRU-BUS-CRBSCCOT. 
REMARK**********************************************************************
REMARK*5000-TRU-BUS-CRBSCCOT. 
REMARK* SE REALIZA EL RECORRIDO POR TODAS LAS CUENTAS DE CARTERA DE LA     *
REMARK* PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS CARACTERISTICAS MIRANDO*
REMARK* QUE EL SUSCRIPTOR NO ESTE BLOQUEADO Y UBICANDO EL REGISTRO         *
REMARK**********************************************************************
TRANS       MOVE 0 TO VALIDA.
LEY001*     IF HACERMATCH = "SI"                                        GDT0024 
LEY001*     PERFORM 8000-U-VER-CTAABD07-BDAMATCH                        GDT0024 
LEY001*     END                                                         GDT0024 
TRANS       IF IND-BLOQUEO-ABD07 = 0   
TRANS          MOVE COD-SUS-ABD07 TO COD-SUSCRIP-ABD02  
TRANS          READ SUSCRIPTOR  WITH IGNORE LOCK
TRANS             NOT INVALID KEY 
TRANS                 IF ESTADO-ABD02 = 1 
TRANS                    MOVE 1 TO VALIDA
TRANS                 END-IF                           
TRANS          END-READ                           
TRANS       END-IF.
ACIEME     IF TIP-SCO-GENERICO = 8 AND NOV-REPORT-ABD07 = 2 *> NO ENTREGRMB0021 
ACIEME        MOVE ESTADO-MES-ABD07 TO VECTOR-HIS                       RMB0021 
ACIEME        IF VECTOR-HIS = 0                   *> Y SIN HISTORIA     RMB0021 
ACIEME           MOVE 0 TO VALIDA                 *> SE DESHECHA        RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF                                                       RMB0021 
TRANS      IF VALIDA = 1 
TRANS         PERFORM 5320-TRU-USU-CTACAR
TRANS      END-IF.
CARTER     MOVE NUM-ID-ABD07 TO CEDULA-ANT 
CARTER     MOVE TIPO-ID-ABD07 TO TIP-ID-ANT 
LEY001*    READ MAESTRO-CREDIT NEXT RECORD                              GDT0024 
LEY001*         AT END MOVE 1 TO FIN-CAR                                GDT0024 
LEY001*    END-READ.                                                    GDT0024 
LEY001     PERFORM  1000-LEE-ICMCRE-SECUENCIAL                          GDT0024 
LEY001     IF  SW-LECTURA-MAESTROS  =  1                                GDT0024 
LEY001       MOVE 1 TO FIN-CAR                                          GDT0024 
LEY001     END-IF.                                                      GDT0024 
IDENTI 5000-TRU-BUS-IDENTIDAD.
REMARK**********************************************************************
REMARK*5000-TRU-BUS-IDENTIDAD.                                             *
REMARK* SE REALIZA EL ACCESO AL REGISTRO DE DATOS PERSONALES DE LA         *
REMARK* PERSONA A QUIEN SE LE ESTAN EXTRACTANDO LAS CARACTERISTICAS        *
REMARK**********************************************************************
IDENTI      MOVE CEDULA-ANT TO CED-NUMIDE.     
IDENTI      MOVE TIP-ID-ANT TO CED-TIPIDE.     
NUIP02      IF CED-TIPIDE = 1                                           FAC0012
NUIP02         MOVE CED-TIPIDE TO TIP-IDE-BDIIVIDE                      FAC0012
NUIP02         MOVE CED-NUMIDE TO NUM-IDE-BDIIVIDE                      FAC0012
NUIP02         PERFORM 80100-VALIDAR-IDENTIFICACION                     FAC0012
NUIP02         IF SW-ID-BDIIVIDE = 0                                    FAC0012
NUIP02            MOVE TIP-ID-ANT TO TIP-IDE-SCO                        FAC0012
NUIP02            MOVE CEDULA-ANT TO NUM-IDE-SCO                        FAC0012
NUIP02            PERFORM 5000-TRU-CAR-IDXXX                            FAC0012
NUIP02         ELSE                                                     FAC0012
NUIP02            PERFORM 5000-TRU-CAR-NO-IDXXX                         FAC0012
NUIP02         END-IF                                                   FAC0012
NUIP02      ELSE                                                        FAC0012
NUIP02         PERFORM 5000-TRU-CAR-NO-IDXXX                            FAC0012
NUIP02      END-IF.                                                     FAC0012
NEWSCO*********************************************************************
NEWSCO*                COMIENZO RUTINAS DE CARACTERISTICAS                *
NEWSCO*********************************************************************
TRANS  5000-TRU-CAR-CONSOLIDAR.
TRANS       PERFORM  5700-TRU-ARME-SALIDA.
IDENTI 5000-TRU-CAR-NO-IDXXX.
REMARK**********************************************************************
REMARK*5000-TRU-CAR-NO-IDXXX.
REMARK* SE DEJAN LOS VALORES ADECUADOS PARA CUANDO LA PERSONA NO TIENE     *
REMARK* DATOS EN LA REGISTRADURIA                                          *
REMARK**********************************************************************
IDENTI        MOVE " -1" TO ID001(1:3).
IDENTI        MOVE "00"  TO ID002(1:2).
IDENTI        MOVE "-1"  TO ID003(1:2).
IDENTI        MOVE " -1" TO ID004(1:3).
IDENTI        MOVE "-1"  TO ID005(1:2).
IDENTI 5000-TRU-CAR-IDXXX.
REMARK**********************************************************************
REMARK*5000-TRU-CAR-IDXXX.
REMARK* SE EXTRAEN DE LA REGISTRADURIA LOS CARACTERISTICAS PERSONALES (IDX)*
REMARK**********************************************************************
MODBDI     MOVE FECHA-EXP-BDIIREGI  TO FECHA-AUX6.                      FAC0008
IDENTI     MOVE FECHA-AUX6(1:2) TO ANO-CED.
IDENTI     MOVE FECHA-AUX6(3:2) TO MES-CED.        
IDENTI     IF ANO-CED < 50
IDENTI        MOVE 20           TO SIG-CED
IDENTI     ELSE
IDENTI        MOVE 19           TO SIG-CED
IDENTI     END-IF.
IDENTI     IF FECHA-RUN-DATE >= FECHA-EXP-CED 
IDENTI        COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -
IDENTI                    ( SIG-ANO-CED * 12 + MES-CED )
IDENTI        MOVE J TO ID001 
IDENTI     ELSE
IDENTI        MOVE " -2" TO ID001(1:3)
IDENTI     END-IF.
IDENTI     IF   TIP-IDE-SCO = 1
IDENTI        MOVE 1 TO ID002 
IDENTI     ELSE 
IDENTI        IF TIP-IDE-SCO = 4 
IDENTI           MOVE 2 TO ID002
IDENTI        ELSE
IDENTI          MOVE 0 TO ID002
IDENTI     END-IF.
MODBDI     IF ESTADO-VIG-BDIIREGI  = 27 OR  12                          FAC0008
IDENTI        MOVE "-1" TO ID003(1:2)
IDENTI     ELSE
MODBDI        MOVE ESTADO-VIG-BDIIREGI TO ID003                         FAC0008
IDENTI     END-IF.
VER1.2*    MOVE " -1" TO ID004(1:3).
VER1.2     IF ID001(1:3) NOT = " -2" 
VER1.2        COMPUTE ID004 = 216 + ID001 
VER1.2     ELSE
VER1.2        MOVE " -1" TO   ID004(1:3)
VER1.2     END-IF.
MICR02     IF IND-SEXO-BDIIREGI = "M"                                   RMB0014 
GENE01        MOVE 0 TO ID005                                           RMB0018 
MICR02     ELSE                                                         RMB0014 
MICR02        IF IND-SEXO-BDIIREGI = "F"                                RMB0014 
GENE01           MOVE 1 TO ID005                                        RMB0018 
MICR02        ELSE                                                      RMB0014 
MICR02           MOVE "-1" TO ID005(1:2)                                RMB0014 
MICR02        END-IF                                                    RMB0014 
MICR02     END-IF.                                                      RMB0014 
ACIEME     IF MUNIC-EXP-BDIIREGI = 0 OR TIP-IDE-SCO NOT = 1             RMB0021 
ACIEME        MOVE " -1" TO ID006(1:3)                                  RMB0021 
ACIEME     ELSE                                                         RMB0021 
ACIEME        MOVE MUNIC-EXP-BDIIREGI TO ID006                          RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME     IF DEP-EXP-BDIIREGI = 0 OR TIP-IDE-SCO NOT = 1               RMB0021 
ACIEME        MOVE "-1" TO ID007(1:2)                                   RMB0021 
ACIEME     ELSE                                                         RMB0021 
ACIEME        MOVE DEP-EXP-BDIIREGI TO ID007                            RMB0021 
ACIEME     END-IF.                                                      RMB0021 
MICR02*    IF NUM-IDE-SCO > 20000000 AND NUM-IDE-SCO < 70000000         RMB0014 
MICR02*       MOVE 1 TO ID005                                           RMB0014 
MICR02*    ELSE                                                         RMB0014 
MICR02*       MOVE 0 TO ID005                                           RMB0014 
MICR02*    END-IF.                                                      RMB0014 
TRANS  5000-TRU-CAR-CKXXX.     
REMARK**********************************************************************
REMARK*5000-TRU-CAR-CKXXX.     
REMARK* SE EXTRAEN CARACTERISTICAS DE CUENTAS CORRIENTES (CKXXX)           *
REMARK**********************************************************************
CHECK      MOVE FECHA-APERT-ABD06 TO FECHA-AUX-SCO .
CHECK      MOVE FECHA-AUX-SCO(1:2) TO MES-APE .
CHECK      MOVE FECHA-AUX-SCO(3:2) TO ANO-APE         .
CHECK      IF ANO-APE < 50
CHECK         MOVE 20 TO SIG-APE
CHECK      ELSE
CHECK         MOVE 19 TO SIG-APE
CHECK      END-IF.
CONSUL     IF V-NUM-CAR(2) < 500
REMARK*Estas fechas se necesitan para el analisis de consultas
CONSUL        ADD 1 TO V-NUM-CAR(2) 
CONSUL        MOVE V-NUM-CAR(2) TO J
CONSUL        MOVE FECHA-APERTURA07 TO V-OPE-DATE(2,J)
CONSUL     END-IF.
ACIEME     IF TIP-SCO-GENERICO NOT = 8                                  RMB0021 
ACIEME        PERFORM 5000-CK-ACIERTA                                   RMB0021 
ACIEME     ELSE                                                         RMB0021 
ACIEME        IF COD-SUS-ABD06(1:2) = "51"                              RMB0021 
ACIEME           PERFORM 5000-CK-AHORROS-PLUS                           RMB0021 
ACIEME        ELSE                                                      RMB0021 
ACIEME           PERFORM 5000-CK-CTACORRIENTES-PLUS                     RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME 5000-CK-ACIERTA.                                                 RMB0021 
REMARK**********************************************************************
REMARK*5000-CK-ACIERTA.
REMARK*  SE CALCULAN LAS CARACTERISTICAS CK PARA PREDICTA Y ACIERTA
REMARK**********************************************************************
ACIEME     MOVE 1 TO CKFLAG.                                            RMB0021 
CHECK      IF NOV-REPORT-ABD06 = 01 OR 06 OR 07   *> CTAS ACTIVAS
CHECK         ADD 1 TO CK002 
CHECK      ELSE 
CHECK         ADD 1 TO CK001
CHECK      END-IF.
ACIEME 5000-CK-CTACORRIENTES-PLUS.                                      RMB0021 
REMARK**********************************************************************
REMARK*5000-CK-CTACORRIENTES-PLUS.
REMARK*  SE CALCULAN LAS CARACTERISTICAS CK PARA ACIERTA PLUS SOLO CTACORR
REMARK**********************************************************************
ACIEME     MOVE 1 TO CKFLAG.                                            RMB0021 
ACIEME     IF NOV-REPORT-ABD06 = 01 OR 06 OR 07   *> CTAS ACTIVAS       RMB0021 
ACIEME        ADD 1 TO CK002                                            RMB0021 
ACIEME     ELSE                                                         RMB0021 
ACIEME        ADD 1 TO CK001                                            RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME     IF NOV-REPORT-ABD06 = 02 OR 06 OR 07   *> CTAS NEGATIVAS     RMB0021 
ACIEME        ADD 1 TO CK003                                            RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME     ADD 1 TO CK004                                               RMB0021 
ACIEME     IF FECHA-APERTURA07 <= FECHA-RUN-DATE                        RMB0021 
ACIEME        MOVE 1 TO CKDOFLAG                                        RMB0021 
ACIEME        COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -              RMB0021 
ACIEME                    ( SIG-ANO-APE * 12 + MES-APE )                RMB0021 
ACIEME        IF J > CK005                                              RMB0021 
ACIEME           MOVE J TO CK005                                        RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME        IF J < CK006                                              RMB0021 
ACIEME           MOVE J TO CK006                                        RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME 5000-CK-AHORROS-PLUS.                                            RMB0021 
REMARK**********************************************************************
REMARK*5000-CK-AHORROS-PLUS.
REMARK*  SE CALCULAN LAS CARACTERISTICAS CK PARA ACIERTA PLUS SOLO AHORROS
REMARK**********************************************************************
ACIEME     MOVE 1 TO AHFLAG.                                            RMB0021 
ACIEME     ADD 1 TO AH001.                                              RMB0021 
ACIEME     IF NOV-REPORT-ABD06 = 01 OR 06 OR 07   *> CTAS ACTIVAS       RMB0021 
ACIEME        ADD 1 TO AH002                                            RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME     IF FECHA-APERTURA07 <= FECHA-RUN-DATE                        RMB0021 
ACIEME        MOVE 1 TO AHDOFLAG                                        RMB0021 
ACIEME        COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -              RMB0021 
ACIEME                    ( SIG-ANO-APE * 12 + MES-APE )                RMB0021 
ACIEME        IF J > AH003                                              RMB0021 
ACIEME           MOVE J TO AH003                                        RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME        IF J < AH004                                              RMB0021 
ACIEME           MOVE J TO AH004                                        RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ENDEUD 5000-TRU-CAR-GDXXX.     
REMARK**********************************************************************
REMARK*5000-TRU-CAR-GDXXX.     
REMARK* SE EXTRAEN CARACTERISTICAS DE ENDEUDAMIENTO GLOBAL (GDXXXX)        *
REMARK**********************************************************************
BDIEND      EVALUATE BDIEMSUP-CALIFICA                                  FAC0005 
ENDEUD        WHEN "A" MOVE 1 TO CAL-SCO
ENDEUD        WHEN "B" MOVE 2 TO CAL-SCO
ENDEUD        WHEN "C" MOVE 3 TO CAL-SCO
ENDEUD        WHEN "D" MOVE 4 TO CAL-SCO
ENDEUD        WHEN "E" MOVE 5 TO CAL-SCO
ENDEUD        WHEN ANY MOVE 6 TO CAL-SCO
ENDEUD      END-EVALUATE.
BDIEND      EVALUATE BDIEMSUP-TIP-DEUDA                                 FAC0005 
ENDEUD        WHEN "S" MOVE 1 TO TIP
ENDEUD        WHEN "M" MOVE 2 TO TIP
MICROC        WHEN "C" MOVE 2 TO TIP                                    RMB0009 
ENDEUD        WHEN "H" MOVE 3 TO TIP
ENDEUD        WHEN ANY MOVE 4 TO TIP
ENDEUD      END-EVALUATE.
ENDEUD      IF CAL-SCO < 6 AND TIP < 4 
ENDEUD         MOVE 1 TO QTRFLAG
ENDEUD         MOVE 1 TO TIPFLAG(TIP)
BDIEND         IF BDIEMSUP-CANTIDAD = 0                                 FAC0005 
BDIEND            MOVE 1 TO BDIEMSUP-CANTIDAD                           FAC0005 
PATCH6         END-IF
BDIEND         ADD BDIEMSUP-CANTIDAD TO GD00X(TIP)                      FAC0005 
PATCH6         MOVE 0 TO W-VALOR-SCO
BDIEND         ADD BDIEMSUP-VALOR,BDIEMSUP-INTERES TO W-VALOR-SCO       FAC0005 
ENDEUD         DIVIDE W-VALOR-SCO BY 1000 GIVING W-VALOR-SCO ROUNDED
PATCH6         ADD  W-VALOR-SCO TO GD01X(TIP)       
BDIEND         ADD BDIEMSUP-CANTIDAD TO  GDXXX(TIP,CAL-SCO)             FAC0005 
BDIEND         IF BDIEMSUP-GARANTIA = "A"                               FAC0005 
BDIEND            ADD BDIEMSUP-CANTIDAD TO GD050                        FAC0005 
ENDEUD         END-IF
ENDEUD      END-IF.
CONSUL 5000-TRU-CAR-IQXXX.     
REMARK**********************************************************************
REMARK*5000-TRU-CAR-IQXXX.                                                 *
REMARK* SE ELIMINAN LAS CONSULTAS DEL CAC Y SE MIRAN SOLO LAS DE SUSCRIPTOR*
REMARK**********************************************************************
ACIEME*    IF COD-SUSCRIP-IND < 950000    *> LINEA Y BATCH              RMB0021 
ACIEME*       PERFORM 5100-TRU-CUENTE-IQXXX                             RMB0021 
ACIEME*    ELSE                                                         RMB0021 
ACIEME*      IF COD-SUSCRIP-IND = 990001 OR 990003 *> CIUDADANOS        RMB0021 
ACIEME*         PERFORM 5200-TRU-CUENTE-IQ030-IQ032                     RMB0021 
ACIEME*      END-IF                                                     RMB0021 
ACIEME*    END-IF.                                                      RMB0021 
ACIEME*                                                                 RMB0021 
ACIEME     IF TIP-SCO-GENERICO = 8           *> ACIERTA PLUS            RMB0021 
ACIEME        IF  COD-SUSCRIP-IND < 700000   *> HARD INQUIRYS           RMB0021 
ACIEME            PERFORM 5100-TRU-CUENTE-IQXXX                         RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     ELSE                                                         RMB0021 
ACIEME        IF COD-SUSCRIP-IND < 950000    *> LINEA Y BATCH           RMB0021 
ACIEME           PERFORM 5100-TRU-CUENTE-IQXXX                          RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME     IF COD-SUSCRIP-IND = 990001 OR 990003 *> CIUDADANOS          RMB0021 
ACIEME        PERFORM 5200-TRU-CUENTE-IQ030-IQ032                       RMB0021 
ACIEME     END-IF.                                                      RMB0021 
CONSUL 5100-TRU-CUENTE-IQXXX.     
REMARK**********************************************************************
REMARK*5000-TRU-CAR-IQXXX.                                                 *
REMARK* SE EXTRAEN LAS CARACTERISTICAS DE CONSULTAS (IQXXXX)               *
REMARK**********************************************************************
CONSUL     MOVE FEC-CONSUL-IND(3:2) TO MES-CONSU.
CONSUL     MOVE FEC-CONSUL-IND(5:2) TO ANO-CONSU.        
CONSUL     IF ANO-CONSU < 50
CONSUL        MOVE 20               TO SIG-CONSU
CONSUL     ELSE
CONSUL        MOVE 19               TO SIG-CONSU
CONSUL     END-IF.
CONSUL     MOVE 1 TO IQFLAG.
CONSUL     MOVE 999 TO J.
CONSUL     IF FECHA-CON-INDE   <= FECHA-RUN-DATE
CONSUL        COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -
CONSUL                    ( SIG-ANO-CONSU * 12 + MES-CONSU )
CONSUL        IF J <= 03 
CONSUL           ADD 1 TO                             IQ00X(001)
CONSUL        ELSE
CONSUL        IF J <= 06                 
CONSUL           ADD 1 TO                             IQ00X(002)
CONSUL        ELSE
CONSUL        IF J <= 12                 
CONSUL           ADD 1 TO                             IQ00X(003)
CONSUL        ELSE
CONSUL           ADD 1 TO                             IQ00X(004)
CONSUL     END-IF.
CONSUL     IF J < IQ00X(05)    
CONSUL           MOVE J TO                            IQ00X(005)
CONSUL     END-IF.
CONSUL     MOVE COD-SUSCRIP-IND TO COD-SUSCRIP-ABD02 .
CONSUL     READ SUSCRIPTOR WITH IGNORE LOCK INVALID KEY 
CONSUL          MOVE 0 TO TIPO 
CONSUL          NOT INVALID KEY 
TRANS               MOVE     V-TIPCTA(COD-TIPCTA-ABD02) TO TIPO 
ACIEME              IF TIP-SCO-GENERICO = 8 AND COD-TIPCTA-ABD02 = 13   RMB0021 
ACIEME                 MOVE 5 TO TIPO                                   RMB0021 
ACIEME              END-IF                                              RMB0021 
ACIEME              IF TIPO > 0 AND < 06                                RMB0021 
NEWSCO* SOLO SE TOMAN LAS DE LOS ULTIMOS 6 MESES POR EL SCORE
NEWSCO                 IF J <= 6 
CONSUL                    ADD 1 TO IQ01X(TIPO) 
CONSUL                    MOVE 1 TO TIPIQFLAG(TIPO)
NEWSCO                 END-IF
CONSUL              END-IF
CONSUL     END-READ.
ACIEME     IF TIPO > 0 AND TIPO < 06                                    RMB0021 
CONSUL        MOVE 1 TO I 
CONSUL        PERFORM UNTIL I > V-NUM-CAR(TIPO)
CONSUL           MOVE V-OPE-DATE(TIPO,I) TO FECHA-APERTURA07
CONSUL           IF FECHA-APERTURA07 >= FECHA-CON-INDE
CONSUL              COMPUTE J = ( SIG-ANO-APE * 12 + MES-APE ) -
CONSUL                          ( SIG-ANO-CONSU * 12 + MES-CONSU )
CONSUL              IF J <= 3
CONSUL                 MOVE 1 TO IQ02X(TIPO)
CONSUL                 MOVE V-NUM-CAR(TIPO) TO I
CONSUL              END-IF
CONSUL           END-IF
CONSUL           ADD 1 TO I
CONSUL        END-PERFORM
CONSUL     END-IF.
ACIEME 5200-TRU-CUENTE-IQ030-IQ032.                                     RMB0021 
REMARK**********************************************************************
REMARK*5200-TRU-CUENTE-IQ030-IQ032.
REMARK*  SE CONTABILIZAN LAS CONSULTAS REALIZADAS POR LOS CIUDADANOS
REMARK**********************************************************************
ACIEME     MOVE FEC-CONSUL-IND(3:2) TO MES-CONSU.                       RMB0021 
ACIEME     MOVE FEC-CONSUL-IND(5:2) TO ANO-CONSU.                       RMB0021 
ACIEME     IF ANO-CONSU < 50                                            RMB0021 
ACIEME        MOVE 20               TO SIG-CONSU                        RMB0021 
ACIEME     ELSE                                                         RMB0021 
ACIEME        MOVE 19               TO SIG-CONSU                        RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME     MOVE 1 TO CIFLAG.                                            RMB0021 
ACIEME     IF FECHA-CON-INDE   <= FECHA-RUN-DATE                        RMB0021 
ACIEME        COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -              RMB0021 
ACIEME                    ( SIG-ANO-CONSU * 12 + MES-CONSU )            RMB0021 
ACIEME        IF J <= 03                                                RMB0021 
ACIEME           ADD 1 TO                             IQ030             RMB0021 
ACIEME        ELSE                                                      RMB0021 
ACIEME        IF J <= 06                                                RMB0021 
ACIEME           ADD 1 TO                             IQ031             RMB0021 
ACIEME        ELSE                                                      RMB0021 
ACIEME        IF J <= 12                                                RMB0021 
ACIEME           ADD 1 TO                             IQ032             RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME 5320-CLASIFICA-CART-ACIERTAPLUS.                                 RMB0021 
REMARK**********************************************************************
REMARK*5320-CLASIFICA-CART-ACIERTAPLUS.
REMARK* DE ACUERDO A LAS DEFINICIONES SE CLASIFICA LA CARTERA SEGUN SU TIPO
REMARK* ASI :   CR = 1,BS=2,CC=3,OT=4,MT=5,CP= 6
REMARK**********************************************************************
ACIEME*   TIPOS DEFAULT DE ACIERTA                                      RMB0021 
ACIEME    MOVE V-TIPCTA(COD-CTA-ABD07) TO TIPO.                         RMB0021 
ACIEME*   NUEVA CLASIFICACION EN ACIERTA PLUS                           RMB0021 
ACIEME    MOVE 0 TO J.                                                  RMB0021 
ACIEME    IF FECHA-VENCIMIENTO07 > FECHA-APERTURA07                     RMB0021 
ACIEME        COMPUTE J = ( SIG-ANO-VEN * 12 + MES-VEN ) -              RMB0021 
ACIEME                    ( SIG-ANO-APE * 12 + MES-APE )                RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    IF COD-CTA-ABD07 >= 04                                        RMB0021 
ACIEME       IF GARANTE-ABD07 > 0 OR NUM-CTA-ABD07(17:1) = "C"          RMB0021 
ACIEME          MOVE 6 TO TIPO         *> CODEUDOR                      RMB0021 
ACIEME       ELSE                                                       RMB0021 
ACIEME          IF COD-CTA-ABD07 = 13                                 ORRMB0021 
ACIEME             (COD-CTA-ABD07 = 05 AND TIPO-OBLIGACION-ABD07 = 3) ORRMB0021 
ACIEME             (COD-CTA-ABD07 = 05 AND J       >= 60            ) ORRMB0021 
ACIEME             (COD-CTA-ABD07 = 08 AND J       >= 60            )   RMB0021 
ACIEME             MOVE 5 TO TIPO       *> HIPOTECRAIO                  RMB0021 
ACIEME          ELSE                                                    RMB0021 
ACIEME             IF COD-CTA-ABD07 = 07                                RMB0021 
ACIEME                MOVE 4 TO TIPO    *> OT (OTROS)                   RMB0021 
ACIEME             END-IF                                               RMB0021 
ACIEME          END-IF                                                  RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME*   LOS ROTATIVOS SE DEJAN IGUAL                                  RMB0021 
ACIEME*   ELSE                                                          RMB0021 
ACIEME*      IF FECHA-RUN-DATE > 200603                                 RMB0021 
ACIEME*         IF COD-CTA-ABD07 = 03  *> AHORA SON ROTATIVOS           RMB0021 
ACIEME*            MOVE 02 TO TIPO     *> SE DEJAN COMO BS (CART-BANCARIRMB0021 
ACIEME*         END-IF                                                  RMB0021 
ACIEME*      END-IF                                                     RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    MOVE V-TIPCAR-PLUS(TIPO) TO DES-TIPO.                         RMB0021 
ACIEME 5320-CLASIFICA-CARTERA.                                          RMB0021 
REMARK**********************************************************************
REMARK*5320-CLASIFICA-CARTERA.
REMARK* DE ACUERDO A LAS DEFINICIONES SE CLASIFICA LA CARTERA SEGUN SU TIPO
REMARK* ASI :   CR = 1,BS=2,CC=3,OT=4             
REMARK**********************************************************************
ACIEME    IF TIP-SCO-GENERICO = 08                                      RMB0021 
ACIEME       PERFORM 5320-CLASIFICA-CART-ACIERTAPLUS                    RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       MOVE V-TIPCTA(COD-CTA-ABD07) TO TIPO                       RMB0021 
ACIEME    END-IF.                                                       RMB0021 
TRANS  5320-TRU-CAR-CTACAR.
REMARK**********************************************************************
REMARK*5320-TRU-CAR-CTACAR.
REMARK* SE EXTRAEN LAS CARACTERISTICAS DE CARTERA (CRXXX,CCXXX,BSXXX,OTXXX)*
REMARK**********************************************************************
TRANS      MOVE FEC-NOVEDAD-ABD07 TO FECHA-AUX-SCO.
TRANS      MOVE FECHA-AUX-SCO(1:2) TO MES-NOV.
TRANS      MOVE FECHA-AUX-SCO(3:2) TO ANO-NOV.        
TRANS      IF ANO-NOV < 50
TRANS         MOVE 20          TO SIG-NOV
TRANS      ELSE
TRANS         MOVE 19          TO SIG-NOV
TRANS      END-IF.
NEWPRE     MOVE FECHA-NOVEDAD07 TO FECHA-NOVEDAD07-AUX.                 RMB0004 
TRANS      MOVE FECHA-APERT-ABD07 TO FECHA-AUX-SCO 
TRANS      MOVE FECHA-AUX-SCO(1:2) TO MES-APE 
TRANS      MOVE FECHA-AUX-SCO(3:2) TO ANO-APE         
TRANS      IF ANO-APE < 50
TRANS         MOVE 20          TO SIG-APE
TRANS      ELSE
TRANS         MOVE 19          TO SIG-APE
TRANS      END-IF.
TRANS      MOVE FECHA-VENC-ABD07 TO FECHA-AUX-SCO 
TRANS      MOVE FECHA-AUX-SCO(1:2) TO MES-VEN 
TRANS      MOVE FECHA-AUX-SCO(3:2) TO ANO-VEN         
NEWPR1     IF ANO-VEN < 60                                              RMB0004 
TRANS         MOVE 20          TO SIG-VEN
TRANS      ELSE
TRANS         MOVE 19          TO SIG-VEN
TRANS      END-IF.
NEWPRE     MOVE FECHA-ACTUALIZ-VALOR-ABD07 TO FECHA-AUX6                RMB0004 
NEWPRE     MOVE FECHA-AUX6   (1:2) TO MES-VAL                           RMB0004 
NEWPRE     MOVE FECHA-AUX6   (3:2) TO SIG-VAL                           RMB0004 
NEWPRE     MOVE FECHA-AUX6   (5:2) TO ANO-VAL                           RMB0004 
NEWPRE     MOVE FECHA-SITUACION-ABD07 TO FECHA-AUX6.                    RMB0004 
NEWPRE     MOVE FECHA-AUX6   (1:2) TO MES-SIT                           RMB0004 
NEWPRE     MOVE FECHA-AUX6   (3:2) TO SIG-SIT                           RMB0004 
NEWPRE     MOVE FECHA-AUX6   (5:2) TO ANO-SIT                           RMB0004 
TRANS      MOVE F-ULT-ACT-ABD02   TO FECHA-AUX-SCO.
TRANS      MOVE FECHA-AUX-SCO(1:2) TO MES-SUS.        
TRANS      MOVE FECHA-AUX-SCO(3:2) TO ANO-SUS.        
TRANS      IF ANO-SUS < 50
TRANS         MOVE 20          TO SIG-SUS
TRANS      ELSE
TRANS         MOVE 19          TO SIG-SUS
TRANS      END-IF.
TRANS      MOVE FECHA-ING-ABD02   TO FECHA-AUX-SCO 
TRANS      MOVE FECHA-AUX-SCO(1:2) TO MES-ING 
TRANS      MOVE FECHA-AUX-SCO(3:2) TO ANO-ING         
TRANS      IF ANO-ING < 50
TRANS         MOVE 20          TO SIG-ING
TRANS      ELSE
TRANS         MOVE 19          TO SIG-ING
TRANS      END-IF.
TRANS      IF V-MORA(NOV-REPORT-ABD07) = 5 
REMARK*       Se utiliza este campo para guardar provisionalmente la fecha
PATCH3        MOVE FECHA-NOVEDAD07 TO FECHA-CON-INDE
OPTOPE* PARA OPTIMIZACION AQUI SE DEBE MODIFICAR         *****OPTOPE    RMB0003
ARRA01        IF FECHA-RUN-DATE <=  200210                              RMB0005
ARRA01           MOVE FECHA-ACTSUS TO FECHA-NOVEDAD07                   RMB0005
TRANS      END-IF.
ACIEME**** MOVE     V-TIPCTA(COD-CTA-ABD07) TO TIPO .                   RMB0021 
ACIEME     PERFORM 5320-CLASIFICA-CARTERA.                              RMB0021 
REMARK* SE CONTROLA POR SI HAY UN NUEVO TIPO DE CUENTA NO CONTEMPLADO
PATCH9     IF TIPO = 9 
PATCH9        MOVE 4 TO TIPO 
PATCH9     END-IF.
CONSUL     IF V-NUM-CAR(TIPO) < 500
REMARK*Estas fechas se necesitan para el analisis de consultas
CONSUL        ADD 1 TO V-NUM-CAR(TIPO) 
CONSUL        MOVE V-NUM-CAR(TIPO) TO J
CONSUL        MOVE FECHA-APERTURA07 TO V-OPE-DATE(TIPO,J)
CONSUL     END-IF.
ACIEME***  MOVE 1 TO CTAFLAG(TIPO)                                      RMB0021 
TRANS      ADD 1 TO V-WORK(TIPO,001).
TRANS      IF V-MORA(NOV-REPORT-ABD07) NOT = 9
ACIEME***     MOVE 1 TO OPEFLAG(TIPO)                                   RMB0021 
TRANS         ADD 1 TO V-WORK(TIPO,002)
TRANS      ELSE
TRANS         MOVE 1 TO CLOFLAG(TIPO)
TRANS      END-IF.
ACIEME*    SE MANEJA APARTE LOS RECLAMOS PARA NO HACER CONFLICTO CON    RMB0021 
ACIEME*    BASICO. AL FINAL SE TRASLANDAN LOS RESULTADOS A LA CAR 003   RMB0021 
ACIEME     IF IND-RECLAMO-ABD07 = 1 OR 2 OR 4                           RMB0021 
ACIEME        ADD 1 TO V-DISPUTAS(TIPO)                                 RMB0021 
ACIEME     END-IF.                                                      RMB0021 
CANC01*    IF ART15-ABD07 > 0 AND < 4                                   RMB0016 
CANC01*       ADD 1 TO V-WORK(TIPO,003)                                 RMB0016 
CANC01*    END-IF.                                                      RMB0016 
CANC01******************************************************************RMB0016 
CANC01*    CARACTERISTICA QUE CALCULA LA FECHA MAS RECIENTE DE CANCELACIRMB0016 
CANC01*    REEMPLAZA LAS CARACTERISTICAS XX003                          RMB0016 
CANC01******************************************************************RMB0016 
CANC01     IF FECHA-NOVEDAD07 <= FECHA-RUN-DATE AND                     RMB0016 
CANC01        V-MORA(NOV-REPORT-ABD07) = 9          *> Cuenta cerrada   RMB0016 
CANC01        MOVE 1 TO DOFLAG(TIPO)                                    RMB0016 
CANC01        COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -              RMB0016 
CANC01                    ( SIG-ANO-NOV * 12 + MES-NOV )                RMB0016 
CANC01        IF J < V-WORK(TIPO,03)                                    RMB0016 
CANC01           MOVE J TO V-WORK(TIPO,003)                             RMB0016 
CANC01        END-IF                                                    RMB0016 
CANC01     END-IF.                                                      RMB0016 
CANC01******************************************************************RMB0016 
PENDIE* AQUI ESTA POR VER COMO SE MANEJA LAS FECHAS VEN < A RUN DATE
TRANS      IF V-MORA(NOV-REPORT-ABD07) NOT = 9
TRANS ********IF MISSING
PATCH2        IF FECHA-VENCIMIENTO07 >  FECHA-APERTURA07
ACIEME*****      MOVE 1 TO DDFLAG(TIPO)                                 RMB0021 
TRANS            IF FECHA-VENCIMIENTO07 >= FECHA-RUN-DATE  
TRANS               COMPUTE J = ( SIG-ANO-VEN * 12 + MES-VEN ) -
TRANS                           ( SIG-ANO-RUN * 12 + MES-RUN )
TRANS               IF J <= 06 
TRANS                  ADD 1 TO  V-WORK(TIPO,010)
TRANS               ELSE
TRANS               IF J <= 12                 
TRANS                  ADD 1 TO  V-WORK(TIPO,011)
TRANS               ELSE
TRANS               IF J <= 18                 
TRANS                  ADD 1 TO  V-WORK(TIPO,012)
TRANS               ELSE
TRANS               IF J <= 24                 
TRANS                  ADD 1 TO  V-WORK(TIPO,013)
TRANS               ELSE
TRANS                  ADD 1 TO  V-WORK(TIPO,014)
TRANS               END-IF
TRANS               END-IF
TRANS               END-IF
TRANS               END-IF
TRANS            END-IF
TRANS         END-IF
TRANS      END-IF.
TRANS      IF V-MORA(NOV-REPORT-ABD07) NOT = 9
TRANS ********IF MISSING
PATCH1        IF FECHA-VENCIMIENTO07 >  FECHA-APERTURA07
TRANS            IF FECHA-NOVEDAD07 <= FECHA-RUN-DATE
TRANS               COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -
TRANS                           ( SIG-ANO-NOV * 12 + MES-NOV )
TRANS               IF J <= 06 
TRANS                  ADD 1 TO V-WORK(TIPO,020)
TRANS               ELSE
TRANS               IF J <= 12                 
TRANS                  ADD 1 TO V-WORK(TIPO,021)
TRANS               ELSE
TRANS                  ADD 1 TO V-WORK(TIPO,022)
TRANS      END-IF.
TRANS      IF FECHA-APERTURA07 <= FECHA-RUN-DATE
TRANS         COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -
TRANS                     ( SIG-ANO-APE * 12 + MES-APE )
TRANS         IF J <= 06 
TRANS            ADD 1 TO V-WORK(TIPO,030)
TRANS         ELSE
TRANS         IF J <= 12                 
TRANS            ADD 1 TO V-WORK(TIPO,031)
TRANS         ELSE
TRANS         IF J <= 18                 
TRANS            ADD 1 TO V-WORK(TIPO,032)
TRANS         ELSE
TRANS         IF J <= 24                 
TRANS            ADD 1 TO V-WORK(TIPO,033)
TRANS         ELSE
TRANS            ADD 1 TO V-WORK(TIPO,034)
TRANS      END-IF.
TRANS      IF FECHA-APERTURA07 <= FECHA-RUN-DATE 
TRANS         MOVE 1 TO DOFLAG(TIPO)
TRANS         COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -
TRANS                     ( SIG-ANO-APE * 12 + MES-APE )
TRANS         IF J > V-WORK(TIPO,40)
TRANS            MOVE J TO V-WORK(TIPO,040)
TRANS         END-IF
TRANS         IF J < V-WORK(TIPO,41)
TRANS            MOVE J TO V-WORK(TIPO,041)
TRANS         END-IF
TRANS      END-IF.
TRANS ********CR050-CR095
TRANS      EVALUATE NOV-REPORT-ABD07 
TRANS        WHEN 1 
TRANS          MOVE 50 TO J 
TRANS        WHEN 2 
TRANS          MOVE 95 TO J 
TRANS        WHEN 3 
TRANS          MOVE 51 TO J 
TRANS        WHEN 4 
TRANS          MOVE 52 TO J 
TRANS        WHEN 5 
TRANS          MOVE 53 TO J 
TRANS        WHEN 6 
TRANS          MOVE 54 TO J 
TRANS        WHEN 7 
TRANS          MOVE 52 TO J 
TRANS        WHEN ANY
TRANS          COMPUTE J = 47 + NOV-REPORT-ABD07 
TRANS      END-EVALUATE. 
TRANS      ADD 1 TO V-WORK(TIPO,J).
TRANS ********CR100-CR103
TRANS      MOVE 0 TO J.
TRANS      IF FECHA-RUN-DATE >= FECHA-NOVEDAD07    
PATCH3        IF V-MORA(NOV-REPORT-ABD07) = 5 
PATCH3           COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -
PATCH3                       ( SIG-ANO-CONSU * 12 + MES-CONSU )
PATCH3        ELSE
TRANS            COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -
TRANS                        ( SIG-ANO-NOV * 12 + MES-NOV )
ACIEME           IF TIP-SCO-GENERICO = 8                                RMB0021 
ACIEME*             SE CALCULA LA FECHA DE CASTIGO COMO LA ACTUAL VALRS RMB0021 
ACIEME              IF NOV-REPORT-ABD07 = 45 OR 47                      RMB0021 
ACIEME                 MOVE FECHA-SITUACION07 TO FECHA-CASTIGADA07      RMB0021 
ACIEME                 IF FECHA-VALORES07 >  FECHA-CASTIGADA07          RMB0021 
ACIEME                    MOVE FECHA-VALORES07 TO FECHA-CASTIGADA07     RMB0021 
ACIEME                 END-IF                                           RMB0021 
ACIEME                 COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -     RMB0021 
ACIEME                             ( SIG-ANO-CAS * 12 + MES-CAS )       RMB0021 
ACIEME              END-IF                                              RMB0021 
ACIEME           END-IF                                                 RMB0021 
PATCH3        END-IF
TRANS         MOVE ESTADO-MES-ABD07 TO VECTOR-HIS
TRANS         MOVE 1 TO MORA
TRANS         MOVE 100 TO POS
TRANS         PERFORM UNTIL MORA > 4
TRANS            MOVE 999 TO MESES-MORA
PATCH5           IF V-MORA(NOV-REPORT-ABD07) = MORA OR
PATCH5              ((NOV-REPORT-ABD07 = 03 OR 46) AND (MORA = 4)) 
TRANS               MOVE J TO MESES-MORA       
TRANS            ELSE 
TRANS               MOVE 12 TO K 
TRANS               PERFORM UNTIL K = 0                    
TRANS                 IF V-HIS(K) = MORA
TRANS                    COMPUTE MESES-MORA = J + 13 - K 
TRANS                    MOVE 1 TO K
TRANS                 END-IF
TRANS                 SUBTRACT 1 FROM K
TRANS               END-PERFORM
TRANS            END-IF
TRANS            IF MESES-MORA < V-WORK(TIPO,POS) 
TRANS               MOVE MESES-MORA TO V-WORK(TIPO,POS)
TRANS            END-IF
TRANS            ADD 1 TO MORA
TRANS            ADD 1 TO POS
TRANS         END-PERFORM
TRANS      END-IF.
TRANS      IF ADJETIVO1-ABD07 = 3 OR ADJETIVO2-ABD07 = 3 OR 
TRANS                                ADJETIVO3-ABD07 = 3
TRANS         ADD 1 TO V-WORK(TIPO,89)
TRANS      END-IF.
TRANS      IF ADJETIVO1-ABD07 = 2 OR ADJETIVO2-ABD07 = 2 OR 
TRANS                                ADJETIVO3-ABD07 = 2
TRANS         ADD 1 TO V-WORK(TIPO,90)
TRANS      END-IF.
TRANS      IF ADJETIVO1-ABD07 = 1 OR ADJETIVO2-ABD07 = 1 OR 
TRANS                                ADJETIVO3-ABD07 = 1
TRANS         ADD 1 TO V-WORK(TIPO,91)
TRANS      END-IF.
NEWPRE********CR111-CR124                                               RMB0004 
ACIEME    IF TIP-SCO-GENERICO = 8                                       RMB0021 
ACIEME       PERFORM 5321-CAR-CR111-CP124-BITS *> PARA ACIERTA PLUS     RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       PERFORM 5321-CAR-CR111-CP124 *> PARA TODOS                 RMB0021 
ACIEME    END-IF                                                        RMB0021 
ACIEME*   SI TRADE IS MORTGAGE                                          RMB0021 
ACIEME    MOVE 0 TO OLD-MORTAGE                                         RMB0021 
ACIEME    IF TIP-SCO-GENERICO NOT = 8  *> SOLO PARA ACIERTA/PREDICTA    RMB0021 
ACIEME       IF V-TIPCRE(COD-CTA-ABD07) = "M"  OR                       RMB0021 
ACIEME          (V-TIPCRE(COD-CTA-ABD07) = "E" AND                      RMB0021 
ACIEME             TIPO-OBLIGACION-ABD07 = 3)                           RMB0021 
ACIEME          MOVE 1 TO OLD-MORTAGE                                   RMB0021 
ACIEME          MOVE TIPO TO TIPO-AUX                                   RMB0021 
ACIEME          MOVE 5 TO TIPO                                          RMB0021 
ACIEME          PERFORM 5321-CAR-CR111-CP124                            RMB0021 
ACIEME          MOVE 0 TO OLD-MORTAGE                                   RMB0021 
ACIEME          MOVE TIPO-AUX  TO TIPO                                  RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME    IF TIP-SCO-GENERICO = 8                                       RMB0021 
ACIEME       PERFORM 5320-CAR-AT112-AT124-BITS *> PARA ACIERTA PLUS     RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       PERFORM 5320-CAR-AT112-AT124 *>    PARA ACIERTA Y PREDICTA RMB0021 
ACIEME    END-IF                                                        RMB0021 
ACIEME*** CR104,BS104,CC104,OT104,MT104,CP104                           RMB0021 
ACIEME     IF FECHA-NOVEDAD07 <= FECHA-RUN-DATE AND                     RMB0021 
ACIEME        V-MORA(NOV-REPORT-ABD07) = 9          *> Cuenta cerrada   RMB0021 
ACIEME        COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -              RMB0021 
ACIEME                    ( SIG-ANO-NOV * 12 + MES-NOV )                RMB0021 
ACIEME        IF J < V-104(TIPO)                                        RMB0021 
ACIEME           MOVE J TO V-104(TIPO)                                  RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME*** CR105,BS105,CC105,OT105,MT105,CP105                           RMB0021 
ACIEME     IF FECHA-NOVEDAD07 <= FECHA-RUN-DATE AND                     RMB0021 
ACIEME               NOV-REPORT-ABD07  = 45 OR 47   *> Castigada o DudosRMB0021 
ACIEME        COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -              RMB0021 
ACIEME                    ( SIG-ANO-NOV * 12 + MES-NOV )                RMB0021 
ACIEME        IF J < V-105(TIPO)                                        RMB0021 
ACIEME           MOVE J TO V-105(TIPO)                                  RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME     END-IF.                                                      RMB0021 
ACIEME 5320-CAR-AT112-AT124.                                            RMB0021 
NEWPRE*** AT112 - AT124                                                 RMB0004 
NEWPRE     IF V-MORA(NOV-REPORT-ABD07) NOT = 9                          RMB0004 
NEWPRE        MOVE 1 TO OPEFLAG-TOT                                     RMB0004 
NEWPRE        IF FECHA-VENCIMIENTO07 >  FECHA-APERTURA07                RMB0004 
NEWPRE           MOVE 1 TO DDFLAG-TOT                                   RMB0004 
NEWPRE           IF FECHA-NOVEDAD07 <= FECHA-RUN-DATE                   RMB0004 
NEWPRE              COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -        RMB0004 
NEWPRE                          ( SIG-ANO-NOV * 12 + MES-NOV )          RMB0004 
NEWPRE              IF J <= 12                                          RMB0004 
NEWPRE                 MOVE 1 TO VFLAG-TOT                              RMB0004 
NEWPRE                 IF VALORES-OK-FLAG = 1                           RMB0004 
NEWPRE*                   AT112,AT124                                   RMB0004 
NEWPRE                    MOVE 1 TO CBFLAG-TOT                          RMB0004 
NEWPRE                    COMPUTE VAL-TOT-BAL = VAL-TOT-BAL +           RMB0004 
NEWPRE                                         VALOR-SALDO-DEUDAM-ABD07 RMB0004 
NEWPRE                    ADD 1 TO CON-TOT-BAL                          RMB0004 
NEWPR1                    IF VALOR-MOR-OK-FLAG = 1                      RMB0004 
NEWPR1                       MOVE 1 TO DQFLAG-TOT                       RMB0004 
NEWPR1                       COMPUTE VAL-TOT-DEL = VAL-TOT-DEL +        RMB0004 
NEWPR1                                         VALOR-SALDO-MORAM-ABD07  RMB0004 
NEWPR1                       ADD 1 TO CON-TOT-DEL                       RMB0004 
NEWPR1                    END-IF                                        RMB0004 
NEWPRE                 END-IF                                           RMB0004 
NEWPRE                 IF IND-AMPLIACION-ABD02 = 5 AND                  RMB0004 
NEWPRE                    FECHA-VALORES07 > 0                           RMB0004 
NEWPRE*                   AT114                                         RMB0004 
NEWPRE                    MOVE 1 TO CLFLAG-TOT                          RMB0004 
NEWPRE                    COMPUTE VAL-TOT-LIM = VAL-TOT-LIM +           RMB0004 
NEWPRE                                         VALOR-INICIAL-ABD07      RMB0004 
NEWPRE                    ADD 1 TO CON-TOT-LIM                          RMB0004 
NEWPRE                 END-IF                                           RMB0004 
NEWPRE                 PERFORM 5321-CRITERIO-DE-EXCLUSION               RMB0004 
NEWPRE                 IF CRITERIO-DE-EXCLUSION = 0                     RMB0004 
NEWPRE*                   AT115,AT116                                   RMB0004 
NEWPRE                    MOVE 1 TO EXFLAG-TOT                          RMB0004 
NEWPRE                    IF VALORES-OK-FLAG = 1 AND                    RMB0004 
NEWPRE                                           VALOR-INICIAL-ABD07 > 0RMB0004 
NEWPRE                       MOVE 1 TO UTFLAG-TOT                       RMB0004 
NEWPRE                       COMPUTE VAL-TOT-BAL0 = VAL-TOT-BAL0 +      RMB0004 
NEWPRE                                     VALOR-SALDO-DEUDAM-ABD07     RMB0004 
NEWPRE                       COMPUTE VAL-TOT-LIM0 = VAL-TOT-LIM0 +      RMB0004 
NEWPRE                                     VALOR-INICIAL-ABD07          RMB0004 
NEWPRE                       COMPUTE VAL-TOT-BALLIM = VAL-TOT-BALLIM    RMB0004 
NEWPRE              +  (VALOR-SALDO-DEUDAM-ABD07 / VALOR-INICIAL-ABD07) RMB0004 
NEWPRE                       ADD 1 TO CON-TOT-BALLIM                    RMB0004 
NEWPRE                    END-IF                                        RMB0004 
NEWPRE                 END-IF                                           RMB0004 
NEWPRE             END-IF                                               RMB0004 
NEWPRE           END-IF                                                 RMB0004 
NEWPRE        END-IF                                                    RMB0004 
NEWPRE     END-IF.                                                      RMB0004 
ACIEME 5320-CAR-AT112-AT124-BITS.                                       RMB0021 
NEWPRE*** AT112 - AT124                                                 RMB0004 
NEWPRE     IF V-MORA(NOV-REPORT-ABD07) NOT = 9                          RMB0004 
NEWPRE        MOVE 1 TO OPEFLAG-TOT                                     RMB0004 
NEWPRE        IF FECHA-VENCIMIENTO07 >  FECHA-APERTURA07                RMB0004 
NEWPRE           MOVE 1 TO DDFLAG-TOT                                   RMB0004 
NEWPRE           IF FECHA-NOVEDAD07 <= FECHA-RUN-DATE                   RMB0004 
NEWPRE              COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -        RMB0004 
NEWPRE                          ( SIG-ANO-NOV * 12 + MES-NOV )          RMB0004 
NEWPRE              IF J <= 12                                          RMB0004 
NEWPRE                 MOVE 1 TO VFLAG-TOT                              RMB0004 
ACIEME                 IF IND-VALORES-VALVLR = 1                        RMB0021 
NEWPRE*                   AT112,AT124                                   RMB0004 
ACIEME                    IF VEC-VALOR-VALVLR(3) = 1                    RMB0021 
NEWPRE                       MOVE 1 TO CBFLAG-TOT                       RMB0004 
NEWPRE                       COMPUTE VAL-TOT-BAL = VAL-TOT-BAL +        RMB0004 
NEWPRE                                         VALOR-SALDO-DEUDAM-ABD07 RMB0004 
NEWPRE                       ADD 1 TO CON-TOT-BAL                       RMB0004 
ACIEME                    END-IF                                        RMB0021 
ACIEME                    IF VEC-VALOR-VALVLR(5) = 1                    RMB0021 
NEWPR1                       MOVE 1 TO DQFLAG-TOT                       RMB0004 
NEWPR1                       COMPUTE VAL-TOT-DEL = VAL-TOT-DEL +        RMB0004 
NEWPR1                                         VALOR-SALDO-MORAM-ABD07  RMB0004 
NEWPR1                       ADD 1 TO CON-TOT-DEL                       RMB0004 
NEWPR1                    END-IF                                        RMB0004 
ACIEME                    IF VEC-VALOR-VALVLR(2) = 1                    RMB0021 
NEWPRE*                   AT114                                         RMB0004 
NEWPRE                       MOVE 1 TO CLFLAG-TOT                       RMB0004 
NEWPRE                       COMPUTE VAL-TOT-LIM = VAL-TOT-LIM +        RMB0004 
NEWPRE                                            VALOR-INICIAL-ABD07   RMB0004 
NEWPRE                       ADD 1 TO CON-TOT-LIM                       RMB0004 
ACIEME                    END-IF                                        RMB0021 
NEWPRE                 END-IF                                           RMB0004 
NEWPRE                 PERFORM 5321-CRITERIO-DE-EXCLUSION               RMB0004 
NEWPRE                 IF CRITERIO-DE-EXCLUSION = 0                     RMB0004 
NEWPRE*                   AT115,AT116                                   RMB0004 
NEWPRE                    MOVE 1 TO EXFLAG-TOT                          RMB0004 
ACIEME                    IF IND-VALORES-VALVLR = 1 AND                 RMB0021 
ACIEME                       VEC-VALOR-VALVLR(2) = 1 AND                RMB0021 
ACIEME                       VEC-VALOR-VALVLR(3) = 1 AND                RMB0021 
NEWPRE                                           VALOR-INICIAL-ABD07 > 0RMB0004 
NEWPRE                       MOVE 1 TO UTFLAG-TOT                       RMB0004 
NEWPRE                       COMPUTE VAL-TOT-BAL0 = VAL-TOT-BAL0 +      RMB0004 
NEWPRE                                     VALOR-SALDO-DEUDAM-ABD07     RMB0004 
NEWPRE                       COMPUTE VAL-TOT-LIM0 = VAL-TOT-LIM0 +      RMB0004 
NEWPRE                                     VALOR-INICIAL-ABD07          RMB0004 
NEWPRE                       COMPUTE VAL-TOT-BALLIM = VAL-TOT-BALLIM    RMB0004 
NEWPRE              +  (VALOR-SALDO-DEUDAM-ABD07 / VALOR-INICIAL-ABD07) RMB0004 
NEWPRE                       ADD 1 TO CON-TOT-BALLIM                    RMB0004 
NEWPRE                    END-IF                                        RMB0004 
NEWPRE                 END-IF                                           RMB0004 
NEWPRE             END-IF                                               RMB0004 
NEWPRE           END-IF                                                 RMB0004 
NEWPRE        END-IF                                                    RMB0004 
NEWPRE     END-IF.                                                      RMB0004 
ACIEME 5321-CAR-CR111-CP124.                                            RMB0021 
REMARK*********************************************************************
REMARK*5321-CAR-CR111-CP124.
REMARK* SE CALCULAN LAS CARACTERISTICAS PARA LOS TIPO 1-6 CR111-CP124,
REMARK* ESTOS TIPOS SON CR,BS,CC,OT,MT,CP.
REMARK*********************************************************************
ACIEME     MOVE 1 TO CTAFLAG(TIPO).                                     RMB0021 
NEWPRE     MOVE 0 TO VALORES-OK-FLAG .                                  RMB0004 
NEWPRE     IF IND-AMPLIACION-ABD02 = 5 AND FECHA-VALORES07 > 0          RMB0004 
NEWPRE        PERFORM 5321-FECHA-VALORES                                RMB0004 
NEWPRE     END-IF.                                                      RMB0004 
NEWPRE     IF V-MORA(NOV-REPORT-ABD07) NOT = 9                          RMB0004 
ACIEME        MOVE 1 TO OPEFLAG(TIPO)                                   RMB0021 
NEWPRE        IF FECHA-VENCIMIENTO07 >  FECHA-APERTURA07 
ACIEME           MOVE 1 TO DDFLAG(TIPO)                                 RMB0021 
NEWPRE           IF FECHA-NOVEDAD07 <= FECHA-RUN-DATE   
NEWPRE              COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -       
NEWPRE                        ( SIG-ANO-NOV * 12 + MES-NOV )          
NEWPRE              IF J <= 12                                       
NEWPRE                 MOVE 1 TO VFLAG(TIPO)                        
NEWPRE                 IF VALORES-OK-FLAG = 1                      
REMARK*                   CR111-CR112 CR122-CR124
NEWPRE                    MOVE 1 TO CBFLAG(TIPO)                           
NEWPRE                    COMPUTE BAL111(TIPO) =      BAL111(TIPO) +      
NEWPRE                                        VALOR-SALDO-DEUDAM-ABD07   
NEWPRE                    ADD 1 TO CON-CTA-BAL(TIPO)                    
NEWPR1                    IF VALOR-MOR-OK-FLAG = 1                     
NEWPR1                        MOVE 1 TO DQFLAG(TIPO)                        
NEWPR1                        COMPUTE BAL122(TIPO) = BAL122(TIPO) +         
NEWPR1                                        VALOR-SALDO-MORAM-ABD07    
NEWPR1                        ADD 1 TO CON-CTA-DEL(TIPO)                    
NEWPR1                    END-IF                                            
NEWPRE                    MOVE 1 TO PMTFLAG(TIPO)                           
NEWPRE                    COMPUTE BAL123(TIPO) = BAL123(TIPO) + 
NEWPRE                                           CUANTIA-ABD07 
NEWPRE                 END-IF                                                
NEWPRE                 IF IND-AMPLIACION-ABD02 = 5 AND 
NEWPRE                                             FECHA-VALORES07 > 0  
REMARK*                   CR113-CR114 
NEWPRE                    MOVE 1 TO CLFLAG(TIPO)                           
NEWPRE                    COMPUTE BAL113(TIPO) =       BAL113(TIPO) +  
NEWPRE                                        VALOR-INICIAL-ABD07        
NEWPRE                    ADD 1 TO CON-CTA-LIM(TIPO)                    
NEWPRE                 END-IF                                          
NEWPRE                 PERFORM 5321-CRITERIO-DE-EXCLUSION             
ACIEME                 IF CRITERIO-DE-EXCLUSION = 0 OR                  RMB0021 
ACIEME                    OLD-MORTAGE = 1       *> SOLO PARA HIP EN PRE-RMB0021 
REMARK*                   CR115-CR121                           
NEWPRE                    MOVE 1 TO EXFLAG(TIPO)                    
NEWPRE                    IF VALORES-OK-FLAG = 1 AND 
NEWPRE                                           VALOR-INICIAL-ABD07 > 0 
NEWPRE                       MOVE 1 TO UTFLAG(TIPO)                         
NEWPRE                       COMPUTE VAL-CTA-BAL(TIPO) = 
NEWPRE                                     VAL-CTA-BAL(TIPO) 
NEWPRE                               +     VALOR-SALDO-DEUDAM-ABD07       
NEWPRE                       COMPUTE VAL-CTA-LIM(TIPO) = 
NEWPRE                                     VAL-CTA-LIM(TIPO) 
NEWPRE                               +     VALOR-INICIAL-ABD07            
NEWPRE                       COMPUTE VAL-CTA-BALLIM(TIPO) =              
NEWPRE                               VAL-CTA-BALLIM(TIPO) +             
NEWPRE                               (VALOR-SALDO-DEUDAM-ABD07/
NEWPRE                                VALOR-INICIAL-ABD07) 
NEWPRE                       ADD 1 TO CON-CTA-BALLIM(TIPO)                 
NEWPRE                       COMPUTE UTIL-AUX ROUNDED =                   
NEWPRE                               VALOR-SALDO-DEUDAM-ABD07 /          
NEWPRE                                VALOR-INICIAL-ABD07               
NEWPRE                       IF UTIL-AUX >= 0 AND <= 0.25              
NEWPRE                          ADD 1 TO BAL117(TIPO)                 
NEWPRE                       END-IF                                  
NEWPRE                       IF UTIL-AUX >= 0.26 AND <= 0.50        
NEWPRE                          ADD 1 TO BAL118(TIPO)              
NEWPRE                       END-IF                               
NEWPRE                       IF UTIL-AUX >= 0.51 AND <= 0.75     
NEWPRE                          ADD 1 TO BAL119(TIPO)           
NEWPRE                       END-IF                            
NEWPRE                       IF UTIL-AUX >= 0.76 AND <= 1     
NEWPRE                          ADD 1 TO BAL120(TIPO)        
NEWPRE                       END-IF                         
NEWPRE                       IF UTIL-AUX >= 1.01               
NEWPRE                          ADD 1 TO BAL121(TIPO)         
NEWPRE                       END-IF                          
NEWPRE                    END-IF                            
NEWPRE                 END-IF                              
NEWPRE              END-IF                                
NEWPRE           END-IF                                
NEWPRE        END-IF                                
TRANS      END-IF.
NEWPRE 5321-FECHA-VALORES.                                              RMB0004 
REMARK*********************************************************************
REMARK*5321-FECHA-VALORES.
REMARK* SE VALIDA SI LOS VALORES SON VALIDOS MIRANDO LAS FECHAS DE 
REMARK* ACTUALIZACION
REMARK*********************************************************************
REMARK* ACIERT: SE ACOMODA A MANEJAR LA FECHA DE VALORES SIN BIT-MAP
NEWPR1    MOVE 0 TO VALOR-MOR-OK-FLAG.                                  RMB0004 
NEWPRE    MOVE 0 TO VALORES-OK-FLAG.                                    RMB0004 
NEWPRE    IF NOV-REPORT-ABD07 = 01 OR                                   RMB0004 
NEWPRE       (NOV-REPORT-ABD07 > 12 AND NOV-REPORT-ABD07 < 17)          RMB0004 
NEWPRE       IF (FECHA-NOVEDAD07-AUX <  200108 AND                      RMB0004 
NEWPRE           FECHA-NOVEDAD07-AUX <= FECHA-VALORES07         ) OR    RMB0004 
NEWPRE          (FECHA-NOVEDAD07-AUX >= 200108 AND                      RMB0004 
NEWPRE           FECHA-NOVEDAD07-AUX <= 200203 AND                      RMB0004 
ACIERT           FECHA-NOVEDAD07-AUX >= FECHA-VALORES07         ) OR    RMB0004 
ACIERT          (FECHA-NOVEDAD07-AUX >  200203 AND                      RMB0004 
ACIERT           FECHA-NOVEDAD07-AUX = FECHA-VALORES07          )       RMB0004 
NEWPRE           MOVE 1 TO VALORES-OK-FLAG                              RMB0004 
NEWPRE       END-IF                                                     RMB0004 
NEWPRE    END-IF.                                                       RMB0004 
NEWPRE    IF (NOV-REPORT-ABD07 > 16 AND NOV-REPORT-ABD07 < 42)          RMB0004 
NEWPRE       IF (FECHA-NOVEDAD07-AUX < 200108 AND                       RMB0004 
NEWPRE           FECHA-NOVEDAD07-AUX = FECHA-VALORES07         ) OR     RMB0004 
NEWPRE          (FECHA-NOVEDAD07-AUX >= 200108 AND                      RMB0004 
NEWPRE           FECHA-NOVEDAD07-AUX <= 200203 AND                      RMB0004 
NEWPRE           FECHA-NOVEDAD07-AUX >= FECHA-VALORES07         ) OR    RMB0004 
ACIERT          (FECHA-NOVEDAD07-AUX >  200203 AND                      RMB0004 
ACIERT           FECHA-NOVEDAD07-AUX = FECHA-VALORES07          )       RMB0004 
NEWPRE           MOVE 1 TO VALORES-OK-FLAG                              RMB0004 
NEWPRE        END-IF                                                    RMB0004 
NEWPRE    END-IF.                                                       RMB0004 
NEWPRE    IF NOV-REPORT-ABD07 = 45 OR 47                                RMB0004 
NEWPRE       IF FECHA-NOVEDAD07-AUX <= FECHA-VALORES07          OR      RMB0004 
NEWPRE          FECHA-ACTSUS     = FECHA-SITUACION07                    RMB0004 
NEWPRE           MOVE 1 TO VALORES-OK-FLAG                              RMB0004 
NEWPRE       END-IF                                                     RMB0004 
NEWPRE    END-IF.                                                       RMB0004 
NEWPRE    IF VALORES-OK-FLAG = 1 AND V-MORA(NOV-REPORT-ABD07) = 5       RMB0004 
NEWPRE       MOVE 0 TO VALOR-SALDO-MORAM-ABD07                          RMB0004 
NEWPRE    END-IF.                                                       RMB0004 
NEWPR1    IF VALORES-OK-FLAG = 1                                        RMB0004 
NEWPR1        MOVE 1 TO VALOR-MOR-OK-FLAG                               RMB0004 
NEWPR1    END-IF                                                        RMB0004 
NEWPR1    IF VALORES-OK-FLAG = 1 AND                                    RMB0004 
NEWPR1      V-MORA(NOV-REPORT-ABD07) > 0 AND < 5                        RMB0004 
NEWPR1       IF VALOR-SALDO-MORAM-ABD07 = 0                             RMB0004 
NEWPR1          MOVE 0 TO VALOR-MOR-OK-FLAG                             RMB0004 
NEWPR1       END-IF                                                     RMB0004 
NEWPR1    END-IF.                                                       RMB0004 
ACIEME 5321-CAR-CR111-CP124-BITS.                                       RMB0021 
REMARK*********************************************************************
REMARK*5321-CAR-CR111-CP124.
REMARK* SE CALCULAN LAS CARACTERISTICAS PARA LOS TIPO 1-6 CR111-CP124,
REMARK* ESTOS TIPOS SON CR,BS,CC,OT,MT,CP.
REMARK*********************************************************************
ACIEME     MOVE 1 TO CTAFLAG(TIPO).                                     RMB0021 
NEWPRE     MOVE 0 TO VALORES-OK-FLAG .                                  RMB0004 
ACIEM8     INITIALIZE VECTOR-VALORES-VALVLR.                            RMB0022
NEWPRE     IF IND-AMPLIACION-ABD02 = 5 AND FECHA-VALORES07 > 0          RMB0004 
ACIEME        PERFORM 32000-PROCESAR-VALORES                            RMB0021 
NEWPRE     END-IF.                                                      RMB0004 
ACIEME     IF (VEC-VALOR-VALVLR(5) = 0 OR VALOR-SALDO-MORAM-ABD07 = 0)  RMB0021 
ACIEME         AND                                                      RMB0021 
ACIEME        (VEC-VALOR-VALVLR(3) = 0 OR VALOR-SALDO-DEUDAM-ABD07 = 0) RMB0021 
ACIEME         AND                                                      RMB0021 
ACIEME        (VEC-VALOR-VALVLR(2) = 0 OR VALOR-INICIAL-ABD07 = 0)      RMB0021 
ACIEME         AND                                                      RMB0021 
ACIEME        (VEC-VALOR-VALVLR(1) = 0 OR CUANTIA-ABD07 > 0)            RMB0021 
ACIEME        MOVE 0 TO IND-VALORES-VALVLR                              RMB0021 
ACIEME     END-IF                                                       RMB0021 
NEWPRE     IF V-MORA(NOV-REPORT-ABD07) NOT = 9                          RMB0004 
ACIEME        MOVE 1 TO OPEFLAG(TIPO)                                   RMB0021 
NEWPRE        IF FECHA-VENCIMIENTO07 >  FECHA-APERTURA07 
ACIEME           MOVE 1 TO DDFLAG(TIPO)                                 RMB0021 
NEWPRE           IF FECHA-NOVEDAD07 <= FECHA-RUN-DATE   
NEWPRE              COMPUTE J = ( SIG-ANO-RUN * 12 + MES-RUN ) -       
NEWPRE                        ( SIG-ANO-NOV * 12 + MES-NOV )          
NEWPRE              IF J <= 12                                       
NEWPRE                 MOVE 1 TO VFLAG(TIPO)                        
ACIEME                 IF IND-VALORES-VALVLR = 1                        RMB0021 
REMARK*                   CR111-CR112 CR122-CR124
ACIEME                    IF VEC-VALOR-VALVLR(3) = 1                    RMB0021 
NEWPRE                       MOVE 1 TO CBFLAG(TIPO)                           
NEWPRE                       COMPUTE BAL111(TIPO) =      BAL111(TIPO) +      
NEWPRE                                        VALOR-SALDO-DEUDAM-ABD07   
NEWPRE                       ADD 1 TO CON-CTA-BAL(TIPO)                    
ACIEME                    END-IF                                        RMB0021 
ACIEME                    IF VEC-VALOR-VALVLR(5) = 1                    RMB0021 
NEWPR1                        MOVE 1 TO DQFLAG(TIPO)                        
NEWPR1                        COMPUTE BAL122(TIPO) = BAL122(TIPO) +         
NEWPR1                                        VALOR-SALDO-MORAM-ABD07    
NEWPR1                        ADD 1 TO CON-CTA-DEL(TIPO)                    
NEWPR1                    END-IF                                            
ACIEME                    IF VEC-VALOR-VALVLR(1) = 1                    RMB0021 
NEWPRE                       MOVE 1 TO PMTFLAG(TIPO)                           
NEWPRE                       COMPUTE BAL123(TIPO) = BAL123(TIPO) + 
NEWPRE                                              CUANTIA-ABD07 
NEWPRE                    END-IF                                                
ACIEME                    IF VEC-VALOR-VALVLR(2) = 1                    RMB0021 
REMARK*                      CR113-CR114 
NEWPRE                       MOVE 1 TO CLFLAG(TIPO)                           
NEWPRE                       COMPUTE BAL113(TIPO) =       BAL113(TIPO) +  
NEWPRE                                           VALOR-INICIAL-ABD07        
NEWPRE                       ADD 1 TO CON-CTA-LIM(TIPO)                    
ACIEME                    END-IF                                        RMB0021 
NEWPRE                 END-IF                                          
NEWPRE                 PERFORM 5321-CRITERIO-DE-EXCLUSION             
NEWPRE                 IF CRITERIO-DE-EXCLUSION = 0                  
REMARK*                   CR115-CR121                           
NEWPRE                    MOVE 1 TO EXFLAG(TIPO)                    
ACIEME                    IF IND-VALORES-VALVLR = 1 AND                 RMB0021 
ACIEME                       VEC-VALOR-VALVLR(2) = 1 AND                RMB0021 
ACIEME                       VEC-VALOR-VALVLR(3) = 1 AND                RMB0021 
NEWPRE                                           VALOR-INICIAL-ABD07 > 0 
NEWPRE                       MOVE 1 TO UTFLAG(TIPO)                         
NEWPRE                       COMPUTE VAL-CTA-BAL(TIPO) = 
NEWPRE                                     VAL-CTA-BAL(TIPO) 
NEWPRE                               +     VALOR-SALDO-DEUDAM-ABD07       
NEWPRE                       COMPUTE VAL-CTA-LIM(TIPO) = 
NEWPRE                                     VAL-CTA-LIM(TIPO) 
NEWPRE                               +     VALOR-INICIAL-ABD07            
NEWPRE                       COMPUTE VAL-CTA-BALLIM(TIPO) =              
NEWPRE                               VAL-CTA-BALLIM(TIPO) +             
NEWPRE                               (VALOR-SALDO-DEUDAM-ABD07/
NEWPRE                                VALOR-INICIAL-ABD07) 
NEWPRE                       ADD 1 TO CON-CTA-BALLIM(TIPO)                 
NEWPRE                       COMPUTE UTIL-AUX ROUNDED =                   
NEWPRE                               VALOR-SALDO-DEUDAM-ABD07 /          
NEWPRE                                VALOR-INICIAL-ABD07               
NEWPRE                       IF UTIL-AUX >= 0 AND <= 0.25              
NEWPRE                          ADD 1 TO BAL117(TIPO)                 
NEWPRE                       END-IF                                  
NEWPRE                       IF UTIL-AUX >= 0.26 AND <= 0.50        
NEWPRE                          ADD 1 TO BAL118(TIPO)              
NEWPRE                       END-IF                               
NEWPRE                       IF UTIL-AUX >= 0.51 AND <= 0.75     
NEWPRE                          ADD 1 TO BAL119(TIPO)           
NEWPRE                       END-IF                            
NEWPRE                       IF UTIL-AUX >= 0.76 AND <= 1     
NEWPRE                          ADD 1 TO BAL120(TIPO)        
NEWPRE                       END-IF                         
NEWPRE                       IF UTIL-AUX >= 1.01               
NEWPRE                          ADD 1 TO BAL121(TIPO)         
NEWPRE                       END-IF                          
NEWPRE                    END-IF                            
NEWPRE                 END-IF                              
NEWPRE              END-IF                                
NEWPRE           END-IF                                
NEWPRE        END-IF                                
TRANS      END-IF.
NEWPRE 5321-CRITERIO-DE-EXCLUSION.                                      RMB0004 
ACIEME************OJO CON ESTA RUTINA PARA PLUS Y ACIERTA               RMB0021 
ACIEME*   PARA PLUS : EN MTs Y ATs INCLUYEN LOS HIPOTECARIOS            RMB0021 
ACIEME*   PARA ACIERTA : EN MTs Y ATs SE EXCLUYEN LOS HIPOTECARIOS      RMB0021 
NEWPRE*   SI TRADE IS MORTGAGE                                          RMB0004 
NEWPRE    MOVE 0 TO CRITERIO-DE-EXCLUSION.                              RMB0004 
ACIEME*   IF TIP-SCO-GENERICO = 8 OR                                    RMB0021 
ACIEME*      (TIP-SCO-GENERICO NOT = 8 AND TIPO = 5)                    RMB0021 
ACIEME*      CONTINUE                                                   RMB0021 
ACIEME*   CAMBIO ACIERTA : EXCLUIR HIPOTECARIOS EN CR,BS,CC,OT Y AT     RMB0021 
ACIEME*   CAMBIO PLUS    : EXCLUIR HIPOTECARIOS EN AT                   RMB0021 
ACIEME    IF TIPO = 5    *> ES UN MT                                    RMB0021 
ACIEME       CONTINUE                                                   RMB0021 
ACIEME    ELSE                                                          RMB0021 
NEWPRE       IF V-TIPCRE(COD-CTA-ABD07) = "M"   OR 
NEWPRE          ( V-TIPCRE(COD-CTA-ABD07) = "E" AND                         
NEWPRE          TIPO-OBLIGACION-ABD07 = 3 )     
NEWPRE          MOVE 1 TO CRITERIO-DE-EXCLUSION                         RMB0004 
ACIEME       END-IF                                                     RMB0021 
ACIEME    END-IF.                                                       RMB0021 
NEWPRE*  SI CURRENT BALANCE AND CREDIT LIMIT = 0                        RMB0004 
ACIEME    IF                                                            RMB0021 
NEWPRE    (VALOR-SALDO-DEUDAM-ABD07 = 0 AND VALOR-INICIAL-ABD07 = 0) OR RMB0004 
NEWPRE*       SI CURRENT BALANCE = 0 AND MORTGAGE OR INSTALLMENT        RMB0004 
NEWPRE      (VALOR-SALDO-DEUDAM-ABD07 = 0 AND                           RMB0004 
NEWPRE                            V-TIPCRE(COD-CTA-ABD07) NOT = "N") OR RMB0004 
NEWPRE*       SI TRADE CLOSED                                           RMB0004 
NEWPRE      V-MORA(NOV-REPORT-ABD07)  = 9                               RMB0004 
NEWPRE         MOVE 1 TO CRITERIO-DE-EXCLUSION                          RMB0004 
NEWPRE    END-IF.                                                       RMB0004 
TRANS  5500-TRU-CAR-FIN-CRBSCCOT.
REMARK**********************************************************************
REMARK*5500-TRU-CAR-FIN-CRBSCCOT.
REMARK* SE ASIGNAN LOS VALORES NEGATIVOS A CARTERA (CRXXX,CCXXX,BSXXX,OTXXX)*
REMARK* DE ACUERDO A LAS ESPECIFICACIONES DADAS.
REMARK**********************************************************************
TRANS       MOVE 1 TO I.
ACIEME      PERFORM UNTIL I > 6                                         RMB0021 
CANC01        IF CLOFLAG(I) = 0                                         RMB0016 
CANC01           MOVE " -2" TO V-WORK(I,003)(1:3)                       RMB0016 
CANC01        END-IF                                                    RMB0016 
TRANS         IF CTAFLAG(I) = 0 
TRANS            MOVE " -1" TO V-WORK(I,001)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,002)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,003)(1:3)
ACIEME           MOVE " -1" TO V-DISPUTAS(I)(1:3)                       RMB0021 
TRANS         END-IF
TRANS         IF CTAFLAG(I) = 0
TRANS            MOVE " -1" TO V-WORK(I,010)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,011)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,012)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,013)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,014)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,020)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,021)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,022)(1:3)
TRANS         ELSE
TRANS         IF OPEFLAG(I) = 0   
TRANS            MOVE " -2" TO V-WORK(I,010)(1:3)
TRANS            MOVE " -2" TO V-WORK(I,011)(1:3)
TRANS            MOVE " -2" TO V-WORK(I,012)(1:3)
TRANS            MOVE " -2" TO V-WORK(I,013)(1:3)
TRANS            MOVE " -2" TO V-WORK(I,014)(1:3)
TRANS            MOVE " -2" TO V-WORK(I,020)(1:3)
TRANS            MOVE " -2" TO V-WORK(I,021)(1:3)
TRANS            MOVE " -2" TO V-WORK(I,022)(1:3)
TRANS         ELSE             
TRANS         IF DDFLAG(I) = 0
TRANS            MOVE " -3" TO V-WORK(I,010)(1:3)
TRANS            MOVE " -3" TO V-WORK(I,011)(1:3)
TRANS            MOVE " -3" TO V-WORK(I,012)(1:3)
TRANS            MOVE " -3" TO V-WORK(I,013)(1:3)
TRANS            MOVE " -3" TO V-WORK(I,014)(1:3)
TRANS            MOVE " -3" TO V-WORK(I,020)(1:3)
TRANS            MOVE " -3" TO V-WORK(I,021)(1:3)
TRANS            MOVE " -3" TO V-WORK(I,022)(1:3)
TRANS         END-IF
TRANS         END-IF
TRANS         END-IF
TRANS         IF CTAFLAG(I) = 0 
TRANS            MOVE " -1" TO V-WORK(I,030)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,031)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,032)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,033)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,034)(1:3)
TRANS         END-IF
TRANS         IF CTAFLAG(I) = 0 
TRANS            MOVE " -1" TO V-WORK(I,040)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,041)(1:3)
TRANS         ELSE
TRANS         IF DOFLAG(I) = 0 
TRANS            MOVE " -2" TO V-WORK(I,040)(1:3)
TRANS            MOVE " -2" TO V-WORK(I,041)(1:3)
TRANS         END-IF
TRANS         END-IF
TRANS         MOVE 50 TO J 
TRANS         PERFORM UNTIL J > 95
TRANS           EVALUATE J                
TRANS             WHEN 50
TRANS               MOVE 01 TO K 
TRANS             WHEN 95
TRANS               MOVE 02 TO K 
TRANS             WHEN 51
TRANS               MOVE 03 TO K 
TRANS             WHEN 52
TRANS               MOVE 04 TO K 
TRANS             WHEN 53
TRANS               MOVE 05 TO K 
TRANS             WHEN 54
TRANS               MOVE 06 TO K 
TRANS             WHEN ANY
TRANS               COMPUTE K = J - 47                  
TRANS           END-EVALUATE 
TRANS           IF J = 89 OR 90 OR 91
TRANS              IF CTAFLAG(I) = 0
TRANS                 MOVE " -1" TO V-WORK(I,J)(1:3) 
TRANS              END-IF
TRANS           ELSE
TRANS              IF V-MORA(K) = 9 
TRANS                 IF CTAFLAG(I) = 0 
TRANS                    MOVE " -1" TO V-WORK(I,J)(1:3) 
TRANS                 ELSE
TRANS                    IF CLOFLAG(I) = 0 
TRANS                       MOVE " -2" TO V-WORK(I,J)(1:3) 
TRANS                    END-IF
TRANS                 END-IF
TRANS              ELSE
TRANS                 IF CTAFLAG(I) = 0 
TRANS                    MOVE " -1" TO V-WORK(I,J)(1:3) 
TRANS                 ELSE
TRANS                    IF OPEFLAG(I) = 0 
TRANS                       MOVE " -2" TO V-WORK(I,J)(1:3) 
TRANS                    END-IF
TRANS                 END-IF
TRANS              END-IF
TRANS           END-IF
TRANS           ADD 1 TO J
TRANS         END-PERFORM  
TRANS         IF CTAFLAG(I) = 0 
TRANS            MOVE " -1" TO V-WORK(I,100)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,101)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,102)(1:3)
TRANS            MOVE " -1" TO V-WORK(I,103)(1:3)
TRANS         END-IF
ACIEME        IF CTAFLAG(I) = 0                                         RMB0021 
ACIEME           MOVE " -1" TO V-104(I)(1:3)                            RMB0021 
ACIEME           MOVE " -1" TO V-105(I)(1:3)                            RMB0021 
ACIEME        ELSE                                                      RMB0021 
ACIEME        IF CLOFLAG(I) = 0                                         RMB0021 
ACIEME           MOVE " -2" TO V-104(I)(1:3)                            RMB0021 
ACIEME        END-IF                                                    RMB0021 
ACIEME        END-IF                                                    RMB0021 
TRANS         ADD 1 TO I
TRANS      END-PERFORM.
NEWPRE     MOVE 1 TO I                                                  RMB0004 
ACIEME     PERFORM UNTIL I > 6                                          RMB0021 
NEWPRE       IF CTAFLAG(I) = 0                                          RMB0004 
NEWPRE          MOVE "       -1" TO BAL111(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -1" TO BAL112(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -1" TO BAL113(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -1" TO BAL114(I)(1:9)                      RMB0004 
NEWPRE          MOVE "    -1" TO BAL115(I)(1:6)                         RMB0004 
NEWPRE          MOVE "    -1" TO BAL116(I)(1:6)                         RMB0004 
NEWPRE          MOVE " -1" TO BAL117(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -1" TO BAL118(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -1" TO BAL119(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -1" TO BAL120(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -1" TO BAL121(I)(1:3)                            RMB0004 
NEWPRE          MOVE "       -1" TO BAL122(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -1" TO BAL123(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -1" TO BAL124(I)(1:9)                      RMB0004 
NEWPRE       ELSE                                                       RMB0004 
NEWPRE       IF OPEFLAG(I) = 0                                          RMB0004 
NEWPRE          MOVE "       -2" TO BAL111(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -2" TO BAL112(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -2" TO BAL113(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -2" TO BAL114(I)(1:9)                      RMB0004 
NEWPRE          MOVE "    -2" TO BAL115(I)(1:6)                         RMB0004 
NEWPRE          MOVE "    -2" TO BAL116(I)(1:6)                         RMB0004 
NEWPRE          MOVE " -2" TO BAL117(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -2" TO BAL118(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -2" TO BAL119(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -2" TO BAL120(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -2" TO BAL121(I)(1:3)                            RMB0004 
NEWPRE          MOVE "       -2" TO BAL122(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -2" TO BAL123(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -2" TO BAL124(I)(1:9)                      RMB0004 
NEWPRE       ELSE                                                       RMB0004 
NEWPRE       IF DDFLAG(I) = 0                                           RMB0004 
NEWPRE          MOVE "       -3" TO BAL111(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -3" TO BAL112(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -3" TO BAL113(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -3" TO BAL114(I)(1:9)                      RMB0004 
NEWPRE          MOVE "    -3" TO BAL115(I)(1:6)                         RMB0004 
NEWPRE          MOVE "    -3" TO BAL116(I)(1:6)                         RMB0004 
NEWPRE          MOVE " -3" TO BAL117(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -3" TO BAL118(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -3" TO BAL119(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -3" TO BAL120(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -3" TO BAL121(I)(1:3)                            RMB0004 
NEWPRE          MOVE "       -3" TO BAL122(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -3" TO BAL123(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -3" TO BAL124(I)(1:9)                      RMB0004 
NEWPRE       ELSE                                                       RMB0004 
NEWPRE       IF VFLAG(I) = 0                                            RMB0004 
NEWPRE          MOVE "       -4" TO BAL111(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -4" TO BAL112(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -4" TO BAL113(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -4" TO BAL114(I)(1:9)                      RMB0004 
NEWPRE          MOVE "    -4" TO BAL115(I)(1:6)                         RMB0004 
NEWPRE          MOVE "    -4" TO BAL116(I)(1:6)                         RMB0004 
NEWPRE          MOVE " -4" TO BAL117(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -4" TO BAL118(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -4" TO BAL119(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -4" TO BAL120(I)(1:3)                            RMB0004 
NEWPRE          MOVE " -4" TO BAL121(I)(1:3)                            RMB0004 
NEWPRE          MOVE "       -4" TO BAL122(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -4" TO BAL123(I)(1:9)                      RMB0004 
NEWPRE          MOVE "       -4" TO BAL124(I)(1:9)                      RMB0004 
NEWPRE       ELSE                                                       RMB0004 
NEWPRE          IF CBFLAG(I) = 0                                        RMB0004 
NEWPRE             MOVE "       -5" TO BAL111(I)(1:9)                   RMB0004 
NEWPRE             MOVE "       -5" TO BAL112(I)(1:9)                   RMB0004 
NEWPRE          ELSE                                                    RMB0004 
NEWPRE             COMPUTE BAL112(I) ROUNDED =                          RMB0004 
NEWPRE                               (BAL111(I)/CON-CTA-BAL(I))         RMB0004 
NEWPRE          END-IF                                                  RMB0004 
NEWPRE          IF CLFLAG(I) = 0                                        RMB0004 
NEWPRE             MOVE "       -5" TO BAL113(I)(1:9)                   RMB0004 
NEWPRE             MOVE "       -5" TO BAL114(I)(1:9)                   RMB0004 
NEWPRE          ELSE                                                    RMB0004 
NEWPRE             COMPUTE BAL114(I) ROUNDED =                          RMB0004 
NEWPRE                               (BAL113(I)/CON-CTA-LIM(I))         RMB0004 
NEWPRE          END-IF                                                  RMB0004 
NEWPRE          IF EXFLAG(I) = 0                                        RMB0004 
NEWPRE             MOVE "    -5" TO BAL115(I)(1:6)                      RMB0004 
NEWPRE             MOVE "    -5" TO BAL116(I)(1:6)                      RMB0004 
NEWPRE             MOVE " -5" TO BAL117(I)(1:3)                         RMB0004 
NEWPRE             MOVE " -5" TO BAL118(I)(1:3)                         RMB0004 
NEWPRE             MOVE " -5" TO BAL119(I)(1:3)                         RMB0004 
NEWPRE             MOVE " -5" TO BAL120(I)(1:3)                         RMB0004 
NEWPRE             MOVE " -5" TO BAL121(I)(1:3)                         RMB0004 
NEWPRE          ELSE                                                    RMB0004 
NEWPRE             IF UTFLAG(I) = 0 OR VAL-CTA-LIM(I) = 0               RMB0004 
NEWPRE                MOVE "    -6" TO BAL115(I)(1:6)                   RMB0004 
NEWPRE             ELSE                                                 RMB0004 
NEWPRE                COMPUTE BAL115(I) ROUNDED = (VAL-CTA-BAL(I)/      RMB0004 
NEWPRE                                          VAL-CTA-LIM(I))*100     RMB0004 
NEWPRE                MOVE BAL115(I)(2:4) TO VAL-ENTERO(1:3)            RMB0004 
NEWPRE                MOVE BAL115(I)(5:2) TO VAL-DECIMAL(1:2)           RMB0004 
NEWPRE                MOVE VALOR-AUX(1:6) TO BAL115(I)(1:6)             RMB0004 
NEWPRE             END-IF                                               RMB0004 
NEWPRE             IF UTFLAG(I) = 0                                     RMB0004 
NEWPRE                MOVE "    -6" TO BAL116(I)(1:6)                   RMB0004 
NEWPRE                MOVE " -6" TO BAL117(I)(1:3)                      RMB0004 
NEWPRE                MOVE " -6" TO BAL118(I)(1:3)                      RMB0004 
NEWPRE                MOVE " -6" TO BAL119(I)(1:3)                      RMB0004 
NEWPRE                MOVE " -6" TO BAL120(I)(1:3)                      RMB0004 
NEWPRE                MOVE " -6" TO BAL121(I)(1:3)                      RMB0004 
NEWPRE             ELSE                                                 RMB0004 
NEWPRE                COMPUTE BAL116(I) ROUNDED = (VAL-CTA-BALLIM(I)/   RMB0004 
NEWPRE                                          CON-CTA-BALLIM(I))*100  RMB0004 
NEWPRE                MOVE BAL116(I)(2:4) TO VAL-ENTERO(1:3)            RMB0004 
NEWPRE                MOVE BAL116(I)(5:2) TO VAL-DECIMAL(1:2)           RMB0004 
NEWPRE                MOVE VALOR-AUX(1:6) TO BAL116(I)(1:6)             RMB0004 
NEWPRE             END-IF                                               RMB0004 
NEWPRE          END-IF                                                  RMB0004 
NEWPRE          IF DQFLAG(I) = 0                                        RMB0004 
NEWPRE             MOVE "       -5" TO BAL122(I)(1:9)                   RMB0004 
NEWPRE             MOVE "       -5" TO BAL124(I)(1:9)                   RMB0004 
NEWPRE          ELSE                                                    RMB0004 
NEWPRE             COMPUTE BAL124(I) ROUNDED =                          RMB0004 
NEWPRE                               (BAL122(I)/CON-CTA-DEL(I))         RMB0004 
NEWPRE          END-IF                                                  RMB0004 
NEWPRE          IF PMTFLAG(I) = 0                                       RMB0004 
NEWPRE             MOVE "       -5" TO BAL123(I)(1:9)                   RMB0004 
NEWPRE          END-IF                                                  RMB0004 
NEWPRE       END-IF                                                     RMB0004 
NEWPRE       END-IF                                                     RMB0004 
NEWPRE       END-IF                                                     RMB0004 
NEWPRE       END-IF                                                     RMB0004 
NEWPRE       ADD 1 TO I                                                 RMB0004 
NEWPRE     END-PERFORM.                                                 RMB0004 
NEWPRE     IF OPEFLAG-TOT = 0                                           RMB0004 
NEWPRE        MOVE "       -2" TO PRO112(1:9)                           RMB0004 
NEWPRE        MOVE "       -2" TO PRO114(1:9)                           RMB0004 
NEWPRE        MOVE "    -2" TO PRO115(1:6)                              RMB0004 
NEWPRE        MOVE "    -2" TO PRO116(1:6)                              RMB0004 
NEWPRE        MOVE "       -2" TO PRO124(1:9)                           RMB0004 
NEWPRE     ELSE                                                         RMB0004 
NEWPRE     IF DDFLAG-TOT = 0                                            RMB0004 
NEWPRE        MOVE "       -3" TO PRO112(1:9)                           RMB0004 
NEWPRE        MOVE "       -3" TO PRO114(1:9)                           RMB0004 
NEWPRE        MOVE "    -3" TO PRO115(1:6)                              RMB0004 
NEWPRE        MOVE "    -3" TO PRO116(1:6)                              RMB0004 
NEWPRE        MOVE "       -3" TO PRO124(1:9)                           RMB0004 
NEWPRE     ELSE                                                         RMB0004 
NEWPRE     IF VFLAG-TOT = 0                                             RMB0004 
NEWPRE        MOVE "       -4" TO PRO112(1:9)                           RMB0004 
NEWPRE        MOVE "       -4" TO PRO114(1:9)                           RMB0004 
NEWPRE        MOVE "    -4" TO PRO115(1:6)                              RMB0004 
NEWPRE        MOVE "    -4" TO PRO116(1:6)                              RMB0004 
NEWPRE        MOVE "       -4" TO PRO124(1:9)                           RMB0004 
NEWPRE     ELSE                                                         RMB0004 
NEWPRE        IF CBFLAG-TOT = 0                                         RMB0004 
NEWPRE           MOVE "       -5" TO PRO112(1:9)                        RMB0004 
NEWPRE        ELSE                                                      RMB0004 
NEWPRE           COMPUTE PRO112 ROUNDED = VAL-TOT-BAL / CON-TOT-BAL     RMB0004 
NEWPRE        END-IF                                                    RMB0004 
NEWPRE        IF CLFLAG-TOT = 0                                         RMB0004 
NEWPRE           MOVE "       -5" TO PRO114(1:9)                        RMB0004 
NEWPRE        ELSE                                                      RMB0004 
NEWPRE           COMPUTE PRO114 ROUNDED = VAL-TOT-LIM / CON-TOT-LIM     RMB0004 
NEWPRE        END-IF                                                    RMB0004 
NEWPRE        IF EXFLAG-TOT = 0                                         RMB0004 
NEWPRE           MOVE "    -5" TO PRO115(1:6)                           RMB0004 
NEWPRE        ELSE                                                      RMB0004 
NEWPRE           IF UTFLAG-TOT = 0 OR VAL-TOT-LIM0 = 0                  RMB0004 
NEWPRE              MOVE "    -6" TO PRO115(1:6)                        RMB0004 
NEWPRE           ELSE                                                   RMB0004 
NEWPRE           COMPUTE PRO115 ROUNDED = (VAL-TOT-BAL0 / VAL-TOT-LIM0) RMB0004 
NEWPRE                                    * 100                         RMB0004 
NEWPRE                MOVE PRO115(2:4) TO VAL-ENTERO(1:3)               RMB0004 
NEWPRE                MOVE PRO115(5:2) TO VAL-DECIMAL(1:2)              RMB0004 
NEWPRE                MOVE VALOR-AUX(1:6) TO PRO115(1:6)                RMB0004 
NEWPRE           END-IF                                                 RMB0004 
NEWPRE        END-IF                                                    RMB0004 
NEWPRE        IF EXFLAG-TOT = 0                                         RMB0004 
NEWPRE           MOVE "    -5" TO PRO116(1:6)                           RMB0004 
NEWPRE        ELSE                                                      RMB0004 
NEWPRE           IF UTFLAG-TOT = 0                                      RMB0004 
NEWPRE              MOVE "    -6" TO PRO116(1:6)                        RMB0004 
NEWPRE           ELSE                                                   RMB0004 
NEWPRE              COMPUTE PRO116 ROUNDED = (VAL-TOT-BALLIM /          RMB0004 
NEWPRE                                    CON-TOT-BALLIM) * 100         RMB0004 
NEWPRE              MOVE PRO116(2:4) TO VAL-ENTERO(1:3)                 RMB0004 
NEWPRE              MOVE PRO116(5:2) TO VAL-DECIMAL(1:2)                RMB0004 
NEWPRE              MOVE VALOR-AUX(1:6) TO PRO116(1:6)                  RMB0004 
NEWPRE           END-IF                                                 RMB0004 
NEWPRE        END-IF                                                    RMB0004 
NEWPRE        IF DQFLAG-TOT = 0                                         RMB0004 
NEWPRE           MOVE "       -5" TO PRO124(1:9)                        RMB0004 
NEWPRE        ELSE                                                      RMB0004 
NEWPRE           COMPUTE PRO124 ROUNDED =  VAL-TOT-DEL /                RMB0004 
NEWPRE                                    CON-TOT-DEL                   RMB0004 
NEWPRE        END-IF.                                                   RMB0004 
TRANS  5700-TRU-ARME-SALIDA.
REMARK**********************************************************************
REMARK*5700-TRU-ARME-SALIDA.
REMARK* SE TRASLADAN LAS CARACTERISTICAS CALCULADAS EN LAS AREAS DE TRABAJO*
REMARK* AL REGISTRO NORMALIZADO DE SALIDAD CON LOS NOMBRES APROPIADOS
REMARK* SE CALCULAN LOS VALORES NEGATIVOS FALTANTES PARA OTRAS CARACTERISTIC
REMARK**********************************************************************
TRANS      MOVE 1 TO I.
ACIEME     PERFORM UNTIL I > 6                                          RMB0021 
TRANS        MOVE 1 TO J K
TRANS        PERFORM UNTIL J > 109 
TRANS          IF V-VALIDO(J) = 1 
TRANS             MOVE V-WORK(I,J)(1:3) TO V-CARTERA(I,K)
TRANS             ADD 1 TO K 
TRANS          END-IF
TRANS          ADD 1 TO J
TRANS        END-PERFORM
TRANS        ADD 1 TO I
TRANS     END-PERFORM.  
ENDEUD    MOVE 1 TO I.
ENDEUD    PERFORM UNTIL I > 3 
ENDEUD      IF QTRFLAG = 0 
ENDEUD         MOVE " -1" TO GD00X(I)(1:3)
ENDEUD         MOVE "     -1" TO GD01X(I)(1:7) 
ENDEUD         MOVE 1 TO J 
ENDEUD         PERFORM UNTIL J > 5 
ENDEUD           MOVE " -1" TO GDXXX(I,J)(1:3)
ENDEUD           ADD 1 TO J 
ENDEUD         END-PERFORM
ENDEUD         MOVE " -1" TO GD050(1:3)
ENDEUD      ELSE 
ENDEUD         IF TIPFLAG(I) = 0
ENDEUD            MOVE "     -2" TO GD01X(I)(1:7)
ENDEUD            MOVE 1 TO J 
ENDEUD            PERFORM UNTIL J > 5 
ENDEUD              MOVE " -2" TO GDXXX(I,J)(1:3)
ENDEUD              ADD 1 TO J 
ENDEUD            END-PERFORM
ENDEUD         END-IF
ENDEUD      END-IF
ENDEUD      ADD 1 TO I
ENDEUD    END-PERFORM.
CONSUL    IF IQFLAG = 0
CONSUL       MOVE " -1" TO IQ00X(001)(1:3)
CONSUL       MOVE " -1" TO IQ00X(002)(1:3)
CONSUL       MOVE " -1" TO IQ00X(003)(1:3)
CONSUL       MOVE " -1" TO IQ00X(004)(1:3)
CONSUL       MOVE " -1" TO IQ00X(005)(1:3)
CONSUL       MOVE " -1" TO IQ01X(001)(1:3)
CONSUL       MOVE " -1" TO IQ01X(002)(1:3)
CONSUL       MOVE " -1" TO IQ01X(003)(1:3)
CONSUL       MOVE " -1" TO IQ01X(004)(1:3)
ACIEME       MOVE " -1" TO IQ01X(005)(1:3)  *> HIPOTECARIO              RMB0021 
CONSUL    END-IF.
CONSUL    MOVE 1 TO I.
ACIEME    PERFORM UNTIL I > 5                                           RMB0021 
CONSUL      IF IQFLAG = 0 
CONSUL         MOVE " -1" TO IQ02X(I)(1:3)
CONSUL      ELSE 
CONSUL         IF TIPIQFLAG(I) = 0
CONSUL            MOVE " -2" TO IQ02X(I)(1:3)
CONSUL         END-IF
CONSUL      END-IF
CONSUL      ADD 1 TO I
CONSUL    END-PERFORM.
ACIEME    IF CIFLAG = 0                                                 RMB0021 
ACIEME       MOVE " -1" TO IQ030(1:3)                                   RMB0021 
ACIEME       MOVE " -1" TO IQ031(1:3)                                   RMB0021 
ACIEME       MOVE " -1" TO IQ032(1:3)                                   RMB0021 
ACIEME    END-IF.                                                       RMB0021 
CHECK     IF CKFLAG = 0 
CHECK        MOVE " -1"  TO CK001(1:3)
CHECK        MOVE " -1"  TO CK002(1:3)
ACIEME       MOVE " -1"  TO CK003(1:3)                                  RMB0021 
ACIEME       MOVE " -1"  TO CK004(1:3)                                  RMB0021 
CHECK     END-IF.
ACIEME    IF CKFLAG = 0                                                 RMB0021 
ACIEME       MOVE " -1"  TO CK005(1:3)                                  RMB0021 
ACIEME       MOVE " -1"  TO CK006(1:3)                                  RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       IF CKDOFLAG = 0                                            RMB0021 
ACIEME          MOVE " -2"  TO CK005(1:3)                               RMB0021 
ACIEME          MOVE " -2"  TO CK006(1:3)                               RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    IF AHFLAG = 0                                                 RMB0021 
ACIEME       MOVE " -1"  TO AH001(1:3)                                  RMB0021 
ACIEME       MOVE " -1"  TO AH002(1:3)                                  RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    IF AHFLAG = 0                                                 RMB0021 
ACIEME       MOVE " -1"  TO AH003(1:3)                                  RMB0021 
ACIEME       MOVE " -1"  TO AH004(1:3)                                  RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       IF AHDOFLAG = 0                                            RMB0021 
ACIEME          MOVE " -2"  TO AH003(1:3)                               RMB0021 
ACIEME          MOVE " -2"  TO AH004(1:3)                               RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    INITIALIZE REG-ALE.                                           RMB0021 
ACIEME    IF TIP-SCO-GENERICO = 08                                      RMB0021 
ACIEME       MOVE 1 TO I                                                RMB0021 
ACIEME       PERFORM UNTIL I > 6 *> SE TRASLADAN LAS DISPUTAS           RMB0021 
ACIEME         MOVE V-DISPUTAS(I)(1:3) TO V-CARTERA(I,3)(1:3)           RMB0021 
ACIEME         ADD 1 TO I                                               RMB0021 
ACIEME       END-PERFORM                                                RMB0021 
ACIEME       PERFORM 5800-ARMAR-REGALE-ACIERTA-PLUS                     RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       PERFORM 5800-ARMAR-REGALE-ACIERTA                          RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME 5800-ARMAR-REGALE-ACIERTA.                                       RMB0021 
REMARK********************************************************************
REMARK*5800-ARMAR-REGALE-ACIERTA.      
REMARK*   SE ARMA EL REGISTRO DE CARACTERISTICAS SEGUN LAYAUD ESPECIFICADO
REMARK*   PARA LOS SCORES DE PREDICTA O ACIERTA
REMARK********************************************************************
ACIEME    MOVE TAGS-ALE                  TO TAGS-ALE-ACI-OUT.           RMB0021 
ACIEME    MOVE BLO-ID001-ID005           TO BLO-ID001-ID005-ACI-OUT.    RMB0021 
ACIEME    MOVE BLO-CK001-CK002           TO BLO-CK001-CK002-ACI-OUT.    RMB0021 
ACIEME    MOVE BLO-CR001-OT103           TO BLO-CR001-OT103-ACI-OUT.    RMB0021 
ACIEME    MOVE BLO-GD001-GD050           TO BLO-GD001-GD050-ACI-OUT.    RMB0021 
ACIEME    MOVE BLO-IQ001-IQ014           TO BLO-IQ001-IQ014-ACI-OUT.    RMB0021 
ACIEME    MOVE BLO-IQ020-IQ023           TO BLO-IQ020-IQ023-ACI-OUT.    RMB0021 
ACIEME    MOVE BLO-CR111-OT124           TO BLO-CR111-OT124-ACI-OUT.    RMB0021 
ACIEME    MOVE BLO-AT112-AT124           TO BLO-AT112-AT124-ACI-OUT.    RMB0021 
ACIEME    MOVE BLO-MT111-MT124           TO BLO-MT111-MT124-ACI-OUT.    RMB0021 
ACIEME    MOVE COLITAS                   TO COLITAS-ACI-OUT   .         RMB0021 
ACIEME    MOVE REG-ALE-ACI-OUT           TO REG-ALE.                    RMB0021 
ACIEME 5800-ARMAR-REGALE-ACIERTA-PLUS.                                  RMB0021 
REMARK********************************************************************
REMARK*5800-ARMAR-REGALE-ACIERTA-PLUS.      
REMARK*   SE ARMA EL REGISTRO DE CARACTERISTICAS SEGUN LAYAUD ESPECIFICADO
REMARK*   PARA LOS SCORES DE ACIERTA-PLUS         
REMARK********************************************************************
ACIEME    MOVE TAGS-ALE(49:12)           TO TAGS-ALE-PLU-OUT.           RMB0021 
ACIEME    MOVE BLO-ID001-ID005           TO BLO-ID001-ID005-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CK001-CK002           TO BLO-CK001-CK002-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CR001-OT103           TO BLO-CR001-OT103-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-GD001-GD050           TO BLO-GD001-GD050-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-IQ001-IQ014           TO BLO-IQ001-IQ014-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-IQ020-IQ023           TO BLO-IQ020-IQ023-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CR111-OT124           TO BLO-CR111-OT124-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-AT112-AT124           TO BLO-AT112-AT124-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-MT111-MT124           TO BLO-MT111-MT124-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-ID006-ID007           TO BLO-ID006-ID007-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CK003-CK006           TO BLO-CK003-CK006-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-AH001-AH004           TO BLO-AH001-AH004-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-IQ015-IQ015           TO BLO-IQ015-IQ015-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-IQ024-IQ024           TO BLO-IQ024-IQ024-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-IQ030-IQ032           TO BLO-IQ030-IQ032-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CR104-OT104           TO BLO-CR104-OT104-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CR105-OT105           TO BLO-CR105-OT105-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-MT001-MT103           TO BLO-MT001-MT103-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-MT104-MT104           TO BLO-MT104-MT104-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-MT105-MT105           TO BLO-MT105-MT105-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CP001-CP103           TO BLO-CP001-CP103-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CP104-CP104           TO BLO-CP104-CP104-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CP105-CP105           TO BLO-CP105-CP105-PLU-OUT.    RMB0021 
ACIEME    MOVE BLO-CP111-CP124           TO BLO-CP111-CP124-PLU-OUT.    RMB0021 
ACIEME    MOVE REG-ALE-PLU-OUT           TO REG-ALE.                    RMB0021 
REMARK********************************************************************
REMARK*     RUTINAS BASICAS DEL CALCULO DEL SCORE CON BASE A LAS CARACTE.*
REMARK********************************************************************
NEWSCO 5800-TRU-REALIZAR-SCORE.        
REMARK********************************************************************
REMARK*5800-TRU-REALIZAR-SCORE.        
REMARK* SE CONVIERTEN DE FORMA GENERAL LAS VARIABLES A NUMERICOS PARA    *
REMARK*           CR,BS,CC,OT                                            *
REMARK********************************************************************
ACIEME    INITIALIZE ADV-PREDICTA.                                      RMB0021 
NEWSCO    IF IQ01X(4)(1:3) NOT =  IQ014
NEWSCO       DISPLAY "INCONSISTENCIA1  EN SISTEMA"
NEWSCO       DISPLAY "IQ01X(4)=",IQ01X(4)
NEWSCO       DISPLAY "IQ014   =",IQ014      
NEWSCO    END-IF.
NEWSCO    MOVE 1 TO I.
NEWSCO    PERFORM UNTIL I > 272 
NEWSCO       IF V-CARTERAS(I) NOT NUMERIC 
NEWSCO          MOVE 000 TO V-TCARTERAS(I) 
NEWSCO       ELSE 
NEWSCO          MOVE V-CARTERAS(I) TO V-TCARTERAS(I)
NEWSCO       END-IF
NEWSCO       ADD 1 TO I
NEWSCO    END-PERFORM.
NEWSCO    IF V-CARTERAS(272) NOT NUMERIC 
NEWSCO       IF TOT103 NOT = 0 
NEWSCO          DISPLAY "INCONSISTENCIA2 EN SISTEMA"
NEWSCO          DISPLAY "V-CARTERAS(272)=",V-CARTERAS(272)
NEWSCO          DISPLAY "TOT103       =",TOT103     
NEWSCO       END-IF  
NEWSCO    ELSE
NEWSCO       IF TOT103 NOT = V-CARTERAS(272)
NEWSCO          DISPLAY "INCONSISTENCIA3 EN SISTEMA"
NEWSCO          DISPLAY "V-CARTERAS(272)=",V-CARTERAS(272)
NEWSCO          DISPLAY "TOT103       =",TOT103     
NEWSCO       END-IF
NEWSCO    END-IF.
NEWSCO    IF CR041 NOT NUMERIC MOVE 999 TO TCR041.
NEWSCO    IF CR100 NOT NUMERIC MOVE 999 TO TCR100.
NEWSCO    IF CR101 NOT NUMERIC MOVE 999 TO TCR101.
NEWSCO    IF CR102 NOT NUMERIC MOVE 999 TO TCR102.
NEWSCO    IF CR103 NOT NUMERIC MOVE 999 TO TCR103.
NEWSCO    IF BS041 NOT NUMERIC MOVE 999 TO TBS041.
NEWSCO    IF BS100 NOT NUMERIC MOVE 999 TO TBS100.
NEWSCO    IF BS101 NOT NUMERIC MOVE 999 TO TBS101.
NEWSCO    IF BS102 NOT NUMERIC MOVE 999 TO TBS102.
NEWSCO    IF BS103 NOT NUMERIC MOVE 999 TO TBS103.
NEWSCO    IF CC041 NOT NUMERIC MOVE 999 TO TCC041.
NEWSCO    IF CC100 NOT NUMERIC MOVE 999 TO TCC100.
NEWSCO    IF CC101 NOT NUMERIC MOVE 999 TO TCC101.
NEWSCO    IF CC102 NOT NUMERIC MOVE 999 TO TCC102.
NEWSCO    IF CC103 NOT NUMERIC MOVE 999 TO TCC103.
NEWSCO    IF OT041 NOT NUMERIC MOVE 999 TO TOT041.
NEWSCO    IF OT100 NOT NUMERIC MOVE 999 TO TOT100.
NEWSCO    IF OT101 NOT NUMERIC MOVE 999 TO TOT101.
NEWSCO    IF OT102 NOT NUMERIC MOVE 999 TO TOT102.
NEWSCO    IF OT103 NOT NUMERIC MOVE 999 TO TOT103.
NEWSCO************** OTRAS VARIABLES A CONVERTIR *********************
NEWSCO    IF CK001 NUMERIC MOVE CK001 TO TCK001 ELSE MOVE 0 TO TCK001.
NEWSCO    IF GD002 NUMERIC MOVE GD002 TO TGD002 ELSE MOVE 0 TO TGD002.
NEWSCO    IF GD010 NUMERIC MOVE GD010 TO TGD010 ELSE MOVE 0 TO TGD010.
NEWSCO    IF GD011 NUMERIC MOVE GD011 TO TGD011 ELSE MOVE 0 TO TGD011.
NEWSCO    IF GD012 NUMERIC MOVE GD012 TO TGD012 ELSE MOVE 0 TO TGD012.
NEWSCO    IF GD024 NUMERIC MOVE GD024 TO TGD024 ELSE MOVE 0 TO TGD024.
NEWSCO    IF GD034 NUMERIC MOVE GD034 TO TGD034 ELSE MOVE 0 TO TGD034.
NEWSCO    IF GD044 NUMERIC MOVE GD044 TO TGD044 ELSE MOVE 0 TO TGD044.
NEWSCO    IF GD050 NUMERIC MOVE GD050 TO TGD050 ELSE MOVE 0 TO TGD050.
NEWSCO    IF IQ001 NUMERIC MOVE IQ001 TO TIQ001 ELSE MOVE 0 TO TIQ001.
NEWSCO    IF IQ002 NUMERIC MOVE IQ002 TO TIQ002 ELSE MOVE 0 TO TIQ002.
NEWSCO    IF IQ013 NUMERIC MOVE IQ013 TO TIQ013 ELSE MOVE 0 TO TIQ013.
NEWSCO    IF IQ014 NUMERIC MOVE IQ014 TO TIQ014 ELSE MOVE 0 TO TIQ014.
REMARK**********************FIN CONVERSION A NUMERICO DE VARIABLES *******
REMARK* SE CALCULAN LAS VARIABLES INICIALES QUE DECIDEN EN QUE SCORE CARD*
REMARK* SE CLASIFICA LA PERSONA A SER ANALIZADA                          *
REMARK********************************************************************
NEWSCO    COMPUTE COBK   = TCR092 + TCR093 + TCR094 +
NEWSCO                     TBS092 + TBS093 + TBS094 +
NEWSCO                     TCC092 + TCC093 + TCC094 +
NEWSCO                     TOT092 + TOT093 + TOT094.
NEWSCO    COMPUTE SUM001 = TCR001 + TBS001 + TCC001 + TOT001.
NEWSCO    MOVE 0 TO SCORE.
NEWSCO    IF SUM001 = 0 OR TIP-ID-ALE = 2 OR TIP-ID-ALE = 3       
NEWSCO       PERFORM 5810-TRU-NO-SCORE 
NEWSCO    ELSE 
NEWSCO       IF COBK >=1 
NEWSCO          MOVE 1 TO SCORE-CARD
NEWSCO          PERFORM 5820-TRU-SCORECARD01
NEWSCO       ELSE
NEWSCO          IF TBS050 >=1    
NEWSCO             IF TCR001 <= 0
NEWSCO                MOVE 2 TO SCORE-CARD
NEWSCO                PERFORM 5830-TRU-SCORECARD02
NEWSCO             ELSE
NEWSCO                MOVE 3 TO SCORE-CARD
NEWSCO                PERFORM 5840-TRU-SCORECARD03
NEWSCO             END-IF
NEWSCO          ELSE
NEWSCO                MOVE 4 TO SCORE-CARD
NEWSCO                PERFORM 5850-TRU-SCORECARD04 
NEWSCO          END-IF
NEWSCO       END-IF                                
NEWSCO    END-IF.
FILT01    IF SCORE > 0                                                  RMB0015 
FILT01       PERFORM 2000-FIL-POCA-HISTORIA-P.                          RMB0015 
NEWSCO 5810-TRU-NO-SCORE.
REMARK*********************************************************************
REMARK*5810-TRU-NO-SCORE.
REMARK* LA PERSONA QUE NO TIENE CUENTAS QUEDA CON 0 EN EL SCORE (SIN SCORE*
REMARK*********************************************************************
NEWSCO    MOVE 0 TO SCORE.
NEWSCO    IF TIP-ID-ALE = 2 OR 3
NEWSCO       MOVE 40  TO  ADVERSE-RAZON(1)
NEWSCO    ELSE
NEWSCO       MOVE 41  TO  ADVERSE-RAZON(1)
NEWSCO    END-IF.                             
NEWSCO 5820-TRU-SCORECARD01.
REMARK*********************************************************************
REMARK*5820-TRU-SCORECARD01.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA CON MORAS ALTAS O DEROGATORIO  *
REMARK*********************************************************************
CARD01    COMPUTE CUAT69X = TCR065 + TCR066 + TBS065 + TBS066 + 
CARD01                      TCC065 + TCC066 + TOT065 + TOT066.
CARD01    COMPUTE DEL2P = TCR068 + TCR069 + TCR070 + TCR071 + TCR072 + 
CARD01                    TCR073 + TCR074 + TCR075 + TCR076 + TCR077 + 
CARD01                    TCR078 + TCR079 + TCR080 + TCR081 + TCR082 + 
CARD01                    TCR083 + TCR084 + TCR085 + TCR086 + TCR087 + 
CARD01                    TCR088 +
CARD01                    TBS068 + TBS069 + TBS070 + TBS071 + TBS072 + 
CARD01                    TBS073 + TBS074 + TBS075 + TBS076 + TBS077 + 
CARD01                    TBS078 + TBS079 + TBS080 + TBS081 + TBS082 + 
CARD01                    TBS083 + TBS084 + TBS085 + TBS086 + TBS087 + 
CARD01                    TBS088 +
CARD01                    TCC068 + TCC069 + TCC070 + TCC071 + TCC072 + 
CARD01                    TCC073 + TCC074 + TCC075 + TCC076 + TCC077 + 
CARD01                    TCC078 + TCC079 + TCC080 + TCC081 + TCC082 + 
CARD01                    TCC083 + TCC084 + TCC085 + TCC086 + TCC087 + 
CARD01                    TCC088 +
CARD01                    TOT068 + TOT069 + TOT070 + TOT071 + TOT072 + 
CARD01                    TOT073 + TOT074 + TOT075 + TOT076 + TOT077 + 
CARD01                    TOT078 + TOT079 + TOT080 + TOT081 + TOT082 + 
CARD01                    TOT083 + TOT084 + TOT085 + TOT086 + TOT087 + 
CARD01                    TOT088. 
CARD01    IF DEL2P < 0 
CARD01       MOVE 0 TO DEL2PX
CARD01    ELSE                    
CARD01       IF DEL2P >= 3 
CARD01          MOVE 3 TO DEL2PX 
CARD01       ELSE
CARD01          MOVE DEL2P TO DEL2PX 
CARD01       END-IF
CARD01    END-IF.
CARD01    COMPUTE MALO1 = TCR092 + TBS092 + TCC092 + TOT092 +
CARD01                    TCR094 + TBS094 + TCC094 + TOT094.    
CARD01    PERFORM 5894-MESAS.
CARD01    COMPUTE NREC = TGD024 + TGD034 + TGD044.
CARD01    PERFORM 5895-PCTCUR.
CARD01    COMPUTE SUM002 = TCR002 + TBS002 + TCC002 + TOT002.
CARD01    IF SUM002 < 4 
CARD01       MOVE 0 TO SUM002X
CARD01    ELSE 
CARD01       IF SUM002 > 10 
CARD01          MOVE 10 TO SUM002X 
CARD01       ELSE
CARD01          MOVE SUM002 TO SUM002X
CARD01       END-IF
CARD01    END-IF. 
CARD01    COMPUTE SUM064 = TCR064 + TBS064 + TCC064 + TOT064.
CARD01    COMPUTE VRAT12 = TCR020 + TBS020 + TCC020 + TOT020 + 
CARD01                     TCR021 + TBS021 + TCC021 + TOT021.    
CARD01    IF CR020 NOT NUMERIC AND
CARD01       BS020 NOT NUMERIC AND
CARD01       CC020 NOT NUMERIC AND
CARD01       OT020 NOT NUMERIC      
CARD01       MOVE -1 TO VRAT12
CARD01    END-IF.
REMARK****************COMIENZO CALCULO PARA LA ECUACION *************
CARD01    IF TCC103 >= 0 AND TCC103 <= 3 
CARD01       MOVE 1 TO CC103001 
CARD01    ELSE 
CARD01       MOVE 0 TO CC103001
CARD01    END-IF.
CARD01    IF TCC103 >= 4 AND TCC103 <= 9
CARD01       MOVE 1 TO CC103002 
CARD01    ELSE 
CARD01       MOVE 0 TO CC103002
CARD01    END-IF.
CARD01    IF TCR040 >= 97 AND TCR040 <= 120 
CARD01       MOVE 1 TO CR040001
CARD01    ELSE
CARD01       MOVE 0 TO CR040001
CARD01    END-IF.
CARD01    IF TCR040 >= 121 AND TCR040 <= 180 
CARD01       MOVE 1 TO CR040002
CARD01    ELSE
CARD01       MOVE 0 TO CR040002
CARD01    END-IF.
CARD01    IF TCR040 >= 181  
CARD01       MOVE 1 TO CR040003
CARD01    ELSE
CARD01       MOVE 0 TO CR040003
CARD01    END-IF.
CARD01    IF TCR103 >= 0 AND TCR103 <= 3 
CARD01       MOVE 1 TO CR103001 
CARD01    ELSE 
CARD01       MOVE 0 TO CR103001
CARD01    END-IF.
CARD01    IF TCR103 >= 4 AND TCR103 <= 18
CARD01       MOVE 1 TO CR103002 
CARD01    ELSE 
CARD01       MOVE 0 TO CR103002
CARD01    END-IF.
CARD01    IF NREC >= 1 
CARD01       MOVE 1 TO NREC0001 
CARD01    ELSE 
CARD01       MOVE 0 TO NREC0001
CARD01    END-IF.
CARD01    IF SUM064 >= 1 
CARD01       MOVE 1 TO SUM06401 
CARD01    ELSE 
CARD01       MOVE 0 TO SUM06401
CARD01    END-IF.
CARD01    IF TBS067 >= 1 
CARD01       MOVE 1 TO BS067001 
CARD01    ELSE 
CARD01       MOVE 0 TO BS067001
CARD01    END-IF.
CARD01    IF MALO1  = 2  
CARD01       MOVE 1 TO MALO1001 
CARD01    ELSE 
CARD01       MOVE 0 TO MALO1001
CARD01    END-IF.
CARD01    IF MALO1  >= 3 
CARD01       MOVE 1 TO MALO1002 
CARD01    ELSE 
CARD01       MOVE 0 TO MALO1002
CARD01    END-IF.
CARD01    IF VRAT12 = 0   
CARD01       MOVE 1 TO VRAT1201 
CARD01    ELSE 
CARD01       MOVE 0 TO VRAT1201
CARD01    END-IF.
CARD01    COMPUTE SCORE = 484                   +
CARD01                    -84      * CC103001   +
CARD01                    -49      * CC103002   +
CARD01                    +35      * CR040001   + 
CARD01                    +46      * CR040002   + 
CARD01                    +49      * CR040003   + 
CARD01                    -55      * CR103001   + 
CARD01                    -31      * CR103002   + 
CARD01                    -30.2    * CUAT69X    + 
CARD01                    -53.71   * DEL2PX     + 
CARD01                    +0.0379  * MESAS      + 
CARD01                    -15      * NREC0001   + 
CARD01                    +2.284   * PCTCUR     + 
CARD01                    -5.654   * SUM002X    + 
CARD01                    -29      * SUM06401   + 
CARD01                    -52      * BS067001   + 
CARD01                    -34      * MALO1001   + 
CARD01                    -47      * MALO1002   + 
CARD01                    -93      * VRAT1201   . 
CARD01    IF SCORE <= 250 MOVE 250 TO SCORE.
CARD01    IF SCORE >= 850 MOVE 850 TO SCORE.
REMARK****************COMIENZO CALCULO PARA LAS RAZONES *************
CARD01    PERFORM 6005-PREPARE-AA.       
CARD01    IF AAVRAT12 = 0                   
CARD01       MOVE 29 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 93 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF TCC103 >= 0 AND <= 3
CARD01       MOVE 01 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 84 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF TCR103 >= 0 AND <= 3
CARD01       MOVE 02 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 55 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF TBS067 >= 1            
CARD01       MOVE 05 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 52 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF TCC103 >= 4 AND <= 9 
CARD01       MOVE 01 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 49 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF TCR040 >= 0 AND <= 096 AND CR040(2:1) NOT = "-"
CARD01       MOVE 06 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 49 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF AAMALO1  >= 3                   
CARD01       MOVE 05 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 47 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF AAMALO1  =  2                   
CARD01       MOVE 05 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 34 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF TCR103 >= 4 AND <= 18
CARD01       MOVE 02 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 31 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF AASUM064 >= 1                
CARD01       MOVE 04 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 29 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF AAOPOT24  = 0                
CORRE2*      MOVE 10 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 18 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF AANREC    >= 1               
CARD01       MOVE 08 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 15 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF TCR040  >= 97  AND <= 120  
CARD01       MOVE 06 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 14 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD01    IF TCR040  >= 121 AND <= 180  
CARD01       MOVE 06 TO ADVERSE-CODE
CARD01       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD01          MOVE 03 TO DIFFERENCE
CARD01          PERFORM 6000-TRU-INSERTE-ADV-CODE.
REMARK************COMIENZO VARIABLES CONTINUAS ***************************
CORRE2*   IF MESAS > 0
CORRE2*      COMPUTE TEMP1 = 29 -(MESAS * 0.0384)
CORRE2*      MOVE 07 TO ADVERSE-CODE
CORRE2*      PERFORM 6001-INSERTE-CONTINUA.
CARD01    IF AACUAT69X > 0 
CARD01       COMPUTE TEMP1 = CUAT69X * 30.2
CARD01       MOVE 05 TO ADVERSE-CODE
CARD01       PERFORM 6001-INSERTE-CONTINUA.
CARD01    IF AADEL2PX  > 0 
CARD01       COMPUTE TEMP1 = DEL2PX  * 53.71
CARD01       MOVE 05 TO ADVERSE-CODE
CARD01       PERFORM 6001-INSERTE-CONTINUA.
CARD01    IF AAPCTCUR >= 0 AND < 100        
CARD01       COMPUTE TEMP1 = 228.4 - (PCTCUR * 2.284)
CARD01       MOVE 09 TO ADVERSE-CODE
CARD01       PERFORM 6001-INSERTE-CONTINUA.
CARD01    IF AASUM002X > 0          
CARD01       COMPUTE TEMP1 =  SUM002X * 5.654
CARD01       MOVE 11 TO ADVERSE-CODE
CARD01       PERFORM 6001-INSERTE-CONTINUA.
CARD02 5830-TRU-SCORECARD02.
REMARK*********************************************************************
REMARK*5830-TRU-SCORECARD02.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA CON CTA CORRIENTES Y NO TARJET.*
REMARK*********************************************************************
CARD02    PERFORM 5891-MINIMO-AYT.
CARD02    COMPUTE BAL = TGD010 + TGD011 + TGD012.
CARD02    PERFORM 5892-CBAT60P.
CARD02    PERFORM 5893-INQ06.     
CARD02    PERFORM 5894-MESAS.
NEWSCO*  MIN(TCR100,TBS100,TCC100,TOT100)                                 *
CARD02    MOVE TCR100 TO MOS30.
CARD02    IF MOS30 > TBS100     
CARD02       MOVE TBS100 TO MOS30.
CARD02    IF MOS30 > TCC100     
CARD02       MOVE TCC100 TO MOS30.
CARD02    IF MOS30 > TOT100     
CARD02       MOVE TOT100 TO MOS30.
CARD02    COMPUTE OPAT18 = TCR030 + TCR031 + TCR032 + 
CARD02                     TBS030 + TBS031 + TBS032 + 
CARD02                     TCC030 + TCC031 + TCC032 + 
CARD02                     TOT030 + TOT031 + TOT032.   
CARD02    IF AYT <= 0 OR AYT = 999 
CARD02       MOVE 0 TO YOUNG 
CARD02    ELSE
CARD02       MOVE AYT TO YOUNG
CARD02    END-IF.
CARD02    IF MOS30 >= 0 AND MOS30 <= 18 
CARD02       MOVE 1 TO MOS30001 
CARD02    ELSE
CARD02       MOVE 0 TO MOS30001
CARD02    END-IF.
CARD02    IF CBAT60P >= 1  
CARD02       MOVE 1 TO CBAT60P1 
CARD02    ELSE
CARD02       MOVE 0 TO CBAT60P1
CARD02    END-IF.
CARD02    IF BAL   >= 10001 AND BAL   <= 30000
CARD02       MOVE 1 TO BAL00001 
CARD02    ELSE
CARD02       MOVE 0 TO BAL00001
CARD02    END-IF.
CARD02    IF BAL   >= 30001 AND BAL   <= 50000
CARD02       MOVE 1 TO BAL00002 
CARD02    ELSE
CARD02       MOVE 0 TO BAL00002
CARD02    END-IF.
CARD02    IF BAL   >= 50001 
CARD02       MOVE 1 TO BAL00003 
CARD02    ELSE
CARD02       MOVE 0 TO BAL00003
CARD02    END-IF.
CARD02    IF INQ06  = 1     
CARD02       MOVE 1 TO INQ06001 
CARD02    ELSE
CARD02       MOVE 0 TO INQ06001
CARD02    END-IF.
CARD02    IF INQ06  = 2     
CARD02       MOVE 1 TO INQ06002 
CARD02    ELSE
CARD02       MOVE 0 TO INQ06002
CARD02    END-IF.
CARD02    IF INQ06  >= 3    
CARD02       MOVE 1 TO INQ06003 
CARD02    ELSE
CARD02       MOVE 0 TO INQ06003
CARD02    END-IF.
CARD02    IF OPAT18 >= 2 AND OPAT18 <= 3 
CARD02       MOVE 1 TO OPAT1801 
CARD02    ELSE
CARD02       MOVE 0 TO OPAT1801
CARD02    END-IF.
CARD02    IF OPAT18 >= 4  
CARD02       MOVE 1 TO OPAT1802 
CARD02    ELSE
CARD02       MOVE 0 TO OPAT1802
CARD02    END-IF.
CARD02    IF TBS040  >= 61 
CARD02       MOVE 1 TO BS040001 
CARD02    ELSE
CARD02       MOVE 0 TO BS040001
CARD02    END-IF.
CARD02    COMPUTE SCORE = 729                   +
CARD02                    -75      * MOS30001   +
CARD02                    -106     * CBAT60P1   +
CARD02                    +0.671   * YOUNG      + 
CARD02                    -11      * BAL00001   + 
CARD02                    -21      * BAL00002   + 
CARD02                    -40      * BAL00003   + 
CARD02                    +0.0866  * MESAS      + 
CARD02                    -22      * INQ06001   + 
CARD02                    -46      * INQ06002   + 
CARD02                    -68      * INQ06003   + 
CARD02                    -27      * OPAT1801   + 
CARD02                    -34      * OPAT1802   + 
CARD02                    +13      * BS040001   . 
CARD02    IF SCORE <= 250 MOVE 250 TO SCORE.
CARD02    IF SCORE >= 850 MOVE 850 TO SCORE.
REMARK****************COMIENZO CALCULO PARA LAS RAZONES *************
CARD02    PERFORM 6005-PREPARE-AA.       
CARD02    IF AACBAT60P >= 1                 
CARD02       MOVE 05 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 106 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORREC    IF AAMOS30  >= 0 AND <= 18
CARD02       MOVE 03 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 75 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD02    IF AAINQ06  >= 3              
CARD02       MOVE 16 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 68 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD02    IF AAINQ06   = 2            
CARD02       MOVE 16 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 46 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF TCK001 >= 1               
CORRE2*      MOVE 15 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 37 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD02    IF AABAL    >= 50001             
CARD02       MOVE 14 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 40 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD02    IF AAOPAT18 >= 4                   
CARD02       MOVE 12 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 34 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORREC    IF AAOPAT18 >= 2 AND <= 3          
CARD02       MOVE 12 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 27 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD02    IF AAINQ06  =  1                   
CARD02       MOVE 16 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 22 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD02    IF AABAL    >= 30000 AND <= 50000
CARD02       MOVE 14 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 21 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD02    IF TBS040 >= 0 AND <= 60 AND BS040(2:1) NOT = "-"
CARD02       MOVE 19 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 13 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD02    IF AABAL     >= 10000 AND <= 30000
CARD02       MOVE 14 TO ADVERSE-CODE
CARD02       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD02          MOVE 11 TO DIFFERENCE
CARD02          PERFORM 6000-TRU-INSERTE-ADV-CODE.
REMARK************COMIENZO VARIABLES CONTINUAS ***************************
CORREC    IF YOUNG   >   0 AND YOUNG NOT = 999
CARD02       COMPUTE TEMP1 = 366 -(YOUNG * 0.671)
CARD02       MOVE 22 TO ADVERSE-CODE
CARD02       PERFORM 6001-INSERTE-CONTINUA.
CORRE2*   IF MESAS   > 0 
CORRE2*      COMPUTE TEMP1 = 69 - (MESAS * 0.0918)
CORRE2*      MOVE 07 TO ADVERSE-CODE
CORRE2*      PERFORM 6001-INSERTE-CONTINUA.
REMARK*********************************************************************
CARD03 5840-TRU-SCORECARD03.
REMARK*********************************************************************
REMARK*5840-TRU-SCORECARD03.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA CON CTA CORRIENTES Y TARJETAS  *
REMARK*********************************************************************
CARD03*  MAX(TCR040,TBS040,TCC040,TOT040)                                 *
CARD03    MOVE TCR040 TO AOT.
CARD03    IF AOT < TBS040     
CARD03       MOVE TBS040 TO AOT.
CARD03    IF AOT < TCC040     
CARD03       MOVE TCC040 TO AOT.
CARD03    IF AOT < TOT040     
CARD03       MOVE TOT040 TO AOT.
CARD03    IF CR040 NOT NUMERIC AND
CARD03       BS040 NOT NUMERIC AND
CARD03       CC040 NOT NUMERIC AND
CARD03       OT040 NOT NUMERIC      
CARD03       MOVE -1 TO AOT
CARD03    END-IF.
CARD03    PERFORM 5891-MINIMO-AYT.
CARD03    COMPUTE BS25P7 = TBS011 + TBS012 + TBS013 + TBS014.
CARD03    COMPUTE CBAT30 = TCR056 + TCR060 + TCR064 + 
CARD03                     TBS056 + TBS060 + TBS064 + 
CARD03                     TCC056 + TCC060 + TCC064 + 
CARD03                     TOT056 + TOT060 + TOT064  .
CARD03    PERFORM 5892-CBAT60P.
CARD03    PERFORM 5893-INQ06.     
CARD03    PERFORM 5894-MESAS.
CARD03    COMPUTE OPAT12 = TCR030 + TCR031 + TBS030 + TBS031 +
CARD03                     TCC030 + TCC031 + TOT030 + TOT031.
CARD03    COMPUTE OPCR18 = TCR030 + TCR031 + TCR032.
CARD03    IF AOT    >=   0 AND AOT    <= 24 
CARD03       MOVE 1 TO AOT00001
CARD03    ELSE
CARD03       MOVE 0 TO AOT00001
CARD03    END-IF.
CARD03    IF AYT    >=   0 AND AYT    <= 6  
CARD03       MOVE 1 TO AYT00001
CARD03    ELSE
CARD03       MOVE 0 TO AYT00001
CARD03    END-IF.
CARD03    IF AYT    >=  37   
CARD03       MOVE 1 TO AYT00002
CARD03    ELSE
CARD03       MOVE 0 TO AYT00002
CARD03    END-IF.
CARD03    IF BS25P7 >=  2    
CARD03       MOVE 1 TO BS25P701
CARD03    ELSE
CARD03       MOVE 0 TO BS25P701
CARD03    END-IF.
CARD03    IF CBAT30 =  1    
CARD03       MOVE 1 TO CBAT3001
CARD03    ELSE
CARD03       MOVE 0 TO CBAT3001
CARD03    END-IF.
CARD03    IF CBAT30 >= 2    
CARD03       MOVE 1 TO CBAT3002
CARD03    ELSE
CARD03       MOVE 0 TO CBAT3002
CARD03    END-IF.
CARD03    IF CBAT60P >= 1   
CARD03       MOVE 1 TO CBAT60P1
CARD03    ELSE
CARD03       MOVE 0 TO CBAT60P1
CARD03    END-IF.
CARD03    IF TCC001  >= 1   
CARD03       MOVE 1 TO CC001001
CARD03    ELSE
CARD03       MOVE 0 TO CC001001
CARD03    END-IF.
CARD03    IF TCR041 >= 61  AND <= 998
CARD03       MOVE 1 TO CR041001
CARD03    ELSE
CARD03       MOVE 0 TO CR041001
CARD03    END-IF.
CARD03    IF TGD002 >= 1  
CARD03       MOVE 1 TO GD002001
CARD03    ELSE
CARD03       MOVE 0 TO GD002001
CARD03    END-IF.
CARD03    IF INQ06  >= 3  
CARD03       MOVE 1 TO INQ06002
CARD03    ELSE
CARD03       MOVE 0 TO INQ06002
CARD03    END-IF.
CARD03    IF TIQ013  >= 1  
CARD03       MOVE 1 TO IQ013001
CARD03    ELSE
CARD03       MOVE 0 TO IQ013001
CARD03    END-IF.
CARD03    IF TIQ014  >= 1  
CARD03       MOVE 1 TO IQ014001
CARD03    ELSE
CARD03       MOVE 0 TO IQ014001
CARD03    END-IF.
CARD03    IF OPAT12   = 2  
CARD03       MOVE 1 TO OPAT1201
CARD03    ELSE
CARD03       MOVE 0 TO OPAT1201
CARD03    END-IF.
CARD03    IF OPAT12   = 3  
CARD03       MOVE 1 TO OPAT1202
CARD03    ELSE
CARD03       MOVE 0 TO OPAT1202
CARD03    END-IF.
CARD03    IF OPAT12  >= 4  
CARD03       MOVE 1 TO OPAT1203
CARD03    ELSE
CARD03       MOVE 0 TO OPAT1203
CARD03    END-IF.
CARD03    IF OPCR18   = 1  
CARD03       MOVE 1 TO OPCR1801
CARD03    ELSE
CARD03       MOVE 0 TO OPCR1801
CARD03    END-IF.
CARD03    IF OPCR18   >= 2 
CARD03       MOVE 1 TO OPCR1802
CARD03    ELSE
CARD03       MOVE 0 TO OPCR1802
CARD03    END-IF.
CARD03    COMPUTE SCORE = 725                   +
CARD03                    -25      * AOT00001   +
CARD03                    -12      * AYT00001   +
CARD03                    +8       * AYT00002   + 
CARD03                    -8       * BS25P701   + 
CARD03                    -84      * CBAT3001   + 
CARD03                    -95      * CBAT3002   + 
CARD03                    -136     * CBAT60P1   + 
CARD03                    -9       * CC001001   + 
CARD03                    +13      * CR041001   + 
CARD03                    -16      * GD002001   + 
CARD03                    +0.076   * MESAS      + 
CARD03                    -22      * INQ06002   + 
CARD03                    -39      * IQ013001   + 
CARD03                    -17      * IQ014001   + 
CARD03                    -9       * OPAT1201   + 
CARD03                    -14      * OPAT1202   +
CARD03                    -22      * OPAT1203   +
CARD03                    -7       * OPCR1801   +
CARD03                    -12      * OPCR1802   .
CARD03    IF SCORE <= 250 MOVE 250 TO SCORE.
CARD03    IF SCORE >= 850 MOVE 850 TO SCORE.
CARD03****************COMIENZO CALCULO PARA LAS RAZONES *************
CARD03    PERFORM 6005-PREPARE-AA.       
CARD03    IF AACBAT60P  >= 1                
CARD03       MOVE 05 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 136 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AACBAT30 >= 2            
CARD03       MOVE 04 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 95 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AACBAT30  = 1            
CARD03       MOVE 04 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 84 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF TIQ013 >= 1           
CARD03       MOVE 17 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 39 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAAOT    >= 0 AND <= 24  
CARD03       MOVE 21 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 25 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAINQ06  >= 3              
CARD03       MOVE 16 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 22 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF TCK001 >= 2            
CORRE2*      MOVE 15 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 22 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAOPAT12  >= 4                  
CARD03       MOVE 12 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 22 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAAYT    >= 0   AND  <= 6        
CARD03       MOVE 22 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 20 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF TIQ014  >= 1          
CARD03       MOVE 18 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 17 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF TGD002  >= 1               
CARD03       MOVE 25 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 16 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAOPAT12  = 3                
CARD03       MOVE 12 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 14 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF TCR041  >= 0  AND  <=  60  
CARD03       MOVE 23 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 13 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAOPCR18  >= 02               
CARD03       MOVE 13 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 12 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF TCC001  >= 1               
CARD03       MOVE 24 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 09 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF TCK001   = 1               
CORRE2*      MOVE 15 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 11 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF AAINQ06    = 2               
CORRE2*      MOVE 16 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 10 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAOPAT12   = 2               
CARD03       MOVE 12 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 09 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAAYT     >= 7 AND  <= 36    
CARD03       MOVE 22 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 08 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AABS25P7  >= 2               
CARD03       MOVE 27 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 08 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03    IF AAOPCR18   = 1               
CARD03       MOVE 13 TO ADVERSE-CODE
CARD03       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD03          MOVE 07 TO DIFFERENCE
CARD03          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD03************COMIENZO VARIABLES CONTINUAS ***************************
CORRE2*   IF MESAS > 0
CORRE2*      COMPUTE TEMP1 = 66 -(MESAS * 0.0812)
CORRE2*      MOVE 07 TO ADVERSE-CODE
CORRE2*      PERFORM 6001-INSERTE-CONTINUA.
CARD03*********************************************************************
CARD04 5850-TRU-SCORECARD04.
REMARK*********************************************************************
REMARK*5850-TRU-SCORECARD04.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA SIN CTA CORRIENTES             *
REMARK*********************************************************************
CARD04    PERFORM 5891-MINIMO-AYT.
CARD04    COMPUTE CBAT39 = TCR056 + TCR057 + TCR058 + TCR060 + TCR061 + 
CARD04                     TCR062 + TCR064 + TCR065 + TCR066 + TCR068 + 
CARD04                     TCR069 + TCR070 + TCR074 + TCR075 + TCR077 + 
CARD04                     TCR078 + TCR079 + TCR081 + TCR082 + TCR083 + 
CARD04                     TBS056 + TBS057 + TBS058 + TBS060 + TBS061 + 
CARD04                     TBS062 + TBS064 + TBS065 + TBS066 + TBS068 + 
CARD04                     TBS069 + TBS070 + TBS074 + TBS075 + TBS077 + 
CARD04                     TBS078 + TBS079 + TBS081 + TBS082 + TBS083 + 
CARD04                     TCC056 + TCC057 + TCC058 + TCC060 + TCC061 + 
CARD04                     TCC062 + TCC064 + TCC065 + TCC066 + TCC068 + 
CARD04                     TCC069 + TCC070 + TCC074 + TCC075 + TCC077 + 
CARD04                     TCC078 + TCC079 + TCC081 + TCC082 + TCC083 + 
CARD04                     TOT056 + TOT057 + TOT058 + TOT060 + TOT061 + 
CARD04                     TOT062 + TOT064 + TOT065 + TOT066 + TOT068 + 
CARD04                     TOT069 + TOT070 + TOT074 + TOT075 + TOT077 + 
CARD04                     TOT078 + TOT079 + TOT081 + TOT082 + TOT083.  
CARD04    IF CBAT39 >= 3 
CARD04       MOVE 3 TO CBAT39X
CARD04    ELSE
CARD04       MOVE CBAT39 TO CBAT39X
CARD04    END-IF.
CARD04    COMPUTE CBAT12W = TCR051 + TCR059 + TCR063 + TCR067 + TCR071 +
CARD04                      TCR072 + TCR073 + TCR076 + TCR080 + TCR084 +
CARD04                      TCR085 + TCR086 + TCR087 + TCR088 + TCR089 +
CARD04                      TCR090 + TCR092 + TCR093 + TCR094 +
CARD04                      TBS051 + TBS059 + TBS063 + TBS067 + TBS071 +
CARD04                      TBS072 + TBS073 + TBS076 + TBS080 + TBS084 +
CARD04                      TBS085 + TBS086 + TBS087 + TBS088 + TBS089 +
CARD04                      TBS090 + TBS092 + TBS093 + TBS094 +
CARD04                      TCC051 + TCC059 + TCC063 + TCC067 + TCC071 +
CARD04                      TCC072 + TCC073 + TCC076 + TCC080 + TCC084 +
CARD04                      TCC085 + TCC086 + TCC087 + TCC088 + TCC089 +
CARD04                      TCC090 + TCC092 + TCC093 + TCC094 +
CARD04                      TOT051 + TOT059 + TOT063 + TOT067 + TOT071 +
CARD04                      TOT072 + TOT073 + TOT076 + TOT080 + TOT084 +
CARD04                      TOT085 + TOT086 + TOT087 + TOT088 + TOT089 +
CARD04                      TOT090 + TOT092 + TOT093 + TOT094.    
CARD04    COMPUTE CR10B = TCR010 + TCR011.
CARD04    IF CR010 NOT NUMERIC AND
CARD04       CR011 NOT NUMERIC 
CARD04       MOVE -1 TO CR10B
CARD04    END-IF.
CARD04    PERFORM 5894-MESAS.
CARD04*  MIN(TCR101,TBS101,TCC101,TOT101,TCR102,TBS102,TCC102.TOT102)     *
CARD04    MOVE TCR101 TO MOS69.
CARD04    IF MOS69 > TBS101     
CARD04       MOVE TBS101 TO MOS69.
CARD04    IF MOS69 > TCC101     
CARD04       MOVE TCC101 TO MOS69.
CARD04    IF MOS69 > TOT101     
CARD04       MOVE TOT101 TO MOS69.
CARD04    IF MOS69 > TCR102     
CARD04       MOVE TCR102 TO MOS69.
CARD04    IF MOS69 > TBS102     
CARD04       MOVE TBS102 TO MOS69.
CARD04    IF MOS69 > TCC102     
CARD04       MOVE TCC102 TO MOS69.
CARD04    IF MOS69 > TOT102     
CARD04       MOVE TOT102 TO MOS69.
CARD04    COMPUTE OPAT24 = TCR030 + TCR031 + TCR032 + TCR033 +
CARD04                     TBS030 + TBS031 + TBS032 + TBS033 +
CARD04                     TCC030 + TCC031 + TCC032 + TCC033 +
CARD04                     TOT030 + TOT031 + TOT032 + TOT033.
CARD04    PERFORM 5895-PCTCUR.
CARD04    COMPUTE SUM050 = TCR050 + TBS050 + TCC050 + TOT050.
CARD04    COMPUTE VRCC12 = TCC020 + TCC021.
CARD04    IF TCR040  >= 109 
CARD04       MOVE 1 TO CR040001
CARD04    ELSE
CARD04       MOVE 0 TO CR040001
CARD04    END-IF.
CARD04    IF TGD050  >= 1                    
CARD04       MOVE 1 TO GD050001
CARD04    ELSE
CARD04       MOVE 0 TO GD050001
CARD04    END-IF.
CARD04    IF TIQ013  >= 1  
CARD04       MOVE 1 TO IQ013001
CARD04    ELSE
CARD04       MOVE 0 TO IQ013001
CARD04    END-IF.
CARD04    IF TIQ014  >= 1  
CARD04       MOVE 1 TO IQ014001
CARD04    ELSE
CARD04       MOVE 0 TO IQ014001
CARD04    END-IF.
CARD04    IF OPAT24  >= 2  
CARD04       MOVE 1 TO OPAT2401
CARD04    ELSE
CARD04       MOVE 0 TO OPAT2401
CARD04    END-IF.
CARD04    IF PCTCUR  >= 40.01 AND PCTCUR <= 90
CARD04       MOVE 1 TO PCTCUR01
CARD04    ELSE
CARD04       MOVE 0 TO PCTCUR01
CARD04    END-IF.
CARD04    IF PCTCUR  >= 90.01 
CARD04       MOVE 1 TO PCTCUR02
CARD04    ELSE
CARD04       MOVE 0 TO PCTCUR02
CARD04    END-IF.
CARD04    IF SUM050  = 1       
CARD04       MOVE 1 TO SUM05001
CARD04    ELSE
CARD04       MOVE 0 TO SUM05001
CARD04    END-IF.
CARD04    IF SUM050  >= 2       
CARD04       MOVE 1 TO SUM05002
CARD04    ELSE
CARD04       MOVE 0 TO SUM05002
CARD04    END-IF.
CARD04    IF MOS69   >= 0   AND   MOS69   <= 1 
CARD04       MOVE 1 TO MOS69001
CARD04    ELSE
CARD04       MOVE 0 TO MOS69001
CARD04    END-IF.
CARD04    IF MOS69    = 2                       
CARD04       MOVE 1 TO MOS69002
CARD04    ELSE
CARD04       MOVE 0 TO MOS69002
CARD04    END-IF.
CARD04    IF MOS69    = 3                       
CARD04       MOVE 1 TO MOS69003
CARD04    ELSE
CARD04       MOVE 0 TO MOS69003
CARD04    END-IF.
CARD04    IF MOS69   >= 4   AND   MOS69   <= 24
CARD04       MOVE 1 TO MOS69004
CARD04    ELSE
CARD04       MOVE 0 TO MOS69004
CARD04    END-IF.
CARD04    IF CBAT12W  = 1                       
CARD04       MOVE 1 TO CBAT12W1
CARD04    ELSE
CARD04       MOVE 0 TO CBAT12W1
CARD04    END-IF.
CARD04    IF CBAT12W >= 2                       
CARD04       MOVE 1 TO CBAT12W2
CARD04    ELSE
CARD04       MOVE 0 TO CBAT12W2
CARD04    END-IF.
CARD04    IF BS002    = "000"                   
CARD04       MOVE 1 TO BS002001
CARD04    ELSE
CARD04       MOVE 0 TO BS002001
CARD04    END-IF.
CARD04    IF VRCC12  >= 1                       
CARD04       MOVE 1 TO VRCC1201
CARD04    ELSE
CARD04       MOVE 0 TO VRCC1201
CARD04    END-IF.
CARD04    IF CR10B   >= 1                       
CARD04       MOVE 1 TO CR10B001
CARD04    ELSE
CARD04       MOVE 0 TO CR10B001
CARD04    END-IF.
CARD04    COMPUTE SCORE = 613                   +
CARD04                    +12      * CR040001   + 
CARD04                    -9       * GD050001   + 
CARD04                    +0.101   * MESAS      + 
CARD04                    -66      * IQ013001   + 
CARD04                    -27      * IQ014001   + 
CARD04                    -11      * OPAT2401   + 
CARD04                    +10      * PCTCUR01   + 
CARD04                    +34      * PCTCUR02   + 
CARD04                    +61      * SUM05001   + 
CARD04                    +65      * SUM05002   + 
CARD04                    -68      * MOS69001   + 
CARD04                    -54      * MOS69002   + 
CARD04                    -44      * MOS69003   + 
CARD04                    -28      * MOS69004   + 
CARD04                    -101     * CBAT12W1   +
CARD04                    -129     * CBAT12W2   +
CARD04                    +29      * BS002001   +
CARD04                    -41      * VRCC1201   +
CARD04                    +0.102   * AYTX       +
CARD04                    -42      * CBAT39X    +
CARD04                    +11      * CR10B001   .
CARD04    IF SCORE <= 250 MOVE 250 TO SCORE.
CARD04    IF SCORE >= 850 MOVE 850 TO SCORE.
CARD04****************COMIENZO CALCULO PARA LAS RAZONES *************
CARD04    PERFORM 6005-PREPARE-AA.       
CARD04    IF AACBAT12W >= 2                 
CARD04       MOVE 05 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 129 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AACBAT12W  = 1                 
CARD04       MOVE 05 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 101 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AAMOS69  >= 0 AND <= 1
CARD04       MOVE 03 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 68 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF TIQ013 >= 1            
CARD04       MOVE 17 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 66 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AASUM050  = 0          
CARD04       MOVE 32 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 65 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AAMOS69  = 2              
CARD04       MOVE 03 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 54 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AAMOS69  = 3                
CARD04       MOVE 03 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 44 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF AASUM054 >= 1            
CORRE2*      MOVE 04 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 43 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AAVRCC12 >= 1                   
CARD04       MOVE 30 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 41 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AAPCTCUR >= 0 AND <= 40   
CARD04       MOVE 09 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 34 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF TBS002 >= 1                   
CARD04       MOVE 04 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 29 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AAMOS69  >= 4 AND <= 24   
CARD04       MOVE 03 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 28 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF TCK001  >= 2               
CORRE2*      MOVE 15 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 27 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF TIQ014  >= 1               
CARD04       MOVE 18 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 27 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AAPCTCUR >= 40.01 AND <= 90
CARD04       MOVE 09 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 24 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF AACRD13P  >= 3               
CORRE2*      MOVE 27 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 21 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF TCR040 >= 0 AND <= 108 AND CR040(2:1) NOT = "-"
CARD04       MOVE 06 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 12 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF TCK001   = 1                
CORRE2*      MOVE 15 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 11 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AAOPAT24  >= 2                
CARD04       MOVE 12 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 11 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AACR10B    = 0                
CARD04       MOVE 28 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 11 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF TGD050   >= 1               
CARD04       MOVE 26 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 09 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04    IF AASUM050   = 1                
CARD04       MOVE 32 TO ADVERSE-CODE
CARD04       IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CARD04          MOVE 04 TO DIFFERENCE
CARD04          PERFORM 6000-TRU-INSERTE-ADV-CODE.
CORRE2*   IF CR001    = " -1"           
CORRE2*      MOVE 31 TO ADVERSE-CODE
CORRE2*      IF V-ASIGNADA(ADVERSE-CODE) = 0 AND RAZONES < 4
CORRE2*         MOVE 04 TO DIFFERENCE
CORRE2*         PERFORM 6000-TRU-INSERTE-ADV-CODE.
CARD04************COMIENZO VARIABLES CONTINUAS ***************************
CORRE2*   IF MESAS > 0
CORRE2*      COMPUTE TEMP1 = 51 -(MESAS * 0.104 )
CORRE2*      MOVE 07 TO ADVERSE-CODE
CORRE2*      PERFORM 6001-INSERTE-CONTINUA.
CARD04    IF AAAYTX > 0 
CARD04       COMPUTE TEMP1 = 43 - (AYTX * 0.102)
CARD04       MOVE 22 TO ADVERSE-CODE
CARD04       PERFORM 6001-INSERTE-CONTINUA.
CARD04    IF AACBAT39X > 0 
CARD04       COMPUTE TEMP1 = CBAT39X * 42     
CARD04       MOVE 05 TO ADVERSE-CODE
CARD04       PERFORM 6001-INSERTE-CONTINUA.
REMARK*********************************************************************
REMARK*    RUTINAS COMPARTIDAS POR LOS SCORE CARDS                        *
REMARK*********************************************************************
NEWSCO 5891-MINIMO-AYT.
REMARK*********************************************************************
REMARK*5891-MINIMO-AYT.                                                   *
NEWSCO*  MIN(TCR041,TBS041,TCC041,TOT041)                                 *
REMARK*********************************************************************
NEWSCO    MOVE TCR041 TO AYT.
NEWSCO    IF AYT > TBS041     
NEWSCO       MOVE TBS041 TO AYT.
NEWSCO    IF AYT > TCC041     
NEWSCO       MOVE TCC041 TO AYT.
NEWSCO    IF AYT > TOT041     
NEWSCO       MOVE TOT041 TO AYT.
NEWSCO    IF AYT <= 48 OR AYT = 999 
NEWSCO       MOVE 00000 TO AYTX
NEWSCO    ELSE 
NEWSCO       MOVE AYT TO AYTX
NEWSCO    END-IF.
NEWSCO 5892-CBAT60P.
REMARK*********************************************************************
REMARK*5892-CBAT60P.
REMARK*  SUMAR TODAS LAS VARIABLES DE MORA 60                             *
REMARK*********************************************************************
NEWSCO    COMPUTE CBAT60P = TCR051 + TCR057 + TCR058 + TCR059 + TCR061 +
NEWSCO                      TCR062 + TCR063 + TCR065 + TCR066 + TCR067 +
NEWSCO                      TCR068 + TCR069 + TCR070 + TCR071 + TCR072 +
NEWSCO                      TCR073 + TCR074 + TCR075 + TCR076 + TCR077 +
NEWSCO                      TCR078 + TCR079 + TCR080 + TCR081 + TCR082 +
NEWSCO                      TCR083 + TCR084 + TCR085 + TCR086 + TCR087 +
NEWSCO                      TCR088 + TCR089 + TCR090 + TCR092 + TCR093 +
NEWSCO                      TCR094 + 
NEWSCO                      TBS051 + TBS057 + TBS058 + TBS059 + TBS061 +
NEWSCO                      TBS062 + TBS063 + TBS065 + TBS066 + TBS067 +
NEWSCO                      TBS068 + TBS069 + TBS070 + TBS071 + TBS072 +
NEWSCO                      TBS073 + TBS074 + TBS075 + TBS076 + TBS077 +
NEWSCO                      TBS078 + TBS079 + TBS080 + TBS081 + TBS082 +
NEWSCO                      TBS083 + TBS084 + TBS085 + TBS086 + TBS087 +
NEWSCO                      TBS088 + TBS089 + TBS090 + TBS092 + TBS093 +
NEWSCO                      TBS094 + 
NEWSCO                      TCC051 + TCC057 + TCC058 + TCC059 + TCC061 +
NEWSCO                      TCC062 + TCC063 + TCC065 + TCC066 + TCC067 +
NEWSCO                      TCC068 + TCC069 + TCC070 + TCC071 + TCC072 +
NEWSCO                      TCC073 + TCC074 + TCC075 + TCC076 + TCC077 +
NEWSCO                      TCC078 + TCC079 + TCC080 + TCC081 + TCC082 +
NEWSCO                      TCC083 + TCC084 + TCC085 + TCC086 + TCC087 +
NEWSCO                      TCC088 + TCC089 + TCC090 + TCC092 + TCC093 +
NEWSCO                      TCC094 + 
NEWSCO                      TOT051 + TOT057 + TOT058 + TOT059 + TOT061 +
NEWSCO                      TOT062 + TOT063 + TOT065 + TOT066 + TOT067 +
NEWSCO                      TOT068 + TOT069 + TOT070 + TOT071 + TOT072 +
NEWSCO                      TOT073 + TOT074 + TOT075 + TOT076 + TOT077 +
NEWSCO                      TOT078 + TOT079 + TOT080 + TOT081 + TOT082 +
NEWSCO                      TOT083 + TOT084 + TOT085 + TOT086 + TOT087 +
NEWSCO                      TOT088 + TOT089 + TOT090 + TOT092 + TOT093 +
NEWSCO                      TOT094.   
NEWSCO 5893-INQ06.     
REMARK*********************************************************************
REMARK*5893-INQ06.     
REMARK*  SUMAR TODAS LAS CONSULTAS EN LOS ULTIMOS 6 MESES                 *
REMARK*********************************************************************
NEWSCO    COMPUTE INQ06 = TIQ001 + TIQ002 .
NEWSCO 5894-MESAS.
REMARK*********************************************************************
REMARK*5894-MESAS.
REMARK*  MOVE LA EDAD CALCULADA DE LA FECHA DE EXPEDICION                 *
REMARK*********************************************************************
NEWSCO    IF ID004 NOT NUMERIC 
NEWSCO       MOVE 0 TO MESAS 
NEWSCO    ELSE
NEWSCO       MOVE ID004 TO MESAS
NEWSCO    END-IF.
NEWSCO 5895-PCTCUR.
REMARK*********************************************************************
REMARK*5895-PCTCUR.
REMARK*  RELACION ENTRE CUENTAS AL DIA SOBRE TOTAL DE CUENTAS             *
REMARK*********************************************************************
NEWSCO    COMPUTE PCTCUR ROUNDED = 100 * 
NEWSCO                           (TCR050 + TBS050 + TCC050 + TOT050) /
NEWSCO                           (TCR001 + TBS001 + TCC001 + TOT001 ) .
NEWSCO 6000-TRU-INSERTE-ADV-CODE.
REMARK*********************************************************************
REMARK*6000-TRU-INSERTE-ADV-CODE.
REMARK*  SE ADICIONA A LA LISTA DE RAZONES LA ENCONTRADA POR VAR DISCRETA *
REMARK*********************************************************************
NEWSCO    ADD 1 TO RAZONES
NEWSCO    MOVE 1 TO V-ASIGNADA(ADVERSE-CODE)
NEWSCO    MOVE ADVERSE-CODE TO ADVERSE-RAZON(RAZONES)
NEWSCO    MOVE DIFFERENCE  TO ADVERSE-DIFF (RAZONES).
NEWSCO 6001-INSERTE-CONTINUA.
REMARK*********************************************************************
REMARK*6001-INSERTE-CONTINUA.
REMARK*  SE ADICIONA A LA LISTA DE RAZONES LA VARIABLE CONTINUA . SE      *
REMARK*  DEZPLAZA TODA LA TABLA HACIA ABAJO CUANDO LA INSERTA.            *
REMARK*********************************************************************
NEWSCO    COMPUTE TEMP1ROUNDED ROUNDED = TEMP1 
NEWSCO    MOVE 1 TO RAZONES.
CORREC    PERFORM UNTIL RAZONES > 4 OR TEMP1ROUNDED <= 0
NEWSCO      IF TEMP1ROUNDED > ADVERSE-DIFF(RAZONES)
NEWSCO         MOVE ADVERSE-DIFF (RAZONES) TO DIFFERENCE-AUX       
NEWSCO         MOVE ADVERSE-RAZON(RAZONES) TO ADVERSE-CODE-AUX  
NEWSCO         MOVE TEMP1ROUNDED TO ADVERSE-DIFF(RAZONES) 
NEWSCO         MOVE ADVERSE-CODE TO ADVERSE-RAZON(RAZONES)
NEWSCO                              ADVERSE-CODE-INI   
NEWSCO         PERFORM UNTIL RAZONES >= 4 OR ADVERSE-CODE-AUX =         
NEWSCO                                       ADVERSE-CODE-INI
NEWSCO            ADD      1 TO   RAZONES
NEWSCO            IF RAZONES <= 4                              
NEWSCO               MOVE ADVERSE-DIFF (RAZONES) TO DIFFERENCE       
NEWSCO               MOVE ADVERSE-RAZON(RAZONES) TO ADVERSE-CODE 
NEWSCO               MOVE DIFFERENCE-AUX TO ADVERSE-DIFF (RAZONES)
NEWSCO               MOVE ADVERSE-CODE-AUX TO ADVERSE-RAZON(RAZONES)
NEWSCO               MOVE DIFFERENCE TO DIFFERENCE-AUX
NEWSCO               MOVE ADVERSE-CODE TO ADVERSE-CODE-AUX
NEWSCO            END-IF
NEWSCO         END-PERFORM
NEWSCO         MOVE 4 TO RAZONES
NEWSCO      ELSE
NEWSCO         IF ADVERSE-RAZON(RAZONES) = ADVERSE-CODE 
NEWSCO            MOVE 4 TO RAZONES
NEWSCO         END-IF
NEWSCO      END-IF
NEWSCO      ADD 1 TO RAZONES
NEWSCO    END-PERFORM.                              
NEWSCO 6005-PREPARE-AA.       
REMARK*********************************************************************
REMARK*6005-PREPARE-AA.       
REMARK*   SE SEPARAN LOS CASOS DE TODA INFORMACION NEGATIVA CON VARIABLES
REMARK*   QUE COMIENZAN POR "AA". ELIMINA CASOS NEGATIVOS MAL MANEJADOS       
REMARK*********************************************************************
CORREC    IF CR040 NOT NUMERIC AND
CORREC       BS040 NOT NUMERIC AND 
CORREC       CC040 NOT NUMERIC AND 
CORREC       OT040 NOT NUMERIC  
CORREC       MOVE -1      TO AAAOT      
CORREC    ELSE
CORREC       MOVE AOT     TO AAAOT       
CORREC    END-IF.
CORREC    IF (CR041 NOT NUMERIC OR CR041 = "999") AND
CORREC       (BS041 NOT NUMERIC OR BS041 = "999") AND 
CORREC       (CC041 NOT NUMERIC OR CC041 = "999") AND 
CORREC       (OT041 NOT NUMERIC OR OT041 = "999")  
CORREC       MOVE -1      TO AAAYT     
CORREC    ELSE
CORREC       MOVE AYT     TO AAAYT       
CORREC    END-IF.
CORREC    IF AAAYT >= 0 AND <= 48 
CORREC       MOVE 0     TO AAAYTX
CORREC    ELSE
CORREC       MOVE AAAYT TO AAAYTX
CORREC    END-IF.
CORREC    IF GD010 NOT NUMERIC AND
CORREC       GD011 NOT NUMERIC AND 
CORREC       GD012 NOT NUMERIC  
CORREC       MOVE -1      TO AABAL      
CORREC       MOVE -1      TO AANREC     
CORREC    ELSE
CORREC       MOVE BAL     TO AABAL       
CORREC       MOVE NREC    TO AANREC      
CORREC    END-IF.
CORREC    IF BS011 NOT NUMERIC AND
CORREC       BS012 NOT NUMERIC AND 
CORREC       BS013 NOT NUMERIC AND 
CORREC       BS014 NOT NUMERIC  
CORREC       MOVE -1      TO AABS25P7 
CORREC    ELSE
CORREC       MOVE BS25P7  TO AABS25P7
CORREC    END-IF.
CORREC    IF CR056 NOT NUMERIC AND CR060 NOT NUMERIC AND
CORREC       BS056 NOT NUMERIC AND BS060 NOT NUMERIC AND
CORREC       CC056 NOT NUMERIC AND CC060 NOT NUMERIC AND
CORREC       OT056 NOT NUMERIC AND OT060 NOT NUMERIC
CORREC* CUENTAS ABIERTAS O CERRADAS
CORREC       MOVE -1      TO AACBAT30 
CORREC       MOVE -1      TO AACBAT60P
CORREC       MOVE -1      TO AACBAT39X
CORREC       MOVE -1      TO AACBAT12W
CORREC    ELSE
CORREC       MOVE CBAT60P TO AACBAT60P
CORREC       MOVE CBAT30  TO AACBAT30 
CORREC       MOVE CBAT39X TO AACBAT39X
CORREC       MOVE CBAT12W TO AACBAT12W
CORREC    END-IF.
CORRE2*   IF CR054 NOT NUMERIC AND
CORRE2*      BS054 NOT NUMERIC AND 
CORRE2*      CC054 NOT NUMERIC AND 
CORRE2*      OT054 NOT NUMERIC  
CORRE2*      MOVE -1      TO AASUM054 
CORRE2*   ELSE
CORRE2*      MOVE SUM054  TO AASUM054 
CORRE2*   END-IF.
CORREC    IF CR010 NOT NUMERIC    
CORREC       MOVE -1      TO AACR10B    
CORRE2*      MOVE -1      TO AACRD13P   
CORREC    ELSE
CORREC       MOVE CR10B   TO AACR10B     
CORRE2*      MOVE CRD13P  TO AACRD13P    
CORREC    END-IF.
CORREC    IF CR065 NOT NUMERIC AND
CORREC       BS065 NOT NUMERIC AND 
CORREC       CC065 NOT NUMERIC AND 
CORREC       OT065 NOT NUMERIC  
CORREC*  TODAS CERRADAS (-2)
CORREC       MOVE -1      TO AACUAT69X
CORREC       MOVE -1      TO AADEL2PX  
CORREC       MOVE -1      TO AAMALO1   
CORREC       MOVE -1      TO AASUM050  
CORREC       MOVE -1      TO AASUM064  
CORREC    ELSE
CORREC       MOVE CUAT69X TO AACUAT69X
CORREC       MOVE DEL2PX  TO AADEL2PX   
CORREC       MOVE MALO1   TO AAMALO1    
CORREC       MOVE SUM050  TO AASUM050   
CORREC       MOVE SUM064  TO AASUM064   
CORREC    END-IF.
CORREC    IF IQ001 NOT NUMERIC    
CORREC       MOVE -1      TO AAINQ06    
CORREC    ELSE
CORREC       MOVE INQ06   TO AAINQ06     
CORREC    END-IF.
CORRE3    IF (CR100 NOT NUMERIC ) AND
CORRE3       (BS100 NOT NUMERIC ) AND 
CORRE3       (CC100 NOT NUMERIC ) AND 
CORRE3       (OT100 NOT NUMERIC )  
CORREC       MOVE -1      TO AAMOS30    
CORREC       MOVE -1      TO AAMOS69    
CORREC    ELSE
CORREC       MOVE MOS30   TO AAMOS30     
CORREC       MOVE MOS69   TO AAMOS69     
CORREC    END-IF.
CORREC    IF CR030 NOT NUMERIC AND
CORREC       BS030 NOT NUMERIC AND 
CORREC       CC030 NOT NUMERIC AND 
CORREC       OT030 NOT NUMERIC  
CORREC       MOVE -1      TO AAOPAT12   
CORREC       MOVE -1      TO AAOPAT18   
CORREC       MOVE -1      TO AAOPAT24   
CORREC    ELSE
CORREC       MOVE OPAT12  TO AAOPAT12    
CORREC       MOVE OPAT18  TO AAOPAT18    
CORREC       MOVE OPAT24  TO AAOPAT24    
CORREC    END-IF.
CORREC    IF CR030 NOT NUMERIC    
CORREC       MOVE -1      TO AAOPCR18   
CORREC    ELSE
CORREC       MOVE OPCR18  TO AAOPCR18    
CORREC    END-IF.
CORRE2*   IF OT030 NOT NUMERIC    
CORRE2*      MOVE -1      TO AAOPOT24   
CORRE2*   ELSE
CORRE2*      MOVE OPOT24  TO AAOPOT24    
CORRE2*   END-IF.
CORREC    IF CR050 NOT NUMERIC AND CR001 NOT NUMERIC AND
CORREC       BS050 NOT NUMERIC AND BS001 NOT NUMERIC AND
CORREC       CC050 NOT NUMERIC AND CC001 NOT NUMERIC AND
CORREC       OT050 NOT NUMERIC AND OT001 NOT NUMERIC
CORREC       MOVE -1      TO AAPCTCUR 
CORREC    ELSE
CORREC       MOVE PCTCUR  TO AAPCTCUR 
CORREC    END-IF.
CORREC    IF CR002 NOT NUMERIC AND
CORREC       BS002 NOT NUMERIC AND 
CORREC       CC002 NOT NUMERIC AND 
CORREC       OT002 NOT NUMERIC  
CORREC       MOVE -1      TO AASUM002X  
CORREC    ELSE
CORREC       MOVE SUM002X TO AASUM002X   
CORREC    END-IF.
CORREC    IF CR020 NOT NUMERIC AND
CORREC       BS020 NOT NUMERIC AND 
CORREC       CC020 NOT NUMERIC AND 
CORREC       OT020 NOT NUMERIC  
CORREC       MOVE -1      TO AAVRAT12   
CORREC    ELSE
CORREC       MOVE VRAT12  TO AAVRAT12    
CORREC    END-IF.
CORREC    IF CC020 NOT NUMERIC AND
CORREC       CC021 NOT NUMERIC      
CORREC       MOVE -1      TO AAVRCC12   
CORREC    ELSE
CORREC       MOVE VRCC12  TO AAVRCC12    
CORREC    END-IF.
REMARK********************************************************************
REMARK*     RUTINAS BASICAS DEL CALCULO DEL SCORE ACIERTA                *
REMARK********************************************************************
NEWSCO 7800-TRU-REALIZAR-SCORE-A.        
REMARK********************************************************************
NEWSCO*7800-TRU-REALIZAR-SCORE-A.        
REMARK* SE CONVIERTEN DE FORMA GENERAL LAS VARIABLES A NUMERICOS PARA    *
REMARK*           CR,BS,CC,OT                                            *
REMARK********************************************************************
ACIEME    INITIALIZE ADV-ACIERTA.                                       RMB0021 
ACIERT    IF IQ01X(4)(1:3) NOT =  IQ014                                 RMB0004 
ACIERT       DISPLAY "INCONSISTENCIA1  EN SISTEMA"                      RMB0004 
ACIERT       DISPLAY "IQ01X(4)=",IQ01X(4)                               RMB0004 
ACIERT       DISPLAY "IQ014   =",IQ014                                  RMB0004 
ACIERT    END-IF.                                                       RMB0004 
ACIERT    MOVE 1 TO I.                                                  RMB0004 
ACIERT    PERFORM UNTIL I > 272                                         RMB0004 
ACIERT       IF V-CARTERAS(I) NOT NUMERIC                               RMB0004 
ACIERT          MOVE 000 TO V-TCARTERAS(I)                              RMB0004 
ACIERT       ELSE                                                       RMB0004 
ACIERT          MOVE V-CARTERAS(I) TO V-TCARTERAS(I)                    RMB0004 
ACIERT       END-IF                                                     RMB0004 
ACIERT       ADD 1 TO I                                                 RMB0004 
ACIERT    END-PERFORM.                                                  RMB0004 
ACIERT    IF V-CARTERAS(272) NOT NUMERIC                                RMB0004 
ACIERT       IF TOT103 NOT = 0                                          RMB0004 
ACIERT          DISPLAY "INCONSISTENCIA2 EN SISTEMA"                    RMB0004 
ACIERT          DISPLAY "V-CARTERAS(272)=",V-CARTERAS(272)              RMB0004 
ACIERT          DISPLAY "TOT103       =",TOT103                         RMB0004 
ACIERT       END-IF                                                     RMB0004 
ACIERT    ELSE                                                          RMB0004 
ACIERT       IF TOT103 NOT = V-CARTERAS(272)                            RMB0004 
ACIERT          DISPLAY "INCONSISTENCIA3 EN SISTEMA"                    RMB0004 
ACIERT          DISPLAY "V-CARTERAS(272)=",V-CARTERAS(272)              RMB0004 
ACIERT          DISPLAY "TOT103       =",TOT103                         RMB0004 
ACIERT       END-IF                                                     RMB0004 
ACIERT    END-IF.                                                       RMB0004 
ACIERT    IF CR041 NOT NUMERIC MOVE 999 TO TCR041.                      RMB0004 
ACIERT    IF CR100 NOT NUMERIC MOVE 999 TO TCR100.                      RMB0004 
ACIERT    IF CR101 NOT NUMERIC MOVE 999 TO TCR101.                      RMB0004 
ACIERT    IF CR102 NOT NUMERIC MOVE 999 TO TCR102.                      RMB0004 
ACIERT    IF CR103 NOT NUMERIC MOVE 999 TO TCR103.                      RMB0004 
ACIERT    IF BS041 NOT NUMERIC MOVE 999 TO TBS041.                      RMB0004 
ACIERT    IF BS100 NOT NUMERIC MOVE 999 TO TBS100.                      RMB0004 
ACIERT    IF BS101 NOT NUMERIC MOVE 999 TO TBS101.                      RMB0004 
ACIERT    IF BS102 NOT NUMERIC MOVE 999 TO TBS102.                      RMB0004 
ACIERT    IF BS103 NOT NUMERIC MOVE 999 TO TBS103.                      RMB0004 
ACIERT    IF CC041 NOT NUMERIC MOVE 999 TO TCC041.                      RMB0004 
ACIERT    IF CC100 NOT NUMERIC MOVE 999 TO TCC100.                      RMB0004 
ACIERT    IF CC101 NOT NUMERIC MOVE 999 TO TCC101.                      RMB0004 
ACIERT    IF CC102 NOT NUMERIC MOVE 999 TO TCC102.                      RMB0004 
ACIERT    IF CC103 NOT NUMERIC MOVE 999 TO TCC103.                      RMB0004 
ACIERT    IF OT041 NOT NUMERIC MOVE 999 TO TOT041.                      RMB0004 
ACIERT    IF OT100 NOT NUMERIC MOVE 999 TO TOT100.                      RMB0004 
ACIERT    IF OT101 NOT NUMERIC MOVE 999 TO TOT101.                      RMB0004 
ACIERT    IF OT102 NOT NUMERIC MOVE 999 TO TOT102.                      RMB0004 
ACIERT    IF OT103 NOT NUMERIC MOVE 999 TO TOT103.                      RMB0004 
ACIERT************** OTRAS VARIABLES A CONVERTIR *********************  RMB0004 
ACIERT    IF CK001 NUMERIC MOVE CK001 TO TCK001 ELSE MOVE 0 TO TCK001.  RMB0004 
ACIERT    IF GD002 NUMERIC MOVE GD002 TO TGD002 ELSE MOVE 0 TO TGD002.  RMB0004 
ACIERT    IF GD010 NUMERIC MOVE GD010 TO TGD010 ELSE MOVE 0 TO TGD010.  RMB0004 
ACIERT    IF GD011 NUMERIC MOVE GD011 TO TGD011 ELSE MOVE 0 TO TGD011.  RMB0004 
ACIERT    IF GD012 NUMERIC MOVE GD012 TO TGD012 ELSE MOVE 0 TO TGD012.  RMB0004 
ACIERT    IF GD022 NUMERIC MOVE GD022 TO TGD022 ELSE MOVE 0 TO TGD022.  RMB0004 
ACIERT    IF GD023 NUMERIC MOVE GD023 TO TGD023 ELSE MOVE 0 TO TGD023.  RMB0004 
ACIERT    IF GD024 NUMERIC MOVE GD024 TO TGD024 ELSE MOVE 0 TO TGD024.  RMB0004 
ACIERT    IF GD032 NUMERIC MOVE GD032 TO TGD032 ELSE MOVE 0 TO TGD032.  RMB0004 
ACIERT    IF GD033 NUMERIC MOVE GD033 TO TGD033 ELSE MOVE 0 TO TGD033.  RMB0004 
ACIERT    IF GD034 NUMERIC MOVE GD034 TO TGD034 ELSE MOVE 0 TO TGD034.  RMB0004 
ACIERT    IF GD042 NUMERIC MOVE GD042 TO TGD042 ELSE MOVE 0 TO TGD042.  RMB0004 
ACIERT    IF GD043 NUMERIC MOVE GD043 TO TGD043 ELSE MOVE 0 TO TGD043.  RMB0004 
ACIERT    IF GD044 NUMERIC MOVE GD044 TO TGD044 ELSE MOVE 0 TO TGD044.  RMB0004 
ACIERT    IF GD050 NUMERIC MOVE GD050 TO TGD050 ELSE MOVE 0 TO TGD050.  RMB0004 
ACIERT    IF IQ001 NUMERIC MOVE IQ001 TO TIQ001 ELSE MOVE 0 TO TIQ001.  RMB0004 
ACIERT    IF IQ002 NUMERIC MOVE IQ002 TO TIQ002 ELSE MOVE 0 TO TIQ002.  RMB0004 
ACIERT    IF IQ012 NUMERIC MOVE IQ012 TO TIQ012 ELSE MOVE 0 TO TIQ012.  RMB0004 
ACIERT    IF IQ013 NUMERIC MOVE IQ013 TO TIQ013 ELSE MOVE 0 TO TIQ013.  RMB0004 
ACIERT    IF IQ014 NUMERIC MOVE IQ014 TO TIQ014 ELSE MOVE 0 TO TIQ014.  RMB0004 
ACIERT******************** VARIABLES A CONVERTIR DE VALORES >110 *****  RMB0004 
REMARK* LOS VALORES ESTAN ALMACENADOS EN LAS VARIABLES BAL111-BAL124(I)
REMARK* PRO112-PRO124(I) AND HIP111-HIP124, TOCA CONVERTIR CADA UNA
REMARK***************************************************************
ACIERT    IF CR111 NUMERIC MOVE CR111 TO TCR111 ELSE MOVE 0 TO TCR111.  RMB0004 
ACIERT    IF BS111 NUMERIC MOVE BS111 TO TBS111 ELSE MOVE 0 TO TBS111.  RMB0004 
ACIERT    IF OT111 NUMERIC MOVE OT111 TO TOT111 ELSE MOVE 0 TO TOT111.  RMB0004 
REMARK*****************************************************************
ACIERT    IF OT112 NUMERIC MOVE OT112 TO TOT112 ELSE MOVE 0 TO TOT112.  RMB0004 
ACIERT    IF AT112 NUMERIC MOVE AT112 TO TAT112 ELSE MOVE 0 TO TAT112.  RMB0004 
REMARK****************************************************************
ACIERT    IF BAL115(1)(5:1) = "-"                                       RMB0004 
ACIERT       MOVE 0 TO TCR115                                           RMB0004 
AC2003       MOVE BAL115(1)(1:6) TO CR115-NUM(1:6)                      RMB0006 
ACIERT    ELSE                                                          RMB0004 
ACIERT       MOVE "000000" TO TCR115(1:6)                               RMB0004 
ACIERT       MOVE BAL115(1)(1:3) TO TCR115(2:3)                         RMB0004 
ACIERT       MOVE BAL115(1)(5:2) TO TCR115(5:2)                         RMB0004 
AC2003       MOVE TCR115(1:6)    TO CR115-NUM(1:6)                      RMB0006 
ACIERT    END-IF.                                                       RMB0004 
REMARK****************************************************************
ACIERT    IF PRO116   (5:1) = "-"                                       RMB0004 
ACIERT       MOVE 0 TO TAT116                                           RMB0004 
AC2003       MOVE PRO116(1:6)    TO AT116-NUM(1:6)                      RMB0006 
ACIERT    ELSE                                                          RMB0004 
ACIERT       MOVE "000000" TO TAT116(1:6)                               RMB0004 
ACIERT       MOVE PRO116   (1:3) TO TAT116(2:3)                         RMB0004 
ACIERT       MOVE PRO116   (5:2) TO TAT116(5:2)                         RMB0004 
AC2003       MOVE TAT116(1:6)    TO AT116-NUM(1:6)                      RMB0006 
ACIERT    END-IF.                                                       RMB0004 
REMARK****************************************************************
ACIERT    IF BS118 NUMERIC MOVE BS118 TO TBS118 ELSE MOVE 0 TO TBS118.  RMB0004 
REMARK****************************************************************
ACIERT    IF BS119 NUMERIC MOVE BS119 TO TBS119 ELSE MOVE 0 TO TBS119.  RMB0004 
REMARK****************************************************************
ACIERT    IF CR120 NUMERIC MOVE CR120 TO TCR120 ELSE MOVE 0 TO TCR120.  RMB0004 
ACIERT    IF BS120 NUMERIC MOVE BS120 TO TBS120 ELSE MOVE 0 TO TBS120.  RMB0004 
REMARK****************************************************************
ACIERT    IF CR121 NUMERIC MOVE CR121 TO TCR121 ELSE MOVE 0 TO TCR121.  RMB0004 
ACIERT    IF BS121 NUMERIC MOVE BS121 TO TBS121 ELSE MOVE 0 TO TBS121.  RMB0004 
REMARK****************************************************************
ACIERT    IF CR122 NUMERIC MOVE CR122 TO TCR122 ELSE MOVE 0 TO TCR122.  RMB0004 
ACIERT    IF BS122 NUMERIC MOVE BS122 TO TBS122 ELSE MOVE 0 TO TBS122.  RMB0004 
ACIERT    IF MT122 NUMERIC MOVE MT122 TO TMT122 ELSE MOVE 0 TO TMT122.  RMB0004 
REMARK****************************************************************
ACIERT    IF BS123 NUMERIC MOVE BS123 TO TBS123 ELSE MOVE 0 TO TBS123.  RMB0004 
REMARK****************************************************************
ACIERT    IF BS124 NUMERIC MOVE BS124 TO TBS124 ELSE MOVE 0 TO TBS124.  RMB0004 
REMARK**********************FIN CONVERSION A NUMERICO DE VARIABLES *******
REMARK* SE CALCULAN LAS VARIABLES INICIALES QUE DECIDEN EN QUE SCORE CARD*
REMARK* SE CLASIFICA LA PERSONA A SER ANALIZADA                          *
REMARK********************************************************************
ACIERT    COMPUTE A-SUM001 = TCR001 + TBS001 + TCC001 + TOT001.         RMB0004 
ACIERT    MOVE 0 TO A-SCORE.                                            RMB0004 
ACIERT    IF A-SUM001 = 0 OR TIP-ID-ALE = 2 OR TIP-ID-ALE = 3           RMB0004 
ACIERT       PERFORM 7810-TRU-NO-SCORE                                  RMB0004 
ACIERT    ELSE                                                          RMB0004 
ACIERT       PERFORM 7815-VAR-SPLITS                                    RMB0004 
ACIERT       IF A-DERAT > 0                                             RMB0004 
ACIERT          MOVE 1 TO A-SCORE-CARD                                  RMB0004 
ACIERT          PERFORM 7820-TRU-SCORECARD01                            RMB0004 
ACIERT       ELSE                                                       RMB0004 
AC2003       IF (A-MOS120 >= 0 AND A-MOS120 <= 12 ) OR A-DEFI > 0 OR    RMB0006 
ACIERT                                  A-DIFF > 0 OR A-NREC > 0        RMB0004 
ACIERT          MOVE 2 TO A-SCORE-CARD                                  RMB0004 
ACIERT          PERFORM 7830-TRU-SCORECARD02                            RMB0004 
ACIERT       ELSE                                                       RMB0004 
ACIERT          IF TBS050 > 0 OR TCR050 > 0                             RMB0004 
ACIERT             MOVE 3 TO A-SCORE-CARD                               RMB0004 
ACIERT             PERFORM 7840-TRU-SCORECARD03                         RMB0004 
ACIERT          ELSE                                                    RMB0004 
ACIERT             IF A-CBAT60 > 0 OR A-CBAT90 > 0 OR A-CBAT120 > 0     RMB0004 
ACIERT                MOVE 4 TO A-SCORE-CARD                            RMB0004 
ACIERT                PERFORM 7850-TRU-SCORECARD04                      RMB0004 
ACIERT             ELSE                                                 RMB0004 
ACIERT                MOVE 5 TO A-SCORE-CARD                            RMB0004 
ACIERT                PERFORM 7860-TRU-SCORECARD05                      RMB0004 
ACIERT             END-IF                                               RMB0004 
ACIERT          END-IF                                                  RMB0004 
ACIERT       END-IF                                                     RMB0004 
ACIERT    END-IF.                                                       RMB0004 
FILT01    MOVE A-SCORE TO A-SCORE-REAL.                                 RMB0015 
FILT01    MOVE A-ADVERSE-RAZON(1) TO A-ADVERSE-RAZON-REAL(1).           RMB0015 
FILT01    MOVE A-ADVERSE-RAZON(2) TO A-ADVERSE-RAZON-REAL(2).           RMB0015 
FILT01    MOVE A-ADVERSE-RAZON(3) TO A-ADVERSE-RAZON-REAL(3).           RMB0015 
FILT01    MOVE A-ADVERSE-RAZON(4) TO A-ADVERSE-RAZON-REAL(4).           RMB0015 
FILT01    IF A-SCORE > 0                                                RMB0015 
FILT01       PERFORM 2000-FIL-POCA-HISTORIA-A.                          RMB0015 
ACIERT 7810-TRU-NO-SCORE.                                               RMB0004 
REMARK*********************************************************************
REMARK*7810-TRU-NO-SCORE.
REMARK* LA PERSONA QUE NO TIENE CUENTAS QUEDA CON 0 EN EL SCORE (SIN SCORE*
REMARK*********************************************************************
ACIERT    MOVE 0 TO A-SCORE.                                            RMB0004 
ACIERT    IF TIP-ID-ALE = 2 OR 3                                        RMB0004 
ACIERT       MOVE 70  TO  A-ADVERSE-RAZON(1)                            RMB0004 
ACIERT    ELSE                                                          RMB0004 
ACIERT       MOVE 71  TO  A-ADVERSE-RAZON(1)                            RMB0004 
ACIERT    END-IF.                                                       RMB0004 
ACIERT 7815-VAR-SPLITS.                                                 RMB0004 
REMARK*********************************************************************
REMARK*7815-VAR-SPLITS.
REMARK* SE CALCULAN LAS VARIABLES QUE DECIDEN A QUE SCORECARD SE CLASIFICA*
REMARK*********************************************************************
ACIERT    COMPUTE A-DERAT = TCR051 + TCR089 + TCR090 + TCR092 + TCR093 +RMB0004 
ACIERT                      TCR094 +                                    RMB0004 
ACIERT                      TBS051 + TBS089 + TBS090 + TBS092 + TBS093 +RMB0004 
ACIERT                      TBS094 +                                    RMB0004 
ACIERT                      TCC051 + TCC089 + TCC090 + TCC092 + TCC093 +RMB0004 
ACIERT                      TCC094 +                                    RMB0004 
ACIERT                      TOT051 + TOT089 + TOT090 + TOT092 + TOT093 +RMB0004 
ACIERT                      TOT094                                      RMB0004 
ACIERT*  A-MOS120 = MIN(TCR103,TBS103,TCC103,TOT103)                    RMB0004 
ACIERT*  USA 999 si es negativo                                         RMB0004 
ACIERT    MOVE TCR103 TO A-MOS120.                                      RMB0004 
ACIERT    IF A-MOS120 > TBS103                                          RMB0004 
ACIERT       MOVE TBS103 TO A-MOS120.                                   RMB0004 
ACIERT    IF A-MOS120 > TCC103                                          RMB0004 
ACIERT       MOVE TCC103 TO A-MOS120.                                   RMB0004 
ACIERT    IF A-MOS120 > TOT103                                          RMB0004 
ACIERT       MOVE TOT103 TO A-MOS120.                                   RMB0004 
ACIERT    COMPUTE A-DEFI = TGD022 + TGD032 + TGD042.                    RMB0004 
ACIERT    COMPUTE A-DIFF = TGD023 + TGD033 + TGD043.                    RMB0004 
ACIERT    COMPUTE A-NREC = TGD024 + TGD034 + TGD044.                    RMB0004 
ACIERT    COMPUTE A-CBAT60 = TCR057 + TCR061 + TCR065 + TCR068 +        RMB0004 
ACIERT                       TCR074 + TCR077 + TCR078 +                 RMB0004 
ACIERT                       TBS057 + TBS061 + TBS065 + TBS068 +        RMB0004 
ACIERT                       TBS074 + TBS077 + TBS078 +                 RMB0004 
ACIERT                       TCC057 + TCC061 + TCC065 + TCC068 +        RMB0004 
ACIERT                       TCC074 + TCC077 + TCC078 +                 RMB0004 
ACIERT                       TOT057 + TOT061 + TOT065 + TOT068 +        RMB0004 
ACIERT                       TOT074 + TOT077 + TOT078.                  RMB0004 
ACIERT    COMPUTE A-CBAT90 = TCR058 + TCR062 + TCR066 + TCR069 +        RMB0004 
ACIERT                       TCR070 + TCR075 + TCR079 + TCR081 +        RMB0004 
ACIERT                       TCR082 + TCR083 +                          RMB0004 
ACIERT                       TBS058 + TBS062 + TBS066 + TBS069 +        RMB0004 
ACIERT                       TBS070 + TBS075 + TBS079 + TBS081 +        RMB0004 
ACIERT                       TBS082 + TBS083 +                          RMB0004 
ACIERT                       TCC058 + TCC062 + TCC066 + TCC069 +        RMB0004 
ACIERT                       TCC070 + TCC075 + TCC079 + TCC081 +        RMB0004 
ACIERT                       TCC082 + TCC083 +                          RMB0004 
ACIERT                       TOT058 + TOT062 + TOT066 + TOT069 +        RMB0004 
ACIERT                       TOT070 + TOT075 + TOT079 + TOT081 +        RMB0004 
ACIERT                       TOT082 + TOT083                            RMB0004 
ACIERT    COMPUTE A-CBAT120 =TCR059 + TCR063 + TCR067 + TCR071 +        RMB0004 
ACIERT                      TCR072 + TCR073 + TCR076 + TCR080 +         RMB0004 
ACIERT                      TCR084 + TCR085 + TCR086 + TCR087 + TCR088 +RMB0004 
ACIERT                      TBS059 + TBS063 + TBS067 + TBS071 +         RMB0004 
ACIERT                      TBS072 + TBS073 + TBS076 + TBS080 +         RMB0004 
ACIERT                      TBS084 + TBS085 + TBS086 + TBS087 + TBS088 +RMB0004 
ACIERT                      TCC059 + TCC063 + TCC067 + TCC071 +         RMB0004 
ACIERT                      TCC072 + TCC073 + TCC076 + TCC080 +         RMB0004 
ACIERT                      TCC084 + TCC085 + TCC086 + TCC087 + TCC088 +RMB0004 
ACIERT                      TOT059 + TOT063 + TOT067 + TOT071 +         RMB0004 
ACIERT                      TOT072 + TOT073 + TOT076 + TOT080 +         RMB0004 
ACIERT                      TOT084 + TOT085 + TOT086 + TOT087 + TOT088. RMB0004 
NEWSCO 7820-TRU-SCORECARD01.
REMARK*********************************************************************
REMARK*7820-TRU-SCORECARD01.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA CON MORAS ALTAS O DEROGATORIO  *
REMARK*********************************************************************
ACIE01    COMPUTE A-CBAT60P = A-CBAT60 + A-CBAT90 + A-CBAT120 + A-DERAT.RMB0004 
ACIE01    COMPUTE A-COBKAT  = TCR092 + TCR093 + TCR094 +                RMB0004 
ACIE01                        TBS092 + TBS093 + TBS094 +                RMB0004 
ACIE01                        TCC092 + TCC093 + TCC094 +                RMB0004 
ACIE01                        TOT092 + TOT093 + TOT094.                 RMB0004 
ACIE01    COMPUTE A-CUREAT = TCR060 + TCR061 + TCR062 + TCR063 +        RMB0004 
ACIE01                       TCR068 + TCR069 + TCR070 + TCR071 +        RMB0004 
ACIE01                       TCR072 + TCR073 + TCR077 + TCR081 +        RMB0004 
ACIE01                       TCR082 + TCR085 + TCR086 + TCR087 +        RMB0004 
ACIE01                       TBS060 + TBS061 + TBS062 + TBS063 +        RMB0004 
ACIE01                       TBS068 + TBS069 + TBS070 + TBS071 +        RMB0004 
ACIE01                       TBS072 + TBS073 + TBS077 + TBS081 +        RMB0004 
ACIE01                       TBS082 + TBS085 + TBS086 + TBS087 +        RMB0004 
ACIE01                       TCC060 + TCC061 + TCC062 + TCC063 +        RMB0004 
ACIE01                       TCC068 + TCC069 + TCC070 + TCC071 +        RMB0004 
ACIE01                       TCC072 + TCC073 + TCC077 + TCC081 +        RMB0004 
ACIE01                       TCC082 + TCC085 + TCC086 + TCC087 +        RMB0004 
ACIE01                       TOT060 + TOT061 + TOT062 + TOT063 +        RMB0004 
ACIE01                       TOT068 + TOT069 + TOT070 + TOT071 +        RMB0004 
ACIE01                       TOT072 + TOT073 + TOT077 + TOT081 +        RMB0004 
ACIE01                       TOT082 + TOT085 + TOT086 + TOT087.         RMB0004 
ACIE01    IF A-CUREAT = 0                                               RMB0004 
ACIE01       IF CR060 NOT NUMERIC AND CR061 NOT NUMERIC AND             RMB0004 
ACIE01          CR062 NOT NUMERIC AND CR063 NOT NUMERIC AND             RMB0004 
ACIE01          CR068 NOT NUMERIC AND CR069 NOT NUMERIC AND             RMB0004 
ACIE01          CR070 NOT NUMERIC AND CR071 NOT NUMERIC AND             RMB0004 
ACIE01          CR072 NOT NUMERIC AND CR073 NOT NUMERIC AND             RMB0004 
ACIE01          CR077 NOT NUMERIC AND CR081 NOT NUMERIC AND             RMB0004 
ACIE01          CR082 NOT NUMERIC AND CR085 NOT NUMERIC AND             RMB0004 
ACIE01          CR086 NOT NUMERIC AND CR087 NOT NUMERIC AND             RMB0004 
ACIE01          BS060 NOT NUMERIC AND BS061 NOT NUMERIC AND             RMB0004 
ACIE01          BS062 NOT NUMERIC AND BS063 NOT NUMERIC AND             RMB0004 
ACIE01          BS068 NOT NUMERIC AND BS069 NOT NUMERIC AND             RMB0004 
ACIE01          BS070 NOT NUMERIC AND BS071 NOT NUMERIC AND             RMB0004 
ACIE01          BS072 NOT NUMERIC AND BS073 NOT NUMERIC AND             RMB0004 
ACIE01          BS077 NOT NUMERIC AND BS081 NOT NUMERIC AND             RMB0004 
ACIE01          BS082 NOT NUMERIC AND BS085 NOT NUMERIC AND             RMB0004 
ACIE01          BS086 NOT NUMERIC AND BS087 NOT NUMERIC AND             RMB0004 
ACIE01          CC060 NOT NUMERIC AND CC061 NOT NUMERIC AND             RMB0004 
ACIE01          CC062 NOT NUMERIC AND CC063 NOT NUMERIC AND             RMB0004 
ACIE01          CC068 NOT NUMERIC AND CC069 NOT NUMERIC AND             RMB0004 
ACIE01          CC070 NOT NUMERIC AND CC071 NOT NUMERIC AND             RMB0004 
ACIE01          CC072 NOT NUMERIC AND CC073 NOT NUMERIC AND             RMB0004 
ACIE01          CC077 NOT NUMERIC AND CC081 NOT NUMERIC AND             RMB0004 
ACIE01          CC082 NOT NUMERIC AND CC085 NOT NUMERIC AND             RMB0004 
ACIE01          CC086 NOT NUMERIC AND CC087 NOT NUMERIC AND             RMB0004 
ACIE01          OT060 NOT NUMERIC AND OT061 NOT NUMERIC AND             RMB0004 
ACIE01          OT062 NOT NUMERIC AND OT063 NOT NUMERIC AND             RMB0004 
ACIE01          OT068 NOT NUMERIC AND OT069 NOT NUMERIC AND             RMB0004 
ACIE01          OT070 NOT NUMERIC AND OT071 NOT NUMERIC AND             RMB0004 
ACIE01          OT072 NOT NUMERIC AND OT073 NOT NUMERIC AND             RMB0004 
ACIE01          OT077 NOT NUMERIC AND OT081 NOT NUMERIC AND             RMB0004 
ACIE01          OT082 NOT NUMERIC AND OT085 NOT NUMERIC AND             RMB0004 
ACIE01          OT086 NOT NUMERIC AND OT087 NOT NUMERIC                 RMB0004 
ACIE01          MOVE -1 TO A-CUREAT                                     RMB0004 
ACIE01        END-IF                                                    RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    PERFORM 7891-A-DEL2P.                                         RMB0004 
ACIE01*  MIN(TCR100,TBS100,TCC100,TOT100)                               RMB0004 
ACIERT*  USA 999 si es negativo                                         RMB0004 
ACIE01    MOVE TCR100 TO A-MOS30.                                       RMB0004 
ACIE01    IF A-MOS30 > TBS100                                           RMB0004 
ACIE01       MOVE TBS100 TO A-MOS30.                                    RMB0004 
ACIE01    IF A-MOS30 > TCC100                                           RMB0004 
ACIE01       MOVE TCC100 TO A-MOS30.                                    RMB0004 
ACIE01    IF A-MOS30 > TOT100                                           RMB0004 
ACIE01       MOVE TOT100 TO A-MOS30.                                    RMB0004 
ACIE01    PERFORM 7892-A-PCTCUR.                                        RMB0004 
ACIE01    COMPUTE A-PCTDER ROUNDED = 100 * A-DERAT / A-SUM001.          RMB0004 
ACIE01    PERFORM 7893-A-SUM002.                                        RMB0004 
ACIE01    COMPUTE A-SUM089 = TCR089 + TBS089 + TCC089 + TOT089.         RMB0004 
ACIE01    COMPUTE A-VRBS12 = TBS020 + TBS021 .                          RMB0004 
REMARK****************COMIENZO CALCULO PARA LA ECUACION *************
ACIE01    IF ID004 NOT NUMERIC                                          RMB0004 
ACIE01       MOVE 0 TO A-ID004X                                         RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       IF ID004 >= 780                                            RMB0004 
ACIE01          MOVE 780 TO A-ID004X                                    RMB0004 
ACIE01       ELSE                                                       RMB0004 
ACIE01         IF ID004 <= 216                                          RMB0004 
ACIE01            MOVE 0  TO A-ID004X                                   RMB0004 
ACIE01         ELSE                                                     RMB0004 
ACIE01            MOVE ID004 TO A-ID004X                                RMB0004 
ACIE01         END-IF                                                   RMB0004 
ACIE01      END-IF                                                      RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TBS055 >= 3 AND TBS055 <= 4                                RMB0004 
ACIE01       MOVE 1 TO A-BS055001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-BS055001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TBS055 >= 5                                                RMB0004 
ACIE01       MOVE 1 TO A-BS055002                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-BS055002                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TBS090 >= 1                                                RMB0004 
ACIE01       MOVE 1 TO A-BS090001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-BS090001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TBS093 >= 1                                                RMB0004 
ACIE01       MOVE 1 TO A-BS093001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-BS093001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TBS122 = 0 AND BS122 NUMERIC                               RMB0004 
ACIE01       MOVE 1 TO A-BS122001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-BS122001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TCC093 >= 1                                                RMB0004 
ACIE01       MOVE 1 TO A-CC093001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-CC093001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TCR093 >= 1                                                RMB0004 
ACIE01       MOVE 1 TO A-CR093001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-CR093001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TCR122 = 0 AND CR122 NUMERIC                               RMB0004 
ACIE01       MOVE 1 TO A-CR122001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-CR122001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-CUREAT >= 1                                              RMB0004 
ACIE01       MOVE 1 TO A-CUREAT01                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-CUREAT01                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
CONS01*   IF TIQ014 = 0 AND IQ014 NUMERIC                               RMB0004 
CONS01    IF TIQ014 = 0 OR  IQ014 NOT NUMERIC                           RMB0010 
ACIE01       MOVE 1 TO A-IQ014001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-IQ014001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF TMT122 >= 1                                                RMB0004 
ACIE01       MOVE 1 TO A-MT122001                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-MT122001                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-PCTCUR >= 13 AND A-PCTCUR <= 16                          RMB0004 
ACIE01       MOVE 1 TO A-PCTCUR01                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-PCTCUR01                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
REAL01*   IF A-PCTCUR >= 17 AND A-PCTCUR <= 20                          RMB0007 
REAL01*      MOVE 1 TO A-PCTCUR02                                       RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-PCTCUR02                                       RMB0007 
REAL01*   END-IF.                                                       RMB0007 
REAL01    IF A-PCTCUR >= 17 AND A-PCTCUR <= 32                          RMB0007 
REAL01       MOVE 1 TO A-PCTCUR02                                       RMB0007 
REAL01    ELSE                                                          RMB0007 
REAL01       MOVE 0 TO A-PCTCUR02                                       RMB0007 
REAL01    END-IF.                                                       RMB0007 
REAL01    IF A-PCTCUR >= 33 AND A-PCTCUR <= 43                          RMB0007 
REAL01       MOVE 1 TO A-PCTCUR03                                       RMB0007 
REAL01    ELSE                                                          RMB0007 
REAL01       MOVE 0 TO A-PCTCUR03                                       RMB0007 
REAL01    END-IF.                                                       RMB0007 
REAL01    IF A-PCTCUR >= 44 AND A-PCTCUR <= 63                          RMB0007 
REAL01       MOVE 1 TO A-PCTCUR04                                       RMB0007 
REAL01    ELSE                                                          RMB0007 
REAL01       MOVE 0 TO A-PCTCUR04                                       RMB0007 
REAL01    END-IF.                                                       RMB0007 
REAL01    IF A-PCTCUR >= 64 AND A-PCTCUR <= 100                         RMB0007 
REAL01       MOVE 1 TO A-PCTCUR05                                       RMB0007 
REAL01    ELSE                                                          RMB0007 
REAL01       MOVE 0 TO A-PCTCUR05                                       RMB0007 
REAL01    END-IF.                                                       RMB0007 
REMARK*   OJO Si todos son -1 queda en cero,falta definir que hacer
REMARK*   SEGUN e-mail si es -1 se debe comportar como 0
ACIE01    IF A-PCTDER >= 0  AND A-PCTDER <= 14                          RMB0004 
ACIE01       MOVE 1 TO A-PCTDER01                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-PCTDER01                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-SUM002 = 6                                               RMB0004 
ACIE01       MOVE 1 TO A-SUM00201                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-SUM00201                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-SUM002 >= 7 AND A-SUM002 <= 8                            RMB0004 
ACIE01       MOVE 1 TO A-SUM00202                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-SUM00202                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-SUM002 >= 9                                              RMB0004 
ACIE01       MOVE 1 TO A-SUM00203                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-SUM00203                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
REMARK*   OJO CON ESTA PREGUNTA !!!!!!
ACIE01    IF A-VRBS12 > 0 OR ( BS020 NOT NUMERIC AND BS021 NOT NUMERIC) RMB0004 
ACIE01       MOVE 0 TO A-VRBS1201                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 1 TO A-VRBS1201                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-SUM089 >= 1                                              RMB0004 
ACIE01       MOVE 1 TO A-SUM08901                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-SUM08901                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-CBAT60P = 3                                              RMB0004 
ACIE01       MOVE 1 TO A-CBAT60P1                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-CBAT60P1                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-CBAT60P = 4                                              RMB0004 
ACIE01       MOVE 1 TO A-CBAT60P2                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-CBAT60P2                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-CBAT60P >= 5                                             RMB0004 
ACIE01       MOVE 1 TO A-CBAT60P3                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-CBAT60P3                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-COBKAT = 0                                               RMB0004 
ACIE01       MOVE 1 TO A-COBKAT01                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-COBKAT01                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
ACIE01    IF A-COBKAT = 2                                               RMB0004 
ACIE01       MOVE 1 TO A-COBKAT02                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-COBKAT02                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
REAL01    IF A-COBKAT >= 3                                              RMB0007 
ACIE01       MOVE 1 TO A-COBKAT03                                       RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-COBKAT03                                       RMB0004 
ACIE01    END-IF.                                                       RMB0004 
REAL01*   IF A-COBKAT >= 4                                              RMB0007 
REAL01*      MOVE 1 TO A-COBKAT04                                       RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-COBKAT04                                       RMB0007 
REAL01*   END-IF.                                                       RMB0007 
ACIE01    IF A-DEL2P >= 1                                               RMB0004 
ACIE01       MOVE 1 TO A-DEL2P01                                        RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-DEL2P01                                        RMB0004 
ACIE01    END-IF.                                                       RMB0004 
REAL01    IF A-MOS30 >= 0 AND A-MOS30 <=2                               RMB0007 
ACIE01       MOVE 1 TO A-MOS3001                                        RMB0004 
ACIE01    ELSE                                                          RMB0004 
ACIE01       MOVE 0 TO A-MOS3001                                        RMB0004 
ACIE01    END-IF.                                                       RMB0004 
REAL02    IF A-MOS30 = 3                                                RMB0007 
REAL01       MOVE 1 TO A-MOS3002                                        RMB0007 
REAL01    ELSE                                                          RMB0007 
REAL01       MOVE 0 TO A-MOS3002                                        RMB0007 
REAL01    END-IF.                                                       RMB0007 
REAL01*   IF A-MOS30 = 3                                                RMB0007 
REAL01*      MOVE 1 TO A-MOS3003                                        RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-MOS3003                                        RMB0007 
REAL01*   END-IF.                                                       RMB0007 
REAL01    COMPUTE A-SCORE ROUNDED = 349           +                     RMB0007 
REAL01                    +16      * A-BS055001   +                     RMB0007 
REAL01                    +24      * A-BS055002   +                     RMB0007 
REAL01                    -41      * A-BS090001   +                     RMB0007 
REAL01                   +134      * A-BS093001   +                     RMB0007 
REAL01                    +28      * A-BS122001   +                     RMB0007 
REAL01                   +137      * A-CC093001   +                     RMB0007 
REAL01                   +137      * A-CR093001   +                     RMB0007 
REAL01                    +27      * A-CR122001   +                     RMB0007 
REAL01                    +46      * A-CUREAT01   +                     RMB0007 
REAL01                    +23      * A-IQ014001   +                     RMB0007 
REAL01                    -45      * A-MT122001   +                     RMB0007 
REAL01                    +42      * A-PCTCUR01   +                     RMB0007 
REAL01                    +59      * A-PCTCUR02   +                     RMB0007 
REAL01                    +70      * A-PCTCUR03   +                     RMB0007 
REAL01                   +081      * A-PCTCUR04   +                     RMB0007 
REAL01                   +100      * A-PCTCUR05   +                     RMB0007 
REAL01***********        +127      * A-PCTCUR06   +                     RMB0007 
REAL01                    +17      * A-PCTDER01   +                     RMB0007 
REAL01                    -40      * A-SUM00201   +                     RMB0007 
REAL01                    -46      * A-SUM00202   +                     RMB0007 
REAL01                    -61      * A-SUM00203   +                     RMB0007 
REAL01                    -26      * A-VRBS1201   +                     RMB0007 
REAL01                    -39      * A-SUM08901   +                     RMB0007 
REAL01                    -57      * A-CBAT60P1   +                     RMB0007 
REAL01                    -80      * A-CBAT60P2   +                     RMB0007 
REAL01                    -96      * A-CBAT60P3   +                     RMB0007 
REAL01                   +060      * A-COBKAT01   +                     RMB0007 
REAL01                    -38      * A-COBKAT02   +                     RMB0007 
REAL01                    -52      * A-COBKAT03   +                     RMB0007 
REAL01****************    -71      * A-COBKAT04   +                     RMB0007 
REAL01                    -49      * A-DEL2P01    +                     RMB0007 
REAL01                    -42      * A-MOS3001    +                     RMB0007 
REAL01                    -32      * A-MOS3002    +                     RMB0007 
REAL01****************    -47      * A-MOS3003    +                     RMB0007 
REAL01                    +0.061   * A-ID004X     .                     RMB0007 
ACIE01    IF A-SCORE <= 150 MOVE 150 TO A-SCORE.                        RMB0004 
ACIE01    IF A-SCORE >= 850 MOVE 850 TO A-SCORE.                        RMB0004 
REMARK****************COMIENZO CALCULO PARA LAS RAZONES *************
REAL01    PERFORM 8005-A-PREPARE-AA.                                    RMB0007 
REAL01    IF TCC093 = 0 AND CC093 NUMERIC                               RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 137 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TCR093 = 0 AND CR093 NUMERIC                               RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 137 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS093 = 0 AND BS093 NUMERIC                               RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 134 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-COBKAT >= 3                                              RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 112 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUR >= 0 AND A-PCTCUR <= 12                           RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 100 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-COBKAT = 2                                               RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 098 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-CBAT60P >= 5                                             RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 096 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-CBAT60P = 4                                              RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 080 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-SUM002 >= 9                                              RMB0007 
REAL01       MOVE 10 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 061 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-COBKAT = 1                                               RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 060 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUR >= 13 AND A-PCTCUR <= 16                          RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 058 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-CBAT60P = 3                                              RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 057 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-DEL2P >= 1                                               RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 049 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-CUREAT = 0                                               RMB0007 
REAL01       MOVE 43 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 046 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-SUM002 = 7 OR 8                                          RMB0007 
REAL01       MOVE 10 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 046 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TMT122 >= 1 AND MT122 NUMERIC                              RMB0007 
REAL01       MOVE 42 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 045 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL02    IF A-MOS30 >= 0 AND A-MOS30 <= 2                              RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 042 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS090 >= 1 AND BS090 NUMERIC                              RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 041 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUR >= 17 AND A-PCTCUR <= 32                          RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 041 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-SUM002 = 6                                               RMB0007 
REAL01       MOVE 10 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 040 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-SUM089 >= 1                                              RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 039 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL02    IF A-MOS30 = 3                                                RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 032 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUR >= 33 AND A-PCTCUR <= 43                          RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 030 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS122 >= 1 AND BS122 NUMERIC                              RMB0007 
REAL01       MOVE 42 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 028 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TCR122 >= 1 AND CR122 NUMERIC                              RMB0007 
REAL01       MOVE 42 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 027 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL02    IF A-VRBS12 = 0                                               RMB0007 
REAL01       MOVE 44 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 026 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS055 >= 0 AND TBS055 <= 2 AND BS055 NUMERIC              RMB0007 
REAL01       MOVE 46 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 024 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TIQ014 >= 1 AND IQ014 NUMERIC                              RMB0007 
REAL01       MOVE 20 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 023 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUR >= 44 AND A-PCTCUR <= 63                          RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 019 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTDER >= 15 AND A-PCTCUR <= 100                         RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 017 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS055 = 3 OR 4                                            RMB0007 
REAL01       MOVE 46 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 008 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-MOS30 = 0 OR 1                                           RMB0007 
REAL01***    MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 062 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-PCTCUR >= 44 AND A-PCTCUR <= 63                          RMB0007 
REAL01***    MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 010 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-COBKAT = 3                                               RMB0007 
REAL01***    MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 199 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
CARD02 7830-TRU-SCORECARD02.
REMARK*********************************************************************
REMARK*7830-TRU-SCORECARD02.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA CON CTA CORRIENTES Y NO TARJET.*
REMARK*********************************************************************
REAL01***PERFORM 7897-A-AOT.                                            RMB0007 
REAL01*** COMPUTE A-CBBS90P =                                           RMB0007 
REAL01***                   TBS058 + TBS062 + TBS066 + TBS069 + TBS070 +RMB0007 
REAL01***                   TBS075 + TBS079 + TBS081 + TBS082 + TBS083 +RMB0007 
REAL01***                   TBS059 + TBS063 + TBS067 + TBS071 + TBS072 +RMB0007 
REAL01***                   TBS073 + TBS076 + TBS080 + TBS084 + TBS085 +RMB0007 
REAL01***                   TBS086 + TBS087 + TBS088 +                  RMB0007 
REAL01***                   TBS051 + TBS089 + TBS090 + TBS092 + TBS093 +RMB0007 
REAL01***                   TBS094 .                                    RMB0007 
ACIE02    PERFORM 7891-A-DEL2P.                                         RMB0004 
ACIE02*  A-MOSBS30P = MIN(TBS103,TBS102,TBS101,TBS100)                  RMB0004 
ACIE02*  NO USA 999 si es negativo lo deja en -1                        RMB0004 
ACIE02    MOVE TBS103 TO A-MOSBS30P.                                    RMB0004 
ACIE02    IF A-MOSBS30P > TBS102                                        RMB0004 
ACIE02       MOVE TBS102 TO A-MOSBS30P.                                 RMB0004 
ACIE02    IF A-MOSBS30P > TBS101                                        RMB0004 
ACIE02       MOVE TBS101 TO A-MOSBS30P.                                 RMB0004 
ACIE02    IF A-MOSBS30P > TBS100                                        RMB0004 
ACIE02       MOVE TBS100 TO A-MOSBS30P.                                 RMB0004 
ACIE02    IF BS103 NOT NUMERIC AND                                      RMB0004 
ACIE02       BS102 NOT NUMERIC AND                                      RMB0004 
ACIE02       BS101 NOT NUMERIC AND                                      RMB0004 
ACIE02       BS100 NOT NUMERIC                                          RMB0004 
ACIE02       MOVE -1 TO A-MOSBS30P                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
ACIE02*  A-MOSCC30P = MIN(TCC103,TCC102,TCC101,TCC100)                  RMB0004 
ACIE02*  NO USA 999 si es negativo lo deja en -1                        RMB0004 
ACIE02    MOVE TCC103 TO A-MOSCC30P.                                    RMB0004 
ACIE02    IF A-MOSCC30P > TCC102                                        RMB0004 
ACIE02       MOVE TCC102 TO A-MOSCC30P.                                 RMB0004 
ACIE02    IF A-MOSCC30P > TCC101                                        RMB0004 
ACIE02       MOVE TCC101 TO A-MOSCC30P.                                 RMB0004 
ACIE02    IF A-MOSCC30P > TCC100                                        RMB0004 
ACIE02       MOVE TCC100 TO A-MOSCC30P.                                 RMB0004 
ACIE02    IF CC103 NOT NUMERIC AND                                      RMB0004 
ACIE02       CC102 NOT NUMERIC AND                                      RMB0004 
ACIE02       CC101 NOT NUMERIC AND                                      RMB0004 
ACIE02       CC100 NOT NUMERIC                                          RMB0004 
ACIE02       MOVE -1 TO A-MOSCC30P                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
ACIE02*  A-MOSCR30P = MIN(TCR103,TCR102,TCR101,TCR100)                  RMB0004 
ACIE02*  NO USA 999 si es negativo lo deja en -1                        RMB0004 
ACIE02    MOVE TCR103 TO A-MOSCR30P.                                    RMB0004 
ACIE02    IF A-MOSCR30P > TCR102                                        RMB0004 
ACIE02       MOVE TCR102 TO A-MOSCR30P.                                 RMB0004 
ACIE02    IF A-MOSCR30P > TCR101                                        RMB0004 
ACIE02       MOVE TCR101 TO A-MOSCR30P.                                 RMB0004 
ACIE02    IF A-MOSCR30P > TCR100                                        RMB0004 
ACIE02       MOVE TCR100 TO A-MOSCR30P.                                 RMB0004 
ACIE02    IF CR103 NOT NUMERIC AND                                      RMB0004 
ACIE02       CR102 NOT NUMERIC AND                                      RMB0004 
ACIE02       CR101 NOT NUMERIC AND                                      RMB0004 
ACIE02       CR100 NOT NUMERIC                                          RMB0004 
ACIE02       MOVE -1 TO A-MOSCR30P                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
ACIE02    PERFORM 7894-A-NUMUTCR75.                                     RMB0004 
ACIE02    PERFORM 7895-A-PCTCUROP.                                      RMB0004 
ACIE02    PERFORM 7896-A-RECDEL.                                        RMB0004 
ACIE02    PERFORM 7893-A-SUM002.                                        RMB0004 
REAL01*** IF TOT112  >= 3037                                            RMB0007 
REAL01***    MOVE 3037 TO A-OT112001                                    RMB0007 
REAL01*** ELSE                                                          RMB0007 
REAL01***    MOVE TOT112 TO A-OT112001                                  RMB0007 
REAL01*** END-IF.                                                       RMB0007 
REMARK****************COMIENZO CALCULO PARA LA ECUACION *************
ACIE02    IF ID004 NOT NUMERIC                                          RMB0004 
ACIE02       MOVE 0 TO A-ID004X                                         RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       IF ID004 >= 794                                            RMB0004 
ACIE02          MOVE 794 TO A-ID004X                                    RMB0004 
ACIE02       ELSE                                                       RMB0004 
ACIE02          MOVE ID004 TO A-ID004X                                  RMB0004 
ACIE02       END-IF                                                     RMB0004 
ACIE02    END-IF.                                                       RMB0004 
ACIE02    IF TBS124  >= 269                                             RMB0004 
ACIE02       MOVE 1 TO A-BS124001                                       RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-BS124001                                       RMB0004 
ACIE02    END-IF.                                                       RMB0004 
ACIE02    IF A-MOSCC30P  >= 0 AND A-MOSCC30P <= 1                       RMB0004 
ACIE02       MOVE 1 TO A-MOSCC30P1                                      RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-MOSCC30P1                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01*** IF A-MOSCC30P  = 2                                            RMB0007 
REAL01***    MOVE 1 TO A-MOSCC30P2                                      RMB0007 
REAL01*** ELSE                                                          RMB0007 
REAL01***    MOVE 0 TO A-MOSCC30P2                                      RMB0007 
REAL01*** END-IF.                                                       RMB0007 
ACIE02    IF TOT067  >= 1                                               RMB0004 
ACIE02       MOVE 1 TO A-OT067001                                       RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-OT067001                                       RMB0004 
ACIE02    END-IF.                                                       RMB0004 
ACIE02    IF A-MOSBS30P  >= 0 AND A-MOSBS30P <= 1                       RMB0004 
ACIE02       MOVE 1 TO A-MOSBS30P1                                      RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-MOSBS30P1                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01    IF A-MOSBS30P  = 999                                          RMB0007 
ACIE02       MOVE 1 TO A-MOSBS30P2                                      RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-MOSBS30P2                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01*** IF A-MOSBS30P  = 999                                          RMB0007 
REAL01***    MOVE 1 TO A-MOSBS30P3                                      RMB0007 
REAL01*** ELSE                                                          RMB0007 
REAL01***    MOVE 0 TO A-MOSBS30P3                                      RMB0007 
REAL01*** END-IF.                                                       RMB0007 
ACIE02    IF A-MOSCR30P  >= 0 AND A-MOSCR30P <= 1                       RMB0004 
ACIE02       MOVE 1 TO A-MOSCR30P1                                      RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-MOSCR30P1                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
ACIE02    IF A-DEL2P >= 1                                               RMB0004 
ACIE02       MOVE 1 TO A-DEL2P01                                        RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-DEL2P01                                        RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01    IF A-PCTCUROP  >= 67 AND A-PCTCUROP <= 82                     RMB0007 
ACIE02       MOVE 1 TO A-PCTCUROP1                                      RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-PCTCUROP1                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01    IF A-PCTCUROP  >= 83                                          RMB0007 
ACIE02       MOVE 1 TO A-PCTCUROP2                                      RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-PCTCUROP2                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01*   IF A-PCTCUROP  >= 83                                          RMB0007 
REAL01*      MOVE 1 TO A-PCTCUROP3                                      RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-PCTCUROP3                                      RMB0007 
REAL01*   END-IF.                                                       RMB0007 
REAL01*   IF A-CBBS90P  >= 2                                            RMB0007 
REAL01*      MOVE 1 TO A-CBBS90P1                                       RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-CBBS90P1                                       RMB0007 
REAL01*   END-IF.                                                       RMB0007 
ACIE02    IF A-NUMUTCR75 = 0                                            RMB0004 
ACIE02       MOVE 1 TO A-NUMUTCR751                                     RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-NUMUTCR751                                     RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01*   IF A-AOT >= 0 AND A-AOT <= 19                                 RMB0007 
REAL01*      MOVE 1 TO A-AOT00001                                       RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-AOT00001                                       RMB0007 
REAL01*   END-IF.                                                       RMB0007 
ACIE02    IF A-SUM002 >= 7                                              RMB0004 
ACIE02       MOVE 1 TO A-SUM00201                                       RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-SUM00201                                       RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01    IF A-RECDEL >= 4 OR  A-RECDEL = 999                           RMB0007 
ACIE02       MOVE 1 TO A-RECDEL01                                       RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE 0 TO A-RECDEL01                                       RMB0004 
ACIE02    END-IF.                                                       RMB0004 
REAL01*** IF A-RECDEL >= 8 OR  A-RECDEL = 999                           RMB0007 
REAL01***    MOVE 1 TO A-RECDEL02                                       RMB0007 
REAL01*** ELSE                                                          RMB0007 
REAL01***    MOVE 0 TO A-RECDEL02                                       RMB0007 
REAL01*** END-IF.                                                       RMB0007 
REAL03    COMPUTE A-SCORE ROUNDED = 536           +                     RMB0007 
REAL03                    -54      * A-BS124001   +                     RMB0007 
REAL03                    -129     * A-MOSCC30P1  +                     RMB0007 
REAL03                    -144     * A-OT067001   +                     RMB0007 
REAL03                    -079     * A-MOSBS30P1  +                     RMB0007 
REAL03                    +19      * A-MOSBS30P2  +                     RMB0007 
REAL03                    -047     * A-MOSCR30P1  +                     RMB0007 
REAL03                    -37      * A-DEL2P01    +                     RMB0007 
REAL03                    +33      * A-PCTCUROP1  +                     RMB0007 
REAL03                    +42      * A-PCTCUROP2  +                     RMB0007 
REAL03                    +26      * A-NUMUTCR751 +                     RMB0007 
REAL03                    -08      * A-SUM00201   +                     RMB0007 
REAL03                    +46      * A-RECDEL01   +                     RMB0007 
REAL03                    +0.042   * A-ID004X     .                     RMB0007 
ACIE02    IF A-SCORE <= 150 MOVE 150 TO A-SCORE.                        RMB0004 
ACIE02    IF A-SCORE >= 850 MOVE 850 TO A-SCORE.                        RMB0004 
REMARK****************COMIENZO CALCULO PARA LAS RAZONES *************
ACIE02    PERFORM 8005-A-PREPARE-AA.                                    RMB0004 
REAL01    IF TOT067 >= 1 AND OT067 NUMERIC                              RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 144 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-MOSCC30P = 0 OR 1                                        RMB0007 
REAL01       MOVE 01 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 129 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-MOSBS30P = 0 OR 1                                        RMB0007 
REAL02       MOVE 33 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 098 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS124 >= 269                                              RMB0007 
REAL01       MOVE 42 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 054 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-MOSCR30P = 0 OR 1                                        RMB0007 
REAL01       MOVE 02 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 047 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-RECDEL >= 0 AND A-RECDEL <= 3                            RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 046 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUROP >= 0 AND A-PCTCUROP <= 66                       RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 042 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-DEL2P  >= 1                                              RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 037 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-NUMUTCR75 >= 1                                           RMB0007 
REAL01       MOVE 48 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 026 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL02    IF A-MOSBS30P >= 2 AND A-MOSBS30P <= 998                      RMB0007 
REAL02       MOVE 33 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 019 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUROP >= 67 AND A-PCTCUROP <= 82                      RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 009 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-SUM002 >= 7                                              RMB0007 
REAL01       MOVE 10 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 008 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-MOSCC30P = 2                                             RMB0007 
REAL01***    MOVE 01 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 045 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-CBBS90P >= 2                                             RMB0007 
REAL01***    MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 026 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-PCTCUROP >= 75 AND A-PCTCUROP <= 82                      RMB0007 
REAL01***    MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 023 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-MOSBS30P >= 3                                            RMB0007 
REAL01***    MOVE 33 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 020 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-AOT >= 0 AND A-AOT <= 19                                 RMB0007 
REAL01***    MOVE 06 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 014 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-RECDEL >= 4 AND A-RECDEL <= 7                            RMB0007 
REAL01***    MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 009 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REMARK************COMIENZO VARIABLES CONTINUAS ***************************
REAL01*** IF TOT112  >   0                                              RMB0007 
REAL01***    COMPUTE A-TEMP1 = TOT112 * 0.00875                         RMB0007 
REAL01***    MOVE 42 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    PERFORM 8001-A-INSERTE-CONTINUA.                           RMB0007 
REMARK*********************************************************************
ACIE03 7840-TRU-SCORECARD03.                                            RMB0004 
REMARK*********************************************************************
REMARK*7840-TRU-SCORECARD03.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA CON CTA CORRIENTES Y TARJETAS  *
REMARK*********************************************************************
ACIE03*  MIN(TCR041,TBS041,TCC041,TOT041)                               RMB0004 
ACIE03*   USA 999 si es negativo                                        RMB0004 
ACIE03    MOVE TCR041 TO A-AYT.                                         RMB0004 
ACIE03    IF A-AYT > TBS041                                             RMB0004 
ACIE03       MOVE TBS041 TO A-AYT.                                      RMB0004 
ACIE03    IF A-AYT > TCC041                                             RMB0004 
ACIE03       MOVE TCC041 TO A-AYT.                                      RMB0004 
ACIE03    IF A-AYT > TOT041                                             RMB0004 
ACIE03       MOVE TOT041 TO A-AYT.                                      RMB0004 
ACIE03    COMPUTE A-CBAT120P =                                          RMB0004 
ACIE03                      TCR051 + TCR059 + TCR063 + TCR067 + TCR071 +RMB0004 
ACIE03                      TCR072 + TCR073 + TCR076 + TCR080 + TCR084 +RMB0004 
ACIE03                      TCR085 + TCR086 + TCR087 + TCR088 + TCR089 +RMB0004 
ACIE03                      TCR090 + TCR092 + TCR093 + TCR094 +         RMB0004 
ACIE03                      TBS051 + TBS059 + TBS063 + TBS067 + TBS071 +RMB0004 
ACIE03                      TBS072 + TBS073 + TBS076 + TBS080 + TBS084 +RMB0004 
ACIE03                      TBS085 + TBS086 + TBS087 + TBS088 + TBS089 +RMB0004 
ACIE03                      TBS090 + TBS092 + TBS093 + TBS094 +         RMB0004 
ACIE03                      TCC051 + TCC059 + TCC063 + TCC067 + TCC071 +RMB0004 
ACIE03                      TCC072 + TCC073 + TCC076 + TCC080 + TCC084 +RMB0004 
ACIE03                      TCC085 + TCC086 + TCC087 + TCC088 + TCC089 +RMB0004 
ACIE03                      TCC090 + TCC092 + TCC093 + TCC094 +         RMB0004 
ACIE03                      TOT051 + TOT059 + TOT063 + TOT067 + TOT071 +RMB0004 
ACIE03                      TOT072 + TOT073 + TOT076 + TOT080 + TOT084 +RMB0004 
ACIE03                      TOT085 + TOT086 + TOT087 + TOT088 + TOT089 +RMB0004 
ACIE03                      TOT090 + TOT092 + TOT093 + TOT094.          RMB0004 
ACIE03    COMPUTE A-CBBS39 = TBS056 + TBS060 + TBS064 +                 RMB0004 
ACIE03                       TBS057 + TBS061 + TBS065 + TBS068 +        RMB0004 
ACIE03                       TBS074 + TBS077 + TBS078 +                 RMB0004 
ACIE03                       TBS058 + TBS062 + TBS066 + TBS069 +        RMB0004 
ACIE03                       TBS070 + TBS075 + TBS079 + TBS081 +        RMB0004 
ACIE03                       TBS082 + TBS083.                           RMB0004 
ACIE03    COMPUTE A-CBCR30P = TCR056 + TCR060 + TCR064 +                RMB0004 
ACIE03                        TCR057 + TCR061 + TCR065 + TCR068 +       RMB0004 
ACIE03                        TCR074 + TCR077 + TCR078 +                RMB0004 
ACIE03                        TCR058 + TCR062 + TCR066 + TCR069 +       RMB0004 
ACIE03                        TCR070 + TCR075 + TCR079 + TCR081 +       RMB0004 
ACIE03                        TCR082 + TCR083 +                         RMB0004 
ACIE03                        TCR059 + TCR063 + TCR067 + TCR071 +       RMB0004 
ACIE03                        TCR072 + TCR073 + TCR076 + TCR080 +       RMB0004 
ACIE03                        TCR084 + TCR085 + TCR086 + TCR087 +       RMB0004 
ACIE03                        TCR088 +                                  RMB0004 
ACIE03                        TCR051 + TCR089 + TCR090 + TCR092 +       RMB0004 
ACIE03                        TCR093 + TCR094.                          RMB0004 
ACIE02    PERFORM 7894-A-NUMUTCR75.                                     RMB0004 
ACIE03    COMPUTE A-OPCC12 = TCC030 + TCC031.                           RMB0004 
ACIE03    COMPUTE A-OPOT18 = TOT030 + TOT031 + TOT032.                  RMB0004 
ACIE03    COMPUTE A-CBAT69 =                                            RMB0004 
ACIE03                      TCR057 + TCR061 + TCR065 + TCR068 + TCR074 +RMB0004 
ACIE03                      TCR077 + TCR078 + TCR058 + TCR062 + TCR066 +RMB0004 
ACIE03                      TCR069 + TCR070 + TCR075 + TCR079 + TCR081 +RMB0004 
ACIE03                      TCR082 + TCR083 +                           RMB0004 
ACIE03                      TBS057 + TBS061 + TBS065 + TBS068 + TBS074 +RMB0004 
ACIE03                      TBS077 + TBS078 + TBS058 + TBS062 + TBS066 +RMB0004 
ACIE03                      TBS069 + TBS070 + TBS075 + TBS079 + TBS081 +RMB0004 
ACIE03                      TBS082 + TBS083 +                           RMB0004 
ACIE03                      TCC057 + TCC061 + TCC065 + TCC068 + TCC074 +RMB0004 
ACIE03                      TCC077 + TCC078 + TCC058 + TCC062 + TCC066 +RMB0004 
ACIE03                      TCC069 + TCC070 + TCC075 + TCC079 + TCC081 +RMB0004 
ACIE03                      TCC082 + TCC083 +                           RMB0004 
ACIE03                      TOT057 + TOT061 + TOT065 + TOT068 + TOT074 +RMB0004 
ACIE03                      TOT077 + TOT078 + TOT058 + TOT062 + TOT066 +RMB0004 
ACIE03                      TOT069 + TOT070 + TOT075 + TOT079 + TOT081 +RMB0004 
ACIE03                      TOT082 + TOT083.                            RMB0004 
ACIE03    COMPUTE A-PCT69  ROUNDED = 100 * A-CBAT69 / A-SUM001.         RMB0004 
ACIE03    PERFORM 7896-A-RECDEL.                                        RMB0004 
REMARK*   Variables directas de la formula
ACIE03    IF ID004 NOT NUMERIC                                          RMB0004 
ACIE03       MOVE 0 TO A-MESES                                          RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       IF ID004 >= 780                                            RMB0004 
ACIE03          MOVE 780 TO A-MESES                                     RMB0004 
ACIE03       ELSE                                                       RMB0004 
ACIE03          MOVE ID004 TO A-MESES                                   RMB0004 
ACIE03       END-IF                                                     RMB0004 
ACIE03    END-IF.                                                       RMB0004 
AC2003    IF AT116-NUM NOT NUMERIC                                      RMB0006 
ACIE03       MOVE 0 TO A-AT116001                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03*      IF TAT116 >= 0 AND TAT116 <= 20                            RMB0004 
ACIE03       COMPUTE TAT116-ROUNDED ROUNDED = TAT116                    RMB0004 
ACIE03       IF TAT116-ROUNDED >= 0 AND TAT116-ROUNDED <= 20            RMB0004 
ACIE03          MOVE 1 TO A-AT116001                                    RMB0004 
ACIE03       ELSE                                                       RMB0004 
ACIE03          MOVE 0 TO A-AT116001                                    RMB0004 
ACIE03       END-IF                                                     RMB0004 
ACIE03    END-IF.                                                       RMB0004 
REAL01    IF A-AYT  >= 63                                               RMB0007 
ACIE03       MOVE 1 TO A-AYT00001                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-AYT00001                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
REAL01*   IF A-AYT  >= 63                                               RMB0007 
REAL01*      MOVE 1 TO A-AYT00002                                       RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-AYT00002                                       RMB0007 
REAL01*   END-IF.                                                       RMB0007 
ACIE03    IF TBS111 >= 9675                                             RMB0004 
ACIE03       MOVE 1 TO A-BS111001                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-BS111001                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
REAL01*   IF TBS121 >= 1                                                RMB0007 
REAL01*      MOVE 1 TO A-BS121001                                       RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-BS121001                                       RMB0007 
REAL01*   END-IF.                                                       RMB0007 
ACIE03    IF A-CBAT120P >= 1                                            RMB0004 
ACIE03       MOVE 1 TO A-CBAT120P1                                      RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-CBAT120P1                                      RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF A-CBBS39   >= 1                                            RMB0004 
ACIE03       MOVE 1 TO A-CBBS3901                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-CBBS3901                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF A-CBCR30P  >= 1                                            RMB0004 
ACIE03       MOVE 1 TO A-CBCR30P1                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-CBCR30P1                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF TCR030 >= 1                                                RMB0004 
ACIE03       MOVE 1 TO A-CR030001                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-CR030001                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF TIQ012 = 2                                                 RMB0004 
ACIE03       MOVE 1 TO A-IQ012001                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-IQ012001                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF TIQ012 >= 3                                                RMB0004 
ACIE03       MOVE 1 TO A-IQ012002                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-IQ012002                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF TIQ014 >= 1                                                RMB0004 
ACIE03       MOVE 1 TO A-IQ014001                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-IQ014001                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF A-NUMUTCR75 >= 1                                           RMB0004 
ACIE03       MOVE 1 TO A-NUMUTCR751                                     RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-NUMUTCR751                                     RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF A-OPCC12    >= 1                                           RMB0004 
ACIE03       MOVE 1 TO A-OPCC1201                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-OPCC1201                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF A-OPOT18    >= 1                                           RMB0004 
ACIE03       MOVE 1 TO A-OPOT1801                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-OPOT1801                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF A-PCT69     >= 17                                          RMB0004 
ACIE03       MOVE 1 TO A-PCT69001                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-PCT69001                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
ACIE03    IF A-RECDEL >= 0 AND A-RECDEL <= 1                            RMB0004 
ACIE03       MOVE 1 TO A-RECDEL01                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-RECDEL01                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
REAL01    IF A-RECDEL >= 2 AND A-RECDEL <= 3                            RMB0007 
ACIE03       MOVE 1 TO A-RECDEL02                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-RECDEL02                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
REAL01    IF A-RECDEL = 4                                               RMB0007 
ACIE03       MOVE 1 TO A-RECDEL03                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-RECDEL03                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
REAL01    IF A-RECDEL >= 5 AND A-RECDEL <= 6                            RMB0007 
ACIE03       MOVE 1 TO A-RECDEL04                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-RECDEL04                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
REAL01    IF A-RECDEL >= 7 AND A-RECDEL <= 12                           RMB0007 
ACIE03       MOVE 1 TO A-RECDEL05                                       RMB0004 
ACIE03    ELSE                                                          RMB0004 
ACIE03       MOVE 0 TO A-RECDEL05                                       RMB0004 
ACIE03    END-IF.                                                       RMB0004 
REAL01*   IF A-RECDEL >= 7 AND A-RECDEL <= 12                           RMB0007 
REAL01*      MOVE 1 TO A-RECDEL06                                       RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-RECDEL06                                       RMB0007 
REAL01*   END-IF.                                                       RMB0007 
REAL01    COMPUTE A-SCORE ROUNDED = 764           +                     RMB0007 
REAL01                    +19      * A-AT116001   +                     RMB0007 
REAL01                    +17      * A-AYT00001   +                     RMB0007 
REAL01**************      +25      * A-AYT00002   +                     RMB0007 
REAL01                    -06      * A-BS111001   +                     RMB0007 
REAL01**************      -93      * A-BS121001   +                     RMB0007 
REAL01                    -33      * A-CBAT120P1  +                     RMB0007 
REAL01                    -15      * A-CBBS3901   +                     RMB0007 
REAL01                    -10      * A-CBCR30P1   +                     RMB0007 
REAL01                    -24      * A-CR030001   +                     RMB0007 
REAL01                    -20      * A-IQ012001   +                     RMB0007 
REAL01                    -31      * A-IQ012002   +                     RMB0007 
REAL01                    -13      * A-IQ014001   +                     RMB0007 
REAL01                    -19      * A-NUMUTCR751 +                     RMB0007 
REAL01                    -17      * A-OPCC1201   +                     RMB0007 
REAL01                    -22      * A-OPOT1801   +                     RMB0007 
REAL01                    -27      * A-PCT69001   +                     RMB0007 
REAL01                    -140     * A-RECDEL01   +                     RMB0007 
REAL01                    -098     * A-RECDEL02   +                     RMB0007 
REAL01                    -78      * A-RECDEL03   +                     RMB0007 
REAL01                    -66      * A-RECDEL04   +                     RMB0007 
REAL01                    -40      * A-RECDEL05   +                     RMB0007 
REAL01**************      -43      * A-RECDEL06   +                     RMB0007 
REAL01                    +0.061   * A-MESES      .                     RMB0007 
ACIE03    IF A-SCORE <= 150 MOVE 150 TO A-SCORE.                        RMB0004 
ACIE03    IF A-SCORE >= 850 MOVE 850 TO A-SCORE.                        RMB0004 
ACIE03****************COMIENZO CALCULO PARA LAS RAZONES *************   RMB0004 
ACIE03    PERFORM 8005-A-PREPARE-AA.                                    RMB0004 
REAL01    IF A-RECDEL >= 0 AND A-RECDEL <= 1                            RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 140 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-RECDEL >= 2 AND <= 3                                     RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 098 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-RECDEL = 4                                               RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 078 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-RECDEL >= 5 AND A-RECDEL <= 6                            RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 066 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-RECDEL >= 7 AND A-RECDEL <= 12                           RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 040 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-CBAT120P >= 1                                            RMB0007 
REAL01       MOVE 32 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 033 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TIQ012 >= 3 AND IQ012 NUMERIC                              RMB0007 
REAL01       MOVE 38 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 031 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCT69  >= 17                                             RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 027 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TCR030 >= 1 AND CR030 NUMERIC                              RMB0007 
REAL01       MOVE 11 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 024 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-OPOT18 >= 1                                              RMB0007 
REAL01       MOVE 36 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 022 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TIQ012 = 2                                                 RMB0007 
REAL01       MOVE 38 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 020 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-NUMUTCR75 >= 1                                           RMB0007 
REAL01       MOVE 48 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 019 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
AC2003    IF TAT116-ROUNDED >= 21 AND AT116-NUM NUMERIC                 RMB0006 
REAL01       MOVE 45 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 019 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-AYT >= 0 AND A-AYT <= 62                                 RMB0007 
REAL01       MOVE 23 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 017 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-OPCC12 >= 1                                              RMB0007 
REAL01       MOVE 14 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 017 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-CBBS39 >= 1                                              RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 015 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TIQ014 >= 1 AND IQ014 NUMERIC                              RMB0007 
REAL01       MOVE 20 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 013 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-CBCR30P >= 1                                             RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 010 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS111 >= 9675 AND BS111 NUMERIC                           RMB0007 
REAL01       MOVE 15 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 006 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF TBS121 >=1  AND BS121 NUMERIC                              RMB0007 
REAL01***    MOVE 47 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 093 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-RECDEL = 4                                               RMB0007 
REAL01***    MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 087 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-AYT >= 43 AND A-AYT <= 62                                RMB0007 
REAL01***    MOVE 23 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 011 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REMARK*********************************************************************
ACIE04 7850-TRU-SCORECARD04.                                            RMB0004 
REMARK*********************************************************************
REMARK*7850-TRU-SCORECARD04.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA SIN CTA CORRIENTES             *
REMARK*********************************************************************
ACIE04    PERFORM 7897-A-AOT.                                           RMB0004 
ACIE04    COMPUTE A-CBAT60P = A-CBAT60 + A-CBAT90 + A-CBAT120 + A-DERAT.RMB0004 
ACIE04    PERFORM 7891-A-DEL2P.                                         RMB0004 
REAL01*** COMPUTE A-INQ06 = TIQ001 + TIQ002.                            RMB0007 
REAL01*** IF BS118 NOT NUMERIC AND BS119 NOT NUMERIC AND                RMB0007 
REAL01***    BS120 NOT NUMERIC AND BS121 NOT NUMERIC                    RMB0007 
REAL01***    MOVE -1  TO A-NUMUTBS25                                    RMB0007 
REAL01*** ELSE                                                          RMB0007 
REAL01***    COMPUTE A-NUMUTBS25 = TBS118 + TBS119 + TBS120 + TBS121    RMB0007 
REAL01*** END-IF.                                                       RMB0007 
ACIE04    PERFORM 7894-A-NUMUTCR75.                                     RMB0004 
ACIE04    PERFORM 7895-A-PCTCUROP.                                      RMB0004 
ACIE04    COMPUTE A-PCTOP12 = TCR030 + TBS030 + TCC030 + TOT030 +       RMB0004 
ACIE04                        TCR031 + TBS031 + TCC031 + TOT031 .       RMB0004 
ACIE04    COMPUTE A-PCTOP12 ROUNDED = 100 *  A-PCTOP12 / A-SUM001.      RMB0004 
ACIE04    PERFORM 7896-A-RECDEL.                                        RMB0004 
ACIE04    COMPUTE A-VRAT12 = TCR020 + TCR021 +                          RMB0004 
ACIE04                       TBS020 + TBS021 +                          RMB0004 
ACIE04                       TCC020 + TCC021 +                          RMB0004 
ACIE04                       TOT020 + TOT021.                           RMB0004 
ACIE04************** CALCULOS VARIABLES ECUACION ********************   RMB0004 
ACIE04    IF A-AOT >= 1 THEN                                            RMB0004 
ACIE04       MOVE A-AOT TO A-AOTX                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0 TO     A-AOTX                                       RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF A-AOTX > 192 THEN                                          RMB0004 
ACIE04       MOVE 192 TO A-AOTX                                         RMB0004 
ACIE04    END-IF.                                                       RMB0004 
REAL01*** IF ID004 NOT NUMERIC                                          RMB0007 
REAL01***    MOVE 0 TO A-ID004X                                         RMB0007 
REAL01*** ELSE                                                          RMB0007 
REAL01***    IF ID004 >= 780                                            RMB0007 
REAL01***       MOVE 780 TO A-ID004X                                    RMB0007 
REAL01***    ELSE                                                       RMB0007 
REAL01***       MOVE ID004 TO A-ID004X                                  RMB0007 
REAL01***    END-IF                                                     RMB0007 
REAL01*** END-IF.                                                       RMB0007 
ACIE04    MOVE A-CBAT60P TO A-CBAT60PX.                                 RMB0004 
ACIE04    IF A-CBAT60PX > 9                                             RMB0004 
ACIE04       MOVE 9 TO A-CBAT60PX                                       RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF A-DEL2P >= 1                                               RMB0004 
ACIE04       MOVE 1    TO  A-DEL2P01                                    RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0    TO  A-DEL2P01                                    RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF A-PCTCUROP >= 100                                          RMB0004 
ACIE04       MOVE 1    TO  A-PCTCUROP1                                  RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0    TO  A-PCTCUROP1                                  RMB0004 
ACIE04    END-IF.                                                       RMB0004 
REAL01    IF TBS123 >= 141 AND TBS123 <= 226                            RMB0007 
ACIE04       MOVE 1    TO  A-BS123001                                   RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0    TO  A-BS123001                                   RMB0004 
ACIE04    END-IF.                                                       RMB0004 
REAL01    IF TBS123 >= 227                                              RMB0007 
ACIE04       MOVE 1    TO  A-BS123002                                   RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0    TO  A-BS123002                                   RMB0004 
ACIE04    END-IF.                                                       RMB0004 
REAL01*   IF TBS123 >= 227                                              RMB0007 
REAL01*      MOVE 1    TO  A-BS123003                                   RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0    TO  A-BS123003                                   RMB0007 
REAL01*   END-IF.                                                       RMB0007 
ACIE04    IF CR111 NOT NUMERIC                                          RMB0004 
ACIE04       MOVE 0 TO A-CR111001                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04      IF TCR111 >= 0 AND TCR111 <= 90                             RMB0004 
ACIE04         MOVE 1 TO A-CR111001                                     RMB0004 
ACIE04      ELSE                                                        RMB0004 
ACIE04         MOVE 0 TO A-CR111001                                     RMB0004 
ACIE04      END-IF                                                      RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF TCR111 >= 91 AND TCR111 <= 210                             RMB0004 
ACIE04       MOVE 1 TO A-CR111002                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0 TO A-CR111002                                       RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF OT111 NOT NUMERIC                                          RMB0004 
ACIE04       MOVE 0 TO A-OT111001                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04      IF TOT111 >= 0 AND TOT111 <= 38                             RMB0004 
ACIE04         MOVE 1 TO A-OT111001                                     RMB0004 
ACIE04      ELSE                                                        RMB0004 
ACIE04         MOVE 0 TO A-OT111001                                     RMB0004 
ACIE04      END-IF                                                      RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF A-VRAT12 >= 4                                              RMB0004 
ACIE04       MOVE 1 TO A-VRAT1201                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0 TO A-VRAT1201                                       RMB0004 
ACIE04    END-IF.                                                       RMB0004 
REAL01*   IF A-INQ06  >= 3                                              RMB0007 
REAL01*      MOVE 1 TO A-INQ06001                                       RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-INQ06001                                       RMB0007 
REAL01*   END-IF.                                                       RMB0007 
ACIE04    IF OT041 NOT NUMERIC                                          RMB0004 
ACIE04       MOVE 0 TO A-OT111001                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04      IF TOT041 >= 0 AND TOT041 <= 14                             RMB0004 
ACIE04         MOVE 1 TO A-OT041001                                     RMB0004 
ACIE04      ELSE                                                        RMB0004 
ACIE04         MOVE 0 TO A-OT041001                                     RMB0004 
ACIE04      END-IF                                                      RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF A-PCTOP12 >= 100                                           RMB0004 
ACIE04       MOVE 1 TO A-PCTOP121                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0 TO A-PCTOP121                                       RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF A-RECDEL >=0 AND A-RECDEL <= 1                             RMB0004 
ACIE04       MOVE 1 TO A-RECDEL01                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0 TO A-RECDEL01                                       RMB0004 
ACIE04    END-IF.                                                       RMB0004 
ACIE04    IF A-RECDEL = 2                                               RMB0004 
ACIE04       MOVE 1 TO A-RECDEL02                                       RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0 TO A-RECDEL02                                       RMB0004 
ACIE04    END-IF.                                                       RMB0004 
REAL01*   IF A-NUMUTBS25 >= 1                                           RMB0007 
REAL01*      MOVE 1 TO A-NUMUTBS251                                     RMB0007 
REAL01*   ELSE                                                          RMB0007 
REAL01*      MOVE 0 TO A-NUMUTBS251                                     RMB0007 
REAL01*   END-IF.                                                       RMB0007 
ACIE04    IF A-NUMUTCR75 >= 1                                           RMB0004 
ACIE04       MOVE 1 TO A-NUMUTCR751                                     RMB0004 
ACIE04    ELSE                                                          RMB0004 
ACIE04       MOVE 0 TO A-NUMUTCR751                                     RMB0004 
ACIE04    END-IF.                                                       RMB0004 
REAL01    COMPUTE A-SCORE ROUNDED = 676           +                     RMB0007 
REAL01                    -13      * A-DEL2P01    +                     RMB0007 
REAL01                    +15      * A-PCTCUROP1  +                     RMB0007 
REAL01                    -5       * A-BS123001   +                     RMB0007 
REAL01                    -15      * A-BS123002   +                     RMB0007 
REAL01***************     -21      * A-BS123003   +                     RMB0007 
REAL01                    +24      * A-CR111001   +                     RMB0007 
REAL01                    +12      * A-CR111002   +                     RMB0007 
REAL01                    +09      * A-OT111001   +                     RMB0007 
REAL01                    -5       * A-VRAT1201   +                     RMB0007 
REAL01***************     -10      * A-INQ06001   +                     RMB0007 
REAL01                    -15      * A-OT041001   +                     RMB0007 
REAL01                    -18      * A-PCTOP121   +                     RMB0007 
REAL01                    -125     * A-RECDEL01   +                     RMB0007 
REAL01                    -53      * A-RECDEL02   +                     RMB0007 
REAL01***************     -12      * A-NUMUTBS251 +                     RMB0007 
REAL01                    -14      * A-NUMUTCR751 +                     RMB0007 
REAL01                    +0.138   * A-AOTX       +                     RMB0007 
REAL01***************     +0.009525 * A-ID004X    +                     RMB0007 
REAL01                    -10      * A-CBAT60PX.                        RMB0007 
ACIE04    IF A-SCORE <= 150 MOVE 150 TO A-SCORE.                        RMB0004 
ACIE04    IF A-SCORE >= 850 MOVE 850 TO A-SCORE.                        RMB0004 
CARD04****************COMIENZO CALCULO PARA LAS RAZONES *************
ACIE04    PERFORM 8005-A-PREPARE-AA.                                    RMB0004 
REAL01    IF A-RECDEL >= 0 AND A-RECDEL <= 1                            RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 125 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL02    IF A-RECDEL = 2                                               RMB0007 
REAL01       MOVE 03 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 053 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TCR111 >= 211 AND CR111 NUMERIC                            RMB0007 
REAL01       MOVE 15 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 024 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTOP12  >= 100                                          RMB0007 
REAL01       MOVE 12 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 018 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS123 >= 227 AND BS123 NUMERIC                            RMB0007 
REAL01       MOVE 39 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 015 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TOT041 >=  0  AND TOT041 <= 14 AND OT041 NUMERIC           RMB0007 
REAL01       MOVE 40 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 015 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUROP >= 0 AND A-PCTCUROP <= 99                       RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 015 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-NUMUTCR75 >= 1                                           RMB0007 
REAL01       MOVE 48 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 014 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-DEL2P >= 1                                               RMB0007 
REAL01       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 013 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TCR111 >= 91 AND TCR111 <= 210                             RMB0007 
REAL01       MOVE 15 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 012 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TOT111 >= 39  AND OT111 NUMERIC                            RMB0007 
REAL01       MOVE 15 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 009 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS123 >= 141 AND TBS123 <= 226                            RMB0007 
REAL01       MOVE 39 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 005 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-VRAT12 >= 4                                              RMB0007 
REAL01       MOVE 31 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01          MOVE 005 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-NUMUTBS25 >= 1                                           RMB0007 
REAL01***    MOVE 47 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 012 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF A-INQ06 >=3                                                RMB0007 
REAL01***    MOVE 18 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 010 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01*** IF TBS123 >=  100 AND TBS123 <= 140  AND BS123 NUMERIC        RMB0007 
REAL01***    MOVE 39 TO A-ADVERSE-CODE                                  RMB0007 
REAL01***    IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL01***       MOVE 008 TO A-DIFFERENCE                                RMB0007 
REAL01***       PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REMARK************COMIENZO VARIABLES CONTINUAS ***************************
ACIE04    IF A-AOTX < 192                                               RMB0004 
REAL01       COMPUTE A-TEMP1 = 27 - ( A-AOTX * 0.138  )                 RMB0007 
ACIE04       MOVE 06 TO A-ADVERSE-CODE                                  RMB0004 
ACIE04       PERFORM 8001-A-INSERTE-CONTINUA.                           RMB0004 
ACIE04    IF A-CBAT60PX > 0                                             RMB0004 
REAL01       COMPUTE A-TEMP1 =  A-CBAT60PX * 10                         RMB0007 
REAL02       MOVE 04 TO A-ADVERSE-CODE                                  RMB0007 
ACIE04       PERFORM 8001-A-INSERTE-CONTINUA.                           RMB0004 
ACIE05 7860-TRU-SCORECARD05.                                            RMB0004 
REMARK*********************************************************************
REMARK*7860-TRU-SCORECARD05.
REMARK* ESTE SCORE CARD ES PARA LA PERSONA SIN CTA CORRIENTES             *
REMARK*********************************************************************
ACIE05    PERFORM 7897-A-AOT.                                           RMB0004 
ACIE05    IF A-AOT <= 12                                                RMB0004 
ACIE05       MOVE TAT112 TO A-NAT112                                    RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO     A-NAT112                                     RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF OT030 NOT NUMERIC AND OT031 NOT NUMERIC                    RMB0004 
ACIE05       MOVE -1 TO A-OPOT12                                        RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       COMPUTE A-OPOT12  = TOT030 + TOT031                        RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    PERFORM 7892-A-PCTCUR.                                        RMB0004 
ACIE05    PERFORM 7896-A-RECDEL.                                        RMB0004 
ACIE05************** CALCULOS VARIABLES ECUACION ********************   RMB0004 
ACIE05    IF ID004 NOT NUMERIC                                          RMB0004 
ACIE05       MOVE 216 TO A-AGE                                          RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       IF ID004 >= 720                                            RMB0004 
ACIE05          MOVE 720 TO A-AGE                                       RMB0004 
ACIE05       ELSE                                                       RMB0004 
ACIE05         IF ID004 < 216                                           RMB0004 
ACIE05            MOVE 216  TO A-AGE                                    RMB0004 
ACIE05         ELSE                                                     RMB0004 
ACIE05            MOVE ID004 TO A-AGE                                   RMB0004 
ACIE05         END-IF                                                   RMB0004 
ACIE05      END-IF                                                      RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF A-RECDEL > 13                                              RMB0004 
ACIE05       MOVE 0 TO A-RECDELAA                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       IF A-RECDEL < 1                                            RMB0004 
ACIE05          MOVE 13 TO A-RECDELAA                                   RMB0004 
ACIE05       ELSE                                                       RMB0004 
ACIE05          COMPUTE A-RECDELAA = 13 - A-RECDEL                      RMB0004 
ACIE05       END-IF                                                     RMB0004 
ACIE05     END-IF.                                                      RMB0004 
ACIE05     IF A-SUM001 > 5 THEN                                         RMB0004 
ACIE05        MOVE 5 TO A-SUM00101                                      RMB0004 
ACIE05     ELSE                                                         RMB0004 
ACIE05        MOVE A-SUM001 TO A-SUM00101                               RMB0004 
ACIE05     END-IF.                                                      RMB0004 
ACIE05    IF AT112 NOT NUMERIC                                          RMB0004 
ACIE05       MOVE 0 TO A-AT112001                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05      IF TAT112 >= 0 AND TAT112 <= 1                              RMB0004 
ACIE05         MOVE 1 TO A-AT112001                                     RMB0004 
ACIE05      ELSE                                                        RMB0004 
ACIE05         MOVE 0 TO A-AT112001                                     RMB0004 
ACIE05      END-IF                                                      RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF TBS064 >= 1                                                RMB0004 
ACIE05       MOVE 1 TO A-BS064001                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-BS064001                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF TCC020 >= 3                                                RMB0004 
ACIE05       MOVE 1 TO A-CC020001                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-CC020001                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
REAL03    IF CC040 NUMERIC                                              RMB0007 
REAL03       IF TCC040 >= 0 AND TCC040 <= 2                             RMB0007 
REAL03          MOVE 1 TO A-CC040001                                    RMB0007 
REAL03       ELSE                                                       RMB0007 
REAL03          MOVE 0 TO A-CC040001                                    RMB0007 
REAL03       END-IF                                                     RMB0007 
REAL03    END-IF.                                                       RMB0007 
AC2003    IF CR115-NUM NOT NUMERIC                                      RMB0006 
ACIE05       MOVE 0 TO A-CR115001                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05*     IF TCR115 >= 0 AND TCR115 <= 40                             RMB0004 
ACIE05      COMPUTE TCR115-ROUNDED ROUNDED = TCR115                     RMB0004 
ACIE05      IF TCR115-ROUNDED >= 0 AND TCR115-ROUNDED <= 40             RMB0004 
ACIE05         MOVE 1 TO A-CR115001                                     RMB0004 
ACIE05      ELSE                                                        RMB0004 
ACIE05         MOVE 0 TO A-CR115001                                     RMB0004 
ACIE05      END-IF                                                      RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF TIQ013 = 1                                                 RMB0004 
ACIE05       MOVE 1 TO A-IQ013001                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-IQ013001                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF TIQ013 >= 2                                                RMB0004 
ACIE05       MOVE 1 TO A-IQ013002                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-IQ013002                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF TIQ014 >= 1                                                RMB0004 
ACIE05       MOVE 1 TO A-IQ014001                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-IQ014001                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF A-NAT112 >= 1                                              RMB0004 
ACIE05       MOVE 1 TO A-NAT11201                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-NAT11201                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF A-OPOT12 >= 1                                              RMB0004 
ACIE05       MOVE 1 TO A-OPOT1201                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-OPOT1201                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF A-PCTCUR >= 21 AND A-PCTCUR <= 99                          RMB0004 
ACIE05       MOVE 1 TO A-PCTCUR01                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-PCTCUR01                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
ACIE05    IF A-PCTCUR = 100                                             RMB0004 
ACIE05       MOVE 1 TO A-PCTCUR02                                       RMB0004 
ACIE05    ELSE                                                          RMB0004 
ACIE05       MOVE 0 TO A-PCTCUR02                                       RMB0004 
ACIE05    END-IF.                                                       RMB0004 
REAL01    COMPUTE A-SCORE ROUNDED = 634           +                     RMB0007 
REAL03                    +35      * A-AT112001   +                     RMB0007 
REAL03                    -35      * A-BS064001   +                     RMB0007 
REAL03                    -26      * A-CC020001   +                     RMB0007 
REAL03                    -45      * A-CC040001   +                     RMB0007 
REAL03                    +53      * A-CR115001   +                     RMB0007 
REAL03                    -53      * A-IQ013001   +                     RMB0007 
REAL03                    -66      * A-IQ013002   +                     RMB0007 
REAL03                    -11      * A-IQ014001   +                     RMB0007 
REAL03                    -10      * A-NAT11201   +                     RMB0007 
REAL03                    -16      * A-OPOT1201   +                     RMB0007 
REAL03                    +16      * A-PCTCUR01   +                     RMB0007 
REAL03                    +21      * A-PCTCUR02   +                     RMB0007 
REAL03                    +0.126    * A-AGE        +                    RMB0007 
REAL03                    -6       * A-RECDELAA   +                     RMB0007 
REAL03                    +7       * A-SUM00101.                        RMB0007 
ACIE05    IF A-SCORE <= 150 MOVE 150 TO A-SCORE.                        RMB0004 
ACIE05    IF A-SCORE >= 850 MOVE 850 TO A-SCORE.                        RMB0004 
ACIE05    PERFORM 8005-A-PREPARE-AA.                                    RMB0004 
REAL01    IF TIQ013 >= 2 AND IQ013 NUMERIC                              RMB0007 
REAL01       MOVE 19 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 066 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TIQ013 = 1                                                 RMB0007 
REAL01       MOVE 19 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 053 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TCR115-ROUNDED >= 41 AND CR115-NUM NUMERIC                 RMB0007 
REAL01       MOVE 48 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 053 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL03    IF CC040 NUMERIC                                              RMB0007 
REAL03       IF TCC040 >=0 AND <= 2                                     RMB0007 
REAL03          MOVE 35 TO A-ADVERSE-CODE                               RMB0007 
REAL03          IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4   RMB0007 
REAL03             MOVE 045 TO A-DIFFERENCE                             RMB0007 
REAL03             PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                 RMB0007 
REAL01    IF TAT112 >= 2 AND AT112 NUMERIC                              RMB0007 
REAL01       MOVE 15 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 035 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TBS064 >= 1 AND BS064 NUMERIC                              RMB0007 
REAL01       MOVE 37 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 035 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TCC020 >= 3  AND CC020 NUMERIC                             RMB0007 
REAL01       MOVE 41 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 026 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL02    IF A-PCTCUR >= 0 AND <= 20                                    RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 021 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-OPOT12 >= 1                                              RMB0007 
REAL01       MOVE 36 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 016 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF TIQ014 >= 1  AND IQ014 NUMERIC                             RMB0007 
REAL01       MOVE 20 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 011 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-NAT112 >= 1                                              RMB0007 
REAL01       MOVE 15 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 010 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REAL01    IF A-PCTCUR >= 21 AND A-PCTCUR <= 99                          RMB0007 
REAL01       MOVE 08 TO A-ADVERSE-CODE                                  RMB0007 
REAL01       IF A-V-ASIGNADA(A-ADVERSE-CODE) = 0 AND A-RAZONES < 4      RMB0007 
REAL03          MOVE 005 TO A-DIFFERENCE                                RMB0007 
REAL01          PERFORM 8000-A-TRU-INSERTE-ADV-CODE.                    RMB0007 
REMARK************COMIENZO VARIABLES CONTINUAS ***************************
ACIE05    IF A-RECDELAA > 0                                             RMB0004 
REAL03       COMPUTE A-TEMP1 = A-RECDELAA * 6                           RMB0007 
ACIE05       MOVE 03 TO A-ADVERSE-CODE                                  RMB0004 
ACIE05       PERFORM 8001-A-INSERTE-CONTINUA.                           RMB0004 
ACIE05    IF A-SUM001 < 5                                               RMB0004 
REAL03       COMPUTE A-TEMP1 =  35 - (A-SUM001 * 7    )                 RMB0007 
ACIE05       MOVE 34 TO A-ADVERSE-CODE                                  RMB0004 
ACIE05       PERFORM 8001-A-INSERTE-CONTINUA.                           RMB0004 
REMARK*********************************************************************
REMARK*    RUTINAS COMPARTIDAS POR LOS SCORE CARDS    ACIERTA             *
REMARK*********************************************************************
ACIE01 7891-A-DEL2P.                                                    RMB0004 
REMARK********************************************************************
REMARK* SE USA EN SCORECARD (1,2,4)
REMARK********************************************************************
ACIE01    COMPUTE A-DEL2P = TCR068 + TCR069 + TCR070 + TCR071 + TCR072 +RMB0004 
ACIE01                    TCR073 + TCR074 + TCR075 + TCR076 + TCR077 +  RMB0004 
ACIE01                    TCR078 + TCR079 + TCR080 + TCR081 + TCR082 +  RMB0004 
ACIE01                    TCR083 + TCR084 + TCR085 + TCR086 + TCR087 +  RMB0004 
ACIE01                    TCR088 +                                      RMB0004 
ACIE01                    TBS068 + TBS069 + TBS070 + TBS071 + TBS072 +  RMB0004 
ACIE01                    TBS073 + TBS074 + TBS075 + TBS076 + TBS077 +  RMB0004 
ACIE01                    TBS078 + TBS079 + TBS080 + TBS081 + TBS082 +  RMB0004 
ACIE01                    TBS083 + TBS084 + TBS085 + TBS086 + TBS087 +  RMB0004 
ACIE01                    TBS088 +                                      RMB0004 
ACIE01                    TCC068 + TCC069 + TCC070 + TCC071 + TCC072 +  RMB0004 
ACIE01                    TCC073 + TCC074 + TCC075 + TCC076 + TCC077 +  RMB0004 
ACIE01                    TCC078 + TCC079 + TCC080 + TCC081 + TCC082 +  RMB0004 
ACIE01                    TCC083 + TCC084 + TCC085 + TCC086 + TCC087 +  RMB0004 
ACIE01                    TCC088 +                                      RMB0004 
ACIE01                    TOT068 + TOT069 + TOT070 + TOT071 + TOT072 +  RMB0004 
ACIE01                    TOT073 + TOT074 + TOT075 + TOT076 + TOT077 +  RMB0004 
ACIE01                    TOT078 + TOT079 + TOT080 + TOT081 + TOT082 +  RMB0004 
ACIE01                    TOT083 + TOT084 + TOT085 + TOT086 + TOT087 +  RMB0004 
ACIE01                    TOT088.                                       RMB0004 
NEWSCO 7892-A-PCTCUR.
REMARK*********************************************************************
REMARK*7892-A-PCTCUR.
REMARK*  RELACION ENTRE CUENTAS AL DIA SOBRE TOTAL DE CUENTAS (CARD 1 Y 5)*
REMARK*********************************************************************
ACIE01    COMPUTE A-PCTCUR ROUNDED = 100 *                              RMB0004 
ACIE01                           (TCR050 + TBS050 + TCC050 + TOT050) /  RMB0004 
ACIE01                                                      A-SUM001.   RMB0004 
NEWSCO 7893-A-SUM002.
REMARK*********************************************************************
REMARK*7893-A-SUM002.
REMARK*  SUMATORIA DE CUENTAS ABIERTAS                  (SCORECARD 1 Y 2)*
REMARK*********************************************************************
ACIE01    COMPUTE A-SUM002 = TCR002 + TBS002 + TCC002 + TOT002.         RMB0004 
ACIE02 7894-A-NUMUTCR75.                                                RMB0004 
REMARK*********************************************************************
REMARK*7894-A-NUMUTCR75.
REMARK*  SUMA  tarjetas con disponible menor del 76%
REMARK*********************************************************************
ACIE02    IF CR120 NOT NUMERIC AND CR121 NOT NUMERIC                    RMB0004 
ACIE02       MOVE -1 TO A-NUMUTCR75                                     RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       COMPUTE A-NUMUTCR75 = TCR120 + TCR121                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
NEWSCO 7895-A-PCTCUROP.
REMARK*********************************************************************
REMARK*7895-A-PCTCUROP.
REMARK*  RELACION ENTRE CUENTAS AL DIA SOBRE ABIERTAS   (SCORECARD 2 Y 4) *
REMARK*********************************************************************
ACIE02    IF (TCR002 + TBS002 + TCC002 + TOT002) > 0                    RMB0004 
ACIE02       COMPUTE A-PCTCUROP ROUNDED = 100 *                         RMB0004 
ACIE02                           (TCR050 + TBS050 + TCC050 + TOT050 )/  RMB0004 
ACIE02                           (TCR002 + TBS002 + TCC002 + TOT002)    RMB0004 
ACIE02    ELSE                                                          RMB0004 
ACIE02       MOVE -1 TO A-PCTCUROP                                      RMB0004 
ACIE02    END-IF.                                                       RMB0004 
ACIE02 7896-A-RECDEL.                                                   RMB0004 
REMARK*********************************************************************
REMARK*7896-A-RECDEL.     
REMARK*********************************************************************
ACIE02*  MIN(TCR100,TBS101,TCC101,TOT101,TCR102,TBS102,TCC102.TOT103)   RMB0004 
ACIE02*                     MOS30                                       RMB0004 
ACIE02    MOVE TCR100 TO A-RECDEL                                       RMB0004 
ACIE02    IF A-RECDEL > TBS100                                          RMB0004 
ACIE02       MOVE TBS100 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TCC100                                          RMB0004 
ACIE02       MOVE TCC100 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TOT100                                          RMB0004 
ACIE02       MOVE TOT100 TO A-RECDEL.                                   RMB0004 
ACIE02*                     MOS60                                       RMB0004 
ACIE02    IF A-RECDEL > TCR101                                          RMB0004 
ACIE02       MOVE TCR101 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TBS101                                          RMB0004 
ACIE02       MOVE TBS101 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TCC101                                          RMB0004 
ACIE02       MOVE TCC101 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TOT101                                          RMB0004 
ACIE02       MOVE TOT101 TO A-RECDEL.                                   RMB0004 
ACIE02*                     MOS90                                       RMB0004 
ACIE02    IF A-RECDEL > TCR102                                          RMB0004 
ACIE02       MOVE TCR102 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TBS102                                          RMB0004 
ACIE02       MOVE TBS102 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TCC102                                          RMB0004 
ACIE02       MOVE TCC102 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TOT102                                          RMB0004 
ACIE02       MOVE TOT102 TO A-RECDEL.                                   RMB0004 
ACIE02*                     MOS120                                      RMB0004 
ACIE02    IF A-RECDEL > TCR103                                          RMB0004 
ACIE02       MOVE TCR103 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TBS103                                          RMB0004 
ACIE02       MOVE TBS103 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TCC103                                          RMB0004 
ACIE02       MOVE TCC103 TO A-RECDEL.                                   RMB0004 
ACIE02    IF A-RECDEL > TOT103                                          RMB0004 
ACIE02       MOVE TOT103 TO A-RECDEL.                                   RMB0004 
ACIE04 7897-A-AOT.                                                      RMB0004 
REMARK*********************************************************************
REMARK*7897-A-AOT.        
REMARK*********************************************************************
ACIE04*  MAX(TCR040,TBS040,TCC040,TOT040)                               RMB0004 
ACIE04    MOVE TCR040 TO A-AOT.                                         RMB0004 
ACIE04    IF A-AOT < TBS040                                             RMB0004 
ACIE04       MOVE TBS040 TO A-AOT.                                      RMB0004 
ACIE04    IF A-AOT < TCC040                                             RMB0004 
ACIE04       MOVE TCC040 TO A-AOT.                                      RMB0004 
ACIE04    IF A-AOT < TOT040                                             RMB0004 
ACIE04       MOVE TOT040 TO A-AOT.                                      RMB0004 
ACIERT 8000-A-TRU-INSERTE-ADV-CODE.                                     RMB0004 
REMARK*********************************************************************
REMARK*8000-A-TRU-INSERTE-ADV-CODE.
REMARK*  SE ADICIONA A LA LISTA DE RAZONES LA ENCONTRADA POR VAR DISCRETA *
REMARK*********************************************************************
ACIERT    ADD 1 TO A-RAZONES                                            RMB0004 
ACIERT    MOVE 1 TO A-V-ASIGNADA(A-ADVERSE-CODE)                        RMB0004 
ACIERT    MOVE A-ADVERSE-CODE TO A-ADVERSE-RAZON(A-RAZONES)             RMB0004 
ACIERT    MOVE A-DIFFERENCE  TO A-ADVERSE-DIFF (A-RAZONES).             RMB0004 
ACIERT 8001-A-INSERTE-CONTINUA.                                         RMB0004 
REMARK*********************************************************************
REMARK*8001-A-INSERTE-CONTINUA.
REMARK*  SE ADICIONA A LA LISTA DE RAZONES LA VARIABLE CONTINUA . SE      *
REMARK*  DEZPLAZA TODA LA TABLA HACIA ABAJO CUANDO LA INSERTA.            *
REMARK*********************************************************************
ACIERT    MOVE 1 TO A-RAZONES.                                          RMB0004 
ACIERT    PERFORM UNTIL A-RAZONES > 4 OR A-TEMP1        <= 0            RMB0004 
ACIERT      IF A-TEMP1        > A-ADVERSE-DIFF(A-RAZONES)               RMB0004 
ACIERT         MOVE A-ADVERSE-DIFF (A-RAZONES) TO A-DIFFERENCE-AUX      RMB0004 
ACIERT         MOVE A-ADVERSE-RAZON(A-RAZONES) TO A-ADVERSE-CODE-AUX    RMB0004 
ACIERT         MOVE A-TEMP1        TO A-ADVERSE-DIFF(A-RAZONES)         RMB0004 
ACIERT         MOVE A-ADVERSE-CODE TO A-ADVERSE-RAZON(A-RAZONES)        RMB0004 
ACIERT                              A-ADVERSE-CODE-INI                  RMB0004 
ACIERT         PERFORM UNTIL A-RAZONES >= 4 OR A-ADVERSE-CODE-AUX =     RMB0004 
ACIERT                                       A-ADVERSE-CODE-INI         RMB0004 
ACIERT            ADD      1 TO   A-RAZONES                             RMB0004 
ACIERT            IF A-RAZONES <= 4                                     RMB0004 
ACIERT               MOVE A-ADVERSE-DIFF (A-RAZONES) TO A-DIFFERENCE    RMB0004 
ACIERT               MOVE A-ADVERSE-RAZON(A-RAZONES) TO A-ADVERSE-CODE  RMB0004 
ACIERT               MOVE A-DIFFERENCE-AUX TO A-ADVERSE-DIFF (A-RAZONES)RMB0004 
ACIERT             MOVE A-ADVERSE-CODE-AUX TO A-ADVERSE-RAZON(A-RAZONES)RMB0004 
ACIERT               MOVE A-DIFFERENCE TO A-DIFFERENCE-AUX              RMB0004 
ACIERT               MOVE A-ADVERSE-CODE TO A-ADVERSE-CODE-AUX          RMB0004 
ACIERT            END-IF                                                RMB0004 
ACIERT         END-PERFORM                                              RMB0004 
ACIERT         MOVE 4 TO A-RAZONES                                      RMB0004 
ACIERT      ELSE                                                        RMB0004 
ACIERT         IF A-ADVERSE-RAZON(A-RAZONES) = A-ADVERSE-CODE           RMB0004 
ACIERT            MOVE 4 TO A-RAZONES                                   RMB0004 
ACIERT         END-IF                                                   RMB0004 
ACIERT      END-IF                                                      RMB0004 
ACIERT      ADD 1 TO A-RAZONES                                          RMB0004 
ACIERT    END-PERFORM.                                                  RMB0004 
ACIERT 8005-A-PREPARE-AA.                                               RMB0004 
REMARK**********************************************************************
REMARK*8005-A-PREPARE-AA.       
REMARK* SE COLOCAN VALORES NEGATIVOS A LAS VARIABLES QUE LO NECESITAN
REMARK* PARA QUE LOS AAC SE CALCULEN CORRECTAMENTE 
REMARK*********************************************************************
ACIERT    IF A-VRBS12 = 0                                               RMB0004 
ACIERT       IF  BS020 NOT NUMERIC AND BS021 NOT NUMERIC                RMB0004 
ACIERT           MOVE -1 TO A-VRBS12                                    RMB0004 
ACIERT       END-IF                                                     RMB0004 
ACIERT    END-IF.                                                       RMB0004 
ACIERT    IF A-PCTCUR = 0                                               RMB0004 
ACIERT       IF CR050 NOT NUMERIC AND BS050 NOT NUMERIC AND             RMB0004 
ACIERT          CC050 NOT NUMERIC AND OT050 NOT NUMERIC                 RMB0004 
ACIERT          MOVE -1 TO A-PCTCUR                                     RMB0004 
ACIERT    END-IF.                                                       RMB0004 
ACIERT    IF A-PCTCUROP = 0                                             RMB0004 
ACIERT       IF CR050 NOT NUMERIC AND BS050 NOT NUMERIC AND             RMB0004 
ACIERT          CC050 NOT NUMERIC AND OT050 NOT NUMERIC                 RMB0004 
ACIERT          MOVE -1 TO A-PCTCUROP                                   RMB0004 
ACIERT    END-IF.                                                       RMB0004 
NEWSCO 7891-MINIMO-AYT.
REMARK*********************************************************************
REMARK*7891-MINIMO-AYT.                                                   *
NEWSCO*  MIN(TCR041,TBS041,TCC041,TOT041)                                 *
REMARK*********************************************************************
NEWSCO    MOVE TCR041 TO AYT.
NEWSCO    IF AYT > TBS041     
NEWSCO       MOVE TBS041 TO AYT.
NEWSCO    IF AYT > TCC041     
NEWSCO       MOVE TCC041 TO AYT.
NEWSCO    IF AYT > TOT041     
NEWSCO       MOVE TOT041 TO AYT.
NEWSCO    IF AYT <= 48 OR AYT = 999 
NEWSCO       MOVE 00000 TO AYTX
NEWSCO    ELSE 
NEWSCO       MOVE AYT TO AYTX
NEWSCO    END-IF.
NEWSCO 7892-CBAT60P.
REMARK*********************************************************************
REMARK*7892-CBAT60P.
REMARK*  SUMAR TODAS LAS VARIABLES DE MORA 60                             *
REMARK*********************************************************************
NEWSCO    COMPUTE CBAT60P = TCR051 + TCR057 + TCR058 + TCR059 + TCR061 +
NEWSCO                      TCR062 + TCR063 + TCR065 + TCR066 + TCR067 +
NEWSCO                      TCR068 + TCR069 + TCR070 + TCR071 + TCR072 +
NEWSCO                      TCR073 + TCR074 + TCR075 + TCR076 + TCR077 +
NEWSCO                      TCR078 + TCR079 + TCR080 + TCR081 + TCR082 +
NEWSCO                      TCR083 + TCR084 + TCR085 + TCR086 + TCR087 +
NEWSCO                      TCR088 + TCR089 + TCR090 + TCR092 + TCR093 +
NEWSCO                      TCR094 + 
NEWSCO                      TBS051 + TBS057 + TBS058 + TBS059 + TBS061 +
NEWSCO                      TBS062 + TBS063 + TBS065 + TBS066 + TBS067 +
NEWSCO                      TBS068 + TBS069 + TBS070 + TBS071 + TBS072 +
NEWSCO                      TBS073 + TBS074 + TBS075 + TBS076 + TBS077 +
NEWSCO                      TBS078 + TBS079 + TBS080 + TBS081 + TBS082 +
NEWSCO                      TBS083 + TBS084 + TBS085 + TBS086 + TBS087 +
NEWSCO                      TBS088 + TBS089 + TBS090 + TBS092 + TBS093 +
NEWSCO                      TBS094 + 
NEWSCO                      TCC051 + TCC057 + TCC058 + TCC059 + TCC061 +
NEWSCO                      TCC062 + TCC063 + TCC065 + TCC066 + TCC067 +
NEWSCO                      TCC068 + TCC069 + TCC070 + TCC071 + TCC072 +
NEWSCO                      TCC073 + TCC074 + TCC075 + TCC076 + TCC077 +
NEWSCO                      TCC078 + TCC079 + TCC080 + TCC081 + TCC082 +
NEWSCO                      TCC083 + TCC084 + TCC085 + TCC086 + TCC087 +
NEWSCO                      TCC088 + TCC089 + TCC090 + TCC092 + TCC093 +
NEWSCO                      TCC094 + 
NEWSCO                      TOT051 + TOT057 + TOT058 + TOT059 + TOT061 +
NEWSCO                      TOT062 + TOT063 + TOT065 + TOT066 + TOT067 +
NEWSCO                      TOT068 + TOT069 + TOT070 + TOT071 + TOT072 +
NEWSCO                      TOT073 + TOT074 + TOT075 + TOT076 + TOT077 +
NEWSCO                      TOT078 + TOT079 + TOT080 + TOT081 + TOT082 +
NEWSCO                      TOT083 + TOT084 + TOT085 + TOT086 + TOT087 +
NEWSCO                      TOT088 + TOT089 + TOT090 + TOT092 + TOT093 +
NEWSCO                      TOT094.   
NEWSCO 7893-INQ06.     
REMARK*********************************************************************
REMARK*7893-INQ06.     
REMARK*  SUMAR TODAS LAS CONSULTAS EN LOS ULTIMOS 6 MESES                 *
REMARK*********************************************************************
NEWSCO    COMPUTE INQ06 = TIQ001 + TIQ002 .
NEWSCO 7894-MESAS.
REMARK*********************************************************************
REMARK*7894-MESAS.
REMARK*  MOVE LA EDAD CALCULADA DE LA FECHA DE EXPEDICION                 *
REMARK*********************************************************************
NEWSCO    IF ID004 NOT NUMERIC 
NEWSCO       MOVE 0 TO MESAS 
NEWSCO    ELSE
NEWSCO       MOVE ID004 TO MESAS
NEWSCO    END-IF.
NEWSCO 7895-PCTCUR.
REMARK*********************************************************************
REMARK*7895-PCTCUR.
REMARK*  RELACION ENTRE CUENTAS AL DIA SOBRE TOTAL DE CUENTAS             *
REMARK*********************************************************************
NEWSCO    COMPUTE PCTCUR ROUNDED = 100 * 
NEWSCO                           (TCR050 + TBS050 + TCC050 + TOT050) /
NEWSCO                           (TCR001 + TBS001 + TCC001 + TOT001 ) .
NEWSCO 8000-TRU-INSERTE-ADV-CODE.
REMARK*********************************************************************
REMARK*8000-TRU-INSERTE-ADV-CODE.
REMARK*  SE ADICIONA A LA LISTA DE RAZONES LA ENCONTRADA POR VAR DISCRETA *
REMARK*********************************************************************
NEWSCO    ADD 1 TO RAZONES
NEWSCO    MOVE 1 TO V-ASIGNADA(ADVERSE-CODE)
NEWSCO    MOVE ADVERSE-CODE TO ADVERSE-RAZON(RAZONES)
NEWSCO    MOVE DIFFERENCE  TO ADVERSE-DIFF (RAZONES).
NEWSCO 8001-INSERTE-CONTINUA.
REMARK*********************************************************************
REMARK*8001-INSERTE-CONTINUA.
REMARK*  SE ADICIONA A LA LISTA DE RAZONES LA VARIABLE CONTINUA . SE      *
REMARK*  DEZPLAZA TODA LA TABLA HACIA ABAJO CUANDO LA INSERTA.            *
REMARK*********************************************************************
NEWSCO    COMPUTE TEMP1ROUNDED ROUNDED = TEMP1 
NEWSCO    MOVE 1 TO RAZONES.
CORREC    PERFORM UNTIL RAZONES > 4 OR TEMP1ROUNDED <= 0
NEWSCO      IF TEMP1ROUNDED > ADVERSE-DIFF(RAZONES)
NEWSCO         MOVE ADVERSE-DIFF (RAZONES) TO DIFFERENCE-AUX       
NEWSCO         MOVE ADVERSE-RAZON(RAZONES) TO ADVERSE-CODE-AUX  
NEWSCO         MOVE TEMP1ROUNDED TO ADVERSE-DIFF(RAZONES) 
NEWSCO         MOVE ADVERSE-CODE TO ADVERSE-RAZON(RAZONES)
NEWSCO                              ADVERSE-CODE-INI   
NEWSCO         PERFORM UNTIL RAZONES >= 4 OR ADVERSE-CODE-AUX =         
NEWSCO                                       ADVERSE-CODE-INI
NEWSCO            ADD      1 TO   RAZONES
NEWSCO            IF RAZONES <= 4                              
NEWSCO               MOVE ADVERSE-DIFF (RAZONES) TO DIFFERENCE       
NEWSCO               MOVE ADVERSE-RAZON(RAZONES) TO ADVERSE-CODE 
NEWSCO               MOVE DIFFERENCE-AUX TO ADVERSE-DIFF (RAZONES)
NEWSCO               MOVE ADVERSE-CODE-AUX TO ADVERSE-RAZON(RAZONES)
NEWSCO               MOVE DIFFERENCE TO DIFFERENCE-AUX
NEWSCO               MOVE ADVERSE-CODE TO ADVERSE-CODE-AUX
NEWSCO            END-IF
NEWSCO         END-PERFORM
NEWSCO         MOVE 4 TO RAZONES
NEWSCO      ELSE
NEWSCO         IF ADVERSE-RAZON(RAZONES) = ADVERSE-CODE 
NEWSCO            MOVE 4 TO RAZONES
NEWSCO         END-IF
NEWSCO      END-IF
NEWSCO      ADD 1 TO RAZONES
NEWSCO    END-PERFORM.                              
NEWSCO 8005-PREPARE-AA.       
REMARK*********************************************************************
REMARK*8005-PREPARE-AA.       
REMARK*   SE SEPARAN LOS CASOS DE TODA INFORMACION NEGATIVA CON VARIABLES
REMARK*   QUE COMIENZAN POR "AA". ELIMINA CASOS NEGATIVOS MAL MANEJADOS       
REMARK*********************************************************************
CORREC    IF CR040 NOT NUMERIC AND
CORREC       BS040 NOT NUMERIC AND 
CORREC       CC040 NOT NUMERIC AND 
CORREC       OT040 NOT NUMERIC  
CORREC       MOVE -1      TO AAAOT      
CORREC    ELSE
CORREC       MOVE AOT     TO AAAOT       
CORREC    END-IF.
CORREC    IF (CR041 NOT NUMERIC OR CR041 = "999") AND
CORREC       (BS041 NOT NUMERIC OR BS041 = "999") AND 
CORREC       (CC041 NOT NUMERIC OR CC041 = "999") AND 
CORREC       (OT041 NOT NUMERIC OR OT041 = "999")  
CORREC       MOVE -1      TO AAAYT     
CORREC    ELSE
CORREC       MOVE AYT     TO AAAYT       
CORREC    END-IF.
CORREC    IF AAAYT >= 0 AND <= 48 
CORREC       MOVE 0     TO AAAYTX
CORREC    ELSE
CORREC       MOVE AAAYT TO AAAYTX
CORREC    END-IF.
CORREC    IF GD010 NOT NUMERIC AND
CORREC       GD011 NOT NUMERIC AND 
CORREC       GD012 NOT NUMERIC  
CORREC       MOVE -1      TO AABAL      
CORREC       MOVE -1      TO AANREC     
CORREC    ELSE
CORREC       MOVE BAL     TO AABAL       
CORREC       MOVE NREC    TO AANREC      
CORREC    END-IF.
CORREC    IF BS011 NOT NUMERIC AND
CORREC       BS012 NOT NUMERIC AND 
CORREC       BS013 NOT NUMERIC AND 
CORREC       BS014 NOT NUMERIC  
CORREC       MOVE -1      TO AABS25P7 
CORREC    ELSE
CORREC       MOVE BS25P7  TO AABS25P7
CORREC    END-IF.
CORREC    IF CR056 NOT NUMERIC AND CR060 NOT NUMERIC AND
CORREC       BS056 NOT NUMERIC AND BS060 NOT NUMERIC AND
CORREC       CC056 NOT NUMERIC AND CC060 NOT NUMERIC AND
CORREC       OT056 NOT NUMERIC AND OT060 NOT NUMERIC
CORREC* CUENTAS ABIERTAS O CERRADAS
CORREC       MOVE -1      TO AACBAT30 
CORREC       MOVE -1      TO AACBAT60P
CORREC       MOVE -1      TO AACBAT39X
CORREC       MOVE -1      TO AACBAT12W
CORREC    ELSE
CORREC       MOVE CBAT60P TO AACBAT60P
CORREC       MOVE CBAT30  TO AACBAT30 
CORREC       MOVE CBAT39X TO AACBAT39X
CORREC       MOVE CBAT12W TO AACBAT12W
CORREC    END-IF.
CORRE2*   IF CR054 NOT NUMERIC AND
CORRE2*      BS054 NOT NUMERIC AND 
CORRE2*      CC054 NOT NUMERIC AND 
CORRE2*      OT054 NOT NUMERIC  
CORRE2*      MOVE -1      TO AASUM054 
CORRE2*   ELSE
CORRE2*      MOVE SUM054  TO AASUM054 
CORRE2*   END-IF.
CORREC    IF CR010 NOT NUMERIC    
CORREC       MOVE -1      TO AACR10B    
CORRE2*      MOVE -1      TO AACRD13P   
CORREC    ELSE
CORREC       MOVE CR10B   TO AACR10B     
CORRE2*      MOVE CRD13P  TO AACRD13P    
CORREC    END-IF.
CORREC    IF CR065 NOT NUMERIC AND
CORREC       BS065 NOT NUMERIC AND 
CORREC       CC065 NOT NUMERIC AND 
CORREC       OT065 NOT NUMERIC  
CORREC*  TODAS CERRADAS (-2)
CORREC       MOVE -1      TO AACUAT69X
CORREC       MOVE -1      TO AADEL2PX  
CORREC       MOVE -1      TO AAMALO1   
CORREC       MOVE -1      TO AASUM050  
CORREC       MOVE -1      TO AASUM064  
CORREC    ELSE
CORREC       MOVE CUAT69X TO AACUAT69X
CORREC       MOVE DEL2PX  TO AADEL2PX   
CORREC       MOVE MALO1   TO AAMALO1    
CORREC       MOVE SUM050  TO AASUM050   
CORREC       MOVE SUM064  TO AASUM064   
CORREC    END-IF.
CORREC    IF IQ001 NOT NUMERIC    
CORREC       MOVE -1      TO AAINQ06    
CORREC    ELSE
CORREC       MOVE INQ06   TO AAINQ06     
CORREC    END-IF.
CORRE3    IF (CR100 NOT NUMERIC ) AND
CORRE3       (BS100 NOT NUMERIC ) AND 
CORRE3       (CC100 NOT NUMERIC ) AND 
CORRE3       (OT100 NOT NUMERIC )  
CORREC       MOVE -1      TO AAMOS30    
CORREC       MOVE -1      TO AAMOS69    
CORREC    ELSE
CORREC       MOVE MOS30   TO AAMOS30     
CORREC       MOVE MOS69   TO AAMOS69     
CORREC    END-IF.
CORREC    IF CR030 NOT NUMERIC AND
CORREC       BS030 NOT NUMERIC AND 
CORREC       CC030 NOT NUMERIC AND 
CORREC       OT030 NOT NUMERIC  
CORREC       MOVE -1      TO AAOPAT12   
CORREC       MOVE -1      TO AAOPAT18   
CORREC       MOVE -1      TO AAOPAT24   
CORREC    ELSE
CORREC       MOVE OPAT12  TO AAOPAT12    
CORREC       MOVE OPAT18  TO AAOPAT18    
CORREC       MOVE OPAT24  TO AAOPAT24    
CORREC    END-IF.
CORREC    IF CR030 NOT NUMERIC    
CORREC       MOVE -1      TO AAOPCR18   
CORREC    ELSE
CORREC       MOVE OPCR18  TO AAOPCR18    
CORREC    END-IF.
CORRE2*   IF OT030 NOT NUMERIC    
CORRE2*      MOVE -1      TO AAOPOT24   
CORRE2*   ELSE
CORRE2*      MOVE OPOT24  TO AAOPOT24    
CORRE2*   END-IF.
CORREC    IF CR050 NOT NUMERIC AND CR001 NOT NUMERIC AND
CORREC       BS050 NOT NUMERIC AND BS001 NOT NUMERIC AND
CORREC       CC050 NOT NUMERIC AND CC001 NOT NUMERIC AND
CORREC       OT050 NOT NUMERIC AND OT001 NOT NUMERIC
CORREC       MOVE -1      TO AAPCTCUR 
CORREC    ELSE
CORREC       MOVE PCTCUR  TO AAPCTCUR 
CORREC    END-IF.
CORREC    IF CR002 NOT NUMERIC AND
CORREC       BS002 NOT NUMERIC AND 
CORREC       CC002 NOT NUMERIC AND 
CORREC       OT002 NOT NUMERIC  
CORREC       MOVE -1      TO AASUM002X  
CORREC    ELSE
CORREC       MOVE SUM002X TO AASUM002X   
CORREC    END-IF.
CORREC    IF CR020 NOT NUMERIC AND
CORREC       BS020 NOT NUMERIC AND 
CORREC       CC020 NOT NUMERIC AND 
CORREC       OT020 NOT NUMERIC  
CORREC       MOVE -1      TO AAVRAT12   
CORREC    ELSE
CORREC       MOVE VRAT12  TO AAVRAT12    
CORREC    END-IF.
CORREC    IF CC020 NOT NUMERIC AND
CORREC       CC021 NOT NUMERIC      
CORREC       MOVE -1      TO AAVRCC12   
CORREC    ELSE
CORREC       MOVE VRCC12  TO AAVRCC12    
CORREC    END-IF.
REMARK*******************************************************************
REMARK*            CODIGO PARA EL SCORE O SEGMENTACION DE MICROCREDITO
REMARK*******************************************************************
MICR03 9800-TRA-SEGMENTACION-M.                                         RMB0016 
REMARK*******************************************************************
REMARK*9800-TRA-SEGMENTACION-M.
REMARK*   SCORE        PARA EL NICHO DE MICROCREDITO BASADO EN EL SCORE
REMARK*   DE ACIERTA .        
REMARK*******************************************************************
MICR03    IF IQ01X(4)(1:3) NOT =  IQ014                                 RMB0016 
MICR03       DISPLAY "INCONSISTENCIA1  EN SISTEMA-MICR"                 RMB0016 
MICR03       DISPLAY "IQ01X(4)=",IQ01X(4)                               RMB0016 
MICR03       DISPLAY "IQ014   =",IQ014                                  RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    MOVE 1 TO I.                                                  RMB0016 
MICR03    PERFORM UNTIL I > 272                                         RMB0016 
MICR03       IF V-CARTERAS(I) NOT NUMERIC                               RMB0016 
MICR03          MOVE 000 TO V-TCARTERAS(I)                              RMB0016 
MICR03       ELSE                                                       RMB0016 
MICR03          MOVE V-CARTERAS(I) TO V-TCARTERAS(I)                    RMB0016 
MICR03       END-IF                                                     RMB0016 
MICR03       ADD 1 TO I                                                 RMB0016 
MICR03    END-PERFORM.                                                  RMB0016 
MICR03    IF V-CARTERAS(272) NOT NUMERIC                                RMB0016 
MICR03       IF TOT103 NOT = 0                                          RMB0016 
MICR03          DISPLAY "INCONSISTENCIA2 EN SISTEMA-MICR"               RMB0016 
MICR03          DISPLAY "V-CARTERAS(272)=",V-CARTERAS(272)              RMB0016 
MICR03          DISPLAY "TOT103       =",TOT103                         RMB0016 
MICR03       END-IF                                                     RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       IF TOT103 NOT = V-CARTERAS(272)                            RMB0016 
MICR03          DISPLAY "INCONSISTENCIA3 EN SISTEMA-MICR"               RMB0016 
MICR03          DISPLAY "V-CARTERAS(272)=",V-CARTERAS(272)              RMB0016 
MICR03          DISPLAY "TOT103       =",TOT103                         RMB0016 
MICR03       END-IF                                                     RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    IF BAL115(1)(5:1) = "-"                                       RMB0016 
MICR03       MOVE 0 TO TCR115                                           RMB0016 
MICR03       MOVE BAL115(1)(1:6) TO CR115-NUM(1:6)                      RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       MOVE "000000" TO TCR115(1:6)                               RMB0016 
MICR03       MOVE BAL115(1)(1:3) TO TCR115(2:3)                         RMB0016 
MICR03       MOVE BAL115(1)(5:2) TO TCR115(5:2)                         RMB0016 
MICR03       MOVE TCR115(1:6)    TO CR115-NUM(1:6)                      RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    IF HIP115   (5:1) = "-"                                       RMB0016 
MICR03       MOVE 0 TO TMT115                                           RMB0016 
MICR03       MOVE HIP115(1:6)    TO MT115-NUM(1:6)                      RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       MOVE "000000" TO TMT115(1:6)                               RMB0016 
MICR03       MOVE HIP115   (1:3) TO TMT115(2:3)                         RMB0016 
MICR03       MOVE HIP115   (5:2) TO TMT115(5:2)                         RMB0016 
MICR03       MOVE TMT115(1:6)    TO MT115-NUM(1:6)                      RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR02    IF BAL116(1)(5:1) = "-"                                       RMB0014 
MICR02       MOVE 0 TO TCR116                                           RMB0014 
MICR03       MOVE BAL116(1)(1:6) TO CR116-NUM(1:6)                      RMB0016 
MICR02    ELSE                                                          RMB0014 
MICR02       MOVE "000000" TO TCR116(1:6)                               RMB0014 
MICR02       MOVE BAL116(1)(1:3) TO TCR116(2:3)                         RMB0014 
MICR02       MOVE BAL116(1)(5:2) TO TCR116(5:2)                         RMB0014 
MICR02       MOVE TCR116(1:6)    TO CR116-NUM(1:6)                      RMB0014 
MICR02    END-IF.                                                       RMB0014 
MICR03    IF BAL116(2)(5:1) = "-"                                       RMB0016 
MICR03       MOVE 0 TO TBS116                                           RMB0016 
MICR03       MOVE BAL116(2)(1:6) TO BS116-NUM(1:6)                      RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       MOVE "000000" TO TBS116(1:6)                               RMB0016 
MICR03       MOVE BAL116(2)(1:3) TO TBS116(2:3)                         RMB0016 
MICR03       MOVE BAL116(2)(5:2) TO TBS116(5:2)                         RMB0016 
MICR03       MOVE TBS116(1:6)    TO BS116-NUM(1:6)                      RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    IF PRO116   (5:1) = "-"                                       RMB0016 
MICR03       MOVE 0 TO TAT116                                           RMB0016 
MICR03       MOVE PRO116(1:6)    TO AT116-NUM(1:6)                      RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       MOVE "000000" TO TAT116(1:6)                               RMB0016 
MICR03       MOVE PRO116   (1:3) TO TAT116(2:3)                         RMB0016 
MICR03       MOVE PRO116   (5:2) TO TAT116(5:2)                         RMB0016 
MICR03       MOVE TAT116(1:6)    TO AT116-NUM(1:6)                      RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    IF CR041 NOT NUMERIC MOVE 999 TO TCR041.                      RMB0016 
MICR03    IF CR100 NOT NUMERIC MOVE 999 TO TCR100.                      RMB0016 
MICR03    IF CR101 NOT NUMERIC MOVE 999 TO TCR101.                      RMB0016 
MICR03    IF CR102 NOT NUMERIC MOVE 999 TO TCR102.                      RMB0016 
MICR03    IF CR103 NOT NUMERIC MOVE 999 TO TCR103.                      RMB0016 
MICR03    IF BS041 NOT NUMERIC MOVE 999 TO TBS041.                      RMB0016 
MICR03    IF BS100 NOT NUMERIC MOVE 999 TO TBS100.                      RMB0016 
MICR03    IF BS101 NOT NUMERIC MOVE 999 TO TBS101.                      RMB0016 
MICR03    IF BS102 NOT NUMERIC MOVE 999 TO TBS102.                      RMB0016 
MICR03    IF BS103 NOT NUMERIC MOVE 999 TO TBS103.                      RMB0016 
MICR03    IF CC041 NOT NUMERIC MOVE 999 TO TCC041.                      RMB0016 
MICR03    IF CC100 NOT NUMERIC MOVE 999 TO TCC100.                      RMB0016 
MICR03    IF CC101 NOT NUMERIC MOVE 999 TO TCC101.                      RMB0016 
MICR03    IF CC102 NOT NUMERIC MOVE 999 TO TCC102.                      RMB0016 
MICR03    IF CC103 NOT NUMERIC MOVE 999 TO TCC103.                      RMB0016 
MICR03    IF OT041 NOT NUMERIC MOVE 999 TO TOT041.                      RMB0016 
MICR03    IF OT100 NOT NUMERIC MOVE 999 TO TOT100.                      RMB0016 
MICR03    IF OT101 NOT NUMERIC MOVE 999 TO TOT101.                      RMB0016 
MICR03    IF OT102 NOT NUMERIC MOVE 999 TO TOT102.                      RMB0016 
MICR03    IF OT103 NOT NUMERIC MOVE 999 TO TOT103.                      RMB0016 
MICR03    IF CK001 NUMERIC MOVE CK001 TO TCK001 ELSE MOVE 0 TO TCK001.  RMB0016 
MICR03    IF CK002 NUMERIC MOVE CK002 TO TCK002 ELSE MOVE 0 TO TCK002.  RMB0016 
MICR03    IF CR111 NUMERIC MOVE CR111 TO TCR111 ELSE MOVE 0 TO TCR111.  RMB0016 
MICR03    IF CR113 NUMERIC MOVE CR113 TO TCR113 ELSE MOVE 0 TO TCR113.  RMB0016 
MICR03    IF CR123 NUMERIC MOVE CR123 TO TCR123 ELSE MOVE 0 TO TCR123.  RMB0016 
MICR03    IF BS111 NUMERIC MOVE BS111 TO TBS111 ELSE MOVE 0 TO TBS111.  RMB0016 
MICR03    IF BS123 NUMERIC MOVE BS123 TO TBS123 ELSE MOVE 0 TO TBS123.  RMB0016 
MICR03    IF BS124 NUMERIC MOVE BS124 TO TBS124 ELSE MOVE 0 TO TBS124.  RMB0016 
MICR03    IF CC111 NUMERIC MOVE CC111 TO TCC111 ELSE MOVE 0 TO TCC111.  RMB0016 
MICR03    IF CC123 NUMERIC MOVE CC123 TO TCC123 ELSE MOVE 0 TO TCC123.  RMB0016 
MICR03    IF OT111 NUMERIC MOVE OT111 TO TOT111 ELSE MOVE 0 TO TOT111.  RMB0016 
MICR03    IF OT112 NUMERIC MOVE OT112 TO TOT112 ELSE MOVE 0 TO TOT112.  RMB0016 
MICR03    IF OT113 NUMERIC MOVE OT113 TO TOT113 ELSE MOVE 0 TO TOT113.  RMB0016 
MICR03    IF OT119 NUMERIC MOVE OT119 TO TOT119 ELSE MOVE 0 TO TOT119.  RMB0016 
MICR03    IF OT121 NUMERIC MOVE OT121 TO TOT121 ELSE MOVE 0 TO TOT121.  RMB0016 
MICR03    IF OT122 NUMERIC MOVE OT122 TO TOT122 ELSE MOVE 0 TO TOT122.  RMB0016 
MICR03    IF OT124 NUMERIC MOVE OT124 TO TOT124 ELSE MOVE 0 TO TOT124.  RMB0016 
MICR03    IF AT112 NUMERIC MOVE AT112 TO TAT112 ELSE MOVE 0 TO TAT112.  RMB0016 
MICR03    IF AT124 NUMERIC MOVE AT124 TO TAT124 ELSE MOVE 0 TO TAT124.  RMB0016 
MICR03    IF MT111 NUMERIC MOVE MT111 TO TMT111 ELSE MOVE 0 TO TMT111.  RMB0016 
MICR03    IF MT113 NUMERIC MOVE MT113 TO TMT113 ELSE MOVE 0 TO TMT113.  RMB0016 
MICR03    IF MT123 NUMERIC MOVE MT123 TO TMT123 ELSE MOVE 0 TO TMT123.  RMB0016 
REMARK*   ID005 SOLO TIENE VALORES 0 Y 1, SI es -1 SE TOMA COMO 9
MICR03    IF ID005 NUMERIC MOVE ID005 TO TID005 ELSE MOVE 9 TO TID005.  RMB0016 
MICR03    IF IQ001 NUMERIC MOVE IQ001 TO TIQ001 ELSE MOVE 0 TO TIQ001.  RMB0016 
MICR03    IF IQ002 NUMERIC MOVE IQ002 TO TIQ002 ELSE MOVE 0 TO TIQ002.  RMB0016 
MICR03    IF IQ005 NUMERIC MOVE IQ005 TO TIQ005 ELSE MOVE 0 TO TIQ005.  RMB0016 
MICR03    IF IQ013 NUMERIC MOVE IQ013 TO TIQ013 ELSE MOVE 0 TO TIQ013.  RMB0016 
MICR03    IF IQ023 NUMERIC MOVE IQ023 TO TIQ023 ELSE MOVE 0 TO TIQ023.  RMB0016 
MICR03    INITIALIZE VARIABLES-MICROCREDITO-ZERO.                       RMB0016 
MICR03    MOVE FECHA-RUN-DATE(1:4) TO M-ANO(1:4).                       RMB0016 
MICR03    IF M-ANO >= 1990 AND M-ANO <= 2009                            RMB0016 
MICR03       COMPUTE M-IANO = M-ANO - 1989                              RMB0016 
MICR03       COMPUTE M-FA = M-SALMINIMO(M-IANO) / 358                   RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       MOVE 0 TO M-FA                                             RMB0016 
MICR03    END-IF                                                        RMB0016 
MICR03    COMPUTE A-SUM001 = TCR001 + TBS001 + TCC001 + TOT001.         RMB0016 
MICR03    COMPUTE A-SUM002 = TCR002 + TBS002 + TCC002 + TOT002.         RMB0016 
MICR03    MOVE 0 TO M-SCORE.                                            RMB0016 
MICR03    IF A-SUM001 = 0 OR TIP-ID-ALE = 2 OR TIP-ID-ALE = 3           RMB0016 
MICR03       PERFORM 9810-TRU-NO-SCORE-M                                RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       IF NOT                                                     RMB0016 
MICR06*          ((TCK002 <= 3 AND TCR002 <= 1              )        ANDRMB0020 
MICR06           (((TCK002 + TCK001 ) <= 3 AND TCR001 <= 1  )        ANDRMB0020 
MICR03           (TCR123 + TBS123 - TMT123 <= 10000 * M-FA )         ANDRMB0016 
MICR03           (TMT123 <= 500 * M-FA )                             ANDRMB0016 
MICR03           (TBS111 + TOT111 + TCC111 - TMT111 <= 10000 * M-FA) ANDRMB0016 
MICR03           (TCR113 <= 3000 * M-FA )                            ANDRMB0016 
MICR03           (TMT113 <= 30000 * M-FA ))                             RMB0016 
MICR03           PERFORM 9810-PERFIL-ALTO-M                             RMB0016 
MICR03       ELSE                                                       RMB0016 
MICR03           PERFORM 9901-M-AOT                                     RMB0016 
MICR03           IF A-AOT <= 3                                          RMB0016 
MICR05              PERFORM 9810-PERFIL-SINHISTORIA-M                   RMB0019 
MICR05*             PERFORM 9810-PERFIL-ALTO-M                          RMB0019 
MICR03           ELSE                                                   RMB0016 
MICR03              PERFORM 9904-M-M120OPEOR                            RMB0016 
MICR03              IF M-M120OPEOR >= 1                                 RMB0016 
MICR03                 PERFORM 9810-PERFIL-MORAACTUAL120-M              RMB0016 
MICR03              ELSE                                                RMB0016 
MICR03                 IF M-FA = 0                                      RMB0016 
MICR03                    PERFORM 9810-FECHA-INVALIDA                   RMB0016 
MICR03                 ELSE                                             RMB0016 
CANC01                    PERFORM 990K-M-MESESCAN                       RMB0016 
CANC01                    IF M-MESESCAN > 24 AND A-SUM002 = 0           RMB0016 
MICR05                       PERFORM 9810-PERFIL-CANCELADAS             RMB0019 
MICR05*                      PERFORM 9810-PERFIL-ALTO-M                 RMB0019 
CANC01                    ELSE                                          RMB0016 
MICR03                       PERFORM 9903-M-RECDEL                      RMB0016 
MICR03                       IF 0 <= A-RECDEL AND A-RECDEL <= 23        RMB0016 
MICR03                          PERFORM 9820-SCORECARD1-M               RMB0016 
MICR03                       ELSE                                       RMB0016 
MICR03                          IF A-SUM002 <= 1                        RMB0016 
MICR03                             PERFORM 9830-SCORECARD2-M            RMB0016 
MICR03                          ELSE                                    RMB0016 
MICR03                             PERFORM 9840-SCORECARD3-M            RMB0016 
MICR03                          END-IF                                  RMB0016 
MICR03                       END-IF                                     RMB0016 
MICR03                    END-IF                                        RMB0016 
MICR03                 END-IF                                           RMB0016 
MICR03              END-IF                                              RMB0016 
MICR03           END-IF                                                 RMB0016 
MICR03        END-IF                                                    RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03 9810-TRU-NO-SCORE-M.                                             RMB0016 
REMARK*********************************************************************
REMARK*9810-TRU-NO-SCORE-M. 
REMARK* LA PERSONA QUE NO TIENE CUENTAS QUEDA CON 0 EN EL SCORE (SIN SCORE*
REMARK*********************************************************************
MICR03    MOVE 0 TO M-SCORE.                                            RMB0016 
MICR03    IF TIP-ID-ALE = 2 OR 3                                        RMB0016 
MICR03       MOVE 70  TO  M-ADVERSE-RAZON(1)                            RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       MOVE 71  TO  M-ADVERSE-RAZON(1)                            RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03 9810-PERFIL-SINHISTORIA-M.                                       RMB0016 
REMARK*********************************************************************
REMARK*9810-PERFIL-SINHISTORIA-M.
REMARK*  NO SE CALCULA EL ESCORE CUANDO LA PERSONA TIENE UN HISTORIAL DE 
REMARK*  CREDITO MUY PEQUENO
REMARK*********************************************************************
MICR06    MOVE 0       TO M-SCORE .                                     RMB0020 
MICR06    MOVE 72      TO M-ADVERSE-RAZON(1).                           RMB0020 
MICR06    MOVE 0       TO M-ADVERSE-RAZON(2).                           RMB0020 
MICR06    MOVE 0       TO M-ADVERSE-RAZON(3).                           RMB0020 
MICR06    MOVE 0       TO M-ADVERSE-RAZON(4).                           RMB0020 
MICR06*   PERFORM 9810-PERFIL-ALTO-M.                                   RMB0020 
MICR06*   IF M-SCORE = 0                                                RMB0020 
MICR06*      MOVE 72      TO M-ADVERSE-RAZON(1)                         RMB0020 
MICR06*      MOVE 0       TO M-ADVERSE-RAZON(2)                         RMB0020 
MICR06*      MOVE 0       TO M-ADVERSE-RAZON(3)                         RMB0020 
MICR06*      MOVE 0       TO M-ADVERSE-RAZON(4)                         RMB0020 
MICR06*   END-IF.                                                       RMB0020 
MICR03 9810-PERFIL-MORAACTUAL120-M.                                     RMB0016 
REMARK*********************************************************************
REMARK*9810-PERFIL-MORAACTUAL120-M.
REMARK* NO SE CALCULA EL SCORE A LAS PERSONAS QUE ACTUALMENTE PRESENTAN
REMARK* MORA DE 120 DIAS O MAYOR
REMARK*********************************************************************
MOD120    MOVE 1       TO M-SCORE .                                     RMB0017 
MICR03    MOVE 73                 TO M-ADVERSE-RAZON(1).                RMB0016 
MICR03 9810-FECHA-INVALIDA.                                             RMB0016 
REMARK*********************************************************************
REMARK*9810-FECHA-INVALIDA.
REMARK* SI LA FECHA PARA EL CALCULO DEL SCORE NO ESTA ENTRE 1990 y 2009
REMARK* SE CONSIDERA INVALIDA. ESTO POR EL MANEJO DE LOS SALARIOS MINIMOS
REMARK*********************************************************************
MICR03    MOVE 0       TO M-SCORE .                                     RMB0016 
MICR03    MOVE 74                 TO M-ADVERSE-RAZON(1).                RMB0016 
CANC01 9810-PERFIL-CANCELADAS.                                          RMB0016 
REMARK*********************************************************************
REMARK*9810-PERFIL-CANCELADAS.
REMARK*   PERSONA CON SOLO CUENATAS CANCELADAS MAS ATRAS DE 24 MESES
REMARK*********************************************************************
MICR06    MOVE 0       TO M-SCORE .                                     RMB0020 
MICR06    MOVE 75      TO M-ADVERSE-RAZON(1).                           RMB0020 
MICR06    MOVE 0       TO M-ADVERSE-RAZON(2).                           RMB0020 
MICR06    MOVE 0       TO M-ADVERSE-RAZON(3).                           RMB0020 
MICR06    MOVE 0       TO M-ADVERSE-RAZON(4).                           RMB0020 
MICR06*   PERFORM 9810-PERFIL-ALTO-M.                                   RMB0020 
MICR06*   IF M-SCORE = 0                                                RMB0020 
MICR06*      MOVE 75      TO M-ADVERSE-RAZON(1)                         RMB0020 
MICR06*      MOVE 0       TO M-ADVERSE-RAZON(2)                         RMB0020 
MICR06*      MOVE 0       TO M-ADVERSE-RAZON(3)                         RMB0020 
MICR06*      MOVE 0       TO M-ADVERSE-RAZON(4)                         RMB0020 
MICR06*   END-IF.                                                       RMB0020 
MICR03 9810-PERFIL-ALTO-M.                                              RMB0016 
REMARK*********************************************************************
REMARK*9810-PERFIL-ALTO-M.
REMARK* PERSONA CON PERFIL ALTO, SE CALCULA EL ACIERTA COMO SCORE
REMARK*********************************************************************
MICR03    PERFORM 7800-TRU-REALIZAR-SCORE-A    .                        RMB0016 
MICR03    MOVE A-SCORE TO M-SCORE .                                     RMB0016 
REMARK*   SI DA CERO SE CONSERVA LA RAZON ORIGINAL DE ACIERTA
MICR05    IF A-SCORE > 0                                                RMB0019 
MICR05       MOVE A-ADVERSE-RAZON-REAL(3) TO M-ADVERSE-RAZON(4)         RMB0019 
MICR05       MOVE A-ADVERSE-RAZON-REAL(2) TO M-ADVERSE-RAZON(3)         RMB0019 
MICR05       MOVE A-ADVERSE-RAZON-REAL(1) TO M-ADVERSE-RAZON(2)         RMB0019 
MICR05       MOVE 80                 TO M-ADVERSE-RAZON(1)              RMB0019 
MICR06    ELSE                                                          RMB0020 
MICR06       MOVE A-ADVERSE-RAZON     (4) TO M-ADVERSE-RAZON(4)         RMB0020 
MICR06       MOVE A-ADVERSE-RAZON     (3) TO M-ADVERSE-RAZON(3)         RMB0020 
MICR06       MOVE A-ADVERSE-RAZON     (2) TO M-ADVERSE-RAZON(2)         RMB0020 
MICR06       MOVE A-ADVERSE-RAZON     (1) TO M-ADVERSE-RAZON(1)         RMB0020 
MICR05    END-IF.                                                       RMB0019 
MICR03 9820-SCORECARD1-M   .                                            RMB0016 
REMARK*********************************************************************
REMARK*9820-SCORECARD1-M   .
REMARK* SCORE PARA PERFILES BAJOS QUE HAN TENIDO MOROSIDADES
REMARK*********************************************************************
MICR03    MOVE 81                 TO M-ADVERSE-RAZON(1).                RMB0016 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(2).                RMB0019 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(3).                RMB0019 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(4).                RMB0019 
MICR03    MOVE 1 TO M-SCORE-CARD.                                       RMB0016 
MICR03    PERFORM 9905-M-CBBS39.                                        RMB0016 
MICR03    PERFORM 990G-M-CBCR60.                                        RMB0016 
MICR03    PERFORM 990D-M-CUREAT.                                        RMB0016 
MICR03    PERFORM 9906-M-DEL2P.                                         RMB0016 
MICR03    PERFORM 9907-M-DERAT.                                         RMB0016 
MICR03    PERFORM 9909-M-MOS60.                                         RMB0016 
MICR03    PERFORM 990F-M-ID004.                                         RMB0016 
MICR03    PERFORM 990H-M-PCPTOP12.                                      RMB0016 
MICR03    IF PRO116   (5:1) NOT = "-"                                   RMB0016 
MICR03       IF 0          <= TAT116 AND TAT116      <= 13              RMB0016 
MICR03                                MOVE 1 TO M-AT116-1               RMB0016 
MICR03       END-IF                                                     RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    IF 4          <= TBS002 AND TBS002      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-BS002-1      END-IF.  RMB0016 
MICR03    IF 1          <= TBS057 AND TBS057      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-BS057-1      END-IF.  RMB0016 
MICR03    IF 1          <= TBS059 AND TBS059      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-BS059-1      END-IF.  RMB0016 
MICR03    IF 1          <= TBS061 AND TBS061      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-BS061-1      END-IF.  RMB0016 
MICR03    IF 002 * M-FA <= TBS124 AND TBS124      <= 107 * M-FA         RMB0016 
MICR03                                MOVE 1 TO M-BS124-1      END-IF.  RMB0016 
MICR03    IF 108 * M-FA <= TBS124 AND TBS124      <= 225 * M-FA         RMB0016 
MICR03                                MOVE 1 TO M-BS124-2      END-IF.  RMB0016 
MICR03    IF 226 * M-FA <= TBS124 AND TBS124      <= 100000000 * M-FA   RMB0016 
MICR03                                MOVE 1 TO M-BS124-3      END-IF.  RMB0016 
MICR03    IF 068 * M-FA <= TCC123 AND TCC123 <= 121 * M-FA              RMB0016 
MICR03                                MOVE 1 TO M-CC123-2      END-IF.  RMB0016 
MICR03    IF 122 * M-FA <= TCC123 AND TCC123      <= 100000000 * M-FA   RMB0016 
MICR03                                MOVE 1 TO M-CC123-3      END-IF.  RMB0016 
MICR03    IF 3          <= TCR053 AND TCR053      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-CR053-1      END-IF.  RMB0016 
MICR03    IF 99         <= TCR115 AND TCR115      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-CR115-2      END-IF.  RMB0016 
MICR03    IF 105 * M-FA <= TCR123 AND TCR123      <= 226 * M-FA         RMB0016 
MICR03                                MOVE 1 TO M-CR123-1      END-IF.  RMB0016 
MICR03    IF 227 * M-FA <= TCR123 AND TCR123      <= 324 * M-FA         RMB0016 
MICR03                                MOVE 1 TO M-CR123-2      END-IF.  RMB0016 
MICR03    IF 325 * M-FA <= TCR123 AND TCR123      <= 10000000 * M-FA    RMB0016 
MICR03                                MOVE 1 TO M-CR123-3      END-IF.  RMB0016 
MICR03    IF 3          <= TIQ001 AND TIQ001      <= 10000000           RMB0016 
MICR03                                MOVE 1 TO M-IQ001-1      END-IF.  RMB0016 
MICR03    IF 38         <= TMT115 AND TMT115      <= 132                RMB0016 
MICR03                                MOVE 1 TO M-MT115-1      END-IF.  RMB0016 
MICR03    IF 133        <= TMT115 AND TMT115      <= 10000000           RMB0016 
MICR03                                MOVE 1 TO M-MT115-2      END-IF.  RMB0016 
MICR03    IF 1          <= TOT013 AND TOT013      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-OT013-1      END-IF.  RMB0016 
MICR03    IF 1          <= TOT014 AND TOT014      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-OT014-1      END-IF.  RMB0016 
MICR03    IF 1          <= TOT030 AND TOT030      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-OT030-1      END-IF.  RMB0016 
MICR03    IF 1          <= TOT119 AND TOT119      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-OT119-1      END-IF.  RMB0016 
MICR03    IF 071 * M-FA <= TOT124 AND TOT124      <= 100000000 * M-FA   RMB0016 
MICR03                                MOVE 1 TO M-OT124-1      END-IF.  RMB0016 
MICR03    IF 51         <= A-PCTOP12  AND A-PCTOP12 <= 75               RMB0016 
MICR03                                MOVE 1 TO M-PCTOP12-1    END-IF.  RMB0016 
MICR03    IF 76         <= A-PCTOP12  AND A-PCTOP12 <= 100000000        RMB0016 
MICR03                                MOVE 1 TO M-PCTOP12-2    END-IF.  RMB0016 
MICR03    IF 2          <= A-CBBS39   AND A-CBBS39  <= 100000000        RMB0016 
MICR03                                MOVE 1 TO M-CBBS39-1     END-IF.  RMB0016 
MICR03    IF 1          <= M-CBCR60   AND M-CBCR60  <= 100000000        RMB0016 
MICR03                                MOVE 1 TO M-CBCR60-1     END-IF.  RMB0016 
MICR03    IF 2          <= A-CUREAT   AND A-CUREAT <= 100000000         RMB0016 
MICR03                                MOVE 1 TO M-CUREAT-1     END-IF.  RMB0016 
MICR03    IF 1          <= A-DEL2P    AND A-DEL2P <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-DEL2P-1      END-IF.  RMB0016 
MICR03    IF 1          <= A-DERAT    AND A-DERAT <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-DERAT-1      END-IF.  RMB0016 
MICR03    IF 1          <= M-MOS60 AND M-MOS60 <= 2                     RMB0016 
MICR03                                MOVE 1 TO M-MOS60-1      END-IF.  RMB0016 
MICR03    IF 1          <= A-RECDEL   AND A-RECDEL <= 2                 RMB0016 
MICR03                                MOVE 1 TO M-RECDEL-1     END-IF.  RMB0016 
MICR03    IF 3          <= A-RECDEL   AND A-RECDEL <= 3                 RMB0016 
MICR03                                MOVE 1 TO M-RECDEL-2     END-IF.  RMB0016 
MICR03    IF 13         <= A-RECDEL   AND A-RECDEL <= 13                RMB0016 
MICR03                                MOVE 1 TO M-RECDEL-3     END-IF.  RMB0016 
MICR03    IF 14         <= A-RECDEL   AND A-RECDEL <= 15                RMB0016 
MICR03                                MOVE 1 TO M-RECDEL-4     END-IF.  RMB0016 
MICR03    IF 16         <= A-RECDEL   AND A-RECDEL <= 18                RMB0016 
MICR03                                MOVE 1 TO M-RECDEL-5     END-IF.  RMB0016 
MICR03    IF 19         <= A-RECDEL   AND A-RECDEL <= 20                RMB0016 
MICR03                                MOVE 1 TO M-RECDEL-6     END-IF.  RMB0016 
MICR03    IF 21         <= A-RECDEL   AND A-RECDEL <= 100000000         RMB0016 
MICR03                                MOVE 1 TO M-RECDEL-7     END-IF.  RMB0016 
MICR03    COMPUTE M-SCORE ROUNDED = 450           +                     RMB0016 
MICR03                    +55      * M-AT116-1    +                     RMB0016 
MICR03                    -38      * M-BS002-1    +                     RMB0016 
MICR03                    +36      * M-BS057-1    +                     RMB0016 
MICR03                    +42      * M-BS059-1    +                     RMB0016 
MICR03                    -91      * M-BS061-1    +                     RMB0016 
MICR03                    -113     * M-BS124-1    +                     RMB0016 
MICR03                    -150     * M-BS124-2    +                     RMB0016 
MICR03                    -183     * M-BS124-3    +                     RMB0016 
MICR03                    -101     * M-CC123-2    +                     RMB0016 
MICR03                    -139     * M-CC123-3    +                     RMB0016 
MICR03                    +48      * M-CR053-1    +                     RMB0016 
MICR03                    -58      * M-CR115-2    +                     RMB0016 
MICR03                    -71      * M-CR123-1    +                     RMB0016 
MICR03                    -80      * M-CR123-2    +                     RMB0016 
MICR03                    -128     * M-CR123-3    +                     RMB0016 
MICR03                    +0.16    * A-ID004X     +                     RMB0016 
MICR03                    -64      * M-IQ001-1    +                     RMB0016 
MICR03                    -74      * M-MT115-1    +                     RMB0016 
MICR03                    -92      * M-MT115-2    +                     RMB0016 
MICR03                    -73      * M-OT013-1    +                     RMB0016 
MICR03                    -60      * M-OT014-1    +                     RMB0016 
MICR03                    -41      * M-OT030-1    +                     RMB0016 
MICR03                    -52      * M-OT119-1    +                     RMB0016 
MICR03                    -114     * M-OT124-1    +                     RMB0016 
MICR03                    -50      * M-PCTOP12-1  +                     RMB0016 
MICR03                    -70      * M-PCTOP12-2  +                     RMB0016 
MICR03                    -49      * M-CBBS39-1   +                     RMB0016 
MICR03                    -103     * M-CBCR60-1   +                     RMB0016 
MICR03                    -88      * M-CUREAT-1   +                     RMB0016 
MICR03                    -55      * M-DEL2P-1    +                     RMB0016 
MICR03                    -188     * M-DERAT-1    +                     RMB0016 
MICR03                    -53      * M-MOS60-1    +                     RMB0016 
MICR03                    -225     * M-RECDEL-1   +                     RMB0016 
MICR03                    -127     * M-RECDEL-2   +                     RMB0016 
MICR03                    +118     * M-RECDEL-3   +                     RMB0016 
MICR03                    +145     * M-RECDEL-4   +                     RMB0016 
MICR03                    +160     * M-RECDEL-5   +                     RMB0016 
MICR03                    +164     * M-RECDEL-6   +                     RMB0016 
MICR03                    +142     * M-RECDEL-7.                        RMB0016 
MICR03    IF M-SCORE <= 0   MOVE 1   TO M-SCORE.                        RMB0016 
MICR03    IF M-SCORE >= 1000 MOVE 999  TO M-SCORE.                      RMB0016 
MICR03 9830-SCORECARD2-M.                                               RMB0016 
REMARK*********************************************************************
REMARK*9830-SCORECARD2-M.
REMARK* SCORE PARA PEFIL BAJO CON BUEN COMPORTAMIENTO
REMARK*********************************************************************
MICR03    MOVE 81                 TO M-ADVERSE-RAZON(1).                RMB0016 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(2).                RMB0019 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(3).                RMB0019 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(4).                RMB0019 
MICR03    MOVE 2 TO M-SCORE-CARD.                                       RMB0016 
MICR03    IF ID004 NUMERIC                                              RMB0016 
MICR03       MOVE ID004 TO A-ID004X                                     RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       MOVE 0 TO A-ID004X                                         RMB0016 
MICR03    END-IF                                                        RMB0016 
MICR03    PERFORM 990H-M-PCPTOP12.                                      RMB0016 
MICR03    PERFORM 9902-M-AYT.                                           RMB0016 
MICR03    PERFORM 990I-M-CBBS69.                                        RMB0016 
MICR03    PERFORM 990D-M-CUREAT.                                        RMB0016 
MICR03    PERFORM 990J-M-OPOT12.                                        RMB0016 
MICR03    PERFORM 9901-M-AOT.                                           RMB0016 
MICR03    IF 1          <= TBS012     AND TBS012 <= 1                   RMB0016 
MICR03                                MOVE 1 TO M-BS012-1      END-IF.  RMB0016 
MICR03    IF BS041 NUMERIC                                              RMB0016 
MICR03       IF 10         <= TBS041     AND TBS041 <= 100000000        RMB0016 
MICR03                                MOVE 1 TO M-BS041-1               RMB0016 
MICR03       END-IF                                                     RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    IF 1          <= TCC050     AND TCC050 <= 100000000           RMB0016 
MICR03                                MOVE 1 TO M-CC050-1      END-IF.  RMB0016 
MICR03    IF 2          <= TCK001     AND TCK001 <= 100000000           RMB0016 
MICR03                                MOVE 1 TO M-CK001-1      END-IF.  RMB0016 
MICR03    IF 1          <= TCR030     AND TCR030 <= 100000000           RMB0016 
MICR03                                MOVE 1 TO M-CR030-1      END-IF.  RMB0016 
MICR03    IF 41         <= TCR111     AND TCR111 <= 100000000           RMB0016 
MICR03                                MOVE 1 TO M-CR111-1      END-IF.  RMB0016 
MICR03    IF 216        <= A-ID004X   AND A-ID004X <= 296               RMB0016 
MICR03                                MOVE 1 TO M-ID004-1      END-IF.  RMB0016 
MICR03    IF 297        <= A-ID004X   AND A-ID004X <= 328               RMB0016 
MICR03                                MOVE 1 TO M-ID004-2      END-IF.  RMB0016 
MICR03    IF 329        <= A-ID004X   AND A-ID004X <= 379               RMB0016 
MICR03                                MOVE 1 TO M-ID004-3      END-IF.  RMB0016 
MICR03    IF 546        <= A-ID004X   AND A-ID004X <= 561               RMB0016 
MICR03                                MOVE 1 TO M-ID004-4      END-IF.  RMB0016 
MICR03    IF 562        <= A-ID004X   AND A-ID004X <= 659               RMB0016 
MICR03                                MOVE 1 TO M-ID004-5      END-IF.  RMB0016 
MICR03    IF 660        <= A-ID004X   AND A-ID004X <= 720               RMB0016 
MICR03                                MOVE 1 TO M-ID004-6      END-IF.  RMB0016 
MICR03    IF 721        <= A-ID004X   AND A-ID004X <= 100000000         RMB0016 
MICR03                                MOVE 1 TO M-ID004-7      END-IF.  RMB0016 
MICR03    IF 1          <= TIQ001 AND TIQ001      <= 2                  RMB0016 
MICR03                                MOVE 1 TO M-IQ001-1      END-IF.  RMB0016 
MICR03    IF 3          <= TIQ001 AND TIQ001      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-IQ001-2      END-IF.  RMB0016 
MICR03    IF 1          <= TIQ013 AND TIQ013      <= 1                  RMB0016 
MICR03                                MOVE 1 TO M-IQ013-1      END-IF.  RMB0016 
MICR03    IF 2          <= TIQ013 AND TIQ013      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-IQ013-2      END-IF.  RMB0016 
MICR03    IF IQ023 NUMERIC                                              RMB0016 
MICR03       IF 0          <= TIQ023 AND TIQ023      <= 0               RMB0016 
MICR03                                MOVE 1 TO M-IQ023-1               RMB0016 
MICR03       END-IF                                                     RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    IF 2          <= A-PCTOP12  AND A-PCTOP12 <= 48               RMB0016 
MICR03                                MOVE 1 TO M-PCTOP12-1    END-IF.  RMB0016 
MICR03    IF 49         <= A-PCTOP12  AND A-PCTOP12 <= 97               RMB0016 
MICR03                                MOVE 1 TO M-PCTOP12-2    END-IF.  RMB0016 
MICR03    IF 3          <= A-AYT      AND A-AYT     <= 3                RMB0016 
MICR03                                MOVE 1 TO M-AYT-1        END-IF.  RMB0016 
MICR03    IF 0          <= M-CBBS69   AND M-CBBS69  <= 0                RMB0016 
MICR03                                MOVE 1 TO M-CBBS69-1     END-IF.  RMB0016 
MICR03    IF 1          <= A-CUREAT   AND A-CUREAT <= 100000000         RMB0016 
MICR03                                MOVE 1 TO M-CUREAT-1     END-IF.  RMB0016 
MICR03    IF 1          <= A-OPOT12   AND A-OPOT12 <= 1                 RMB0016 
MICR03                                MOVE 1 TO M-OPOT12-1     END-IF.  RMB0016 
MICR03    IF 6          <= TBS116     AND TBS116   <= 20                RMB0016 
MICR03                                MOVE 1 TO M-BS116-1      END-IF.  RMB0016 
MICR03    IF A-AOT > 180  MOVE 180 TO M-AOTX ELSE MOVE A-AOT TO M-AOTX. RMB0016 
MICR03    COMPUTE M-SCORE ROUNDED = 742           +                     RMB0016 
MICR03                    -10      * M-BS041-1    +                     RMB0016 
MICR03                    +47      * M-BS012-1    +                     RMB0016 
MICR03                    -104     * M-CC050-1    +                     RMB0016 
MICR03                    -44      * M-CK001-1    +                     RMB0016 
MICR03                    -167     * M-CR030-1    +                     RMB0016 
MICR03                    -43      * M-CR111-1    +                     RMB0016 
MICR03                    -81      * M-ID004-1    +                     RMB0016 
MICR03                    -59      * M-ID004-2    +                     RMB0016 
MICR03                    -32      * M-ID004-3    +                     RMB0016 
MICR03                    +46      * M-ID004-4    +                     RMB0016 
MICR03                    +49      * M-ID004-5    +                     RMB0016 
MICR03                    +74      * M-ID004-6    +                     RMB0016 
MICR03                    +78      * M-ID004-7    +                     RMB0016 
MICR03                    -99      * M-IQ001-1    +                     RMB0016 
MICR03                    -148     * M-IQ001-2    +                     RMB0016 
MICR03                    -64      * M-IQ013-1    +                     RMB0016 
MICR03                    -98      * M-IQ013-2    +                     RMB0016 
MICR03                    -63      * M-IQ023-1    +                     RMB0016 
MICR03                    +64      * M-PCTOP12-1  +                     RMB0016 
MICR03                    +35      * M-PCTOP12-2  +                     RMB0016 
MICR03                    +49      * M-AYT-1      +                     RMB0016 
MICR03                    +41      * M-CBBS69-1   +                     RMB0016 
MICR03                    -207     * M-CUREAT-1   +                     RMB0016 
MICR03                    -121     * M-OPOT12-1   +                     RMB0016 
MICR03                    -0.48    * M-AOTX       +                     RMB0016 
MICR03                    +34      * M-BS116-1.                         RMB0016 
MICR03    IF M-SCORE <= 0   MOVE 1   TO M-SCORE.                        RMB0016 
MICR03    IF M-SCORE >= 1000 MOVE 999  TO M-SCORE.                      RMB0016 
MICR03 9840-SCORECARD3-M   .                                            RMB0016 
REMARK*********************************************************************
REMARK*9840-SCORECARD1-M   .
REMARK* SCORE PARA PERFILES BAJOS                                    
REMARK*********************************************************************
MICR03    MOVE 81                 TO M-ADVERSE-RAZON(1).                RMB0016 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(2).                RMB0019 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(3).                RMB0019 
MICR05    MOVE  0                 TO M-ADVERSE-RAZON(4).                RMB0019 
MICR03    MOVE 3 TO M-SCORE-CARD.                                       RMB0016 
MICR03    PERFORM 990H-M-PCPTOP12.                                      RMB0016 
MICR03    PERFORM 9901-M-AOT.                                           RMB0016 
MICR03    PERFORM 990B-M-OPCC12.                                        RMB0016 
MICR03    PERFORM 990J-M-OPOT12.                                        RMB0016 
MICR03    PERFORM 990E-M-PCTCUR.                                        RMB0016 
MICR03    PERFORM 990C-M-PCTCUROP.                                      RMB0016 
MICR03    PERFORM 9902-M-AYT.                                           RMB0016 
MICR03    PERFORM 990F-M-ID004.                                         RMB0016 
MICR03    IF 1          <= TAT112 AND TAT112      <= 155                RMB0016 
MICR03                                MOVE 1 TO M-AT112-1      END-IF.  RMB0016 
MICR03    IF 4          <= TBS002 AND TBS002      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-BS002-1      END-IF.  RMB0016 
MICR03    IF CC010 NUMERIC                                              RMB0016 
MICR03       IF 0          <= TCC010 AND TCC010      <= 0               RMB0016 
MICR03                                MOVE 1 TO M-CC010-1               RMB0016 
MICR03       END-IF                                                     RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03    IF 3          <= TCC040 AND TCC040      <= 5                  RMB0016 
MICR03                                MOVE 1 TO M-CC040-1      END-IF.  RMB0016 
MICR03    IF 6          <= TCC040 AND TCC040      <= 9                  RMB0016 
MICR03                                MOVE 1 TO M-CC040-2      END-IF.  RMB0016 
MICR03    IF 085 * M-FA <= TCC123 AND TCC123      <= 181 * M-FA         RMB0016 
MICR03                                MOVE 1 TO M-CC123-1      END-IF.  RMB0016 
MICR03    IF 182 * M-FA <= TCC123 AND TCC123      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-CC123-2      END-IF.  RMB0016 
MICR03    IF 2          <= TCK002 AND TCK002      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-CK002-1      END-IF.  RMB0016 
MICR03    IF 1          <= TCR030 AND TCR030      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-CR030-1      END-IF.  RMB0016 
MICR03    IF 1          <= TCR031 AND TCR031      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-CR031-1      END-IF.  RMB0016 
MICR03    IF 048 * M-FA <= TCR123 AND TCR123      <= 096 * M-FA         RMB0016 
MICR03                                MOVE 1 TO M-CR123-1      END-IF.  RMB0016 
MICR03    IF 097 * M-FA <= TCR123 AND TCR123      <= 144 * M-FA         RMB0016 
MICR03                                MOVE 1 TO M-CR123-2      END-IF.  RMB0016 
MICR03    IF 145 * M-FA <= TCR123 AND TCR123      <= 261 * M-FA         RMB0016 
MICR03                                MOVE 1 TO M-CR123-3      END-IF.  RMB0016 
MICR03    IF 262 * M-FA <= TCR123 AND TCR123      <= 100000000 * M-FA   RMB0016 
MICR03                                MOVE 1 TO M-CR123-4      END-IF.  RMB0016 
MICR03    IF 2          <= TIQ001 AND TIQ001      <= 2                  RMB0016 
MICR03                                MOVE 1 TO M-IQ001-2      END-IF.  RMB0016 
MICR03    IF 3          <= TIQ001 AND TIQ001      <= 3                  RMB0016 
MICR03                                MOVE 1 TO M-IQ001-3      END-IF.  RMB0016 
MICR03    IF 4          <= TIQ001 AND TIQ001      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-IQ001-4      END-IF.  RMB0016 
MICR03    IF 1          <= TIQ002 AND TIQ002      <= 1                  RMB0016 
MICR03                                MOVE 1 TO M-IQ002-1      END-IF.  RMB0016 
MICR03    IF 2          <= TIQ002 AND TIQ002      <= 2                  RMB0016 
MICR03                                MOVE 1 TO M-IQ002-2      END-IF.  RMB0016 
MICR03    IF 3          <= TIQ002 AND TIQ002      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-IQ002-3      END-IF.  RMB0016 
MICR03    IF 1          <= TIQ013 AND TIQ013      <= 1                  RMB0016 
MICR03                                MOVE 1 TO M-IQ013-1      END-IF.  RMB0016 
MICR03    IF 1          <= TOT013 AND TOT013      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-OT013-1      END-IF.  RMB0016 
MICR03    IF 771        <= TOT112 AND TOT112      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-OT112-1      END-IF.  RMB0016 
MICR03    IF 2          <= TOT113 AND TOT113      <= 345                RMB0016 
MICR03                                MOVE 1 TO M-OT113-1      END-IF.  RMB0016 
MICR03    IF 1          <= TOT121 AND TOT121      <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-OT121-1      END-IF.  RMB0016 
MICR03    IF 44         <= A-PCTOP12  AND A-PCTOP12 <= 100000000        RMB0016 
MICR03                                MOVE 1 TO M-PCTOP12-1    END-IF.  RMB0016 
MICR03    IF 11         <= A-AOT      AND A-AOT   <= 100000000          RMB0016 
MICR03                                MOVE 1 TO M-AOT-1        END-IF.  RMB0016 
MICR03    IF 2          <= A-OPCC12   AND A-OPCC12 <= 100000000         RMB0016 
MICR03                                MOVE 1 TO M-OPCC12-1     END-IF.  RMB0016 
MICR03    IF 1          <= A-OPOT12   AND A-OPOT12 <= 1                 RMB0016 
MICR03                                MOVE 1 TO M-OPOT12-1     END-IF.  RMB0016 
MICR03    IF 2          <= A-OPOT12   AND A-OPOT12 <= 100000000         RMB0016 
MICR03                                MOVE 1 TO M-OPOT12-2     END-IF.  RMB0016 
MICR03    IF 0          <= A-PCTCUR   AND A-PCTCUR <= 18                RMB0016 
MICR03                                MOVE 1 TO M-PCTCUR-1     END-IF.  RMB0016 
MICR03    IF 19         <= A-PCTCUR   AND A-PCTCUR <= 26                RMB0016 
MICR03                                MOVE 1 TO M-PCTCUR-2     END-IF.  RMB0016 
MICR03    IF 27         <= A-PCTCUR   AND A-PCTCUR <= 30                RMB0016 
MICR03                                MOVE 1 TO M-PCTCUR-3     END-IF.  RMB0016 
MICR03    IF 31         <= A-PCTCUR   AND A-PCTCUR <= 33                RMB0016 
MICR03                                MOVE 1 TO M-PCTCUR-4     END-IF.  RMB0016 
MICR03    IF 98         <= A-PCTCUROP AND A-PCTCUROP <= 100000000       RMB0016 
MICR03                                MOVE 1 TO M-PCTCUROP-1   END-IF.  RMB0016 
MICR03    IF 4          <= A-SUM002   AND A-SUM002   <= 100000000       RMB0016 
MICR03                                MOVE 1 TO M-SUM002-1     END-IF.  RMB0016 
MICR03    IF A-AYT > 24   MOVE 24  TO M-AYTX ELSE MOVE A-AYT TO M-AYTX. RMB0016 
MICR03    COMPUTE M-SCORE ROUNDED = 439           +                     RMB0016 
MICR03                    -35      * M-AT112-1    +                     RMB0016 
MICR03                    -48      * M-BS002-1    +                     RMB0016 
MICR03                    -40      * M-CC010-1    +                     RMB0016 
MICR03                    -71      * M-CC040-1    +                     RMB0016 
MICR03                    -50      * M-CC040-2    +                     RMB0016 
MICR03                    -46      * M-CC123-1    +                     RMB0016 
MICR03                    -90      * M-CC123-2    +                     RMB0016 
MICR03                    -25      * M-CK002-1    +                     RMB0016 
MICR03                    -65      * M-CR030-1    +                     RMB0016 
MICR03                    -30      * M-CR031-1    +                     RMB0016 
MICR03                    -39      * M-CR123-1    +                     RMB0016 
MICR03                    -56      * M-CR123-2    +                     RMB0016 
MICR03                    -77      * M-CR123-3    +                     RMB0016 
MICR03                    -128     * M-CR123-4    +                     RMB0016 
MICR03                    +0.16    * A-ID004X     +                     RMB0016 
MICR03                    -61      * M-IQ001-2    +                     RMB0016 
MICR03                    -91      * M-IQ001-3    +                     RMB0016 
MICR03                    -110     * M-IQ001-4    +                     RMB0016 
MICR03                    -22      * M-IQ002-1    +                     RMB0016 
MICR03                    -36      * M-IQ002-2    +                     RMB0016 
MICR03                    -57      * M-IQ002-3    +                     RMB0016 
MICR03                    -43      * M-IQ013-1    +                     RMB0016 
MICR03                    -44      * M-OT013-1    +                     RMB0016 
MICR03                    -37      * M-OT112-1    +                     RMB0016 
MICR03                    +31      * M-OT113-1    +                     RMB0016 
MICR03                    +51      * M-OT121-1    +                     RMB0016 
MICR03                    -20      * M-PCTOP12-1  +                     RMB0016 
MICR03                    +29      * M-AOT-1      +                     RMB0016 
MICR03                    +1.039   * M-AYTX       +                     RMB0016 
MICR03                    -42      * M-OPCC12-1   +                     RMB0016 
MICR03                    -37      * M-OPOT12-1   +                     RMB0016 
MICR03                    -58      * M-OPOT12-2   +                     RMB0016 
MICR03                    +51      * M-PCTCUR-1   +                     RMB0016 
MICR03                    +34      * M-PCTCUR-2   +                     RMB0016 
MICR03                    +30      * M-PCTCUR-3   +                     RMB0016 
MICR03                    +23      * M-PCTCUR-4   +                     RMB0016 
MICR03                    +135     * M-PCTCUROP-1 +                     RMB0016 
MICR03                    -23      * M-SUM002-1.                        RMB0016 
MICR03    IF M-SCORE <= 0   MOVE 1   TO M-SCORE.                        RMB0016 
MICR03    IF M-SCORE >= 1000 MOVE 999  TO M-SCORE.                      RMB0016 
MICR03 9901-M-AOT.                                                      RMB0016 
REMARK*********************************************************************
REMARK*9901-M-AOT.        
REMARK*  CALCULO DEL HISTORIAL DE CREDITO MAS ANTIGUO                 
REMARK*********************************************************************
MICR03*  MAX(TCR040,TBS040,TCC040,TOT040)                               RMB0016 
MICR03    MOVE TCR040 TO A-AOT.                                         RMB0016 
MICR03    IF A-AOT < TBS040                                             RMB0016 
MICR03       MOVE TBS040 TO A-AOT.                                      RMB0016 
MICR03    IF A-AOT < TCC040                                             RMB0016 
MICR03       MOVE TCC040 TO A-AOT.                                      RMB0016 
MICR03    IF A-AOT < TOT040                                             RMB0016 
MICR03       MOVE TOT040 TO A-AOT.                                      RMB0016 
MICR03 9902-M-AYT.                                                      RMB0016 
REMARK*********************************************************************
REMARK*9902-M-AYT.                  
REMARK*  CALCULO DEL HISTORIAL DE CREDITO MAS RECIENTE                
REMARK*********************************************************************
MICR03*  MIN(TCR041,TBS041,TCC041,TOT041)                               RMB0016 
MICR03*   USA 999 si es negativo                                        RMB0016 
MICR03    MOVE TCR041 TO A-AYT.                                         RMB0016 
MICR03    IF A-AYT > TBS041                                             RMB0016 
MICR03       MOVE TBS041 TO A-AYT.                                      RMB0016 
MICR03    IF A-AYT > TCC041                                             RMB0016 
MICR03       MOVE TCC041 TO A-AYT.                                      RMB0016 
MICR03    IF A-AYT > TOT041                                             RMB0016 
MICR03       MOVE TOT041 TO A-AYT.                                      RMB0016 
MICR03 9903-M-RECDEL.                                                   RMB0016 
REMARK*********************************************************************
REMARK*9903-M-RECDEL.     
REMARK* ULTIMO MES EN QUE SE PRESENTO UNA MORA
REMARK*********************************************************************
MICR03*  MIN(TCR100,TBS101,TCC101,TOT101,TCR102,TBS102,TCC102.TOT103)   RMB0016 
MICR03*                     MOS30                                       RMB0016 
MICR03    MOVE TCR100 TO A-RECDEL                                       RMB0016 
MICR03    IF A-RECDEL > TBS100                                          RMB0016 
MICR03       MOVE TBS100 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TCC100                                          RMB0016 
MICR03       MOVE TCC100 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TOT100                                          RMB0016 
MICR03       MOVE TOT100 TO A-RECDEL.                                   RMB0016 
MICR03*                     MOS60                                       RMB0016 
MICR03    IF A-RECDEL > TCR101                                          RMB0016 
MICR03       MOVE TCR101 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TBS101                                          RMB0016 
MICR03       MOVE TBS101 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TCC101                                          RMB0016 
MICR03       MOVE TCC101 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TOT101                                          RMB0016 
MICR03       MOVE TOT101 TO A-RECDEL.                                   RMB0016 
MICR03*                     MOS90                                       RMB0016 
MICR03    IF A-RECDEL > TCR102                                          RMB0016 
MICR03       MOVE TCR102 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TBS102                                          RMB0016 
MICR03       MOVE TBS102 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TCC102                                          RMB0016 
MICR03       MOVE TCC102 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TOT102                                          RMB0016 
MICR03       MOVE TOT102 TO A-RECDEL.                                   RMB0016 
MICR03*                     MOS120                                      RMB0016 
MICR03    IF A-RECDEL > TCR103                                          RMB0016 
MICR03       MOVE TCR103 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TBS103                                          RMB0016 
MICR03       MOVE TBS103 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TCC103                                          RMB0016 
MICR03       MOVE TCC103 TO A-RECDEL.                                   RMB0016 
MICR03    IF A-RECDEL > TOT103                                          RMB0016 
MICR03       MOVE TOT103 TO A-RECDEL.                                   RMB0016 
MICR03 9904-M-M120OPEOR.                                                RMB0016 
REMARK********************************************************************
REMARK*9904-M-M120OPEOR.                                               
REMARK*   SE SUMAN LAS OCURRENCIAS DE LAS MORAS DE 120 O PEOR
REMARK********************************************************************
MICR03    COMPUTE M-M120OPEOR =                                         RMB0016 
MICR03            TCR067 + TCR076 + TCR080 + TCR084 + TCR088 +          RMB0016 
MICR03            TCR051 + TCR089 + TCR090 + TCR092 + TCR094 +          RMB0016 
MICR03            TBS067 + TBS076 + TBS080 + TBS084 + TBS088 +          RMB0016 
MICR03            TBS051 + TBS089 + TBS090 + TBS092 + TBS094 +          RMB0016 
MICR03            TCC067 + TCC076 + TCC080 + TCC084 + TCC088 +          RMB0016 
MICR03            TCC051 + TCC089 + TCC090 + TCC092 + TCC094 +          RMB0016 
MICR03            TOT067 + TOT076 + TOT080 + TOT084 + TOT088 +          RMB0016 
MICR03            TOT051 + TOT089 + TOT090 + TOT092 + TOT094 .          RMB0016 
MICR03 9905-M-CBBS39.                                                   RMB0016 
REMARK********************************************************************
REMARK*9905-M-CBBS39.     
REMARK* NUMERO DE MORA DE 30 A 90
REMARK********************************************************************
MICR03    COMPUTE A-CBBS39 = TBS056 + TBS060 + TBS064 +                 RMB0016 
MICR03                       TBS057 + TBS061 + TBS065 + TBS068 +        RMB0016 
MICR03                       TBS074 + TBS077 + TBS078 +                 RMB0016 
MICR03                       TBS058 + TBS062 + TBS066 + TBS069 +        RMB0016 
MICR03                       TBS070 + TBS075 + TBS079 + TBS081 +        RMB0016 
MICR03                       TBS082 + TBS083.                           RMB0016 
MICR03 9906-M-DEL2P.                                                    RMB0016 
REMARK********************************************************************
REMARK*9906-M-DEL2P.                                                    RMB0004
REMARK* NUMERO DE MORAS HISTORICAS
REMARK********************************************************************
MICR03    COMPUTE A-DEL2P = TCR068 + TCR069 + TCR070 + TCR071 + TCR072 +RMB0016 
MICR03                    TCR073 + TCR074 + TCR075 + TCR076 + TCR077 +  RMB0016 
MICR03                    TCR078 + TCR079 + TCR080 + TCR081 + TCR082 +  RMB0016 
MICR03                    TCR083 + TCR084 + TCR085 + TCR086 + TCR087 +  RMB0016 
MICR03                    TCR088 +                                      RMB0016 
MICR03                    TBS068 + TBS069 + TBS070 + TBS071 + TBS072 +  RMB0016 
MICR03                    TBS073 + TBS074 + TBS075 + TBS076 + TBS077 +  RMB0016 
MICR03                    TBS078 + TBS079 + TBS080 + TBS081 + TBS082 +  RMB0016 
MICR03                    TBS083 + TBS084 + TBS085 + TBS086 + TBS087 +  RMB0016 
MICR03                    TBS088 +                                      RMB0016 
MICR03                    TCC068 + TCC069 + TCC070 + TCC071 + TCC072 +  RMB0016 
MICR03                    TCC073 + TCC074 + TCC075 + TCC076 + TCC077 +  RMB0016 
MICR03                    TCC078 + TCC079 + TCC080 + TCC081 + TCC082 +  RMB0016 
MICR03                    TCC083 + TCC084 + TCC085 + TCC086 + TCC087 +  RMB0016 
MICR03                    TCC088 +                                      RMB0016 
MICR03                    TOT068 + TOT069 + TOT070 + TOT071 + TOT072 +  RMB0016 
MICR03                    TOT073 + TOT074 + TOT075 + TOT076 + TOT077 +  RMB0016 
MICR03                    TOT078 + TOT079 + TOT080 + TOT081 + TOT082 +  RMB0016 
MICR03                    TOT083 + TOT084 + TOT085 + TOT086 + TOT087 +  RMB0016 
MICR03                    TOT088.                                       RMB0016 
MICR03 9907-M-DERAT.                                                    RMB0016 
REMARK********************************************************************
REMARK*9907-M-DERAT.                                                    RMB0004
REMARK* NUMERO DE MORAS GRAVES
REMARK********************************************************************
MICR03    COMPUTE A-DERAT = TCR051 + TCR089 + TCR090 + TCR092 + TCR093 +RMB0016 
MICR03                      TCR094 +                                    RMB0016 
MICR03                      TBS051 + TBS089 + TBS090 + TBS092 + TBS093 +RMB0016 
MICR03                      TBS094 +                                    RMB0016 
MICR03                      TCC051 + TCC089 + TCC090 + TCC092 + TCC093 +RMB0016 
MICR03                      TCC094 +                                    RMB0016 
MICR03                      TOT051 + TOT089 + TOT090 + TOT092 + TOT093 +RMB0016 
MICR03                      TOT094.                                     RMB0016 
MICR03 9908-M-MOS30.                                                    RMB0016 
REMARK********************************************************************
REMARK*9908-M-MOS30.                                                    RMB0004
REMARK* MESES DE LA MORA DE 30 MAS RECIENTE
REMARK********************************************************************
MICR03*  MIN(TCR100,TBS100,TCC100,TOT100)                               RMB0016 
MICR03*  USA 999 si es negativo                                         RMB0016 
MICR03    MOVE TCR100 TO A-MOS30.                                       RMB0016 
MICR03    IF A-MOS30 > TBS100                                           RMB0016 
MICR03       MOVE TBS100 TO A-MOS30.                                    RMB0016 
MICR03    IF A-MOS30 > TCC100                                           RMB0016 
MICR03       MOVE TCC100 TO A-MOS30.                                    RMB0016 
MICR03    IF A-MOS30 > TOT100                                           RMB0016 
MICR03       MOVE TOT100 TO A-MOS30.                                    RMB0016 
MICR03 9909-M-MOS60.                                                    RMB0016 
REMARK********************************************************************
REMARK*9909-M-MOS60.                                                    RMB0004
REMARK* MESES DE LA MORA DE 60 MAS RECIENTE
REMARK********************************************************************
MICR03*  MIN(TCR101,TBS101,TCC101,TOT101)                               RMB0016 
MICR03*  USA 999 si es negativo                                         RMB0016 
MICR03    MOVE TCR101 TO M-MOS60.                                       RMB0016 
MICR03    IF M-MOS60 > TBS101                                           RMB0016 
MICR03       MOVE TBS101 TO M-MOS60.                                    RMB0016 
MICR03    IF M-MOS60 > TCC101                                           RMB0016 
MICR03       MOVE TCC101 TO M-MOS60.                                    RMB0016 
MICR03    IF M-MOS60 > TOT101                                           RMB0016 
MICR03       MOVE TOT101 TO M-MOS60.                                    RMB0016 
MICR03 990A-M-MOSBS30P.                                                 RMB0016 
REMARK********************************************************************
REMARK*990A-M-MOSBS30P.                                                 RMB0004
REMARK* MESES DE LA MORA MAS RECIENTE EN PRESTAMOS BANCARIOS
REMARK********************************************************************
MICR03*  A-MOSBS30P = MIN(TBS103,TBS102,TBS101,TBS100)                  RMB0016 
MICR03*  NO USA 999 si es negativo lo deja en -1                        RMB0016 
MICR03    MOVE TBS103 TO A-MOSBS30P.                                    RMB0016 
MICR03    IF A-MOSBS30P > TBS102                                        RMB0016 
MICR03       MOVE TBS102 TO A-MOSBS30P.                                 RMB0016 
MICR03    IF A-MOSBS30P > TBS101                                        RMB0016 
MICR03       MOVE TBS101 TO A-MOSBS30P.                                 RMB0016 
MICR03    IF A-MOSBS30P > TBS100                                        RMB0016 
MICR03       MOVE TBS100 TO A-MOSBS30P.                                 RMB0016 
MICR03    IF BS103 NOT NUMERIC AND                                      RMB0016 
MICR03       BS102 NOT NUMERIC AND                                      RMB0016 
MICR03       BS101 NOT NUMERIC AND                                      RMB0016 
MICR03       BS100 NOT NUMERIC                                          RMB0016 
MICR03       MOVE -1 TO A-MOSBS30P                                      RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03 990B-M-OPCC12.                                                   RMB0016 
REMARK*********************************************************************
REMARK*990B-M-OPCC12.                                                   RMB0004
REMARK* NUMERO DE CARTERAS DE COMUNICACIONSE ABIERTAS EN LOS ULTIMOS 12 MESES
REMARK*********************************************************************
MICR03    COMPUTE A-OPCC12 = TCC030 + TCC031.                           RMB0016 
MICR03 990C-M-PCTCUROP.                                                 RMB0016 
REMARK*********************************************************************
REMARK*990C-M-PCTCUROP.
REMARK*  RELACION ENTRE CUENTAS AL DIA SOBRE ABIERTAS                     *
REMARK*********************************************************************
MICR03    IF (TCR002 + TBS002 + TCC002 + TOT002) > 0                    RMB0016 
MICR03       COMPUTE A-PCTCUROP ROUNDED = 100 *                         RMB0016 
MICR03                           (TCR050 + TBS050 + TCC050 + TOT050 )/  RMB0016 
MICR03                           (TCR002 + TBS002 + TCC002 + TOT002)    RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       MOVE -1 TO A-PCTCUROP                                      RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03 990D-M-CUREAT.                                                   RMB0016 
REMARK*********************************************************************
REMARK*990D-M-CUREAT.     
REMARK* NUMEROS DE CUENTAS QUE ESTAN Al DIA
REMARK*********************************************************************
MICR03    COMPUTE A-CUREAT = TCR060 + TCR061 + TCR062 + TCR063 +        RMB0016 
MICR03                       TCR068 + TCR069 + TCR070 + TCR071 +        RMB0016 
MICR03                       TCR072 + TCR073 + TCR077 + TCR081 +        RMB0016 
MICR03                       TCR082 + TCR085 + TCR086 + TCR087 +        RMB0016 
MICR03                       TBS060 + TBS061 + TBS062 + TBS063 +        RMB0016 
MICR03                       TBS068 + TBS069 + TBS070 + TBS071 +        RMB0016 
MICR03                       TBS072 + TBS073 + TBS077 + TBS081 +        RMB0016 
MICR03                       TBS082 + TBS085 + TBS086 + TBS087 +        RMB0016 
MICR03                       TCC060 + TCC061 + TCC062 + TCC063 +        RMB0016 
MICR03                       TCC068 + TCC069 + TCC070 + TCC071 +        RMB0016 
MICR03                       TCC072 + TCC073 + TCC077 + TCC081 +        RMB0016 
MICR03                       TCC082 + TCC085 + TCC086 + TCC087 +        RMB0016 
MICR03                       TOT060 + TOT061 + TOT062 + TOT063 +        RMB0016 
MICR03                       TOT068 + TOT069 + TOT070 + TOT071 +        RMB0016 
MICR03                       TOT072 + TOT073 + TOT077 + TOT081 +        RMB0016 
MICR03                       TOT082 + TOT085 + TOT086 + TOT087.         RMB0016 
MICR03    IF A-CUREAT = 0                                               RMB0016 
MICR03       IF CR060 NOT NUMERIC AND CR061 NOT NUMERIC AND             RMB0016 
MICR03          CR062 NOT NUMERIC AND CR063 NOT NUMERIC AND             RMB0016 
MICR03          CR068 NOT NUMERIC AND CR069 NOT NUMERIC AND             RMB0016 
MICR03          CR070 NOT NUMERIC AND CR071 NOT NUMERIC AND             RMB0016 
MICR03          CR072 NOT NUMERIC AND CR073 NOT NUMERIC AND             RMB0016 
MICR03          CR077 NOT NUMERIC AND CR081 NOT NUMERIC AND             RMB0016 
MICR03          CR082 NOT NUMERIC AND CR085 NOT NUMERIC AND             RMB0016 
MICR03          CR086 NOT NUMERIC AND CR087 NOT NUMERIC AND             RMB0016 
MICR03          BS060 NOT NUMERIC AND BS061 NOT NUMERIC AND             RMB0016 
MICR03          BS062 NOT NUMERIC AND BS063 NOT NUMERIC AND             RMB0016 
MICR03          BS068 NOT NUMERIC AND BS069 NOT NUMERIC AND             RMB0016 
MICR03          BS070 NOT NUMERIC AND BS071 NOT NUMERIC AND             RMB0016 
MICR03          BS072 NOT NUMERIC AND BS073 NOT NUMERIC AND             RMB0016 
MICR03          BS077 NOT NUMERIC AND BS081 NOT NUMERIC AND             RMB0016 
MICR03          BS082 NOT NUMERIC AND BS085 NOT NUMERIC AND             RMB0016 
MICR03          BS086 NOT NUMERIC AND BS087 NOT NUMERIC AND             RMB0016 
MICR03          CC060 NOT NUMERIC AND CC061 NOT NUMERIC AND             RMB0016 
MICR03          CC062 NOT NUMERIC AND CC063 NOT NUMERIC AND             RMB0016 
MICR03          CC068 NOT NUMERIC AND CC069 NOT NUMERIC AND             RMB0016 
MICR03          CC070 NOT NUMERIC AND CC071 NOT NUMERIC AND             RMB0016 
MICR03          CC072 NOT NUMERIC AND CC073 NOT NUMERIC AND             RMB0016 
MICR03          CC077 NOT NUMERIC AND CC081 NOT NUMERIC AND             RMB0016 
MICR03          CC082 NOT NUMERIC AND CC085 NOT NUMERIC AND             RMB0016 
MICR03          CC086 NOT NUMERIC AND CC087 NOT NUMERIC AND             RMB0016 
MICR03          OT060 NOT NUMERIC AND OT061 NOT NUMERIC AND             RMB0016 
MICR03          OT062 NOT NUMERIC AND OT063 NOT NUMERIC AND             RMB0016 
MICR03          OT068 NOT NUMERIC AND OT069 NOT NUMERIC AND             RMB0016 
MICR03          OT070 NOT NUMERIC AND OT071 NOT NUMERIC AND             RMB0016 
MICR03          OT072 NOT NUMERIC AND OT073 NOT NUMERIC AND             RMB0016 
MICR03          OT077 NOT NUMERIC AND OT081 NOT NUMERIC AND             RMB0016 
MICR03          OT082 NOT NUMERIC AND OT085 NOT NUMERIC AND             RMB0016 
MICR03          OT086 NOT NUMERIC AND OT087 NOT NUMERIC                 RMB0016 
MICR03          MOVE -1 TO A-CUREAT                                     RMB0016 
MICR03        END-IF                                                    RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03 990E-M-PCTCUR.                                                   RMB0016 
REMARK*********************************************************************
REMARK*990E-M-PCTCUR.
REMARK*  RELACION ENTRE CUENTAS AL DIA SOBRE TOTAL DE CUENTAS (CARD 1 Y 5)*
REMARK*********************************************************************
MICR03    COMPUTE A-PCTCUR ROUNDED = 100 *                              RMB0016 
MICR03                           (TCR050 + TBS050 + TCC050 + TOT050) /  RMB0016 
MICR03                                                      A-SUM001.   RMB0016 
MICR03 990F-M-ID004.                                                    RMB0016 
REMARK*********************************************************************
REMARK*990F-M-ID004.   
REMARK*  MESES DE EDAD . SI NO SE TIENE SE ASUMEN 18 ANOS DE EDAD         *
REMARK*********************************************************************
MICR03    IF ID004 NOT NUMERIC                                          RMB0016 
MICR03       MOVE 216 TO A-ID004X                                       RMB0016 
MICR03    ELSE                                                          RMB0016 
MICR03       IF ID004 >= 780                                            RMB0016 
MICR03          MOVE 780 TO A-ID004X                                    RMB0016 
MICR03       ELSE                                                       RMB0016 
MICR03          MOVE ID004 TO A-ID004X                                  RMB0016 
MICR03       END-IF                                                     RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03 990G-M-CBCR60.                                                   RMB0016 
REMARK*********************************************************************
REMARK*990G-M-CBCR60.
REMARK*  MORAS DE 60 EN TARJETA DE CREDITO
REMARK*********************************************************************
MICR03    COMPUTE M-CBCR60  = TCR057 + TCR061 + TCR065 + TCR068 +       RMB0016 
MICR03                        TCR074 + TCR077 + TCR078 .                RMB0016 
MICR03 990H-M-PCPTOP12.                                                 RMB0016 
REMARK*********************************************************************
REMARK*990H-M-PCPTOP12.
REMARK*  CUENTAS ABIERTAS ENTRE 0 Y 12 MESES 
REMARK*********************************************************************
MICR03    COMPUTE A-PCTOP12 = TCR030 + TBS030 + TCC030 + TOT030 +       RMB0016 
MICR03                        TCR031 + TBS031 + TCC031 + TOT031 .       RMB0016 
MICR03    COMPUTE A-PCTOP12 ROUNDED = 100 *  A-PCTOP12 / A-SUM001.      RMB0016 
MICR03 990I-M-CBBS69.                                                   RMB0016 
REMARK*********************************************************************
REMARK*990I-M-CBBS69.     
REMARK*  NUMERO DE MORAS 60 Y 90 PRESTAMOS BANCARIOS
REMARK*********************************************************************
MICR03    COMPUTE M-CBBS69 =                                            RMB0016 
MICR03                      TBS057 + TBS061 + TBS065 + TBS068 + TBS074 +RMB0016 
MICR03                      TBS077 + TBS078 + TBS058 + TBS062 + TBS066 +RMB0016 
MICR03                      TBS069 + TBS070 + TBS075 + TBS079 + TBS081 +RMB0016 
MICR03                      TBS082 + TBS083.                            RMB0016 
MICR03    IF M-CBBS69 = 0                                               RMB0016 
MICR03       IF BS057 NOT NUMERIC AND BS061 NOT NUMERIC AND             RMB0016 
MICR03          BS065 NOT NUMERIC AND BS068 NOT NUMERIC AND             RMB0016 
MICR03          BS074 NOT NUMERIC AND BS077 NOT NUMERIC AND             RMB0016 
MICR03          BS078 NOT NUMERIC AND BS058 NOT NUMERIC AND             RMB0016 
MICR03          BS062 NOT NUMERIC AND BS066 NOT NUMERIC AND             RMB0016 
MICR03          BS069 NOT NUMERIC AND BS070 NOT NUMERIC AND             RMB0016 
MICR03          BS075 NOT NUMERIC AND BS079 NOT NUMERIC AND             RMB0016 
MICR03          BS081 NOT NUMERIC AND BS082 NOT NUMERIC AND             RMB0016 
MICR03          BS083 NOT NUMERIC                                       RMB0016 
MICR03          MOVE -1 TO M-CBBS69                                     RMB0016 
MICR03        END-IF                                                    RMB0016 
MICR03    END-IF.                                                       RMB0016 
MICR03 990J-M-OPOT12.                                                   RMB0016 
REMARK*********************************************************************
REMARK*990J-M-OPOT12.                                                   RMB0004
REMARK* NUMERO DE CARTERAS DE OTRAS          ABIERTAS EN LOS ULTIMOS 12 MESES
REMARK*********************************************************************
MICR03    COMPUTE A-OPOT12 = TOT030 + TOT031.                           RMB0016 
CANC01 990K-M-MESESCAN.                                                 RMB0016 
REMARK********************************************************************
REMARK*990A-M-MESESCAN.                                                 RMB0004
REMARK* MESES DE LA MORA MAS RECIENTE EN PRESTAMOS BANCARIOS
REMARK********************************************************************
CANC01*  M-MESESCAN = MIN(TCR003,TBS003,TCC003,TOT003)                  RMB0016 
CANC01*  NO USA 999 si es negativo lo deja en -1                        RMB0016 
CANC01    IF CR003 NUMERIC MOVE CR003 TO TCR003 ELSE MOVE 999 TO TCR003.RMB0016 
CANC01    IF BS003 NUMERIC MOVE BS003 TO TBS003 ELSE MOVE 999 TO TBS003.RMB0016 
CANC01    IF CC003 NUMERIC MOVE CC003 TO TCC003 ELSE MOVE 999 TO TCC003.RMB0016 
CANC01    IF OT003 NUMERIC MOVE OT003 TO TOT003 ELSE MOVE 999 TO TOT003.RMB0016 
CANC01    MOVE TCR003 TO M-MESESCAN.                                    RMB0016 
CANC01    IF M-MESESCAN > TBS003                                        RMB0016 
CANC01       MOVE TBS003 TO M-MESESCAN.                                 RMB0016 
CANC01    IF M-MESESCAN > TCC003                                        RMB0016 
CANC01       MOVE TCC003 TO M-MESESCAN.                                 RMB0016 
CANC01    IF M-MESESCAN > TOT003                                        RMB0016 
CANC01       MOVE TOT003 TO M-MESESCAN.                                 RMB0016 
CANC01    IF M-MESESCAN = 999     *> SE CONTROLA EL MOVIMIENTO 999      RMB0016 
CANC01       MOVE -1     TO M-MESESCAN.                                 RMB0016 
CANC01    IF CR003 NOT NUMERIC AND                                      RMB0016 
CANC01       BS003 NOT NUMERIC AND                                      RMB0016 
CANC01       CC003 NOT NUMERIC AND                                      RMB0016 
CANC01       OT003 NOT NUMERIC                                          RMB0016 
CANC01       MOVE -1 TO M-MESESCAN                                      RMB0016 
CANC01    END-IF.                                                       RMB0016 
ACIEME********************** NUEVO SCORES ACIERTA PLUS *****************RMB0021 
NEWSCO 11800-TRU-REALIZAR-SCORE-P.      
REMARK********************************************************************
REMARK*11800-TRU-REALIZAR-SCORE-P.      
REMARK* AQUI SE ENSAMBLARA EL NUEVO SCORE ACIERTA PLUS                   *
ACIEME****************COMIENZO CALCULO DE ACIERTA PLUS **************** RMB0021 
ACIEME    INITIALIZE ADV-ACIERTA-PLUS.                                  RMB0021 
ACIEME    MOVE 0 TO P-SCORE-CARD.                                       RMB0021 
ACIEME    IF IQ01X(4)(1:3) NOT =  IQ014                                 RMB0021 
ACIEME       DISPLAY "INCONSISTENCIA1  EN SISTEMA"                      RMB0021 
ACIEME       DISPLAY "IQ01X(4)=",IQ01X(4)                               RMB0021 
ACIEME       DISPLAY "IQ014   =",IQ014                                  RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    MOVE 1 TO I.                                                  RMB0021 
ACIEME    PERFORM UNTIL I > 408                                         RMB0021 
ACIEME       IF V-CARTERAS(I) NOT NUMERIC                               RMB0021 
ACIEME          MOVE 000 TO V-TCARTERAS(I)                              RMB0021 
ACIEME       ELSE                                                       RMB0021 
ACIEME          MOVE V-CARTERAS(I) TO V-TCARTERAS(I)                    RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME       ADD 1 TO I                                                 RMB0021 
ACIEME    END-PERFORM.                                                  RMB0021 
ACIEME    IF V-CARTERAS(408) NOT NUMERIC                                RMB0021 
ACIEME       IF TCP103 NOT = 0                                          RMB0021 
ACIEME          DISPLAY "INCONSISTENCIA2 EN SISTEMA"                    RMB0021 
ACIEME          DISPLAY "V-CARTERAS(408)=",V-CARTERAS(408)              RMB0021 
ACIEME          DISPLAY "TCP103       =",TCP103                         RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       IF TCP103 NOT = V-CARTERAS(408)                            RMB0021 
ACIEME          DISPLAY "INCONSISTENCIA3 EN SISTEMA"                    RMB0021 
ACIEME          DISPLAY "V-CARTERAS(408)=",V-CARTERAS(408)              RMB0021 
ACIEME          DISPLAY "TCP103       =",TCP103                         RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME*   VARIABLES NO CONVERTIDAS EN LA PARTE AUTOMATICA               RMB0021 
ACIEME    IF CR104 NUMERIC MOVE CR104 TO TCR104.                        RMB0021 
ACIEME    IF BS104 NUMERIC MOVE BS104 TO TBS104.                        RMB0021 
ACIEME    IF CC104 NUMERIC MOVE CC104 TO TCC104.                        RMB0021 
ACIEME    IF OT104 NUMERIC MOVE OT104 TO TOT104.                        RMB0021 
ACIEME    IF MT104 NUMERIC MOVE MT104 TO TMT104.                        RMB0021 
ACIEME    IF CR105 NUMERIC MOVE CR105 TO TCR105.                        RMB0021 
ACIEME    IF BS105 NUMERIC MOVE BS105 TO TBS105.                        RMB0021 
ACIEME    IF CC105 NUMERIC MOVE CC105 TO TCC105.                        RMB0021 
ACIEME    IF OT105 NUMERIC MOVE OT105 TO TOT105.                        RMB0021 
ACIEME    IF MT105 NUMERIC MOVE MT105 TO TMT105.                        RMB0021 
ACIEME    IF CR041 NOT NUMERIC MOVE 999 TO TCR041.                      RMB0021 
ACIEME    IF CR100 NOT NUMERIC MOVE 999 TO TCR100.                      RMB0021 
ACIEME    IF CR101 NOT NUMERIC MOVE 999 TO TCR101.                      RMB0021 
ACIEME    IF CR102 NOT NUMERIC MOVE 999 TO TCR102.                      RMB0021 
ACIEME    IF CR103 NOT NUMERIC MOVE 999 TO TCR103.                      RMB0021 
ACIEME    IF CR104 NOT NUMERIC MOVE 999 TO TCR104.                      RMB0021 
ACIEME    IF CR105 NOT NUMERIC MOVE 999 TO TCR105.                      RMB0021 
ACIEME    IF BS041 NOT NUMERIC MOVE 999 TO TBS041.                      RMB0021 
ACIEME    IF BS100 NOT NUMERIC MOVE 999 TO TBS100.                      RMB0021 
ACIEME    IF BS101 NOT NUMERIC MOVE 999 TO TBS101.                      RMB0021 
ACIEME    IF BS102 NOT NUMERIC MOVE 999 TO TBS102.                      RMB0021 
ACIEME    IF BS103 NOT NUMERIC MOVE 999 TO TBS103.                      RMB0021 
ACIEME    IF BS104 NOT NUMERIC MOVE 999 TO TBS104.                      RMB0021 
ACIEME    IF BS105 NOT NUMERIC MOVE 999 TO TBS105.                      RMB0021 
ACIEME    IF CC041 NOT NUMERIC MOVE 999 TO TCC041.                      RMB0021 
ACIEME    IF CC100 NOT NUMERIC MOVE 999 TO TCC100.                      RMB0021 
ACIEME    IF CC101 NOT NUMERIC MOVE 999 TO TCC101.                      RMB0021 
ACIEME    IF CC102 NOT NUMERIC MOVE 999 TO TCC102.                      RMB0021 
ACIEME    IF CC103 NOT NUMERIC MOVE 999 TO TCC103.                      RMB0021 
ACIEME    IF CC104 NOT NUMERIC MOVE 999 TO TCC104.                      RMB0021 
ACIEME    IF CC105 NOT NUMERIC MOVE 999 TO TCC105.                      RMB0021 
ACIEME    IF OT041 NOT NUMERIC MOVE 999 TO TOT041.                      RMB0021 
ACIEME    IF OT100 NOT NUMERIC MOVE 999 TO TOT100.                      RMB0021 
ACIEME    IF OT101 NOT NUMERIC MOVE 999 TO TOT101.                      RMB0021 
ACIEME    IF OT102 NOT NUMERIC MOVE 999 TO TOT102.                      RMB0021 
ACIEME    IF OT103 NOT NUMERIC MOVE 999 TO TOT103.                      RMB0021 
ACIEME    IF OT104 NOT NUMERIC MOVE 999 TO TOT104.                      RMB0021 
ACIEME    IF OT105 NOT NUMERIC MOVE 999 TO TOT105.                      RMB0021 
ACIEME    IF MT041 NOT NUMERIC MOVE 999 TO TMT041.                      RMB0021 
ACIEME    IF MT100 NOT NUMERIC MOVE 999 TO TMT100.                      RMB0021 
ACIEME    IF MT101 NOT NUMERIC MOVE 999 TO TMT101.                      RMB0021 
ACIEME    IF MT102 NOT NUMERIC MOVE 999 TO TMT102.                      RMB0021 
ACIEME    IF MT103 NOT NUMERIC MOVE 999 TO TMT103.                      RMB0021 
ACIEME    IF MT104 NOT NUMERIC MOVE 999 TO TMT104.                      RMB0021 
ACIEME    IF MT105 NOT NUMERIC MOVE 999 TO TMT105.                      RMB0021 
ACIEME************** OTRAS VARIABLES A CONVERTIR *********************  RMB0021 
REMARK*   ESTAS VARIABLES SE CONVIERTEN ANTES DE CADA PREGUNTA PARA
REMARK*   EVITAR LAS FALTA DE CONVERSION                             *
ACIERT************** OTRAS VARIABLES A CONVERTIR *********************  RMB0004 
ACIEME*   IF AT124 NUMERIC MOVE AT124 TO TAT124 ELSE MOVE 0 TO TAT124.  RMB0021 
ACIEME*   IF CC111 NUMERIC MOVE CC111 TO TCC111 ELSE MOVE 0 TO TCC111.  RMB0021 
ACIEME*   IF IQ001 NUMERIC MOVE IQ001 TO TIQ001 ELSE MOVE 0 TO TIQ001.  RMB0021 
ACIEME*   IF IQ002 NUMERIC MOVE IQ002 TO TIQ002 ELSE MOVE 0 TO TIQ002.  RMB0021 
REMARK**********************FIN CONVERSION A NUMERICO DE VARIABLES *******
REMARK* SE CALCULAN LAS VARIABLES INICIALES QUE DECIDEN EN QUE SCORE CARD*
REMARK* SE CLASIFICA LA PERSONA A SER ANALIZADA                          *
REMARK********************************************************************
ACIEME    MOVE FECHA-RUN-DATE(1:4) TO M-ANO(1:4).                       RMB0021 
ACIEME    IF M-ANO >= 1990 AND M-ANO <= 2009 AND P-MUESTRA = 0          RMB0021 
ACIEME       COMPUTE M-IANO = M-ANO - 1989                              RMB0021 
ACIEME       COMPUTE P-INDEX = 385 / M-SALMINIMO(M-IANO)                RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       MOVE 1 TO P-INDEX                                          RMB0021 
ACIEME    END-IF                                                        RMB0021 
ACIEME    COMPUTE P-SUM001 = TCR001 + TBS001 + TCC001 + TOT001 + TMT001.RMB0021 
ACIEME    MOVE 0 TO P-SCORE.                                            RMB0021 
ACIEME    IF P-SUM001 = 0 OR TIP-ID-ALE = 2 OR TIP-ID-ALE = 3           RMB0021 
ACIEME       PERFORM 11810-TRU-NO-SCORE-P                               RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       PERFORM 11820-VAR-SPLITS-P                                 RMB0021 
ACIEME       IF P-SOLOCELU > -1                                         RMB0021 
ACIEME          MOVE 1 TO P-SCORE-CARD                                  RMB0021 
ACIEME          PERFORM 11820-TRU-SCORECARD01-P                         RMB0021 
ACIEME       ELSE                                                       RMB0021 
ACIEME       IF P-CBAT90P > 0                                           RMB0021 
ACIEME          MOVE 2 TO P-SCORE-CARD                                  RMB0021 
ACIEME          PERFORM 11830-TRU-SCORECARD02-P                         RMB0021 
ACIEME       ELSE                                                       RMB0021 
ACIEME          IF P-AOT <= 15                                          RMB0021 
ACIEME             MOVE 3 TO P-SCORE-CARD                               RMB0021 
ACIEME             PERFORM 11840-TRU-SCORECARD03-P                      RMB0021 
ACIEME          ELSE                                                    RMB0021 
ACIEME             IF MT001 NUMERIC   *> MAYOR DE -1                    RMB0021 
ACIEME                MOVE 4 TO P-SCORE-CARD                            RMB0021 
ACIEME                PERFORM 11850-TRU-SCORECARD04-P                   RMB0021 
ACIEME             ELSE                                                 RMB0021 
ACIEME                IF P-AYT <= 6                                     RMB0021 
ACIEME                   MOVE 5 TO P-SCORE-CARD                         RMB0021 
ACIEME                   PERFORM 11860-TRU-SCORECARD05-P                RMB0021 
ACIEME                ELSE                                              RMB0021 
ACIEME                   IF CC001 NOT NUMERIC  *> MENOR O IGUAL A -1    RMB0021 
ACIEME                      MOVE 6 TO P-SCORE-CARD                      RMB0021 
ACIEME                      PERFORM 11870-TRU-SCORECARD06-P             RMB0021 
ACIEME                   ELSE                                           RMB0021 
ACIEME                      MOVE 7 TO P-SCORE-CARD                      RMB0021 
ACIEME                      PERFORM 11880-TRU-SCORECARD07-P             RMB0021 
ACIEME                   END-IF                                         RMB0021 
ACIEME                END-IF                                            RMB0021 
ACIEME             END-IF                                               RMB0021 
ACIEME          END-IF                                                  RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    MOVE P-SCORE TO P-SCORE-REAL.                                 RMB0021 
ACIEME    MOVE P-ADVERSE-RAZON(1) TO P-ADVERSE-RAZON-REAL(1).           RMB0021 
ACIEME    MOVE P-ADVERSE-RAZON(2) TO P-ADVERSE-RAZON-REAL(2).           RMB0021 
ACIEME    MOVE P-ADVERSE-RAZON(3) TO P-ADVERSE-RAZON-REAL(3).           RMB0021 
ACIEME    MOVE P-ADVERSE-RAZON(4) TO P-ADVERSE-RAZON-REAL(4).           RMB0021 
ACIEME    MOVE 0 TO P-EXCLUSIONES.                                      RMB0021 
ACIEME    IF P-SCORE > 0                                                RMB0021 
ACIEME       PERFORM 11890-EXCLUSIONES-P.                               RMB0021 
ACIEME 11810-TRU-NO-SCORE-P.                                            RMB0021 
REMARK*********************************************************************
REMARK*11810-TRU-NO-SCORE-P.
REMARK* LA PERSONA QUE NO TIENE CUENTAS QUEDA CON 0 EN EL SCORE (SIN SCORE*
REMARK*********************************************************************
ACIEME    MOVE 0 TO P-SCORE.                                            RMB0021 
ACIEME    IF TIP-ID-ALE = 2 OR 3                                        RMB0021 
ACIEME       MOVE 70  TO  P-ADVERSE-RAZON(1)                            RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       MOVE 71  TO  P-ADVERSE-RAZON(1)                            RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME 11820-VAR-SPLITS-P.                                              RMB0021 
REMARK*********************************************************************
REMARK*7815-VAR-SPLITS.
REMARK* SE CALCULAN LAS VARIABLES QUE DECIDEN A QUE SCORECARD SE CLASIFICA*
REMARK*********************************************************************
ACIEME    IF P-SUM001 = TCC001                                          RMB0021 
ACIEME       MOVE TCC001 TO P-SOLOCELU                                  RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       MOVE -1 TO P-SOLOCELU                                      RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    COMPUTE P-CBAT90 = TCR058 + TCR062 + TCR066 + TCR069 +        RMB0021 
ACIEME                       TCR070 + TCR075 + TCR079 + TCR081 +        RMB0021 
ACIEME                       TCR082 + TCR083 +                          RMB0021 
ACIEME                       TBS058 + TBS062 + TBS066 + TBS069 +        RMB0021 
ACIEME                       TBS070 + TBS075 + TBS079 + TBS081 +        RMB0021 
ACIEME                       TBS082 + TBS083 +                          RMB0021 
ACIEME                       TCC058 + TCC062 + TCC066 + TCC069 +        RMB0021 
ACIEME                       TCC070 + TCC075 + TCC079 + TCC081 +        RMB0021 
ACIEME                       TCC082 + TCC083 +                          RMB0021 
ACIEME                       TOT058 + TOT062 + TOT066 + TOT069 +        RMB0021 
ACIEME                       TOT070 + TOT075 + TOT079 + TOT081 +        RMB0021 
ACIEME                       TOT082 + TOT083 +                          RMB0021 
ACIEME                       TMT058 + TMT062 + TMT066 + TMT069 +        RMB0021 
ACIEME                       TMT070 + TMT075 + TMT079 + TMT081 +        RMB0021 
ACIEME                       TMT082 + TMT083                            RMB0021 
ACIEME    COMPUTE P-CBAT120 =TCR059 + TCR063 + TCR067 + TCR071 +        RMB0021 
ACIEME                      TCR072 + TCR073 + TCR076 + TCR080 +         RMB0021 
ACIEME                      TCR084 + TCR085 + TCR086 + TCR087 + TCR088 +RMB0021 
ACIEME                      TBS059 + TBS063 + TBS067 + TBS071 +         RMB0021 
ACIEME                      TBS072 + TBS073 + TBS076 + TBS080 +         RMB0021 
ACIEME                      TBS084 + TBS085 + TBS086 + TBS087 + TBS088 +RMB0021 
ACIEME                      TCC059 + TCC063 + TCC067 + TCC071 +         RMB0021 
ACIEME                      TCC072 + TCC073 + TCC076 + TCC080 +         RMB0021 
ACIEME                      TCC084 + TCC085 + TCC086 + TCC087 + TCC088 +RMB0021 
ACIEME                      TOT059 + TOT063 + TOT067 + TOT071 +         RMB0021 
ACIEME                      TOT072 + TOT073 + TOT076 + TOT080 +         RMB0021 
ACIEME                      TOT084 + TOT085 + TOT086 + TOT087 + TOT088 +RMB0021 
ACIEME                      TMT059 + TMT063 + TMT067 + TMT071 +         RMB0021 
ACIEME                      TMT072 + TMT073 + TMT076 + TMT080 +         RMB0021 
ACIEME                      TMT084 + TMT085 + TMT086 + TMT087 + TMT088. RMB0021 
ACIEME    COMPUTE P-DERAT = TCR051 + TCR089 + TCR090 + TCR092 + TCR093 +RMB0021 
ACIEME                      TCR094 +                                    RMB0021 
ACIEME                      TBS051 + TBS089 + TBS090 + TBS092 + TBS093 +RMB0021 
ACIEME                      TBS094 +                                    RMB0021 
ACIEME                      TCC051 + TCC089 + TCC090 + TCC092 + TCC093 +RMB0021 
ACIEME                      TCC094 +                                    RMB0021 
ACIEME                      TOT051 + TOT089 + TOT090 + TOT092 + TOT093 +RMB0021 
ACIEME                      TOT094 +                                    RMB0021 
ACIEME                      TMT051 + TMT089 + TMT090 + TMT092 + TMT093 +RMB0021 
ACIEME                      TMT094.                                     RMB0021 
ACIEME   COMPUTE P-CBAT90P = P-CBAT90 + P-CBAT120 + P-DERAT.            RMB0021 
ACIEM9   COMPUTE P-CBAT120P = P-CBAT120 + P-DERAT.                      RMB0025
ACIEME*  MAX(TCR040,TBS040,TCC040,TOT040,TMT040)                        RMB0021 
ACIEME    MOVE TCR040 TO P-AOT.                                         RMB0021 
ACIEME    IF P-AOT < TBS040                                             RMB0021 
ACIEME       MOVE TBS040 TO P-AOT.                                      RMB0021 
ACIEME    IF P-AOT < TCC040                                             RMB0021 
ACIEME       MOVE TCC040 TO P-AOT.                                      RMB0021 
ACIEME    IF P-AOT < TOT040                                             RMB0021 
ACIEME       MOVE TOT040 TO P-AOT.                                      RMB0021 
ACIEME    IF P-AOT < TMT040                                             RMB0021 
ACIEME       MOVE TMT040 TO P-AOT.                                      RMB0021 
ACIEME*  MIN(TCR041,TBS041,TCC041,TOT041)                               RMB0021 
ACIEME*   USA 999 si es negativo                                        RMB0021 
ACIEME    MOVE TCR041 TO P-AYT.                                         RMB0021 
ACIEME    IF P-AYT > TBS041                                             RMB0021 
ACIEME       MOVE TBS041 TO P-AYT.                                      RMB0021 
ACIEME    IF P-AYT > TCC041                                             RMB0021 
ACIEME       MOVE TCC041 TO P-AYT.                                      RMB0021 
ACIEME    IF P-AYT > TOT041                                             RMB0021 
ACIEME       MOVE TOT041 TO P-AYT.                                      RMB0021 
ACIEME    IF P-AYT > TMT041                                             RMB0021 
ACIEME       MOVE TMT041 TO P-AYT.                                      RMB0021 
NEWSCO 11820-TRU-SCORECARD01-P.
REMARK*********************************************************************
REMARK*7820-TRU-SCORECARD01-P.
REMARK* IMPLEMENTACION DEL SCORE-CARD 1 DE ACIERTA-PLUS
REMARK*********************************************************************
ACIEM1    PERFORM 12001-P-RECDEL-DECDELP.                               RMB0021 
ACIEM1    PERFORM 12002-P-TOT90P.                                       RMB0021 
ACIEM1    IF ID004 NOT NUMERIC                                          RMB0021 
ACIEM1       MOVE  240 TO P-ID004F                                      RMB0021 
ACIEM1    ELSE                                                          RMB0021 
ERR002       IF ID004 <= 240                                            RMB0004
ACIEM1          MOVE 240 TO P-ID004F                                    RMB0021 
ACIEM1       ELSE                                                       RMB0021 
ACIEM1         IF ID004 >= 660                                          RMB0021 
ACIEM1            MOVE 660 TO P-ID004F                                  RMB0021 
ACIEM1         ELSE                                                     RMB0021 
ACIEM1            MOVE ID004 TO P-ID004F                                RMB0021 
ACIEM1         END-IF                                                   RMB0021 
ACIEM1      END-IF                                                      RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ACIEM1    INITIALIZE VARIABLES-DUMMYS-ACIERTA-PLUS.                     RMB0021 
ACIEM1    IF 000 <= P-AOT AND P-AOT <=  059 MOVE 1 TO P-AOT001 END-IF.  RMB0021 
ACIEM1    IF 060 <= P-AOT AND P-AOT <=  081 MOVE 1 TO P-AOT002 END-IF.  RMB0021 
ACIEM1    IF 082 <= P-AOT                   MOVE 1 TO P-AOT003 END-IF.  RMB0021 
ACIEM1    IF AH003 NOT NUMERIC              MOVE 1 TO P-AH003001 END-IF.RMB0021 
ACIEM1    IF AH003 NUMERIC                                              RMB0021 
ACIEM1     IF 000 <= AH003 AND AH003 <=  043 MOVE 1 TO P-AH003002 END-IFRMB0021 
ACIEM1     IF 044 <= AH003 AND AH003 <=  078 MOVE 1 TO P-AH003003 END-IFRMB0021 
ACIEM1     IF 079 <= AH003                   MOVE 1 TO P-AH003004 END-IFRMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ACIERT    IF AT124 NUMERIC MOVE AT124 TO TAT124 ELSE MOVE 0 TO TAT124.  RMB0004 
ACIEM1    IF AT124 NOT NUMERIC               MOVE 1 TO P-AT124001 END-IFRMB0021 
ACIEM1    IF AT124 NUMERIC                                              RMB0021 
ACIEM1     IF  000 <=  TAT124 * P-INDEX  AND                            RMB0021 
ACIEM1               TAT124 * P-INDEX <= 020 MOVE 1 TO P-AT124002       RMB0021 
ACIEM1     END-IF                                                       RMB0021 
ACIEM1     IF 021 <= TAT124 * P-INDEX        MOVE 1 TO P-AT124003       RMB0021 
ACIEM1     END-IF                                                       RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ACIEM1    IF CC002 NUMERIC                                              RMB0021 
ACIEM1     IF 000  = CC002                  MOVE 1 TO P-CC002001 END-IF RMB0021 
ACIEM1     IF 001 <= CC002                  MOVE 1 TO P-CC002002 END-IF RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ACIEM1    IF CC111 NUMERIC MOVE CC111 TO TCC111 ELSE MOVE 0 TO TCC111.  RMB0021 
ACIEM1    IF CC111 NOT NUMERIC    MOVE 1 TO P-CC111001 END-IF.          RMB0021 
ACIEM1    IF CC111 NUMERIC                                              RMB0021 
ACIEM1     IF 000 <= TCC111 * P-INDEX AND                               RMB0021 
ACIEM1               TCC111 * P-INDEX <= 083 MOVE 1 TO P-CC111002       RMB0021 
ACIEM1     END-IF                                                       RMB0021 
ACIEM1     IF 084 <= TCC111 * P-INDEX        MOVE 1 TO P-CC111003       RMB0021 
ACIEM1     END-IF                                                       RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ACIEM1    IF IQ013 NOT NUMERIC    MOVE 1 TO P-IQ013001 END-IF.          RMB0021 
ACIEM1    IF IQ013 NUMERIC                                              RMB0021 
ACIEM1     IF 000  = IQ013                  MOVE 1 TO P-IQ013001 END-IF RMB0021 
ACIEM1     IF 001  = IQ013                  MOVE 1 TO P-IQ013002 END-IF RMB0021 
ACIEM1     IF 002  = IQ013                  MOVE 1 TO P-IQ013003 END-IF RMB0021 
ACIEM1     IF 003 <= IQ013                  MOVE 1 TO P-IQ013004 END-IF RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ACIEM1    IF 000 <= P-AYT AND P-AYT <=  004 MOVE 1 TO P-AYT001 END-IF.  RMB0021 
ACIEM1    IF 005 <= P-AYT         MOVE 1 TO P-AYT002 END-IF.            RMB0021 
ACIEM1    IF ID007 NUMERIC                                              RMB0021 
ACIEM1     IF ID007 = 7                     MOVE 1 TO P-ID007001 END-IF RMB0021 
ACIEM1     IF ID007 = 3 OR 5                MOVE 1 TO P-ID007002 END-IF RMB0021 
ACIEM1     IF ID007 = 12 OR 13 OR 21 OR 28  MOVE 1 TO P-ID007003 END-IF RMB0021 
ACIEM1     IF ID007 = 48                    MOVE 1 TO P-ID007003 END-IF RMB0021 
ACIEM1     IF ID007 NOT = (07 AND 03 AND 05 AND 12 AND 13 AND 21 AND    RMB0021 
ACIEM1                     28 AND 48 )                                  RMB0021 
ACIEM1                                      MOVE 1 TO P-ID007004        RMB0021 
ACIEM1     END-IF                                                       RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ERR001    IF 000 <= P-RECDELP AND 
ACIEM1              P-RECDELP <=  001 MOVE 1 TO P-RECDELP001            RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ERR001    IF 002 <= P-RECDELP AND
ACIEM1              P-RECDELP <=  002 MOVE 1 TO P-RECDELP002            RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ERR001    IF 003 <= P-RECDELP AND 
ACIEM1              P-RECDELP <=  005 MOVE 1 TO P-RECDELP003            RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ERR001    IF 006 <= P-RECDELP AND 
ACIEM1              P-RECDELP <=  011 MOVE 1 TO P-RECDELP004            RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ERR001    IF 012 <= P-RECDELP         MOVE 1 TO P-RECDELP005 END-IF.    RMB0004 
ACIEM1    IF P-AOT > 15 AND P-TOT90P <= 0 AND P-SUM001 > 1              RMB0021 
ACIEM1       MOVE 1  TO P-HIBRIDA001                                    RMB0021 
ACIEM1    ELSE                                                          RMB0021 
ACIEM1       MOVE 1  TO P-HIBRIDA002                                    RMB0021 
ACIEM1    END-IF.                                                       RMB0021 
ACIEM1    COMPUTE P-SCOREN        = 1.8782        +                     RMB0021 
ACIEM1                    +0       * P-AOT001     +                     RMB0021 
ACIEM1                    +0.5145  * P-AOT002     +                     RMB0021 
ACIEM1                    +0.7356  * P-AOT003     +                     RMB0021 
ACIEM1                    +0       * P-AH003001   +                     RMB0021 
ACIEM1                    +0       * P-AH003002   +                     RMB0021 
ACIEM1                    +0.2484  * P-AH003003   +                     RMB0021 
ACIEM1                    +0.3947  * P-AH003004   +                     RMB0021 
ACIEM1                    +0       * P-AT124001   +                     RMB0021 
ACIEM1                    +0       * P-AT124002   +                     RMB0021 
ACIEM1                    -0.5291  * P-AT124003   +                     RMB0021 
ACIEM1                    +0.3204  * P-CC002001   +                     RMB0021 
ACIEM1                    +0       * P-CC002002   +                     RMB0021 
ACIEM1                    +0       * P-CC111001   +                     RMB0021 
ACIEM1                    +0       * P-CC111002   +                     RMB0021 
ACIEM1                   -0.4793   * P-CC111003   +                     RMB0021 
ACIEM1                   +0        * P-IQ013001   +                     RMB0021 
ACIEM1                   +0        * P-IQ013002   +                     RMB0021 
ACIEM1                   -0.4201   * P-IQ013003   +                     RMB0021 
ACIEM1                   -0.6932   * P-IQ013004   +                     RMB0021 
ACIEM1                   -0.5762   * P-AYT001     +                     RMB0021 
ACIEM1                   +0        * P-AYT002     +                     RMB0021 
ACIEM1                   +0.0006     * P-ID004F   +                     RMB0021 
ACIEM1*                  +0.00062327 * P-ID004F   + DABAN DIFERENCIAS 2 RMB0021 
ACIEM1                   +0.2101   * P-ID007001   +                     RMB0021 
ACIEM1                   -0.5183   * P-ID007002   +                     RMB0021 
ACIEM1                   -0.6225   * P-ID007003   +                     RMB0021 
ACIEM1                   +0        * P-ID007004   +                     RMB0021 
ACIEM1                   -2.114    * P-RECDELP001 +                     RMB0021 
ACIEM1                   -1.6526   * P-RECDELP002 +                     RMB0021 
ACIEM1                   -1.1522   * P-RECDELP003 +                     RMB0021 
ACIEM1                   -0.9895   * P-RECDELP004 +                     RMB0021 
ACIEM1                   +0        * P-RECDELP005 +                     RMB0021 
ACIEM1                   +0.1245   * P-HIBRIDA001 +                     RMB0021 
ACIEM1                   0         * P-HIBRIDA002 .                     RMB0021 
ACIEM1    MOVE -02504.31955783529     TO P-COEF1.                       RMB0021 
ACIEM1    MOVE +19269.5164017271      TO P-COEF2.                       RMB0021 
ACIEM1    MOVE -09190.14412506333     TO P-COEF3.                       RMB0021 
ACIEM1    MOVE +03633.30697392006     TO P-COEF4.                       RMB0021 
ACIEM1    MOVE -37709.0758095821      TO P-COEF5.                       RMB0021 
ACIEM1    MOVE +27264.069874109       TO P-COEF6.                       RMB0021 
ACIEM1    COMPUTE P-SCOREN = ( 1 / (1 + 2.717281828 ** (- P-SCOREN))).  RMB0021 
ACIEM1    COMPUTE P-SCOREN1 = (P-COEF1      )                        +  RMB0021 
ACIEM1                       (P-COEF2 * (P-SCOREN ** 1 ))           +   RMB0021 
ACIEM1                       (P-COEF3 * (P-SCOREN ** 2 ))           +   RMB0021 
ACIEM1                       (P-COEF4 * (P-SCOREN ** 3 ))           +   RMB0021 
ACIEM1                       (P-COEF5 * (P-SCOREN ** 0.5))          +   RMB0021 
ACIEM1                       (P-COEF6 * (P-SCOREN ** 0.33))             RMB0021 
ACIEM1    COMPUTE P-SCORE ROUNDED = P-SCOREN1.                          RMB0021 
ACIEM1    IF P-SCORE <= 150 MOVE 150 TO P-SCORE.                        RMB0021 
ACIEM1    IF P-SCORE >= 850 MOVE 850 TO P-SCORE.                        RMB0021 
REMARK****************COMIENZO CALCULO PARA LAS RAZONES *************
REMARK*    SE DEBEN PONER TODOS LOS PESOS DE MAYOR A MENOR Y POR    *
REMARK*    ULTIMO LAS VARIABLES CONTINUAS                           *
REMARK***************************************************************
ACIEM1    PERFORM 18005-P-PREPARE-AA.                                   RMB0021 
ACIEM1    IF P-RECDELP001    = 1                                        RMB0021 
ACIEM1       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 2.1140 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-RECDELP002    = 1                                        RMB0021 
ACIEM1       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 1.6526 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-RECDELP003    = 1                                        RMB0021 
ACIEM1       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 1.1522 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-RECDELP004    = 1                                        RMB0021 
ACIEM1       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.9895 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-ID007003      = 1                                        RMB0021 
ACIEM1       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.8326 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-AOT001        = 1                                        RMB0021 
ACIEM1       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.7356 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-ID007002      = 1                                        RMB0021 
ACIEM1       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.7284 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-IQ013004      = 1                                        RMB0021 
ACIEM1       MOVE 19 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.6932 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-AYT001        = 1                                        RMB0021 
ACIEM1       MOVE 23 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.5762 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-AT124003      = 1                                        RMB0021 
ACIEM1       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.5291 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-CC111003      = 1                                        RMB0021 
ACIEM1       MOVE 15 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.4793 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-IQ013003      = 1                                        RMB0021 
ACIEM1       MOVE 19 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.4201 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-AH003001      = 1                                        RMB0021 
ACIEM1       MOVE 49 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.3947 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-AH003002      = 1                                        RMB0021 
ACIEM1       MOVE 49 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.3947 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-CC002002      = 1                                        RMB0021 
ACIEM1       MOVE 54 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.3204 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-AOT002        = 1                                        RMB0021 
ACIEM1       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.2211 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-ID007004      = 1                                        RMB0021 
ACIEM1       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.2101 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-AH003003      = 1                                        RMB0021 
ACIEM1       MOVE 49 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.1463 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM1    IF P-HIBRIDA002    = 1                                        RMB0021 
ACIEM1       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM1          MOVE 0.1245 TO P-DIFFERENCE                             RMB0021 
ACIEM1          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
REMARK************COMIENZO VARIABLES CONTINUAS ***************************
ACIEM1    IF P-ID004F NOT = 660                                         RMB0021 
ACIEM1       COMPUTE P-TEMP1 = (660 - P-ID004F) * 0.0006                RMB0021 
ACIEM1       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM1       PERFORM 18001-P-INSERTE-CONTINUA.                          RMB0021 
ACIEM2 11830-TRU-SCORECARD02-P.                                         RMB0021 
EMARK*********************************************************************
REMARK*11830-TRU-SCORECARD02-P.
REMARK* IMPLEMENTACION DEL SCORE-CARD 2 DE ACIERTA-PLUS
REMARK*********************************************************************
ACIEM2    PERFORM 12001-P-RECDEL-DECDELP.                               RMB0021 
ACIEM2    PERFORM 12002-P-TOT90P.                                       RMB0021 
ACIEM2    COMPUTE P-SUM002 = TCR002 + TBS002 + TCC002 + TOT002 + TMT002.RMB0021 
ACIEM2    PERFORM 12003-P-TOT30.                                        RMB0021 
ACIEM2    PERFORM 12004-P-TOT60.                                        RMB0021 
ACIEM2    IF IQ001 NUMERIC MOVE IQ001 TO TIQ001 ELSE MOVE 0 TO TIQ001.  RMB0021 
ACIEM2    IF IQ002 NUMERIC MOVE IQ002 TO TIQ002 ELSE MOVE 0 TO TIQ002.  RMB0021 
ERR003    COMPUTE P-IQ1-2 = TIQ001 + TIQ002.
ACIEM2    IF TBS002 > 0                                                 RMB0021 
ACIEM2       COMPUTE P-BSBS ROUNDED = (TBS050 / TBS002 ) * 100          RMB0021 
ACIEM2    ELSE                                                          RMB0021 
ACIEM2       MOVE -1 TO P-BSBS                                          RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF TMT002 > 0                                                 RMB0021 
ACIEM2       COMPUTE P-MTMT ROUNDED = (TMT050 / TMT002 ) * 100          RMB0021 
ACIEM2    ELSE                                                          RMB0021 
ACIEM2       MOVE -1 TO P-MTMT                                          RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    PERFORM 12005-P-MOSCR30P.                                     RMB0021 
ACIEM2    PERFORM 12006-P-PCT69.                                        RMB0021 
ACIEM2    INITIALIZE VARIABLES-DUMMYS-ACIERTA-PLUS.                     RMB0021 
ACIEM2    IF NOT (P-AOT > 15 AND P-TOT90P <= 0 AND P-SUM001 > 1 )       RMB0021 
ACIEM2       MOVE 1  TO P-HIBRIDA003                                    RMB0021 
ACIEM2    ELSE                                                          RMB0021 
ACIEM2       MOVE 0  TO P-HIBRIDA003                                    RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF P-AOT > 15 AND P-TOT90P <= 0 AND P-SUM001 > 1 AND          RMB0021 
ACIEM2       P-SUM002 <= 1                                              RMB0021 
ACIEM2       MOVE 1  TO P-HIBRIDA004                                    RMB0021 
ACIEM2    ELSE                                                          RMB0021 
ACIEM2       MOVE 0  TO P-HIBRIDA004                                    RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF P-AOT > 15 AND P-TOT90P <= 0 AND P-SUM001 > 1 AND          RMB0021 
ACIEM2       2 <= P-SUM002 AND P-SUM002 <= 3                            RMB0021 
ACIEM2       MOVE 1  TO P-HIBRIDA005                                    RMB0021 
ACIEM2    ELSE                                                          RMB0021 
ACIEM2       MOVE 0  TO P-HIBRIDA005                                    RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF P-AOT > 15 AND P-TOT90P <= 0 AND P-SUM001 > 1 AND          RMB0021 
ACIEM2       P-SUM002 > 3                                               RMB0021 
ACIEM2       MOVE 1  TO P-HIBRIDA006                                    RMB0021 
ACIEM2    ELSE                                                          RMB0021 
ACIEM2       MOVE 0  TO P-HIBRIDA006                                    RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF ID007 NUMERIC                                              RMB0021 
ACIEM2     IF ID007 = 48 OR 03              MOVE 1 TO P-ID007005 END-IF RMB0021 
ACIEM2     IF ID007 = 09 OR 26              MOVE 1 TO P-ID007006 END-IF RMB0021 
ACIEM2     IF ID007 = 21 OR 13              MOVE 1 TO P-ID007007 END-IF RMB0021 
ACIEM2     IF ID007 = 24                    MOVE 1 TO P-ID007008 END-IF RMB0021 
ACIEM2     IF ID007 NOT = ( 48 AND 3 AND 9 AND 26 AND 21 AND 13 AND 24 )RMB0021 
ACIEM2                                      MOVE 1 TO P-ID007009 END-IF RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 000 <= P-AOT AND P-AOT <=  016 MOVE 1 TO P-AOT004 END-IF.  RMB0021 
ACIEM2    IF 017 <= P-AOT AND P-AOT <=  021 MOVE 1 TO P-AOT005 END-IF.  RMB0021 
ACIEM2    IF 022 <= P-AOT AND P-AOT <=  026 MOVE 1 TO P-AOT006 END-IF.  RMB0021 
ACIEM2    IF 027 <= P-AOT AND P-AOT <=  221 MOVE 1 TO P-AOT007 END-IF.  RMB0021 
ACIEM2    IF 222 <= P-AOT AND P-AOT <=  247 MOVE 1 TO P-AOT008 END-IF.  RMB0021 
ACIEM2    IF 248 <= P-AOT AND P-AOT <=  296 MOVE 1 TO P-AOT009 END-IF.  RMB0021 
ACIEM2    IF 297 <= P-AOT                   MOVE 1 TO P-AOT010 END-IF.  RMB0021 
REMARK*******************VARIABLE 115 CONTIENE PUNTO DECIMAL ***********
ACIEM2    IF CR115    (5:1) = "-"                                       RMB0021 
ACIEM2       MOVE 1 TO P-CR115001                                       RMB0021 
ACIEM2    ELSE                                                          RMB0021 
ACIEM2       MOVE "000000" TO TCR115(1:6)                               RMB0021 
ACIEM2       MOVE CR115    (1:3) TO TCR115(2:3)                         RMB0021 
ACIEM2       MOVE CR115    (5:2) TO TCR115(5:2)                         RMB0021 
ACIEM2    IF 000 <= TCR115 AND TCR115 <= 000 MOVE 1 TO P-CR115002 END-IFRMB0021 
ACIEM2    IF 000  < TCR115 AND TCR115 <= 008 MOVE 1 TO P-CR115003 END-IFRMB0021 
ACIEM2    IF 008  < TCR115 AND TCR115 <= 018 MOVE 1 TO P-CR115004 END-IFRMB0021 
ACIEM2    IF 018  < TCR115 AND TCR115 <= 029 MOVE 1 TO P-CR115005 END-IFRMB0021 
ACIEM2    IF 029  < TCR115 AND TCR115 <= 065 MOVE 1 TO P-CR115006 END-IFRMB0021 
ACIEM2    IF 065  < TCR115 AND TCR115 <= 075 MOVE 1 TO P-CR115007 END-IFRMB0021 
ACIEM2    IF 075  < TCR115 AND TCR115 <= 085 MOVE 1 TO P-CR115008 END-IFRMB0021 
ACIEM2    IF 085  < TCR115 AND TCR115 <= 101 MOVE 1 TO P-CR115009 END-IFRMB0021 
ACIEM2    IF 101  < TCR115                   MOVE 1 TO P-CR115010 END-IFRMB0021 
ACIEM2    END-IF.                                                       RMB0021 
REMARK******************************************************************
ACIERT    IF AT124 NUMERIC MOVE AT124 TO TAT124 ELSE MOVE 0 TO TAT124.  RMB0004 
ACIEM2    IF AT124 NOT NUMERIC               MOVE 1 TO P-AT124004 END-IFRMB0021 
ACIEM2    IF AT124 NUMERIC                                              RMB0021 
ACIEM2     IF  000 <=  TAT124 * P-INDEX  AND                            RMB0021 
ACIEM2               TAT124 * P-INDEX <= 000 MOVE 1 TO P-AT124005       RMB0021 
ACIEM2     END-IF                                                       RMB0021 
ACIEM2     IF  001 <=  TAT124 * P-INDEX  AND                            RMB0021 
ACIEM2               TAT124 * P-INDEX <= 023 MOVE 1 TO P-AT124006       RMB0021 
ACIEM2     END-IF                                                       RMB0021 
ACIEM2     IF  024 <=  TAT124 * P-INDEX  AND                            RMB0021 
ACIEM2               TAT124 * P-INDEX <= 048 MOVE 1 TO P-AT124007       RMB0021 
ACIEM2     END-IF                                                       RMB0021 
ACIEM2     IF  049 <=  TAT124 * P-INDEX  AND                            RMB0021 
ACIEM2               TAT124 * P-INDEX <= 080 MOVE 1 TO P-AT124008       RMB0021 
ACIEM2     END-IF                                                       RMB0021 
ACIEM2     IF 081 <= TAT124 * P-INDEX        MOVE 1 TO P-AT124009       RMB0021 
ACIEM2     END-IF                                                       RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 000 <= P-TOT30 AND P-TOT30 <=  000                         RMB0021 
ACIEM2                                     MOVE 1 TO P-TOT30001 END-IF. RMB0021 
ACIEM2    IF 001 <= P-TOT30                MOVE 1 TO P-TOT30002 END-IF. RMB0021 
ACIEM2    IF 000 <= P-TOT60 AND P-TOT60 <=  000                         RMB0021 
ACIEM2                                     MOVE 1 TO P-TOT60001 END-IF. RMB0021 
ACIEM2    IF 001 <= P-TOT60                MOVE 1 TO P-TOT60002 END-IF. RMB0021 
ACIEM2    IF        P-RECDEL  <   002 MOVE 1 TO P-RECDEL001     END-IF. RMB0021 
ACIEM2    IF 002 <= P-RECDEL AND                                        RMB0021 
ACIEM2              P-RECDEL  <=  002 MOVE 1 TO P-RECDEL002             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 003 <= P-RECDEL AND                                        RMB0021 
ACIEM2              P-RECDEL  <=  004 MOVE 1 TO P-RECDEL003             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 005 <= P-RECDEL AND                                        RMB0021 
ACIEM2              P-RECDEL  <=  009 MOVE 1 TO P-RECDEL004             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 010 <= P-RECDEL          MOVE 1 TO P-RECDEL005     END-IF. RMB0021 
ACIEM2    IF        P-IQ1-2   <=  000 MOVE 1 TO P-IQ1-2001      END-IF. RMB0021 
ACIEM2    IF 001 <= P-IQ1-2  AND                                        RMB0021 
ACIEM2              P-IQ1-2   <=  003 MOVE 1 TO P-IQ1-2002              RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 004 <= P-IQ1-2           MOVE 1 TO P-IQ1-2003      END-IF. RMB0021 
ACIEM2    IF        P-BSBS    <   000 MOVE 1 TO P-BSBS001       END-IF. RMB0021 
ACIEM2    IF 000 <= P-BSBS   AND                                        RMB0021 
ACIEM2              P-BSBS    <=  047 MOVE 1 TO P-BSBS002               RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 047 <  P-BSBS   AND                                        RMB0021 
ACIEM2              P-BSBS    <=  097 MOVE 1 TO P-BSBS003               RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 097 <  P-BSBS            MOVE 1 TO P-BSBS004       END-IF. RMB0021 
ACIEM2    IF        P-MTMT    <   000 MOVE 1 TO P-MTMT001       END-IF. RMB0021 
ACIEM2    IF 000 <= P-MTMT   AND                                        RMB0021 
ACIEM2              P-MTMT    <=  033 MOVE 1 TO P-MTMT002               RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 033 <  P-MTMT   AND                                        RMB0021 
ACIEM2              P-MTMT    <=  083 MOVE 1 TO P-MTMT003               RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 083 <  P-MTMT            MOVE 1 TO P-MTMT004       END-IF. RMB0021 
ACIEM2    IF CC041 NOT NUMERIC              MOVE 1 TO P-CC041001 END-IF.RMB0021 
ACIEM2    IF CC041 NUMERIC                                              RMB0021 
ACIEM2     IF 000 <= CC041 AND CC041 <=  003 MOVE 1 TO P-CC041002 END-IFRMB0021 
ACIEM2     IF 004 <= CC041 AND CC041 <=  005 MOVE 1 TO P-CC041003 END-IFRMB0021 
ACIEM2     IF 006 <= CC041 AND CC041 <=  007 MOVE 1 TO P-CC041004 END-IFRMB0021 
ACIEM2     IF 008 <= CC041 AND CC041 <=  009 MOVE 1 TO P-CC041005 END-IFRMB0021 
ACIEM2     IF 010 <= CC041 AND CC041 <=  011 MOVE 1 TO P-CC041006 END-IFRMB0021 
ACIEM2     IF 012 <= CC041 AND CC041 <=  013 MOVE 1 TO P-CC041007 END-IFRMB0021 
ACIEM2     IF 014 <= CC041 AND CC041 <=  046 MOVE 1 TO P-CC041008 END-IFRMB0021 
ACIEM2     IF 047 <= CC041 AND CC041 <=  070 MOVE 1 TO P-CC041009 END-IFRMB0021 
ACIEM2     IF 071 <= CC041                   MOVE 1 TO P-CC041010 END-IFRMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF        P-MOSCR30P <   000 MOVE 1 TO P-MOSCR30P001   END-IF.RMB0021 
ACIEM2    IF 000 <= P-MOSCR30P AND                                      RMB0021 
ACIEM2              P-MOSCR30P <=  006 MOVE 1 TO P-MOSCR30P002          RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 007 <= P-MOSCR30P AND                                      RMB0021 
ACIEM2              P-MOSCR30P <=  009 MOVE 1 TO P-MOSCR30P003          RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 010 <= P-MOSCR30P         MOVE 1 TO P-MOSCR30P004   END-IF.RMB0021 
ACIEM2    IF 000 <= P-PCT69    AND                                      RMB0021 
ACIEM2              P-PCT69    <=  000 MOVE 1 TO P-PCT69001             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 001 <= P-PCT69    AND                                      RMB0021 
ACIEM2              P-PCT69    <=  006 MOVE 1 TO P-PCT69002             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 007 <= P-PCT69    AND                                      RMB0021 
ACIEM2              P-PCT69    <=  008 MOVE 1 TO P-PCT69003             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 009 <= P-PCT69    AND                                      RMB0021 
ACIEM2              P-PCT69    <=  010 MOVE 1 TO P-PCT69004             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 011 <= P-PCT69    AND                                      RMB0021 
ACIEM2              P-PCT69    <=  013 MOVE 1 TO P-PCT69005             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 014 <= P-PCT69    AND                                      RMB0021 
ACIEM2              P-PCT69    <=  014 MOVE 1 TO P-PCT69006             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 015 <= P-PCT69    AND                                      RMB0021 
ACIEM2              P-PCT69    <=  017 MOVE 1 TO P-PCT69007             RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 018 <= P-PCT69            MOVE 1 TO P-PCT69008      END-IF.RMB0021 
ACIEM2    IF 000 <= P-CBAT69   AND                                      RMB0021 
ACIEM2              P-CBAT69   <=  000 MOVE 1 TO P-CBAT69007            RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 001 <= P-CBAT69   AND                                      RMB0021 
ACIEM2              P-CBAT69   <=  001 MOVE 1 TO P-CBAT69008            RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 002 <= P-CBAT69   AND                                      RMB0021 
ACIEM2              P-CBAT69   <=  002 MOVE 1 TO P-CBAT69009            RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF 003 <= P-CBAT69           MOVE 1 TO P-CBAT69010     END-IF.RMB0021 
ACIEM9    IF 000 <= P-CBAT120P AND                                      RMB0025
ACIEM9              P-CBAT120P <=  000 MOVE 1 TO P-CBAT120001           RMB0025
ACIEM2    END-IF.                                                       RMB0021 
ACIEM9    IF 001 <= P-CBAT120P AND                                      RMB0025
ACIEM9              P-CBAT120P <=  001 MOVE 1 TO P-CBAT120002           RMB0025
ACIEM2    END-IF.                                                       RMB0021 
ACIEM9    IF 002 <= P-CBAT120P AND                                      RMB0025
ACIEM9              P-CBAT120P <=  002 MOVE 1 TO P-CBAT120003           RMB0025
ACIEM2    END-IF.                                                       RMB0021 
ACIEM9    IF 003 <= P-CBAT120P         MOVE 1 TO P-CBAT120004    END-IF.RMB0025
ACIEM2    IF NOT ( P-MOSCC <= 2 OR P-DERAT > 5 )                        RMB0021 
ACIEM2       MOVE 1 TO P-HIBRIDA007                                     RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    IF P-MOSCC <= 2 OR P-DERAT > 5                                RMB0021 
ACIEM2       MOVE 1 TO P-HIBRIDA008                                     RMB0021 
ACIEM2    END-IF.                                                       RMB0021 
ACIEM2    COMPUTE P-SCOREN        = 1.1448        +                     RMB0021 
ACIEM2                    +0       * P-HIBRIDA003 +                     RMB0021 
ACIEM2                    +0.2187  * P-HIBRIDA004 +                     RMB0021 
ACIEM2                    +0       * P-HIBRIDA005 +                     RMB0021 
ACIEM2                    -0.1387  * P-HIBRIDA006 +                     RMB0021 
ACIEM2                    -0.3348  * P-ID007005   +                     RMB0021 
ACIEM2                    -0.4391  * P-ID007006   +                     RMB0021 
ACIEM2                    -0.2896  * P-ID007007   +                     RMB0021 
ACIEM2                    +0.4465  * P-ID007008   +                     RMB0021 
ACIEM2                    +0       * P-ID007009   +                     RMB0021 
ACIEM2                    -0.4298  * P-AOT004     +                     RMB0021 
ACIEM2                    -0.2462  * P-AOT005     +                     RMB0021 
ACIEM2                    -0.1544  * P-AOT006     +                     RMB0021 
ACIEM2                    +0       * P-AOT007     +                     RMB0021 
ACIEM2                    +0.2479  * P-AOT008     +                     RMB0021 
ACIEM2                   +0.3539   * P-AOT009     +                     RMB0021 
ACIEM2                   +0.3832   * P-AOT010     +                     RMB0021 
ACIEM2                   +0        * P-CR115001   +                     RMB0021 
ACIEM2                   +0.3333   * P-CR115002   +                     RMB0021 
ACIEM2                   +0.2909   * P-CR115003   +                     RMB0021 
ACIEM2                   +0.199    * P-CR115004   +                     RMB0021 
ACIEM2                   +0.1167   * P-CR115005   +                     RMB0021 
ACIEM2                   -0.0331   * P-CR115006   +                     RMB0021 
ACIEM2                   -0.1263   * P-CR115007   +                     RMB0021 
ACIEM2                   -0.1604   * P-CR115008   +                     RMB0021 
ACIEM2                   -0.1898   * P-CR115009   +                     RMB0021 
ACIEM2                   -0.38     * P-CR115010   +                     RMB0021 
ACIEM2                   +0        * P-AT124004   +                     RMB0021 
ACIEM2                   +0.2023   * P-AT124005   +                     RMB0021 
ACIEM2                   -0.0343   * P-AT124006   +                     RMB0021 
ACIEM2                   -0.1173   * P-AT124007   +                     RMB0021 
ACIEM2                   -0.1711   * P-AT124008   +                     RMB0021 
ACIEM2                   -0.1941   * P-AT124009   +                     RMB0021 
ACIEM2                   +0        * P-TOT30001   +                     RMB0021 
ACIEM2                   -0.9391   * P-TOT30002   +                     RMB0021 
ACIEM2                   +0        * P-TOT60001   +                     RMB0021 
ACIEM2                   -1.8194   * P-TOT60002   +                     RMB0021 
ACIEM2                   +0        * P-RECDEL001  +                     RMB0021 
ACIEM2                   -0.5515   * P-RECDEL002  +                     RMB0021 
ACIEM2                   +0        * P-RECDEL003  +                     RMB0021 
ACIEM2                   +0.1642   * P-RECDEL004  +                     RMB0021 
ACIEM2                   +0.2747   * P-RECDEL005  +                     RMB0021 
ACIEM2                   +0        * P-IQ1-2001   +                     RMB0021 
ACIEM2                   +0        * P-IQ1-2002   +                     RMB0021 
ACIEM2                   -0.2622   * P-IQ1-2003   +                     RMB0021 
ACIEM2                   +0        * P-BSBS001    +                     RMB0021 
ACIEM2                   -0.208    * P-BSBS002    +                     RMB0021 
ACIEM2                   +0        * P-BSBS003    +                     RMB0021 
ACIEM2                   +0.2427   * P-BSBS004    +                     RMB0021 
ACIEM2                   +0        * P-MTMT001    +                     RMB0021 
ACIEM2                   -0.2411   * P-MTMT002    +                     RMB0021 
ACIEM2                   +0        * P-MTMT003    +                     RMB0021 
ACIEM2                   +0.3629   * P-MTMT004    +                     RMB0021 
ACIEM2                   +0        * P-CC041001   +                     RMB0021 
ACIEM2                   -0.5236   * P-CC041002   +                     RMB0021 
ACIEM2                   -0.3682   * P-CC041003   +                     RMB0021 
ACIEM2                   -0.3462   * P-CC041004   +                     RMB0021 
ACIEM2                   -0.3267   * P-CC041005   +                     RMB0021 
ACIEM2                   -0.2992   * P-CC041006   +                     RMB0021 
ACIEM2                   -0.1584   * P-CC041007   +                     RMB0021 
ACIEM2                   +0        * P-CC041008   +                     RMB0021 
ACIEM2                   +0.0851   * P-CC041009   +                     RMB0021 
ACIEM2                   +0.14     * P-CC041010   +                     RMB0021 
ACIEM2                   +0        * P-MOSCR30P001 +                    RMB0021 
ACIEM2                   +0        * P-MOSCR30P002 +                    RMB0021 
ACIEM2                   +0.1211   * P-MOSCR30P003 +                    RMB0021 
ACIEM2                   +0.2125   * P-MOSCR30P004 +                    RMB0021 
ACIEM2                   +0.0728   * P-PCT69001   +                     RMB0021 
ACIEM2                   -0.0824   * P-PCT69002   +                     RMB0021 
ACIEM2                   -0.0871   * P-PCT69003   +                     RMB0021 
ACIEM2                   -0.1039   * P-PCT69004   +                     RMB0021 
ACIEM2                   -0.1067   * P-PCT69005   +                     RMB0021 
ACIEM2                   -0.1216   * P-PCT69006   +                     RMB0021 
ACIEM2                   -0.1237   * P-PCT69007   +                     RMB0021 
ACIEM2                   -0.1294   * P-PCT69008   +                     RMB0021 
ACIEM2                   +0        * P-CBAT69007  +                     RMB0021 
ACIEM2                   +0        * P-CBAT69008  +                     RMB0021 
ACIEM2                   -0.1557   * P-CBAT69009  +                     RMB0021 
ACIEM2                   -0.2677   * P-CBAT69010  +                     RMB0021 
ACIEM2                   +0        * P-CBAT120001 +                     RMB0021 
ACIEM2                   +0        * P-CBAT120002 +                     RMB0021 
ACIEM2                   -0.3557   * P-CBAT120003 +                     RMB0021 
ACIEM2                   -0.4737   * P-CBAT120004 +                     RMB0021 
ACIEM2                   +0        * P-HIBRIDA007 +                     RMB0021 
ACIEM2                   -0.1337   * P-HIBRIDA008 .                     RMB0021 
ACIEM2    MOVE -0165.468829908681     TO P-COEF1.                       RMB0021 
ACIEM2    MOVE +4691.71327637401      TO P-COEF2.                       RMB0021 
ACIEM2    MOVE -3146.24577734694      TO P-COEF3.                       RMB0021 
ACIEM2    MOVE +1730.78597517905      TO P-COEF4.                       RMB0021 
ACIEM2    MOVE -6565.45883683918      TO P-COEF5.                       RMB0021 
ACIEM2    MOVE +4195.92563439809      TO P-COEF6.                       RMB0021 
ACIEM2    COMPUTE P-SCOREN = ( 1 / (1 + 2.717281828 ** (- P-SCOREN))).  RMB0021 
ACIEM2    COMPUTE P-SCOREN1 = (P-COEF1      )                        +  RMB0021 
ACIEM2                       (P-COEF2 * (P-SCOREN ** 1 ))           +   RMB0021 
ACIEM2                       (P-COEF3 * (P-SCOREN ** 2 ))           +   RMB0021 
ACIEM2                       (P-COEF4 * (P-SCOREN ** 3 ))           +   RMB0021 
ACIEM2                       (P-COEF5 * (P-SCOREN ** 0.5))          +   RMB0021 
ACIEM2                       (P-COEF6 * (P-SCOREN ** 0.33))             RMB0021 
ACIEM2    COMPUTE P-SCORE ROUNDED = P-SCOREN1.                          RMB0021 
ACIEM2    IF P-SCORE <= 150 MOVE 150 TO P-SCORE.                        RMB0021 
ACIEM2    IF P-SCORE >= 850 MOVE 850 TO P-SCORE.                        RMB0021 
REMARK****************COMIENZO CALCULO PARA LAS RAZONES *************
ACIEM2    PERFORM 18005-P-PREPARE-AA.                                   RMB0021 
ACIEM2    IF P-TOT60002      = 1                                        RMB0021 
ACIEM2       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 1.8194 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-TOT30002      = 1                                        RMB0021 
ACIEM2       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.9391 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-ID007006      = 1                                        RMB0021 
ACIEM2       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.8856 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-RECDEL002     = 1                                        RMB0021 
ACIEM2       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.8262 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AOT004        = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.8130 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-ID007005      = 1                                        RMB0021 
ACIEM2       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.7813 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-ID007007      = 1                                        RMB0021 
ACIEM2       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.7361 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115010      = 1                                        RMB0021 
ACIEM2       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.7133 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041002      = 1                                        RMB0021 
ACIEM2       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.6636 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AOT005        = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.6294 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-MTMT002       = 1                                        RMB0021 
ACIEM2       MOVE 60 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.6040 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AOT006        = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.5376 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115009      = 1                                        RMB0021 
ACIEM2       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.5231 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041003      = 1                                        RMB0021 
ACIEM2       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.5082 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115008      = 1                                        RMB0021 
ACIEM2       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.4937 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041004      = 1                                        RMB0021 
ACIEM2       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.4862 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CBAT120004    = 1                                        RMB0021 
ACIEM2       MOVE 32 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.4737 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041005      = 1                                        RMB0021 
ACIEM2       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.4667 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115007      = 1                                        RMB0021 
ACIEM2       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.4596 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-BSBS002       = 1                                        RMB0021 
ACIEM2       MOVE 59 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.4507 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-ID007009      = 1                                        RMB0021 
ACIEM2       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.4465 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041006      = 1                                        RMB0021 
ACIEM2       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.4392 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AT124009      = 1                                        RMB0021 
ACIEM2       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3964 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AOT007        = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3832 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AT124008      = 1                                        RMB0021 
ACIEM2       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3734 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115006      = 1                                        RMB0021 
ACIEM2       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3664 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-MTMT001       = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3629 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-MTMT003       = 1                                        RMB0021 
ACIEM2       MOVE 60 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3629 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-HIBRIDA006    = 1                                        RMB0021 
ACIEM2       MOVE 10 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3574 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CBAT120003    = 1                                        RMB0021 
ACIEM2       MOVE 32 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3557 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115001      = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3333 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AT124007      = 1                                        RMB0021 
ACIEM2       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.3196 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041007      = 1                                        RMB0021 
ACIEM2       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2984 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2*   IF P-RECDEL001     = 1                                        RMB0021 
ACIEM2*      MOVE 00 TO P-ADVERSE-CODE    *> OJO                        RMB0021 
ACIEM2*      IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2*         MOVE 0.2747 TO P-DIFFERENCE                             RMB0021 
ACIEM2*         PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-RECDEL003     = 1                                        RMB0021 
ACIEM2       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2747 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CBAT69010     = 1                                        RMB0021 
ACIEM2       MOVE 32 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2677 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-IQ1-2003      = 1                                        RMB0021 
ACIEM2       MOVE 18 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2622 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-BSBS001       = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2427 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-BSBS003       = 1                                        RMB0021 
ACIEM2       MOVE 59 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2427 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AT124006      = 1                                        RMB0021 
ACIEM2       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2366 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-HIBRIDA003    = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2187 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-HIBRIDA005    = 1                                        RMB0021 
ACIEM2       MOVE 10 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2187 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115005      = 1                                        RMB0021 
ACIEM2       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2166 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-MOSCR30P001   = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2125 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-MOSCR30P002   = 1                                        RMB0021 
ACIEM2       MOVE 02 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2125 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AT124004      = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2023 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-PCT69008      = 1                                        RMB0021 
ACIEM2       MOVE 04 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.2022 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-PCT69007      = 1                                        RMB0021 
ACIEM2       MOVE 04 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1965 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-PCT69006      = 1                                        RMB0021 
ACIEM2       MOVE 04 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1944 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-PCT69005      = 1                                        RMB0021 
ACIEM2       MOVE 04 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1795 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-PCT69004      = 1                                        RMB0021 
ACIEM2       MOVE 04 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1767 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-PCT69003      = 1                                        RMB0021 
ACIEM2       MOVE 04 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1599 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CBAT69009     = 1                                        RMB0021 
ACIEM2       MOVE 32 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1557 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-PCT69002      = 1                                        RMB0021 
ACIEM2       MOVE 04 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1552 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041001      = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1400 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041008      = 1                                        RMB0021 
ACIEM2       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1400 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AOT008        = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1353 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115004      = 1                                        RMB0021 
ACIEM2       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1343 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-HIBRIDA008    = 1                                        RMB0021 
ACIEM2       MOVE 52 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1337 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-RECDEL004     = 1                                        RMB0021 
ACIEM2       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.1105 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-MOSCR30P003   = 1                                        RMB0021 
ACIEM2       MOVE 02 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.0914 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CC041009      = 1                                        RMB0021 
ACIEM2       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.0549 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-CR115003      = 1                                        RMB0021 
ACIEM2       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.0424 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM2    IF P-AOT009        = 1                                        RMB0021 
ACIEM2       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM2       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM2          MOVE 0.0293 TO P-DIFFERENCE                             RMB0021 
ACIEM2          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
REMARK*******************************************************************
NEWSCO 11840-TRU-SCORECARD03-P.
REMARK*******************************************************************
REMARK*11840-TRU-SCORECARD03-P.
REMARK* IMPLEMENTACION DEL SCORE-CARD 3 DE ACIERTA-PLUS
REMARK*********************************************************************
ACIEM3    IF IQ001 NUMERIC MOVE IQ001 TO TIQ001 ELSE MOVE 0 TO TIQ001.  RMB0021 
ACIEM3    IF IQ002 NUMERIC MOVE IQ002 TO TIQ002 ELSE MOVE 0 TO TIQ002.  RMB0021 
ACIEM3    COMPUTE P-IQ1-2 = TIQ001 + TIQ002.                            RMB0021 
ACIEM3    PERFORM 12001-P-RECDEL-DECDELP.                               RMB0021 
ACIEM3    COMPUTE P-SUM030= TCR030 + TBS030 + TCC030 + TOT030 + TMT030. RMB0021 
ACIEM3    IF ID004 NOT NUMERIC                                          RMB0021 
ACIEM3       MOVE  216 TO P-ID004X                                      RMB0021 
ACIEM3    ELSE                                                          RMB0021 
ACIEM3       IF ID004 <= 216                                            RMB0021 
ACIEM3          MOVE 216 TO P-ID004X                                    RMB0021 
ACIEM3       ELSE                                                       RMB0021 
ACIEM3         IF ID004 >= 780                                          RMB0021 
ACIEM3            MOVE 780 TO P-ID004X                                  RMB0021 
ACIEM3         ELSE                                                     RMB0021 
ACIEM3            MOVE ID004 TO P-ID004X                                RMB0021 
ACIEM3         END-IF                                                   RMB0021 
ACIEM3      END-IF                                                      RMB0021 
ACIEM3    END-IF.                                                       RMB0021 
REMARK***********************************************************
ACIEM3    INITIALIZE VARIABLES-DUMMYS-ACIERTA-PLUS.                     RMB0021 
ACIEM3    IF AH004 NOT NUMERIC              MOVE 1 TO P-AH004001 END-IF.RMB0021 
ACIEM3    IF AH004 NUMERIC                                              RMB0021 
ACIEM3     IF 000 <= AH004 AND AH004 <   049 MOVE 1 TO P-AH004002 END-IFRMB0021 
ACIEM3     IF        AH004           >=  049 MOVE 1 TO P-AH004003 END-IFRMB0021 
ACIEM3    END-IF.                                                       RMB0021 
ACIEM3    IF CK006 NOT NUMERIC              MOVE 1 TO P-CK006001 END-IF.RMB0021 
ACIEM3    IF CK006 NUMERIC                                              RMB0021 
ACIEM3     IF 000 <= CK006 AND CK006 <=  036 MOVE 1 TO P-CK006002 END-IFRMB0021 
ACIEM3     IF 037 <= CK006                   MOVE 1 TO P-CK006003 END-IFRMB0021 
ACIEM3    END-IF.                                                       RMB0021 
REMARK*******************VARIABLE 115 CONTIENE PUNTO DECIMAL ***********
ACIEM3    IF CR115    (5:1) = "-"                                       RMB0021 
ACIEM3       MOVE 1 TO P-CR115011                                       RMB0021 
ACIEM3    ELSE                                                          RMB0021 
ACIEM3       MOVE "000000" TO TCR115(1:6)                               RMB0021 
ACIEM3       MOVE CR115    (1:3) TO TCR115(2:3)                         RMB0021 
ACIEM3       MOVE CR115    (5:2) TO TCR115(5:2)                         RMB0021 
ACIEM3    IF 000 <= TCR115 AND TCR115 <= 030 MOVE 1 TO P-CR115012 END-IFRMB0021 
ACIEM3    IF 030 <  TCR115 AND TCR115 <= 083 MOVE 1 TO P-CR115013 END-IFRMB0021 
ACIEM3    IF 083 <  TCR115                   MOVE 1 TO P-CR115014 END-IFRMB0021 
ACIEM3    END-IF.                                                       RMB0021 
REMARK*******************************************************************
ACIEM3    IF         P-IQ1-2   <   003 MOVE 1 TO P-IQ1-2004      END-IF.RMB0021 
ACIEM3    IF  003 =  P-IQ1-2           MOVE 1 TO P-IQ1-2005      END-IF.RMB0021 
ACIEM3    IF  004 <= P-IQ1-2           MOVE 1 TO P-IQ1-2006      END-IF.RMB0021 
ACIEM3    IF IQ013 NOT NUMERIC              MOVE 1 TO P-IQ013005 END-IF.RMB0021 
ACIEM3    IF IQ013 NUMERIC                                              RMB0021 
ACIEM3     IF        IQ013           <   002 MOVE 1 TO P-IQ013005 END-IFRMB0021 
ACIEM3     IF 002 <= IQ013                   MOVE 1 TO P-IQ013006 END-IFRMB0021 
ACIEM3    END-IF.                                                       RMB0021 
ACIEM3    IF OT030 NOT NUMERIC              MOVE 1 TO P-OT030001 END-IF.RMB0021 
ACIEM3    IF OT030 NUMERIC                                              RMB0021 
ACIEM3     IF        OT030           <   001 MOVE 1 TO P-OT030001 END-IFRMB0021 
ACIEM3     IF 001 <= OT030                   MOVE 1 TO P-OT030002 END-IFRMB0021 
ACIEM3    END-IF.                                                       RMB0021 
ACIEM3    IF OT124 NOT NUMERIC              MOVE 1 TO P-OT124001 END-IF.RMB0021 
ACIEM3    IF OT124 NUMERIC                                              RMB0021 
ACIEM3     IF        OT124     <   000000001 MOVE 1 TO P-OT124001 END-IFRMB0021 
ACIEM3     IF 000000001 <= OT124             MOVE 1 TO P-OT124002 END-IFRMB0021 
ACIEM3    END-IF.                                                       RMB0021 
ACIEM3    IF 000 <= P-RECDEL AND                                        RMB0021 
ACIEM3              P-RECDEL  <=  002 MOVE 1 TO P-RECDEL006             RMB0021 
ACIEM3    END-IF.                                                       RMB0021 
ACIEM3    IF 003 <= P-RECDEL AND                                        RMB0021 
ACIEM3              P-RECDEL  <=  014 MOVE 1 TO P-RECDEL007             RMB0021 
ACIEM3    END-IF.                                                       RMB0021 
ACIEM3    IF 015 <= P-RECDEL          MOVE 1 TO P-RECDEL008 END-IF.     RMB0021 
ACIEM3    IF        P-SUM030 < 003    MOVE 1 TO P-SUM030001 END-IF.     RMB0021 
ACIEM3    IF 003 <= P-SUM030          MOVE 1 TO P-SUM030002 END-IF.     RMB0021 
ACIEM3    IF ID007 NUMERIC                                              RMB0021 
ACIEM3     IF ID007 = 03 OR 48              MOVE 1 TO P-ID007010 END-IF RMB0021 
ACIEM3     IF ID007 = 05 OR 28              MOVE 1 TO P-ID007011 END-IF RMB0021 
ACIEM3     IF ID007 = 12                    MOVE 1 TO P-ID007012 END-IF RMB0021 
ACIEM3     IF ID007 = 13                    MOVE 1 TO P-ID007013 END-IF RMB0021 
ACIEM3     IF ID007 = 21                    MOVE 1 TO P-ID007014 END-IF RMB0021 
ACIEM3     IF ID007 NOT = (3 AND 48 AND 5 AND 28 AND 12 AND 13 AND 21 ) RMB0021 
ACIEM3                                      MOVE 1 TO P-ID007015 END-IF RMB0021 
ACIEM3    END-IF.                                                       RMB0021 
ACIEM3    IF BS122 NOT NUMERIC              MOVE 1 TO P-BS122001 END-IF.RMB0021 
ACIEM3    IF BS122 NUMERIC                                              RMB0021 
ACIEM3     IF        BS122     <   000000001 MOVE 1 TO P-BS122001 END-IFRMB0021 
ACIEM3     IF 000000001 <= BS122             MOVE 1 TO P-BS122002 END-IFRMB0021 
ACIEM3    END-IF.                                                       RMB0021 
ACIEM3    COMPUTE P-SCOREN        = 1.9776        +                     RMB0021 
ACIEM3                   +0       * P-AH004001    +                     RMB0021 
ACIEM3                   +0       * P-AH004002    +                     RMB0021 
ACIEM3                   +0.3592  * P-AH004003    +                     RMB0021 
ACIEM3                   +0       * P-CK006001    +                     RMB0021 
ACIEM3                   -0.3536  * P-CK006002    +                     RMB0021 
ACIEM3                   +0       * P-CK006003    +                     RMB0021 
ACIEM3                   +0       * P-CR115011    +                     RMB0021 
ACIEM3                   +0.5444  * P-CR115012    +                     RMB0021 
ACIEM3                   +0       * P-CR115013    +                     RMB0021 
ACIEM3                   -0.6248  * P-CR115014    +                     RMB0021 
ACIEM3                   +0       * P-IQ1-2004    +                     RMB0021 
ACIEM3                   -0.4441  * P-IQ1-2005    +                     RMB0021 
ACIEM3                   -0.7208  * P-IQ1-2006    +                     RMB0021 
ACIEM3                   +0       * P-IQ013005    +                     RMB0021 
ACIEM3                   -0.568    * P-IQ013006   +                     RMB0021 
ACIEM3                   +0        * P-OT030001   +                     RMB0021 
ACIEM3                   -0.5391   * P-OT030002   +                     RMB0021 
ACIEM3                   +0        * P-OT124001   +                     RMB0021 
ACIEM3                   -0.952    * P-OT124002   +                     RMB0021 
ACIEM3                   -2.2106   * P-RECDEL006  +                     RMB0021 
ACIEM3                   -1.0961   * P-RECDEL007  +                     RMB0021 
ACIEM3                   +0        * P-RECDEL008  +                     RMB0021 
ACIEM3                   +0        * P-SUM030001  +                     RMB0021 
ACIEM3                   -0.5444   * P-SUM030002  +                     RMB0021 
ACIEM3                   -0.951    * P-ID007010   +                     RMB0021 
ACIEM3                   -0.7618   * P-ID007011   +                     RMB0021 
ACIEM3                   -0.7126   * P-ID007012   +                     RMB0021 
ACIEM3                   -0.8034   * P-ID007013   +                     RMB0021 
ACIEM3                   -0.8264   * P-ID007014   +                     RMB0021 
ACIEM3                   +0        * P-ID007015   +                     RMB0021 
ACIEM3                   +0        * P-BS122001   +                     RMB0021 
ACIEM3                   -0.908    * P-BS122002   +                     RMB0021 
ACIEM3*                  +0.00151  * P-ID004X     . DABAN DIFERENCIAS 2 RMB0021 
ACIEM3                   +0.0015   * P-ID004X     .                     RMB0021 
ACIEM3    MOVE -00862.230271084667    TO P-COEF1.                       RMB0021 
ACIEM3    MOVE +13137.3360435634      TO P-COEF2.                       RMB0021 
ACIEM3    MOVE -09541.85624646507     TO P-COEF3.                       RMB0021 
ACIEM3    MOVE +04841.22644379236     TO P-COEF4.                       RMB0021 
ACIEM3    MOVE -19543.483758449       TO P-COEF5.                       RMB0021 
ACIEM3    MOVE +12820.149104826       TO P-COEF6.                       RMB0021 
ACIEM3    COMPUTE P-SCOREN = ( 1 / (1 + 2.717281828 ** (- P-SCOREN))).  RMB0021 
ACIEM3    COMPUTE P-SCOREN1 = (P-COEF1      )                        +  RMB0021 
ACIEM3                       (P-COEF2 * (P-SCOREN ** 1 ))           +   RMB0021 
ACIEM3                       (P-COEF3 * (P-SCOREN ** 2 ))           +   RMB0021 
ACIEM3                       (P-COEF4 * (P-SCOREN ** 3 ))           +   RMB0021 
ACIEM3                       (P-COEF5 * (P-SCOREN ** 0.5))          +   RMB0021 
ACIEM3                       (P-COEF6 * (P-SCOREN ** 0.33))             RMB0021 
ACIEM3    COMPUTE P-SCORE ROUNDED = P-SCOREN1.                          RMB0021 
ACIEM3    IF P-SCORE <= 150 MOVE 150 TO P-SCORE.                        RMB0021 
ACIEM3    IF P-SCORE >= 850 MOVE 850 TO P-SCORE.                        RMB0021 
REMARK****************COMIENZO CALCULO PARA LAS RAZONES *************
ACIEM3    PERFORM 18005-P-PREPARE-AA.                                   RMB0021 
ACIEM3    IF P-RECDEL006     = 1                                        RMB0021 
ACIEM3       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 2.2106 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-CR115014      = 1                                        RMB0021 
ACIEM3       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 1.1692 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-RECDEL007     = 1                                        RMB0021 
ACIEM3       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 1.0961 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-OT124002      = 1                                        RMB0021 
ACIEM3       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.9520 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-ID007010      = 1                                        RMB0021 
ACIEM3       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.9510 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-BS122002      = 1                                        RMB0021 
ACIEM3       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.9080 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-ID007014      = 1                                        RMB0021 
ACIEM3       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.8264 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-ID007013      = 1                                        RMB0021 
ACIEM3       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.8034 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-ID007011      = 1                                        RMB0021 
ACIEM3       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.7618 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-IQ1-2006      = 1                                        RMB0021 
ACIEM3       MOVE 18 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.7208 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-ID007012      = 1                                        RMB0021 
ACIEM3       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.7126 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-IQ013006      = 1                                        RMB0021 
ACIEM3       MOVE 19 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.5680 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-CR115011      = 1                                        RMB0021 
ACIEM3       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.5444 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-CR115013      = 1                                        RMB0021 
ACIEM3       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.5444 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-SUM030002     = 1                                        RMB0021 
ACIEM3       MOVE 12 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.5444 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-OT030002      = 1                                        RMB0021 
ACIEM3       MOVE 36 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.5391 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-IQ1-2005      = 1                                        RMB0021 
ACIEM3       MOVE 18 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.4441 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-AH004001      = 1                                        RMB0021 
ACIEM3       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.3592 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-AH004002      = 1                                        RMB0021 
ACIEM3       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.3592 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM3    IF P-CK006002      = 1                                        RMB0021 
ACIEM3       MOVE 63 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM3          MOVE 0.3536 TO P-DIFFERENCE                             RMB0021 
ACIEM3          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
REMAR3************COMIENZO VARIABLES CONTINUAS ***************************
ACIEM3    IF P-ID004X NOT = 780                                         RMB0021 
ACIEM3       COMPUTE P-TEMP1 = (780 - P-ID004X) * 0.0015                RMB0021 
ACIEM3       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM3       PERFORM 18001-P-INSERTE-CONTINUA.                          RMB0021 
NEWSCO 11850-TRU-SCORECARD04-P.
REMARK*********************************************************************
REMARK*11850-TRU-SCORECARD04-P.
REMARK* IMPLEMENTACION DEL SCORE-CARD 4 DE ACIERTA-PLUS
REMARK*********************************************************************
ACIEM4    PERFORM 12007-P-PCPTOP12.                                     RMB0021 
ACIEM4    PERFORM 12006-P-PCT69.                                        RMB0021 
ACIEM4    PERFORM 12004-P-TOT60.                                        RMB0021 
ACIEM4    PERFORM 12003-P-TOT30.                                        RMB0021 
ACIEM4    PERFORM 12001-P-RECDEL-DECDELP.                               RMB0021 
ACIEM4    PERFORM 12008-P-PCTCUR.                                       RMB0021 
ACIEM4    IF ID004 NOT NUMERIC                                          RMB0021 
ACIEM4       MOVE  216 TO P-ID004X                                      RMB0021 
ACIEM4    ELSE                                                          RMB0021 
ACIEM4       IF ID004 <= 216                                            RMB0021 
ACIEM4          MOVE 216 TO P-ID004X                                    RMB0021 
ACIEM4       ELSE                                                       RMB0021 
ACIEM4         IF ID004 >= 780                                          RMB0021 
ACIEM4            MOVE 780 TO P-ID004X                                  RMB0021 
ACIEM4         ELSE                                                     RMB0021 
ACIEM4            MOVE ID004 TO P-ID004X                                RMB0021 
ACIEM4         END-IF                                                   RMB0021 
ACIEM4      END-IF                                                      RMB0021 
ACIEM4    END-IF.                                                       RMB0021 
REMAR4***********************************************************
ACIEM4    INITIALIZE VARIABLES-DUMMYS-ACIERTA-PLUS.                     RMB0021 
REMARK*******************VARIABLE 115 CONTIENE PUNTO DECIMAL ***********
ACIEM4    IF AT115    (5:1) = "-"                                       RMB0021 
ACIEM4       MOVE 1 TO P-AT115001                                       RMB0021 
ACIEM4    ELSE                                                          RMB0021 
ACIEM4       MOVE "000000" TO TAT115(1:6)                               RMB0021 
ACIEM4       MOVE AT115    (1:3) TO TAT115(2:3)                         RMB0021 
ACIEM4       MOVE AT115    (5:2) TO TAT115(5:2)                         RMB0021 
ACIEM4    IF 000 <= TAT115 AND TAT115 <= 013 MOVE 1 TO P-AT115002 END-IFRMB0021 
ACIEM4    IF 013  < TAT115 AND TAT115 <= 028 MOVE 1 TO P-AT115003 END-IFRMB0021 
ACIEM4    IF 028  < TAT115 AND TAT115 <= 040 MOVE 1 TO P-AT115004 END-IFRMB0021 
ACIEM4    IF 040  < TAT115 AND TAT115 <= 049 MOVE 1 TO P-AT115005 END-IFRMB0021 
ACIEM4    IF 049  < TAT115 AND TAT115 <= 112 MOVE 1 TO P-AT115006 END-IFRMB0021 
ACIEM4    IF 112  < TAT115 AND TAT115 <= 131 MOVE 1 TO P-AT115007 END-IFRMB0021 
ACIEM4    IF 131  < TAT115                   MOVE 1 TO P-AT115008 END-IFRMB0021 
ACIEM4    END-IF.                                                       RMB0021 
REMARK******************************************************************
ACIEM4    IF BS122 NOT NUMERIC              MOVE 1 TO P-BS122003 END-IF.RMB0021 
ACIEM4    IF BS122 NUMERIC                                              RMB0021 
ACIEM4     IF        BS122     =   000000000 MOVE 1 TO P-BS122004 END-IFRMB0021 
ACIEM4     IF 000000001 <= BS122             MOVE 1 TO P-BS122005 END-IFRMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF CC032 NOT NUMERIC              MOVE 1 TO P-CC032001 END-IF.RMB0021 
ACIEM4    IF CC032 NUMERIC                                              RMB0021 
ACIEM4     IF 000  = CC032                   MOVE 1 TO P-CC032002 END-IFRMB0021 
ACIEM4     IF 001 <= CC032                   MOVE 1 TO P-CC032003 END-IFRMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF CP103 NOT NUMERIC              MOVE 1 TO P-CP103001 END-IF.RMB0021 
ACIEM4    IF CP103 NUMERIC                                              RMB0021 
ACIEM4     IF        CP103 > 065             MOVE 1 TO P-CP103002 END-IFRMB0021 
ACIEM4     IF 000 <= CP103 AND CP103 <= 065  MOVE 1 TO P-CP103003 END-IFRMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF CR116    (5:1) = "-"                                       RMB0021 
ACIEM4       MOVE 1 TO P-CR116001                                       RMB0021 
ACIEM4    ELSE                                                          RMB0021 
ACIEM4       MOVE "000000" TO TCR116(1:6)                               RMB0021 
ACIEM4       MOVE CR116    (1:3) TO TCR116(2:3)                         RMB0021 
ACIEM4       MOVE CR116    (5:2) TO TCR116(5:2)                         RMB0021 
ACIEM4    IF 000 <= TCR116 AND TCR116 <= 010 MOVE 1 TO P-CR116002 END-IFRMB0021 
ACIEM4    IF 010  < TCR116 AND TCR116 <= 019 MOVE 1 TO P-CR116003 END-IFRMB0021 
ACIEM4    IF 019  < TCR116 AND TCR116 <= 046 MOVE 1 TO P-CR116004 END-IFRMB0021 
ACIEM4    IF 046  < TCR116 AND TCR116 <= 063 MOVE 1 TO P-CR116005 END-IFRMB0021 
ACIEM4    IF 063  < TCR116 AND TCR116 <= 083 MOVE 1 TO P-CR116006 END-IFRMB0021 
ACIEM4    IF 083  < TCR116 AND TCR116 <= 092 MOVE 1 TO P-CR116007 END-IFRMB0021 
ACIEM4    IF 092  < TCR116 AND TCR116 <= 100 MOVE 1 TO P-CR116008 END-IFRMB0021 
ACIEM4    IF 100  < TCR116                   MOVE 1 TO P-CR116009 END-IFRMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF IQ001 NOT NUMERIC               MOVE 1 TO P-IQ001001 END-IFRMB0021 
ACIEM4    IF IQ001 NUMERIC                                              RMB0021 
ACIEM4     IF        IQ001 <= 002            MOVE 1 TO P-IQ001001 END-IFRMB0021 
ACIEM4     IF 003 <= IQ001                   MOVE 1 TO P-IQ001002 END-IFRMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF IQ013 NOT NUMERIC               MOVE 1 TO P-IQ013007 END-IFRMB0021 
ACIEM4    IF IQ013 NUMERIC                                              RMB0021 
ACIEM4     IF        IQ013 <= 001            MOVE 1 TO P-IQ013007 END-IFRMB0021 
ACIEM4     IF 002 <= IQ013                   MOVE 1 TO P-IQ013008 END-IFRMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF        P-PCTOP12 <=  033        MOVE 1 TO P-PCTOP12001.    RMB0021 
ACIEM4    IF 034 <= P-PCTOP12 AND                                       RMB0021 
ACIEM4              P-PCTOP12 <=  050        MOVE 1 TO P-PCTOP12002     RMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF 051 <= P-PCTOP12                MOVE 1 TO P-PCTOP12003.    RMB0021 
ACIEM4    IF        P-CBAT69   <   001       MOVE 1 TO P-CBAT69005.     RMB0021 
ACIEM4    IF 001 <= P-CBAT69                 MOVE 1 TO P-CBAT69006.     RMB0021 
ACIEM4    IF ID007 NUMERIC                                              RMB0021 
ACIEM4     IF ID007 = 48 OR 12 OR 21        MOVE 1 TO P-ID007016 END-IF RMB0021 
ACIEM4     IF ID007 = 03                    MOVE 1 TO P-ID007017 END-IF RMB0021 
ACIEM4     IF ID007 = 05 OR 11              MOVE 1 TO P-ID007018 END-IF RMB0021 
ACIEM4     IF ID007 = 01                    MOVE 1 TO P-ID007019 END-IF RMB0021 
ACIEM4     IF ID007 NOT = ( 48 AND 12 AND 21 AND 3 AND 5 AND 11 AND 1 ) RMB0021 
ACIEM4                                      MOVE 1 TO P-ID007020 END-IF RMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    COMPUTE P-OPCC12 = TCC030 + TCC031.                           RMB0021 
ACIEM4    IF        P-OPCC12  <=  000        MOVE 1 TO P-OPCC12001.     RMB0021 
ACIEM4    IF 001 =  P-OPCC12                 MOVE 1 TO P-OPCC12002.     RMB0021 
ACIEM4    IF 002 <= P-OPCC12                 MOVE 1 TO P-OPCC12003.     RMB0021 
ACIEM4    IF MT040 NUMERIC                                              RMB0021 
ACIEM4     IF 000 <= MT040 AND MT040 <=  015 MOVE 1 TO P-MT040001 END-IFRMB0021 
ACIEM4     IF 016 <= MT040                   MOVE 1 TO P-MT040002 END-IFRMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF 001 <= P-TOT60                MOVE 1 TO P-RECDEL009 END-IF.RMB0021 
ACIEM4    IF 001 <= P-TOT30                MOVE 1 TO P-RECDEL010 END-IF.RMB0021 
ACIEM4    IF 002  = P-RECDEL               MOVE 1 TO P-RECDEL011 END-IF.RMB0021 
ACIEM4    IF 003 <= P-RECDEL AND                                        RMB0021 
ACIEM4              P-RECDEL  <=  004 MOVE 1 TO P-RECDEL012             RMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF 005 <= P-RECDEL AND                                        RMB0021 
ACIEM4              P-RECDEL  <=  023 MOVE 1 TO P-RECDEL013             RMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF 024 <= P-RECDEL               MOVE 1 TO P-RECDEL014 END-IF.RMB0021 
ACIEM4    IF OT041 NUMERIC                                              RMB0021 
ACIEM4       IF 000 <= OT041 AND OT041 <=  006 MOVE 1 TO P-OT041001     RMB0021 
ACIEM4       ELSE                                                       RMB0021 
ACIEM4                                         MOVE 1 TO P-OT041002     RMB0021 
ACIEM4       END-IF                                                     RMB0021 
ACIEM4    ELSE                                                          RMB0021 
ACIEM4                                         MOVE 1 TO P-OT041002     RMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF CC100 NUMERIC                                              RMB0021 
ACIEM4       IF 000 <= CC100 AND CC100 <=  008 MOVE 1 TO P-CC100001     RMB0021 
ACIEM4       ELSE                                                       RMB0021 
ACIEM4                                         MOVE 1 TO P-CC100002     RMB0021 
ACIEM4       END-IF                                                     RMB0021 
ACIEM4    ELSE                                                          RMB0021 
ACIEM4                                         MOVE 1 TO P-CC100002     RMB0021 
ACIEM4    END-IF.                                                       RMB0021 
ACIEM4    IF  NOT (P-PCTCUR >= 96) MOVE 1 TO P-PCTCUR001 END-IF.        RMB0021 
ACIEM4    IF  096 <= P-PCTCUR      MOVE 1 TO P-PCTCUR002 END-IF.        RMB0021 
ACIEM4    COMPUTE P-SCOREN        = 2.5644        +                     RMB0021 
ACIEM4                   +0       * P-AT115001    +                     RMB0021 
ACIEM4                   +0.3715  * P-AT115002    +                     RMB0021 
ACIEM4                   +0.2570  * P-AT115003    +                     RMB0021 
ACIEM4                   +0.1211  * P-AT115004    +                     RMB0021 
ACIEM4                   +0.1211  * P-AT115005    +                     RMB0021 
ACIEM4                   -0.0387  * P-AT115006    +                     RMB0021 
ACIEM4                   -0.1520  * P-AT115007    +                     RMB0021 
ACIEM4                   -0.1686  * P-AT115008    +                     RMB0021 
ACIEM4                   +0       * P-BS122003    +                     RMB0021 
ACIEM4                   +0       * P-BS122004    +                     RMB0021 
ACIEM4                   -0.4752  * P-BS122005    +                     RMB0021 
ACIEM4                   +0       * P-CC032001    +                     RMB0021 
ACIEM4                   +0       * P-CC032002    +                     RMB0021 
ACIEM4                   -0.2433  * P-CC032003    +                     RMB0021 
ACIEM4                   +0       * P-CP103001    +                     RMB0021 
ACIEM4                   +0        * P-CP103002   +                     RMB0021 
ACIEM4                   -0.2934   * P-CP103003   +                     RMB0021 
ACIEM4                   +0        * P-CR116001   +                     RMB0021 
ACIEM4                   +0.2268   * P-CR116002   +                     RMB0021 
ACIEM4                   +0.1312   * P-CR116003   +                     RMB0021 
ACIEM4                   +0.0228   * P-CR116004   +                     RMB0021 
ACIEM4                   -0.1039   * P-CR116005   +                     RMB0021 
ACIEM4                   -0.1644   * P-CR116006   +                     RMB0021 
ACIEM4                   -0.2287   * P-CR116007   +                     RMB0021 
ACIEM4                   -0.2562   * P-CR116008   +                     RMB0021 
ACIEM4                   -0.3970   * P-CR116009   +                     RMB0021 
ACIEM4                   +0        * P-IQ001001   +                     RMB0021 
ACIEM4                   -0.3533   * P-IQ001002   +                     RMB0021 
ACIEM4                   +0        * P-IQ013007   +                     RMB0021 
ACIEM4                   -0.3259   * P-IQ013008   +                     RMB0021 
ACIEM4                   +0        * P-PCTOP12001 +                     RMB0021 
ACIEM4                   -0.3550   * P-PCTOP12002 +                     RMB0021 
ACIEM4                   -0.6964   * P-PCTOP12003 +                     RMB0021 
ACIEM4                   +0        * P-CBAT69005  +                     RMB0021 
ACIEM4                   -0.7202   * P-CBAT69006  +                     RMB0021 
ACIEM4                   -0.5626   * P-ID007016   +                     RMB0021 
ACIEM4                   -0.3083   * P-ID007017   +                     RMB0021 
ACIEM4                   -0.4487   * P-ID007018   +                     RMB0021 
ACIEM4                   +0.2208   * P-ID007019   +                     RMB0021 
ACIEM4                   +0        * P-ID007020   +                     RMB0021 
ACIEM4                   +0        * P-OPCC12001  +                     RMB0021 
ACIEM4                   -0.2375   * P-OPCC12002  +                     RMB0021 
ACIEM4                   -0.5859   * P-OPCC12003  +                     RMB0021 
ACIEM4                   -0.2206   * P-MT040001   +                     RMB0021 
ACIEM4                   +0        * P-MT040002   +                     RMB0021 
ACIEM4                   -2.1559   * P-RECDEL009  +                     RMB0021 
ACIEM4                   -1.3410   * P-RECDEL010  +                     RMB0021 
ACIEM4                   -0.5112   * P-RECDEL011  +                     RMB0021 
ACIEM4                   -0.3371   * P-RECDEL012  +                     RMB0021 
ACIEM4                   +0        * P-RECDEL013  +                     RMB0021 
ACIEM4                   +0.5771   * P-RECDEL014  +                     RMB0021 
ACIEM4                   -0.2058   * P-OT041001   +                     RMB0021 
ACIEM4                   +0        * P-OT041002   +                     RMB0021 
ACIEM4                   -0.5075   * P-CC100001   +                     RMB0021 
ACIEM4                   +0        * P-CC100002   +                     RMB0021 
ACIEM4                   +0        * P-PCTCUR001  +                     RMB0021 
ACIEM4                   +0.4778   * P-PCTCUR002  +                     RMB0021 
ACIEM4                   +0.000510 * P-ID004X     .  *> ASI QUEDO EN SASRMB0021 
ACIEM4    MOVE -01326.40348448462     TO P-COEF1.                       RMB0021 
ACIEM4    MOVE +18724.3846743293      TO P-COEF2.                       RMB0021 
ACIEM4    MOVE -13174.8315317367      TO P-COEF3.                       RMB0021 
ACIEM4    MOVE +06282.19757390293     TO P-COEF4.                       RMB0021 
ACIEM4    MOVE -28287.2329583752      TO P-COEF5.                       RMB0021 
ACIEM4    MOVE +18653.499034294       TO P-COEF6.                       RMB0021 
ACIEM4    COMPUTE P-SCOREN = ( 1 / (1 + 2.717281828 ** (- P-SCOREN))).  RMB0021 
ACIEM4    COMPUTE P-SCOREN1 = (P-COEF1      )                        +  RMB0021 
ACIEM4                       (P-COEF2 * (P-SCOREN ** 1 ))           +   RMB0021 
ACIEM4                       (P-COEF3 * (P-SCOREN ** 2 ))           +   RMB0021 
ACIEM4                       (P-COEF4 * (P-SCOREN ** 3 ))           +   RMB0021 
ACIEM4                       (P-COEF5 * (P-SCOREN ** 0.5))          +   RMB0021 
ACIEM4                       (P-COEF6 * (P-SCOREN ** 0.33))             RMB0021 
ACIEM4    COMPUTE P-SCORE ROUNDED = P-SCOREN1.                          RMB0021 
ACIEM4    IF P-SCORE <= 150 MOVE 150 TO P-SCORE.                        RMB0021 
ACIEM4    IF P-SCORE >= 850 MOVE 850 TO P-SCORE.                        RMB0021 
REMAR4****************COMIENZO CALCULO PARA LAS RAZONES *************
ACIEM4    PERFORM 18005-P-PREPARE-AA.                                   RMB0021 
ACIEM4    IF P-RECDEL009     = 1                                        RMB0021 
ACIEM4       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 2.7330 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-RECDEL010     = 1                                        RMB0021 
ACIEM4       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 1.9181 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-RECDEL011     = 1                                        RMB0021 
ACIEM4       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 1.0883 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-RECDEL012     = 1                                        RMB0021 
ACIEM4       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.9142 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-ID007016      = 1                                        RMB0021 
ACIEM4       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.7834 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CBAT69006     = 1                                        RMB0021 
ACIEM4       MOVE 32 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.7202 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-PCTOP12003    = 1                                        RMB0021 
ACIEM4       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.6964 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-ID007018      = 1                                        RMB0021 
ACIEM4       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.6695 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CR116009      = 1                                        RMB0021 
ACIEM4       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.6238 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-OPCC12003     = 1                                        RMB0021 
ACIEM4       MOVE 14 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.5859 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-RECDEL013     = 1                                        RMB0021 
ACIEM4       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.5771 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-AT115008      = 1                                        RMB0021 
ACIEM4       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.5402 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-ID007017      = 1                                        RMB0021 
ACIEM4       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.5291 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-AT115007      = 1                                        RMB0021 
ACIEM4       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.5235 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CC100001      = 1                                        RMB0021 
ACIEM4       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.5075 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CR116008      = 1                                        RMB0021 
ACIEM4       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.4830 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-PCTCUR001     = 1                                        RMB0021 
ACIEM4       MOVE 08 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.4778 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-BS122005      = 1                                        RMB0021 
ACIEM4       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.4752 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CR116007      = 1                                        RMB0021 
ACIEM4       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.4555 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-AT115006      = 1                                        RMB0021 
ACIEM4       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.4103 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CR116006      = 1                                        RMB0021 
ACIEM4       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.3912 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-AT115001      = 1                                        RMB0021 
ACIEM4       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.3715 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-PCTOP12002    = 1                                        RMB0021 
ACIEM4       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.3550 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-IQ001002      = 1                                        RMB0021 
ACIEM4       MOVE 18 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.3533 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CR116005      = 1                                        RMB0021 
ACIEM4       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.3307 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-IQ013008      = 1                                        RMB0021 
ACIEM4       MOVE 19 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.3259 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CP103003      = 1                                        RMB0021 
ACIEM4       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2934 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-AT115004      = 1                                        RMB0021 
ACIEM4       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2505 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-AT115005      = 1                                        RMB0021 
ACIEM4       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2505 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CC032003      = 1                                        RMB0021 
ACIEM4       MOVE 14 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2433 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-OPCC12002     = 1                                        RMB0021 
ACIEM4       MOVE 14 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2375 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CR116001      = 1                                        RMB0021 
ACIEM4       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2268 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-ID007020      = 1                                        RMB0021 
ACIEM4       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2208 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-MT040001      = 1                                        RMB0021 
ACIEM4       MOVE 53 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2206 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-OT041001      = 1                                        RMB0021 
ACIEM4       MOVE 40 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2058 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CR116004      = 1                                        RMB0021 
ACIEM4       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.2040 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-AT115003      = 1                                        RMB0021 
ACIEM4       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.1145 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM4    IF P-CR116003      = 1                                        RMB0021 
ACIEM4       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM4          MOVE 0.0956 TO P-DIFFERENCE                             RMB0021 
ACIEM4          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
REMARK************COMIENZO VARIABLES CONTINUAS ***************************
ACIEM4    IF P-ID004X NOT = 780                                         RMB0021 
ACIEM4       COMPUTE P-TEMP1 = (780 - P-ID004X) * 0.00051               RMB0021 
ACIEM4       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM4       PERFORM 18001-P-INSERTE-CONTINUA.                          RMB0021 
NEWSCO 11860-TRU-SCORECARD05-P.
REMARK******************************************************************
REMARK*11860-TRU-SCORECARD05-P.
REMARK* IMPLEMENTACION DEL SCORE-CARD 5 DE ACIERTA-PLUS
REMARK******************************************************************
ACIEM5    PERFORM 12009-P-CBCC60.                                       RMB0021 
ACIEM5    PERFORM 12007-P-PCPTOP12.                                     RMB0021 
ACIEM5    PERFORM 12001-P-RECDEL-DECDELP.                               RMB0021 
REMAR5***********************************************************
ACIEM5    INITIALIZE VARIABLES-DUMMYS-ACIERTA-PLUS.                     RMB0021 
REMAR5*******************VARIABLE 115 CONTIENE PUNTO DECIMAL ***********
ACIEM5    IF AT124 NOT NUMERIC                                          RMB0021 
ACIEM5       IF AT124 = "       -2"                                     RMB0021 
ACIEM5          MOVE 1 TO P-AT124011                                    RMB0021 
ACIEM5       ELSE                                                       RMB0021 
ACIEM5          IF AT124 = "       -1"                                  RMB0021 
ACIEM5             MOVE 1 TO P-AT124012                                 RMB0021 
ACIEM5          ELSE                                                    RMB0021 
ACIEM5             MOVE 1 TO P-AT124010                                 RMB0021 
ACIEM5          END-IF                                                  RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF AT124 NUMERIC MOVE AT124 TO TAT124 ELSE MOVE 0 TO TAT124.  RMB0021 
ACIEM5    IF AT124 NUMERIC                                              RMB0021 
ACIEM5       IF        TAT124 * P-INDEX  = 000 MOVE 1 TO P-AT124013     RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF  000 <   TAT124 * P-INDEX  AND                          RMB0021 
ACIEM5                 TAT124 * P-INDEX <= 022 MOVE 1 TO P-AT124014     RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF  022 <   TAT124 * P-INDEX  AND                          RMB0021 
ACIEM5                 TAT124 * P-INDEX <= 051 MOVE 1 TO P-AT124015     RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF  051 <   TAT124 * P-INDEX  AND                          RMB0021 
ACIEM5                 TAT124 * P-INDEX <= 118 MOVE 1 TO P-AT124016     RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF  118 <   TAT124 * P-INDEX      MOVE 1 TO P-AT124017     RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF        P-CBCC60  <   000      MOVE 1 TO P-CBCC60001 END-IF.RMB0021 
ACIEM5    IF 000 <= P-CBCC60  AND P-CBCC60 <=  000                      RMB0021 
ACIEM5                                     MOVE 1 TO P-CBCC60002        RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 001 <= P-CBCC60               MOVE 1 TO P-CBCC60003 END-IF.RMB0021 
ACIEM5    IF CC041 NOT NUMERIC              MOVE 1 TO P-CC041011 END-IF.RMB0021 
ACIEM5    IF CC041 NUMERIC                                              RMB0021 
ACIEM5     IF 000 <= CC041 AND CC041 <= 004  MOVE 1 TO P-CC041012 END-IFRMB0021 
ACIEM5     IF 005 <= CC041 AND CC041 <= 007  MOVE 1 TO P-CC041013 END-IFRMB0021 
ACIEM5     IF 008 <= CC041 AND CC041 <= 012  MOVE 1 TO P-CC041014 END-IFRMB0021 
ACIEM5     IF 013 <= CC041 AND CC041 <= 015  MOVE 1 TO P-CC041015 END-IFRMB0021 
ACIEM5     IF 016 <= CC041 AND CC041 <= 019  MOVE 1 TO P-CC041016 END-IFRMB0021 
ACIEM5     IF 020 <= CC041 AND CC041 <= 032  MOVE 1 TO P-CC041017 END-IFRMB0021 
ACIEM5     IF 033 <= CC041 AND CC041 <= 069  MOVE 1 TO P-CC041018 END-IFRMB0021 
ACIEM5     IF 070 <= CC041                   MOVE 1 TO P-CC041019 END-IFRMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF CR034 NOT NUMERIC              MOVE 1 TO P-CR034001 END-IF.RMB0021 
ACIEM5    IF CR034 NUMERIC                                              RMB0021 
ACIEM5     IF 000 <= CR034 AND CR034 <= 000  MOVE 1 TO P-CR034002 END-IFRMB0021 
ACIEM5     IF 001 <= CR034 AND CR034 <= 003  MOVE 1 TO P-CR034003 END-IFRMB0021 
ACIEM5     IF 004 <= CR034                   MOVE 1 TO P-CR034004 END-IFRMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF CR116    (5:1) = "-"                                       RMB0021 
ACIEM5       IF CR116(6:1) = "5" OR "6"   *>= -5                        RMB0021 
ACIEM5          MOVE 1 TO P-CR116010                                    RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF CR116(6:1) = "4"                                        RMB0021 
ACIEM5          MOVE 1 TO P-CR116011                                    RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF CR116(6:1) = "3"                                        RMB0021 
ACIEM5          MOVE 1 TO P-CR116012                                    RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF CR116(6:1) = "2"                                        RMB0021 
ACIEM5          MOVE 1 TO P-CR116013                                    RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF CR116(6:1) = "1"                                        RMB0021 
ACIEM5          MOVE 1 TO P-CR116014                                    RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5    ELSE                                                          RMB0021 
ACIEM5       MOVE "000000" TO TCR116(1:6)                               RMB0021 
ACIEM5       MOVE CR116    (1:3) TO TCR116(2:3)                         RMB0021 
ACIEM5       MOVE CR116    (5:2) TO TCR116(5:2)                         RMB0021 
ACIEM5    IF 000 <= TCR116 AND TCR116 <= 013 MOVE 1 TO P-CR116015 END-IFRMB0021 
ACIEM5    IF 013  < TCR116 AND TCR116 <= 019 MOVE 1 TO P-CR116016 END-IFRMB0021 
ACIEM5    IF 020  < TCR116 AND TCR116 <= 026 MOVE 1 TO P-CR116017 END-IFRMB0021 
ACIEM5    IF 027  < TCR116 AND TCR116 <= 032 MOVE 1 TO P-CR116018 END-IFRMB0021 
ACIEM5    IF 033  < TCR116 AND TCR116 <= 041 MOVE 1 TO P-CR116019 END-IFRMB0021 
ACIEM5    IF 042  < TCR116 AND TCR116 <= 049 MOVE 1 TO P-CR116020 END-IFRMB0021 
ACIEM5    IF 050  < TCR116 AND TCR116 <= 058 MOVE 1 TO P-CR116021 END-IFRMB0021 
ACIEM5    IF 059  < TCR116 AND TCR116 <= 081 MOVE 1 TO P-CR116022 END-IFRMB0021 
ACIEM5    IF 082  < TCR116 AND TCR116 <= 090 MOVE 1 TO P-CR116023 END-IFRMB0021 
ACIEM5    IF 091  < TCR116 AND TCR116 <= 100 MOVE 1 TO P-CR116024 END-IFRMB0021 
ACIEM5    IF 101  < TCR116                   MOVE 1 TO P-CR116025 END-IFRMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF ID004 NOT NUMERIC MOVE 1 TO P-ID004001       END-IF.       RMB0021 
ACIEM5    IF ID004 NUMERIC                                              RMB0021 
ACIEM5       IF             ID004 <= 274      MOVE 1 TO P-ID004001      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 275 <= ID004 AND ID004 <= 291 MOVE 1 TO P-ID004002      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 292 <= ID004 AND ID004 <= 314 MOVE 1 TO P-ID004003      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 315 <= ID004 AND ID004 <= 344 MOVE 1 TO P-ID004004      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 345 <= ID004 AND ID004 <= 354 MOVE 1 TO P-ID004005      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 355 <= ID004 AND ID004 <= 420 MOVE 1 TO P-ID004006      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 421 <= ID004 AND ID004 <= 490 MOVE 1 TO P-ID004007      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 491 <= ID004 AND ID004 <= 556 MOVE 1 TO P-ID004008      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 557 <= ID004 AND ID004 <= 595 MOVE 1 TO P-ID004009      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 596 <= ID004 AND ID004 <= 617 MOVE 1 TO P-ID004010      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 618 <= ID004 AND ID004 <= 671 MOVE 1 TO P-ID004011      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5       IF 672 <= ID004                  MOVE 1 TO P-ID004012      RMB0021 
ACIEM5       END-IF                                                     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF ID007 NUMERIC                                              RMB0021 
ACIEM5     IF ID007 = 48 OR 56              MOVE 1 TO P-ID007021 END-IF RMB0021 
ACIEM5     IF ID007 = 21 OR 13              MOVE 1 TO P-ID007022 END-IF RMB0021 
ACIEM5     IF ID007 = 05                    MOVE 1 TO P-ID007023 END-IF RMB0021 
ACIEM5     IF ID007 = 03 OR 12              MOVE 1 TO P-ID007024 END-IF RMB0021 
ACIEM5     IF ID007 NOT = ( 48 AND 56 AND 21 AND 13 AND 5 AND 3 AND 12) RMB0021 
ACIEM5                                      MOVE 1 TO P-ID007025 END-IF RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF IQ013 NOT NUMERIC               MOVE 1 TO P-IQ013009 END-IFRMB0021 
ACIEM5    IF IQ013 NUMERIC                                              RMB0021 
ACIEM5     IF 000 <= IQ013 AND IQ013 <= 000  MOVE 1 TO P-IQ013010 END-IFRMB0021 
ACIEM5     IF 001 <= IQ013 AND IQ013 <= 001  MOVE 1 TO P-IQ013011 END-IFRMB0021 
ACIEM5     IF 002 <= IQ013 AND IQ013 <= 002  MOVE 1 TO P-IQ013012 END-IFRMB0021 
ACIEM5     IF 003 <= IQ013                   MOVE 1 TO P-IQ013013 END-IFRMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF        P-PCTOP12 <=  014        MOVE 1 TO P-PCTOP12004.    RMB0021 
ACIEM5    IF 015 <= P-PCTOP12 AND                                       RMB0021 
ACIEM5              P-PCTOP12 <=  020        MOVE 1 TO P-PCTOP12005     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 021 <= P-PCTOP12 AND                                       RMB0021 
ACIEM5              P-PCTOP12 <=  025        MOVE 1 TO P-PCTOP12006     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 026 <= P-PCTOP12 AND                                       RMB0021 
ACIEM5              P-PCTOP12 <=  035        MOVE 1 TO P-PCTOP12007     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 036 <= P-PCTOP12 AND                                       RMB0021 
ACIEM5              P-PCTOP12 <=  040        MOVE 1 TO P-PCTOP12008     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 041 <= P-PCTOP12 AND                                       RMB0021 
ACIEM5              P-PCTOP12 <=  050        MOVE 1 TO P-PCTOP12009     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 051 <= P-PCTOP12 AND                                       RMB0021 
ACIEM5              P-PCTOP12 <=  060        MOVE 1 TO P-PCTOP12010     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 061 <= P-PCTOP12                MOVE 1 TO P-PCTOP12011     RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF        P-RECDEL <= 001   MOVE 1 TO P-RECDEL015 END-IF.     RMB0021 
ACIEM5    IF 002 <= P-RECDEL AND                                        RMB0021 
ACIEM5              P-RECDEL  <=  002 MOVE 1 TO P-RECDEL016             RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 003 <= P-RECDEL AND                                        RMB0021 
ACIEM5              P-RECDEL  <=  003 MOVE 1 TO P-RECDEL017             RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 004 <= P-RECDEL AND                                        RMB0021 
ACIEM5              P-RECDEL  <=  005 MOVE 1 TO P-RECDEL018             RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 006 <= P-RECDEL AND                                        RMB0021 
ACIEM5              P-RECDEL  <=  010 MOVE 1 TO P-RECDEL019             RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 011 <= P-RECDEL AND                                        RMB0021 
ACIEM5              P-RECDEL  <=  022 MOVE 1 TO P-RECDEL020             RMB0021 
ACIEM5    END-IF.                                                       RMB0021 
ACIEM5    IF 023 <= P-RECDEL          MOVE 1 TO P-RECDEL021 END-IF.     RMB0021 
ACIEM5    COMPUTE P-SCOREN        = 2.2897        +                     RMB0021 
ACIEM5                   +0       * P-AT124010    +                     RMB0021 
ACIEM5                   +0       * P-AT124011    +                     RMB0021 
ACIEM5                   +0       * P-AT124012    +                     RMB0021 
ACIEM5                   +0.1078  * P-AT124013    +                     RMB0021 
ACIEM5                   -0.2239  * P-AT124014    +                     RMB0021 
ACIEM5                   -0.3736  * P-AT124015    +                     RMB0021 
ACIEM5                   -0.4379  * P-AT124016    +                     RMB0021 
ACIEM5                   -0.4741  * P-AT124017    +                     RMB0021 
ACIEM5                   +0       * P-CBCC60001   +                     RMB0021 
ACIEM5                   +0       * P-CBCC60002   +                     RMB0021 
ACIEM5                   -0.7030  * P-CBCC60003   +                     RMB0021 
ACIEM5                   +0       * P-CC041011    +                     RMB0021 
ACIEM5                   -0.3657  * P-CC041012    +                     RMB0021 
ACIEM5                   -0.3347  * P-CC041013    +                     RMB0021 
ACIEM5                   -0.3183  * P-CC041014    +                     RMB0021 
ACIEM5                   -0.2317   * P-CC041015   +                     RMB0021 
ACIEM5                   -0.0761   * P-CC041016   +                     RMB0021 
ACIEM5                   +0.1131   * P-CC041017   +                     RMB0021 
ACIEM5                   +0.2577   * P-CC041018   +                     RMB0021 
ACIEM5                   +0.2850   * P-CC041019   +                     RMB0021 
ACIEM5                   +0        * P-CR034001   +                     RMB0021 
ACIEM5                   -0.1783   * P-CR034002   +                     RMB0021 
ACIEM5                   +0.0439   * P-CR034003   +                     RMB0021 
ACIEM5                   +0.1360   * P-CR034004   +                     RMB0021 
ACIEM5                   +0        * P-CR116010   +                     RMB0021 
ACIEM5                   +0        * P-CR116011   +                     RMB0021 
ACIEM5                   +0        * P-CR116012   +                     RMB0021 
ACIEM5                   +0        * P-CR116013   +                     RMB0021 
ACIEM5                   +0        * P-CR116014   +                     RMB0021 
ACIEM5                   +0.3493   * P-CR116015   +                     RMB0021 
ACIEM5                   +0.3252   * P-CR116016   +                     RMB0021 
ACIEM5                   +0.2697   * P-CR116017   +                     RMB0021 
ACIEM5                   +0.2106   * P-CR116018   +                     RMB0021 
ACIEM5                   +0.1648   * P-CR116019   +                     RMB0021 
ACIEM5                   +0.0350   * P-CR116020   +                     RMB0021 
ACIEM5                   -0.0182   * P-CR116021   +                     RMB0021 
ACIEM5                   -0.1493   * P-CR116022   +                     RMB0021 
ACIEM5                   -0.2573   * P-CR116023   +                     RMB0021 
ACIEM5                   -0.3681   * P-CR116024   +                     RMB0021 
ACIEM5                   -0.5767   * P-CR116025   +                     RMB0021 
ACIEM5                   -0.2760   * P-ID004001   +                     RMB0021 
ACIEM5                   -0.2365   * P-ID004002   +                     RMB0021 
ACIEM5                   -0.1895   * P-ID004003   +                     RMB0021 
ACIEM5                   -0.1635   * P-ID004004   +                     RMB0021 
ACIEM5                   -0.1102   * P-ID004005   +                     RMB0021 
ACIEM5                   -0.0474   * P-ID004006   +                     RMB0021 
ACIEM5                   -0.0108   * P-ID004007   +                     RMB0021 
ACIEM5                   +0.0429   * P-ID004008   +                     RMB0021 
ACIEM5                   +0.1099   * P-ID004009   +                     RMB0021 
ACIEM5                   +0.1571   * P-ID004010   +                     RMB0021 
ACIEM5                   +0.2337   * P-ID004011   +                     RMB0021 
ACIEM5                   +0.2523   * P-ID004012   +                     RMB0021 
ACIEM5                   -0.9521   * P-ID007021   +                     RMB0021 
ACIEM5                   -0.7100   * P-ID007022   +                     RMB0021 
ACIEM5                   -0.6603   * P-ID007023   +                     RMB0021 
ACIEM5                   -0.6126   * P-ID007024   +                     RMB0021 
ACIEM5                   +0        * P-ID007025   +                     RMB0021 
ACIEM5                   +0        * P-IQ013009   +                     RMB0021 
ACIEM5                   +0        * P-IQ013010   +                     RMB0021 
ACIEM5                   +0        * P-IQ013011   +                     RMB0021 
ACIEM5                   -0.3178   * P-IQ013012   +                     RMB0021 
ACIEM5                   -0.7152   * P-IQ013013   +                     RMB0021 
ACIEM5                   +0.3835   * P-PCTOP12004 +                     RMB0021 
ACIEM5                   +0.2692   * P-PCTOP12005 +                     RMB0021 
ACIEM5                   +0.2029   * P-PCTOP12006 +                     RMB0021 
ACIEM5                   +0.1113   * P-PCTOP12007 +                     RMB0021 
ACIEM5                   -0.0503   * P-PCTOP12008 +                     RMB0021 
ACIEM5                   -0.0914   * P-PCTOP12009 +                     RMB0021 
ACIEM5                   -0.3985   * P-PCTOP12010 +                     RMB0021 
ACIEM5                   -0.4254   * P-PCTOP12011 +                     RMB0021 
ACIEM5                   -1.8207   * P-RECDEL015  +                     RMB0021 
ACIEM5                   -1.0097   * P-RECDEL016  +                     RMB0021 
ACIEM5                   -0.6730   * P-RECDEL017  +                     RMB0021 
ACIEM5                   -0.4742   * P-RECDEL018  +                     RMB0021 
ACIEM5                   -0.0996   * P-RECDEL019  +                     RMB0021 
ACIEM5                   +0.0296   * P-RECDEL020  +                     RMB0021 
ACIEM5                   +0.4187   * P-RECDEL021  .                     RMB0021 
ACIEM5    MOVE -03130.4743279142      TO P-COEF1.                       RMB0021 
ACIEM5    MOVE +29294.7609575901      TO P-COEF2.                       RMB0021 
ACIEM5    MOVE -16893.6613012479      TO P-COEF3.                       RMB0021 
ACIEM5    MOVE +07208.98980108671     TO P-COEF4.                       RMB0021 
ACIEM5    MOVE -51820.0018398135      TO P-COEF5.                       RMB0021 
ACIEM5    MOVE +36194.6120346324      TO P-COEF6.                       RMB0021 
ACIEM5    COMPUTE P-SCOREN = ( 1 / (1 + 2.717281828 ** (- P-SCOREN))).  RMB0021 
ACIEM5    COMPUTE P-SCOREN1 = (P-COEF1      )                        +  RMB0021 
ACIEM5                       (P-COEF2 * (P-SCOREN ** 1 ))           +   RMB0021 
ACIEM5                       (P-COEF3 * (P-SCOREN ** 2 ))           +   RMB0021 
ACIEM5                       (P-COEF4 * (P-SCOREN ** 3 ))           +   RMB0021 
ACIEM5                       (P-COEF5 * (P-SCOREN ** 0.5))          +   RMB0021 
ACIEM5                       (P-COEF6 * (P-SCOREN ** 0.33))             RMB0021 
ACIEM5    COMPUTE P-SCORE ROUNDED = P-SCOREN1.                          RMB0021 
ACIEM5    IF P-SCORE <= 150 MOVE 150 TO P-SCORE.                        RMB0021 
ACIEM5    IF P-SCORE >= 850 MOVE 850 TO P-SCORE.                        RMB0021 
REMAR5****************COMIENZO CALCULO PARA LAS RAZONES *************
ACIEM5    PERFORM 18005-P-PREPARE-AA.                                   RMB0021 
ACIEM5    IF P-RECDEL015     = 1                                        RMB0021 
ACIEM5       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 2.2394 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-RECDEL016     = 1                                        RMB0021 
ACIEM5       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 1.4284 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-RECDEL017     = 1                                        RMB0021 
ACIEM5       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 1.0917 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID007021      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.9521 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116025      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.9260 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-RECDEL018     = 1                                        RMB0021 
ACIEM5       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.8929 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-PCTOP12011    = 1                                        RMB0021 
ACIEM5       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.8089 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-PCTOP12010    = 1                                        RMB0021 
ACIEM5       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.7820 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116024      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.7174 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-IQ013013      = 1                                        RMB0021 
ACIEM5       MOVE 19 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.7152 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID007022      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.7100 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CBCC60003     = 1                                        RMB0021 
ACIEM5       MOVE 04 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.7030 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID007023      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.6603 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CC041012      = 1                                        RMB0021 
ACIEM5       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.6507 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CC041013      = 1                                        RMB0021 
ACIEM5       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.6197 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID007024      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.6126 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116023      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.6066 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CC041014      = 1                                        RMB0021 
ACIEM5       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.6033 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-AT124017      = 1                                        RMB0021 
ACIEM5       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.5819 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-AT124016      = 1                                        RMB0021 
ACIEM5       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.5457 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004001      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.5283 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-RECDEL019     = 1                                        RMB0021 
ACIEM5       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.5183 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CC041015      = 1                                        RMB0021 
ACIEM5       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.5167 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116022      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.4986 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004002      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.4888 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-AT124015      = 1                                        RMB0021 
ACIEM5       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.4814 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-PCTOP12009    = 1                                        RMB0021 
ACIEM5       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.4749 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004003      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.4418 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-PCTOP12008    = 1                                        RMB0021 
ACIEM5       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.4338 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004004      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.4158 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-RECDEL020     = 1                                        RMB0021 
ACIEM5       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3891 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116021      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3675 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004005      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3625 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CC041016      = 1                                        RMB0021 
ACIEM5       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3611 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116010      = 1                                        RMB0021 
ACIEM5       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3493 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116011      = 1                                        RMB0021 
ACIEM5       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3493 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116012      = 1                                        RMB0021 
ACIEM5       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3493 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116013      = 1                                        RMB0021 
ACIEM5       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3493 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116014      = 1                                        RMB0021 
ACIEM5       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3493 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-AT124014      = 1                                        RMB0021 
ACIEM5       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3317 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-IQ013012      = 1                                        RMB0021 
ACIEM5       MOVE 19 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3178 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR034002      = 1                                        RMB0021 
ACIEM5       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3143 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116020      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.3143 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004006      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.2997 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CC041011      = 1                                        RMB0021 
ACIEM5       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.2850 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-PCTOP12007    = 1                                        RMB0021 
ACIEM5       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.2722 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004007      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.2631 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004008      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.2094 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116019      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1845 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-PCTOP12006    = 1                                        RMB0021 
ACIEM5       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1806 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CC041017      = 1                                        RMB0021 
ACIEM5       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1719 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004009      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1424 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116018      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1387 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR034001      = 1                                        RMB0021 
ACIEM5       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1360 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-PCTOP12005    = 1                                        RMB0021 
ACIEM5       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1143 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-AT124010      = 1                                        RMB0021 
ACIEM5       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1078 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-AT124011      = 1                                        RMB0021 
ACIEM5       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1078 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-AT124012      = 1                                        RMB0021 
ACIEM5       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.1078 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004010      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.0952 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR034003      = 1                                        RMB0021 
ACIEM5       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.0921 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116017      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.0796 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CC041018      = 1                                        RMB0021 
ACIEM5       MOVE 25 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.0273 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-CR116016      = 1                                        RMB0021 
ACIEM5       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.0241 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM5    IF P-ID004011      = 1                                        RMB0021 
ACIEM5       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM5       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM5          MOVE 0.0186 TO P-DIFFERENCE                             RMB0021 
ACIEM5          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
NEWSCO 11870-TRU-SCORECARD06-P.
REMARK******************************************************************
REMARK*11870-TRU-SCORECARD06-P.
REMARK* IMPLEMENTACION DEL SCORE-CARD 6 DE ACIERTA-PLUS
REMARK******************************************************************
ACIEM6    PERFORM 12010-P-MOS60.                                        RMB0021 
ACIEM6    PERFORM 12011-P-TOT30P.                                       RMB0021 
REMAR6***********************************************************
ACIEM6    INITIALIZE VARIABLES-DUMMYS-ACIERTA-PLUS.                     RMB0021 
REMAR6*******************VARIABLE 115 CONTIENE PUNTO DECIMAL ***********
ACIEM6    IF AT114 NOT NUMERIC             MOVE 1 TO P-AT114001  END-IF.RMB0021 
ACIEM6    IF AT114 NUMERIC MOVE AT114 TO TAT114 ELSE MOVE 0 TO TAT114.  RMB0021 
ACIEM6    IF AT114 NUMERIC                                              RMB0021 
ACIEM6       IF        TAT114 * P-INDEX  = 000 MOVE 1 TO P-AT114002     RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF  001  <=  TAT114 * P-INDEX  AND                         RMB0021 
ACIEM6                 TAT114 * P-INDEX <= 1999 MOVE 1 TO P-AT114003    RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF  2000 <=   TAT114 * P-INDEX  AND                        RMB0021 
ACIEM6                 TAT114 * P-INDEX <= 2975 MOVE 1 TO P-AT114004    RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 2976  <=   TAT114 * P-INDEX  AND                        RMB0021 
ACIEM6                 TAT114 * P-INDEX <= 4785 MOVE 1 TO P-AT114005    RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 4786  <=   TAT114 * P-INDEX  AND                        RMB0021 
ACIEM6                 TAT114 * P-INDEX <= 5823 MOVE 1 TO P-AT114006    RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 5824  <=   TAT114 * P-INDEX     MOVE 1 TO P-AT114007    RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF AT116    (5:1) = "-"                                       RMB0021 
ACIEM6       MOVE 1 TO P-AT116001                                       RMB0021 
ACIEM6    ELSE                                                          RMB0021 
ACIEM6       MOVE "000000" TO TAT116(1:6)                               RMB0021 
ACIEM6       MOVE AT116    (1:3) TO TAT116(2:3)                         RMB0021 
ACIEM6       MOVE AT116    (5:2) TO TAT116(5:2)                         RMB0021 
ACIEM6    IF 000 <= TAT116 AND TAT116 <= 005 MOVE 1 TO P-AT116002 END-IFRMB0021 
ACIEM6    IF 005  < TAT116 AND TAT116 <= 013 MOVE 1 TO P-AT116003 END-IFRMB0021 
ACIEM6    IF 013  < TAT116 AND TAT116 <= 021 MOVE 1 TO P-AT116004 END-IFRMB0021 
ACIEM6    IF 021  < TAT116 AND TAT116 <= 031 MOVE 1 TO P-AT116005 END-IFRMB0021 
ACIEM6    IF 031  < TAT116 AND TAT116 <= 036 MOVE 1 TO P-AT116006 END-IFRMB0021 
ACIEM6    IF 036  < TAT116 AND TAT116 <= 044 MOVE 1 TO P-AT116007 END-IFRMB0021 
ACIEM6    IF 044  < TAT116 AND TAT116 <= 051 MOVE 1 TO P-AT116008 END-IFRMB0021 
ACIEM6    IF 051  < TAT116 AND TAT116 <= 057 MOVE 1 TO P-AT116009 END-IFRMB0021 
ACIEM6    IF 057  < TAT116 AND TAT116 <= 062 MOVE 1 TO P-AT116010 END-IFRMB0021 
ACIEM6    IF 062  < TAT116 AND TAT116 <= 073 MOVE 1 TO P-AT116011 END-IFRMB0021 
ACIEM6    IF 073  < TAT116                   MOVE 1 TO P-AT116012 END-IFRMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF AT124 NOT NUMERIC              MOVE 1 TO P-AT124018 END-IF.RMB0021 
ACIEM6    IF AT124 NUMERIC MOVE AT124 TO TAT124 ELSE MOVE 0 TO TAT124.  RMB0021 
ACIEM6    IF AT124 NUMERIC                                              RMB0021 
ACIEM6       IF        TAT124 * P-INDEX  = 000 MOVE 1 TO P-AT124019     RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF  001 <=  TAT124 * P-INDEX  AND                          RMB0021 
ACIEM6                 TAT124 * P-INDEX <= 025 MOVE 1 TO P-AT124020     RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF  026 <=  TAT124 * P-INDEX  AND                          RMB0021 
ACIEM6                 TAT124 * P-INDEX <= 083 MOVE 1 TO P-AT124021     RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF  084 <=  TAT124 * P-INDEX      MOVE 1 TO P-AT124022     RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF BS050 NOT NUMERIC              MOVE 1 TO P-BS050001 END-IF.RMB0021 
ACIEM6    IF BS050 NUMERIC                                              RMB0021 
ACIEM6     IF 000 <= BS050 AND BS050 <=  000 MOVE 1 TO P-BS050002 END-IFRMB0021 
ACIEM6     IF 001 <= BS050                   MOVE 1 TO P-BS050003 END-IFRMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF BS115    (5:1) = "-"                                       RMB0021 
ACIEM6       MOVE 1 TO P-BS115001                                       RMB0021 
ACIEM6    ELSE                                                          RMB0021 
ACIEM6       MOVE "000000" TO TBS115(1:6)                               RMB0021 
ACIEM6       MOVE BS115    (1:3) TO TBS115(2:3)                         RMB0021 
ACIEM6       MOVE BS115    (5:2) TO TBS115(5:2)                         RMB0021 
ACIEM6    IF 000 <= TBS115 AND TBS115 <= 020 MOVE 1 TO P-BS115002 END-IFRMB0021 
ACIEM6    IF 020  < TBS115 AND TBS115 <= 033 MOVE 1 TO P-BS115003 END-IFRMB0021 
ACIEM6    IF 033  < TBS115 AND TBS115 <= 043 MOVE 1 TO P-BS115004 END-IFRMB0021 
ACIEM6    IF 043  < TBS115 AND TBS115 <= 052 MOVE 1 TO P-BS115005 END-IFRMB0021 
ACIEM6    IF 052  < TBS115 AND TBS115 <= 057 MOVE 1 TO P-BS115006 END-IFRMB0021 
ACIEM6    IF 057  < TBS115 AND TBS115 <= 073 MOVE 1 TO P-BS115007 END-IFRMB0021 
ACIEM6    IF 073  < TBS115 AND TBS115 <= 089 MOVE 1 TO P-BS115008 END-IFRMB0021 
ACIEM6    IF 089  < TBS115                   MOVE 1 TO P-BS115009 END-IFRMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF CR050 NOT NUMERIC              MOVE 1 TO P-CR050001 END-IF.RMB0021 
ACIEM6    IF CR050 NUMERIC                                              RMB0021 
ACIEM6     IF 000 <= CR050 AND CR050 <=  000 MOVE 1 TO P-CR050002 END-IFRMB0021 
ACIEM6     IF 001 <= CR050                   MOVE 1 TO P-CR050003 END-IFRMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF ID004 NOT NUMERIC MOVE 1 TO P-ID004013       END-IF.       RMB0021 
ACIEM6    IF ID004 NUMERIC                                              RMB0021 
ACIEM6       IF             ID004 <= 276      MOVE 1 TO P-ID004013      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 277 <= ID004 AND ID004 <= 312 MOVE 1 TO P-ID004014      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 313 <= ID004 AND ID004 <= 328 MOVE 1 TO P-ID004015      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 329 <= ID004 AND ID004 <= 343 MOVE 1 TO P-ID004016      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 344 <= ID004 AND ID004 <= 357 MOVE 1 TO P-ID004017      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 358 <= ID004 AND ID004 <= 370 MOVE 1 TO P-ID004018      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 371 <= ID004 AND ID004 <= 395 MOVE 1 TO P-ID004019      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 396 <= ID004 AND ID004 <= 406 MOVE 1 TO P-ID004020      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 407 <= ID004 AND ID004 <= 440 MOVE 1 TO P-ID004021      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 441 <= ID004 AND ID004 <= 506 MOVE 1 TO P-ID004022      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 507 <= ID004 AND ID004 <= 516 MOVE 1 TO P-ID004023      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 517 <= ID004 AND ID004 <= 523 MOVE 1 TO P-ID004024      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 524 <= ID004 AND ID004 <= 554 MOVE 1 TO P-ID004025      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 555 <= ID004 AND ID004 <= 563 MOVE 1 TO P-ID004026      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 564 <= ID004 AND ID004 <= 588 MOVE 1 TO P-ID004027      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 589 <= ID004 AND ID004 <= 621 MOVE 1 TO P-ID004028      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 622 <= ID004 AND ID004 <= 661 MOVE 1 TO P-ID004029      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 662 <= ID004 AND ID004 <= 685 MOVE 1 TO P-ID004030      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 686 <= ID004 AND ID004 <= 713 MOVE 1 TO P-ID004031      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 714 <= ID004 AND ID004 <= 743 MOVE 1 TO P-ID004032      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 744 <= ID004 AND ID004 <= 763 MOVE 1 TO P-ID004033      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 764 <= ID004 AND ID004 <= 791 MOVE 1 TO P-ID004034      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6       IF 792 <= ID004                  MOVE 1 TO P-ID004035      RMB0021 
ACIEM6       END-IF                                                     RMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF IQ013 NOT NUMERIC               MOVE 1 TO P-IQ013014 END-IFRMB0021 
ACIEM6    IF IQ013 NUMERIC                                              RMB0021 
ACIEM6     IF 000 <= IQ013 AND IQ013 <= 000  MOVE 1 TO P-IQ013015 END-IFRMB0021 
ACIEM6     IF 001 <= IQ013                   MOVE 1 TO P-IQ013016 END-IFRMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF 000 <= P-AOT AND P-AOT <=  016 MOVE 1 TO P-AOT011 END-IF.  RMB0021 
ACIEM6    IF 017 <= P-AOT AND P-AOT <=  019 MOVE 1 TO P-AOT012 END-IF.  RMB0021 
ACIEM6    IF 020 <= P-AOT AND P-AOT <=  021 MOVE 1 TO P-AOT013 END-IF.  RMB0021 
ACIEM6    IF 022 <= P-AOT AND P-AOT <=  026 MOVE 1 TO P-AOT014 END-IF.  RMB0021 
ACIEM6    IF 027 <= P-AOT AND P-AOT <=  029 MOVE 1 TO P-AOT015 END-IF.  RMB0021 
ACIEM6    IF 030 <= P-AOT AND P-AOT <=  031 MOVE 1 TO P-AOT016 END-IF.  RMB0021 
ACIEM6    IF 032 <= P-AOT AND P-AOT <=  052 MOVE 1 TO P-AOT017 END-IF.  RMB0021 
ACIEM6    IF 053 <= P-AOT AND P-AOT <=  140 MOVE 1 TO P-AOT018 END-IF.  RMB0021 
ACIEM6    IF 141 <= P-AOT AND P-AOT <=  166 MOVE 1 TO P-AOT019 END-IF.  RMB0021 
ACIEM6    IF 167 <= P-AOT AND P-AOT <=  208 MOVE 1 TO P-AOT020 END-IF.  RMB0021 
ACIEM6    IF 209 <= P-AOT AND P-AOT <=  252 MOVE 1 TO P-AOT021 END-IF.  RMB0021 
ACIEM6    IF 253 <= P-AOT                   MOVE 1 TO P-AOT022 END-IF.  RMB0021 
ACIEM6    IF        P-MOS60   <=  007      MOVE 1 TO P-MOS60001  END-IF.RMB0021 
ACIEM6    IF 008 <= P-MOS60   AND P-MOS60  <=  019                      RMB0021 
ACIEM6                                     MOVE 1 TO P-MOS60002         RMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    IF 020 <= P-MOS60                MOVE 1 TO P-MOS60003  END-IF.RMB0021 
ACIEM6    COMPUTE P-OPOT18 = TOT030 + TOT031 + TOT032.                  RMB0021 
ACIEM6    IF        P-OPOT18  <=  -1         MOVE 1 TO P-OPOT18001.     RMB0021 
ACIEM6    IF 000  = P-OPOT18                 MOVE 1 TO P-OPOT18002.     RMB0021 
ACIEM6    IF 001 <= P-OPOT18                 MOVE 1 TO P-OPOT18003.     RMB0021 
ACIEM6    IF 000  = P-TOT30P                 MOVE 1 TO P-TOT30P001.     RMB0021 
ACIEM6    IF 001 <= P-TOT30P                 MOVE 1 TO P-TOT30P002.     RMB0021 
ACIEM6    IF ID007 NUMERIC                                              RMB0021 
ACIEM6     IF ID007 = 3 OR 12 OR 13 OR 21   MOVE 1 TO P-ID007026 END-IF RMB0021 
ACIEM6     IF ID007 = 28 OR 5               MOVE 1 TO P-ID007027 END-IF RMB0021 
ACIEM6     IF ID007 = 7                     MOVE 1 TO P-ID007028 END-IF RMB0021 
ACIEM6     IF ID007 = 24                    MOVE 1 TO P-ID007029 END-IF RMB0021 
ACIEM6     IF ID007 NOT = ( 3 AND 12 AND 13 AND 21 AND 28 AND 5 AND 7   RMB0021 
ACIEM6                                                          AND 24) RMB0021 
ACIEM6                                      MOVE 1 TO P-ID007030 END-IF RMB0021 
ACIEM6    END-IF.                                                       RMB0021 
ACIEM6    COMPUTE P-SCOREN        = 3.1888        +                     RMB0021 
ACIEM6                   +0       * P-AT114001    +                     RMB0021 
ACIEM6                   -0.4249  * P-AT114002    +                     RMB0021 
ACIEM6                   -0.0981  * P-AT114003    +                     RMB0021 
ACIEM6                   +0.0257  * P-AT114004    +                     RMB0021 
ACIEM6                   +0.0740  * P-AT114005    +                     RMB0021 
ACIEM6                   +0.1493  * P-AT114006    +                     RMB0021 
ACIEM6                   +0.1869  * P-AT114007    +                     RMB0021 
ACIEM6                   +0       * P-AT116001    +                     RMB0021 
ACIEM6                   +0.5969  * P-AT116002    +                     RMB0021 
ACIEM6                   +0.2425  * P-AT116003    +                     RMB0021 
ACIEM6                   +0.1836  * P-AT116004    +                     RMB0021 
ACIEM6                   +0.1277  * P-AT116005    +                     RMB0021 
ACIEM6                   +0.1091  * P-AT116006    +                     RMB0021 
ACIEM6                   +0.0364  * P-AT116007    +                     RMB0021 
ACIEM6                   -0.0411  * P-AT116008    +                     RMB0021 
ACIEM6                   -0.0706  * P-AT116009    +                     RMB0021 
ACIEM6                   -0.0978  * P-AT116010    +                     RMB0021 
ACIEM6                   -0.1198  * P-AT116011    +                     RMB0021 
ACIEM6                   -0.1471  * P-AT116012    +                     RMB0021 
ACIEM6                   +0       * P-AT124018    +                     RMB0021 
ACIEM6                   +0       * P-AT124019    +                     RMB0021 
ACIEM6                   -0.3610  * P-AT124020    +                     RMB0021 
ACIEM6                   -0.7328  * P-AT124021    +                     RMB0021 
ACIEM6                   -0.8700  * P-AT124022    +                     RMB0021 
ACIEM6                   +0       * P-BS050001    +                     RMB0021 
ACIEM6                   +0       * P-BS050002    +                     RMB0021 
ACIEM6                   +0.3211  * P-BS050003    +                     RMB0021 
ACIEM6                   +0       * P-BS115001    +                     RMB0021 
ACIEM6                   +0.3343  * P-BS115002    +                     RMB0021 
ACIEM6                   +0.2901  * P-BS115003    +                     RMB0021 
ACIEM6                   +0.0915  * P-BS115004    +                     RMB0021 
ACIEM6                   +0.0756  * P-BS115005    +                     RMB0021 
ACIEM6                   -0.0418  * P-BS115006    +                     RMB0021 
ACIEM6                   -0.1041  * P-BS115007    +                     RMB0021 
ACIEM6                   -0.1836  * P-BS115008    +                     RMB0021 
ACIEM6                   -0.4095  * P-BS115009    +                     RMB0021 
ACIEM6                   +0       * P-CR050001    +                     RMB0021 
ACIEM6                   +0       * P-CR050002    +                     RMB0021 
ACIEM6                   +0.4196  * P-CR050003    +                     RMB0021 
ACIEM6                   -0.3210  * P-ID004013    +                     RMB0021 
ACIEM6                   -0.2653  * P-ID004014    +                     RMB0021 
ACIEM6                   -0.2462  * P-ID004015    +                     RMB0021 
ACIEM6                   -0.2060  * P-ID004016    +                     RMB0021 
ACIEM6                   -0.1577  * P-ID004017    +                     RMB0021 
ACIEM6                   -0.1431  * P-ID004018    +                     RMB0021 
ACIEM6                   -0.0989  * P-ID004019    +                     RMB0021 
ACIEM6                   -0.0858  * P-ID004020    +                     RMB0021 
ACIEM6                   -0.0830  * P-ID004021    +                     RMB0021 
ACIEM6                   -0.0553  * P-ID004022    +                     RMB0021 
ACIEM6                   +0.0218  * P-ID004023    +                     RMB0021 
ACIEM6                   +0.0418  * P-ID004024    +                     RMB0021 
ACIEM6                   +0.0589  * P-ID004025    +                     RMB0021 
ACIEM6                   +0.1031  * P-ID004026    +                     RMB0021 
ACIEM6                   +0.1102  * P-ID004027    +                     RMB0021 
ACIEM6                   +0.1498  * P-ID004028    +                     RMB0021 
ACIEM6                   +0.1741  * P-ID004029    +                     RMB0021 
ACIEM6                   +0.1984  * P-ID004030    +                     RMB0021 
ACIEM6                   +0.2153  * P-ID004031    +                     RMB0021 
ACIEM6                   +0.2563  * P-ID004032    +                     RMB0021 
ACIEM6                   +0.2851  * P-ID004033    +                     RMB0021 
ACIEM6                   +0.3373  * P-ID004034    +                     RMB0021 
ACIEM6                   +0.4409  * P-ID004035    +                     RMB0021 
ACIEM6                   +0       * P-IQ013014    +                     RMB0021 
ACIEM6                   +0       * P-IQ013015    +                     RMB0021 
ACIEM6                   -0.5900  * P-IQ013016    +                     RMB0021 
ACIEM6                   -0.1946  * P-AOT011      +                     RMB0021 
ACIEM6                   -0.1366  * P-AOT012      +                     RMB0021 
ACIEM6                   -0.1185  * P-AOT013      +                     RMB0021 
ACIEM6                   -0.0794  * P-AOT014      +                     RMB0021 
ACIEM6                   -0.0370  * P-AOT015      +                     RMB0021 
ACIEM6                   -0.0282  * P-AOT016      +                     RMB0021 
ACIEM6                   -0.0138  * P-AOT017      +                     RMB0021 
ACIEM6                   -0.0089  * P-AOT018      +                     RMB0021 
ACIEM6                   +0.1100  * P-AOT019      +                     RMB0021 
ACIEM6                   +0.1751  * P-AOT020      +                     RMB0021 
ACIEM6                   +0.3073  * P-AOT021      +                     RMB0021 
ACIEM6                   +0.4921  * P-AOT022      +                     RMB0021 
ACIEM6                   -1.5756  * P-MOS60001    +                     RMB0021 
ACIEM6                   -0.8380  * P-MOS60002    +                     RMB0021 
ACIEM6                   +0       * P-MOS60003    +                     RMB0021 
ACIEM6                   +0       * P-OPOT18001   +                     RMB0021 
ACIEM6                   +0       * P-OPOT18002   +                     RMB0021 
ACIEM6                   -0.3303  * P-OPOT18003   +                     RMB0021 
ACIEM6                   +0       * P-TOT30P001   +                     RMB0021 
ACIEM6                   -1.3091  * P-TOT30P002   +                     RMB0021 
ACIEM6                   -0.5631  * P-ID007026    +                     RMB0021 
ACIEM6                   -0.4528  * P-ID007027    +                     RMB0021 
ACIEM6                   +0.3563  * P-ID007028    +                     RMB0021 
ACIEM6                   +0.5849  * P-ID007029    +                     RMB0021 
ACIEM6                   +0       * P-ID007030.                         RMB0021 
ACIEM6    MOVE -06718.04243642727     TO P-COEF1.                       RMB0021 
ACIEM6    MOVE +52900.3129121286      TO P-COEF2.                       RMB0021 
ACIEM6    MOVE -28141.2419226959      TO P-COEF3.                       RMB0021 
ACIEM6    MOVE +11262.0692759838      TO P-COEF4.                       RMB0021 
ACIEM6    MOVE -100000                TO P-COEF5.                       RMB0021 
ACIEM6    MOVE +71592.1431386416      TO P-COEF6.                       RMB0021 
ACIEM6    COMPUTE P-SCOREN = ( 1 / (1 + 2.717281828 ** (- P-SCOREN))).  RMB0021 
ACIEM6    COMPUTE P-SCOREN1 = (P-COEF1      )                        +  RMB0021 
ACIEM6                       (P-COEF2 * (P-SCOREN ** 1 ))           +   RMB0021 
ACIEM6                       (P-COEF3 * (P-SCOREN ** 2 ))           +   RMB0021 
ACIEM6                       (P-COEF4 * (P-SCOREN ** 3 ))           +   RMB0021 
ACIEM6                       (P-COEF5 * (P-SCOREN ** 0.5))          +   RMB0021 
ACIEM6                       (P-COEF6 * (P-SCOREN ** 0.33))             RMB0021 
ACIEM6    COMPUTE P-SCORE ROUNDED = P-SCOREN1.                          RMB0021 
ACIEM6    IF P-SCORE <= 150 MOVE 150 TO P-SCORE.                        RMB0021 
ACIEM6    IF P-SCORE >= 850 MOVE 850 TO P-SCORE.                        RMB0021 
REMAR6****************COMIENZO CALCULO PARA LAS RAZONES *************
ACIEM6    PERFORM 18005-P-PREPARE-AA.                                   RMB0021 
ACIEM6    IF P-MOS60001      = 1                                        RMB0021 
ACIEM6       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 1.5756 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-TOT30P002     = 1                                        RMB0021 
ACIEM6       MOVE 32 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 1.3091 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID007026      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 1.1480 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID007027      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 1.0377 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT124022      = 1                                        RMB0021 
ACIEM6       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.8700 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-MOS60002      = 1                                        RMB0021 
ACIEM6       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.8380 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004013      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.7619 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116012      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.7440 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS115009      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.7438 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT124021      = 1                                        RMB0021 
ACIEM6       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.7328 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116011      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.7167 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004014      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.7062 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116010      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6947 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004015      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6871 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT011        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6867 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116009      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6675 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004016      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6469 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116008      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6380 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT012        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6287 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT114002      = 1                                        RMB0021 
ACIEM6       MOVE 51 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6118 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT013        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.6106 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004017      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5986 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116001      = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5969 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-IQ013016      = 1                                        RMB0021 
ACIEM6       MOVE 19 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5900 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID007030      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5849 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004018      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5840 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT014        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5715 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116007      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5605 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004019      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5398 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT015        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5291 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004020      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5267 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004021      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5239 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT016        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5203 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS115008      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5179 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT017        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5059 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT018        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.5010 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004022      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.4962 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116006      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.4878 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116005      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.4692 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS115007      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.4384 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-CR050001      = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.4196 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-CR050002      = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.4196 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004023      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.4191 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116004      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.4133 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004024      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3991 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT019        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3821 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004025      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3820 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS115006      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3761 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT124020      = 1                                        RMB0021 
ACIEM6       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3610 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT116003      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3544 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004026      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3378 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS115001      = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3343 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004027      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3307 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-OPOT18003     = 1                                        RMB0021 
ACIEM6       MOVE 36 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3303 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS050001      = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3211 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS050002      = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3211 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT020        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.3170 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004028      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.2911 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT114003      = 1                                        RMB0021 
ACIEM6       MOVE 51 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.2850 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004029      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.2668 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS115005      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.2587 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS115004      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.2428 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004030      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.2425 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID007028      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.2286 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004031      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.2256 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT114001      = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.1869 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AOT021        = 1                                        RMB0021 
ACIEM6       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.1848 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004032      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.1846 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT114004      = 1                                        RMB0021 
ACIEM6       MOVE 51 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.1612 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004033      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.1558 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT114005      = 1                                        RMB0021 
ACIEM6       MOVE 51 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.1129 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-ID004034      = 1                                        RMB0021 
ACIEM6       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.1036 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-BS115003      = 1                                        RMB0021 
ACIEM6       MOVE 45 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.0442 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM6    IF P-AT114006      = 1                                        RMB0021 
ACIEM6       MOVE 51 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM6       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM6          MOVE 0.0376 TO P-DIFFERENCE                             RMB0021 
ACIEM6          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACPLU9 11880-TRU-SCORECARD07-P.
REMARK******************************************************************
REMARK*11880-TRU-SCORECARD07-P.
REMARK* IMPLEMENTACION DEL SCORE-CARD 7 DE ACIERTA-PLUS
REMARK******************************************************************
ACIEM7    PERFORM 12007-P-PCPTOP12.                                     RMB0021 
ACIEM7    PERFORM 12001-P-RECDEL-DECDELP.                               RMB0021 
REMARK***********************************************************
ACIEM7    INITIALIZE VARIABLES-DUMMYS-ACIERTA-PLUS.                     RMB0021 
REMAR7*******************VARIABLE 115 CONTIENE PUNTO DECIMAL ***********
ACIEM7    IF AT114 NOT NUMERIC                                          RMB0021 
ACIEM7       IF AT114 = "       -3"                                     RMB0021 
ACIEM7          MOVE 1 TO P-AT114009                                    RMB0021 
ACIEM7       ELSE                                                       RMB0021 
ACIEM7          IF AT114 = "       -2"                                  RMB0021 
ACIEM7             MOVE 1 TO P-AT114010                                 RMB0021 
ACIEM7          ELSE                                                    RMB0021 
ACIEM7             IF AT114 = "       -1"                               RMB0021 
ACIEM7                MOVE 1 TO P-AT114011                              RMB0021 
ACIEM7             ELSE                                                 RMB0021 
ACIEM7                MOVE 1 TO P-AT114008                              RMB0021 
ACIEM7          END-IF                                                  RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF AT114 NUMERIC MOVE AT114 TO TAT114 ELSE MOVE 0 TO TAT114.  RMB0021 
ACIEM7    IF AT114 NUMERIC                                              RMB0021 
ACIEM7       IF  000  <=  TAT114 * P-INDEX  AND                         RMB0021 
ACIEM7                 TAT114 * P-INDEX <=  716 MOVE 1 TO P-AT114012    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF   717 <=   TAT114 * P-INDEX  AND                        RMB0021 
ACIEM7                 TAT114 * P-INDEX <= 2874 MOVE 1 TO P-AT114013    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF 2875  <=   TAT114 * P-INDEX  AND                        RMB0021 
ACIEM7                 TAT114 * P-INDEX <= 6768 MOVE 1 TO P-AT114014    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF 6769  <=   TAT114 * P-INDEX     MOVE 1 TO P-AT114015    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF AT124 NOT NUMERIC                                          RMB0021 
ACIEM7       IF AT124 = "       -3"                                     RMB0021 
ACIEM7          MOVE 1 TO P-AT124024                                    RMB0021 
ACIEM7       ELSE                                                       RMB0021 
ACIEM7          IF AT124 = "       -2"                                  RMB0021 
ACIEM7             MOVE 1 TO P-AT124025                                 RMB0021 
ACIEM7          ELSE                                                    RMB0021 
ACIEM7             IF AT124 = "       -1"                               RMB0021 
ACIEM7                MOVE 1 TO P-AT124026                              RMB0021 
ACIEM7             ELSE                                                 RMB0021 
ACIEM7                MOVE 1 TO P-AT124023                              RMB0021 
ACIEM7          END-IF                                                  RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF AT124 NUMERIC MOVE AT124 TO TAT124 ELSE MOVE 0 TO TAT124.  RMB0021 
ACIEM7    IF AT124 NUMERIC                                              RMB0021 
ACIEM7       IF        TAT124 * P-INDEX  = 000 MOVE 1 TO P-AT124027     RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF  000 <   TAT124 * P-INDEX  AND                          RMB0021 
ACIEM7                 TAT124 * P-INDEX <= 025 MOVE 1 TO P-AT124028     RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF  026 <=  TAT124 * P-INDEX  AND                          RMB0021 
ACIEM7                 TAT124 * P-INDEX <= 069 MOVE 1 TO P-AT124029     RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF  070 <=  TAT124 * P-INDEX      MOVE 1 TO P-AT124030     RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF CC040 NUMERIC                                              RMB0021 
ACIEM7     IF 000 <= CC040 AND CC040 <= 011  MOVE 1 TO P-CC040001 END-IFRMB0021 
ACIEM7     IF 012 <= CC040 AND CC040 <= 017  MOVE 1 TO P-CC040002 END-IFRMB0021 
ACIEM7     IF 018 <= CC040 AND CC040 <= 027  MOVE 1 TO P-CC040003 END-IFRMB0021 
ACIEM7     IF 028 <= CC040 AND CC040 <= 063  MOVE 1 TO P-CC040004 END-IFRMB0021 
ACIEM7     IF 064 <= CC040                   MOVE 1 TO P-CC040005 END-IFRMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF CR040 NOT NUMERIC              MOVE 1 TO P-CR040001 END-IF.RMB0021 
ACIEM7    IF CR040 NUMERIC                                              RMB0021 
ACIEM7     IF 000 <= CR040 AND CR040 <= 028  MOVE 1 TO P-CR040002 END-IFRMB0021 
ACIEM7     IF 029 <= CR040 AND CR040 <= 045  MOVE 1 TO P-CR040003 END-IFRMB0021 
ACIEM7     IF 046 <= CR040 AND CR040 <= 097  MOVE 1 TO P-CR040004 END-IFRMB0021 
ACIEM7     IF 098 <= CR040                   MOVE 1 TO P-CR040005 END-IFRMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF CR116    (5:1) = "-"                                       RMB0021 
ACIEM7       IF CR116(6:1) = "5" OR "6"   *>= -5                        RMB0021 
ACIEM7          MOVE 1 TO P-CR116026                                    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF CR116(6:1) = "4"                                        RMB0021 
ACIEM7          MOVE 1 TO P-CR116027                                    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF CR116(6:1) = "3"                                        RMB0021 
ACIEM7          MOVE 1 TO P-CR116028                                    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF CR116(6:1) = "2"                                        RMB0021 
ACIEM7          MOVE 1 TO P-CR116029                                    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7       IF CR116(6:1) = "1"                                        RMB0021 
ACIEM7          MOVE 1 TO P-CR116030                                    RMB0021 
ACIEM7       END-IF                                                     RMB0021 
ACIEM7    ELSE                                                          RMB0021 
ACIEM7       MOVE "000000" TO TCR116(1:6)                               RMB0021 
ACIEM7       MOVE CR116    (1:3) TO TCR116(2:3)                         RMB0021 
ACIEM7       MOVE CR116    (5:2) TO TCR116(5:2)                         RMB0021 
ACIEM7    IF 000 <= TCR116 AND TCR116 <= 018 MOVE 1 TO P-CR116031 END-IFRMB0021 
ACIEM7    IF 018  < TCR116 AND TCR116 <= 041 MOVE 1 TO P-CR116032 END-IFRMB0021 
ACIEM7    IF 041  < TCR116 AND TCR116 <= 081 MOVE 1 TO P-CR116033 END-IFRMB0021 
ACIEM7    IF 081  < TCR116 AND TCR116 <= 101 MOVE 1 TO P-CR116034 END-IFRMB0021 
ACIEM7    IF 101  < TCR116                   MOVE 1 TO P-CR116035 END-IFRMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF IQ013 NOT NUMERIC               MOVE 1 TO P-IQ013017 END-IFRMB0021 
ACIEM7    IF IQ013 NUMERIC                                              RMB0021 
ACIEM7     IF 000 <= IQ013 AND IQ013 <= 001  MOVE 1 TO P-IQ013018 END-IFRMB0021 
ACIEM7     IF 002 <= IQ013                   MOVE 1 TO P-IQ013019 END-IFRMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 000 <= P-PCTOP12 AND                                       RMB0021 
ACIEM7              P-PCTOP12 <=  025        MOVE 1 TO P-PCTOP12012     RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 026 <= P-PCTOP12 AND                                       RMB0021 
ACIEM7              P-PCTOP12 <=  050        MOVE 1 TO P-PCTOP12013     RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 051 <= P-PCTOP12                MOVE 1 TO P-PCTOP12014     RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 000 <= P-RECDEL AND                                        RMB0021 
ACIEM7              P-RECDEL  <=  001 MOVE 1 TO P-RECDEL022             RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 002 <= P-RECDEL AND                                        RMB0021 
ACIEM7              P-RECDEL  <=  003 MOVE 1 TO P-RECDEL023             RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 004 <= P-RECDEL AND                                        RMB0021 
ACIEM7              P-RECDEL  <=  004 MOVE 1 TO P-RECDEL024             RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 005 <= P-RECDEL AND                                        RMB0021 
ACIEM7              P-RECDEL  <=  006 MOVE 1 TO P-RECDEL025             RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 007 <= P-RECDEL AND                                        RMB0021 
ACIEM7              P-RECDEL  <=  007 MOVE 1 TO P-RECDEL026             RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 008 <= P-RECDEL AND                                        RMB0021 
ACIEM7              P-RECDEL  <=  017 MOVE 1 TO P-RECDEL027             RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 018 <= P-RECDEL AND                                        RMB0021 
ACIEM7              P-RECDEL  <   999 MOVE 1 TO P-RECDEL028             RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 999 <= P-RECDEL          MOVE 1 TO P-RECDEL029 END-IF.     RMB0021 
ACIEM7    IF CR050 NOT NUMERIC             MOVE 1 TO P-CR050004 END-IF. RMB0021 
ACIEM7    IF CR050 NUMERIC                                              RMB0021 
ACIEM7     IF 000 <= CR050 AND CR050 <=  000 MOVE 1 TO P-CR050005 END-IFRMB0021 
ACIEM7     IF 001 <= CR050 AND CR050 <=  001 MOVE 1 TO P-CR050006 END-IFRMB0021 
ACIEM7     IF 002 <= CR050                   MOVE 1 TO P-CR050007 END-IFRMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF TCC002 > 0                                                 RMB0021 
ACIEM7       COMPUTE P-CCCC ROUNDED = (TCC050 / TCC002 ) * 100          RMB0021 
ACIEM7    ELSE                                                          RMB0021 
ACIEM7       MOVE -1 TO P-CCCC                                          RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF        P-CCCC    <   000 MOVE 1 TO P-CCCC001       END-IF. RMB0021 
ACIEM7    IF 000 <= P-CCCC   AND                                        RMB0021 
ACIEM7              P-CCCC    <=  040 MOVE 1 TO P-CCCC002               RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 041 <= P-CCCC   AND                                        RMB0021 
ACIEM7              P-CCCC    <=  090 MOVE 1 TO P-CCCC003               RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 091 <= P-CCCC            MOVE 1 TO P-CCCC004       END-IF. RMB0021 
ACIEM7    IF TBS002 > 0                                                 RMB0021 
ACIEM7       COMPUTE P-BSBS ROUNDED = (TBS050 / TBS002 ) * 100          RMB0021 
ACIEM7    ELSE                                                          RMB0021 
ACIEM7       MOVE -1 TO P-BSBS                                          RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF        P-BSBS    <   000 MOVE 1 TO P-BSBS005       END-IF. RMB0021 
ACIEM7    IF 000 <= P-BSBS   AND                                        RMB0021 
ACIEM7              P-BSBS    <=  090 MOVE 1 TO P-BSBS006               RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    IF 091 <= P-BSBS            MOVE 1 TO P-BSBS007       END-IF. RMB0021 
ACIEM7    IF ID007 NUMERIC                                              RMB0021 
ACIEM7     IF ID007 = 03                    MOVE 1 TO P-ID007031 END-IF RMB0021 
ACIEM7     IF ID007 = 05                    MOVE 1 TO P-ID007032 END-IF RMB0021 
ACIEM7     IF ID007 = 12 OR 13 OR 21        MOVE 1 TO P-ID007033 END-IF RMB0021 
ACIEM7     IF ID007 NOT = ( 3 AND 5 AND 12 AND 13 AND 21)               RMB0021 
ACIEM7                                      MOVE 1 TO P-ID007034 END-IF RMB0021 
ACIEM7    END-IF.                                                       RMB0021 
ACIEM7    COMPUTE P-SCOREN        = 2.4365        +                     RMB0021 
ACIEM7                   +0       * P-AT114008    +                     RMB0021 
ACIEM7                   +0       * P-AT114009    +                     RMB0021 
ACIEM7                   +0       * P-AT114010    +                     RMB0021 
ACIEM7                   +0       * P-AT114011    +                     RMB0021 
ACIEM7                   -0.2146  * P-AT114012    +                     RMB0021 
ACIEM7                   -0.0315  * P-AT114013    +                     RMB0021 
ACIEM7                   +0.0442  * P-AT114014    +                     RMB0021 
ACIEM7                   +0.2090  * P-AT114015    +                     RMB0021 
ACIEM7                   +0       * P-AT124023    +                     RMB0021 
ACIEM7                   +0       * P-AT124024    +                     RMB0021 
ACIEM7                   +0       * P-AT124025    +                     RMB0021 
ACIEM7                   +0       * P-AT124026    +                     RMB0021 
ACIEM7                   +0.1000  * P-AT124027    +                     RMB0021 
ACIEM7                   -0.1771  * P-AT124028    +                     RMB0021 
ACIEM7                   -0.2797  * P-AT124029    +                     RMB0021 
ACIEM7                   -0.3557  * P-AT124030    +                     RMB0021 
ACIEM7                   -0.2729  * P-CC040001    +                     RMB0021 
ACIEM7                   -0.1862  * P-CC040002    +                     RMB0021 
ACIEM7                   -0.0379  * P-CC040003    +                     RMB0021 
ACIEM7                   +0.0480  * P-CC040004    +                     RMB0021 
ACIEM7                   +0.1987  * P-CC040005    +                     RMB0021 
ACIEM7                   +0       * P-CR040001    +                     RMB0021 
ACIEM7                   -0.0711  * P-CR040002    +                     RMB0021 
ACIEM7                   -0.0310  * P-CR040003    +                     RMB0021 
ACIEM7                   +0.0379  * P-CR040004    +                     RMB0021 
ACIEM7                   +0.1032  * P-CR040005    +                     RMB0021 
ACIEM7                   +0       * P-CR116026    +                     RMB0021 
ACIEM7                   +0       * P-CR116027    +                     RMB0021 
ACIEM7                   +0       * P-CR116028    +                     RMB0021 
ACIEM7                   +0       * P-CR116029    +                     RMB0021 
ACIEM7                   +0       * P-CR116030    +                     RMB0021 
ACIEM7                   +0.4143  * P-CR116031    +                     RMB0021 
ACIEM7                   +0.2227  * P-CR116032    +                     RMB0021 
ACIEM7                   -0.0256  * P-CR116033    +                     RMB0021 
ACIEM7                   -0.2319  * P-CR116034    +                     RMB0021 
ACIEM7                   -0.5127  * P-CR116035    +                     RMB0021 
ACIEM7                   +0        * P-IQ013017   +                     RMB0021 
ACIEM7                   +0        * P-IQ013018   +                     RMB0021 
ACIEM7                   -0.4569   * P-IQ013019   +                     RMB0021 
ACIEM7                   +0        * P-PCTOP12012 +                     RMB0021 
ACIEM7                   -0.2292   * P-PCTOP12013 +                     RMB0021 
ACIEM7                   -0.6069   * P-PCTOP12014 +                     RMB0021 
ACIEM7                   -1.4698   * P-RECDEL022  +                     RMB0021 
ACIEM7                   -0.6943   * P-RECDEL023  +                     RMB0021 
ACIEM7                   -0.3997   * P-RECDEL024  +                     RMB0021 
ACIEM7                   -0.2286   * P-RECDEL025  +                     RMB0021 
ACIEM7                   -0.0090   * P-RECDEL026  +                     RMB0021 
ACIEM7                   +0.1025   * P-RECDEL027  +                     RMB0021 
ACIEM7                   +0.4513   * P-RECDEL028  +                     RMB0021 
ACIEM7                   +0.4513   * P-RECDEL029  +                     RMB0021 
ACIEM7                   +0        * P-CR050004   +                     RMB0021 
ACIEM7                   +0        * P-CR050005   +                     RMB0021 
ACIEM7                   +0        * P-CR050006   +                     RMB0021 
ACIEM7                   +0.2096   * P-CR050007   +                     RMB0021 
ACIEM7                   +0        * P-CCCC001    +                     RMB0021 
ACIEM7                   -0.8412   * P-CCCC002    +                     RMB0021 
ACIEM7                   -0.6537   * P-CCCC003    +                     RMB0021 
ACIEM7                   +0        * P-CCCC004    +                     RMB0021 
ACIEM7                   +0        * P-BSBS005    +                     RMB0021 
ACIEM7                   -0.5794   * P-BSBS006    +                     RMB0021 
ACIEM7                   +0        * P-BSBS007    +                     RMB0021 
ACIEM7                   -0.4292   * P-ID007031   +                     RMB0021 
ACIEM7                   -0.4812   * P-ID007032   +                     RMB0021 
ACIEM7                   -0.5504   * P-ID007033   +                     RMB0021 
ACIEM7                   +0        * P-ID007034.                        RMB0021 
ACIEM7    MOVE -06982.50690888061     TO P-COEF1.                       RMB0021 
ACIEM7    MOVE +51056.765802751       TO P-COEF2.                       RMB0021 
ACIEM7    MOVE -25366.475615222       TO P-COEF3.                       RMB0021 
ACIEM7    MOVE +09683.06660238578     TO P-COEF4.                       RMB0021 
ACIEM7    MOVE -100000                TO P-COEF5.                       RMB0021 
ACIEM7    MOVE +72464.5093564067      TO P-COEF6.                       RMB0021 
ACIEM7    COMPUTE P-SCOREN = ( 1 / (1 + 2.717281828 ** (- P-SCOREN))).  RMB0021 
ACIEM7    COMPUTE P-SCOREN1 = (P-COEF1      )                        +  RMB0021 
ACIEM7                       (P-COEF2 * (P-SCOREN ** 1 ))           +   RMB0021 
ACIEM7                       (P-COEF3 * (P-SCOREN ** 2 ))           +   RMB0021 
ACIEM7                       (P-COEF4 * (P-SCOREN ** 3 ))           +   RMB0021 
ACIEM7                       (P-COEF5 * (P-SCOREN ** 0.5))          +   RMB0021 
ACIEM7                       (P-COEF6 * (P-SCOREN ** 0.33))             RMB0021 
ACIEM7    COMPUTE P-SCORE ROUNDED = P-SCOREN1.                          RMB0021 
ACIEM7    IF P-SCORE <= 150 MOVE 150 TO P-SCORE.                        RMB0021 
ACIEM7    IF P-SCORE >= 850 MOVE 850 TO P-SCORE.                        RMB0021 
REMAR7****************COMIENZO CALCULO PARA LAS RAZONES *************
ACIEM7    PERFORM 18005-P-PREPARE-AA.                                   RMB0021 
ACIEM7    IF P-RECDEL022     = 1                                        RMB0021 
ACIEM7       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 1.9211 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-RECDEL023     = 1                                        RMB0021 
ACIEM7       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 1.1456 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116035      = 1                                        RMB0021 
ACIEM7       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.9270 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-RECDEL024     = 1                                        RMB0021 
ACIEM7       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.8510 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CCCC002       = 1                                        RMB0021 
ACIEM7       MOVE 61 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.8412 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-RECDEL025     = 1                                        RMB0021 
ACIEM7       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.6799 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CCCC003       = 1                                        RMB0021 
ACIEM7       MOVE 61 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.6537 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116034      = 1                                        RMB0021 
ACIEM7       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.6462 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-PCTOP12014    = 1                                        RMB0021 
ACIEM7       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.6069 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-BSBS006       = 1                                        RMB0021 
ACIEM7       MOVE 59 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.5794 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-ID007033      = 1                                        RMB0021 
ACIEM7       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.5504 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-ID007032      = 1                                        RMB0021 
ACIEM7       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4812 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CC040001      = 1                                        RMB0021 
ACIEM7       MOVE 35 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4716 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-RECDEL026     = 1                                        RMB0021 
ACIEM7       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4603 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-IQ013019      = 1                                        RMB0021 
ACIEM7       MOVE 19 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4569 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT124030      = 1                                        RMB0021 
ACIEM7       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4557 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116033      = 1                                        RMB0021 
ACIEM7       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4399 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-ID007031      = 1                                        RMB0021 
ACIEM7       MOVE 55 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4292 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT114012      = 1                                        RMB0021 
ACIEM7       MOVE 51 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4236 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116026      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4143 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116027      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4143 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116028      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4143 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116029      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4143 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116030      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.4143 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CC040002      = 1                                        RMB0021 
ACIEM7       MOVE 35 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.3849 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT124029      = 1                                        RMB0021 
ACIEM7       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.3797 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-RECDEL027     = 1                                        RMB0021 
ACIEM7       MOVE 03 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.3488 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT124028      = 1                                        RMB0021 
ACIEM7       MOVE 42 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2771 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT114013      = 1                                        RMB0021 
ACIEM7       MOVE 51 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2405 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CC040003      = 1                                        RMB0021 
ACIEM7       MOVE 35 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2366 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-PCTOP12013    = 1                                        RMB0021 
ACIEM7       MOVE 62 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2292 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR050004      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2096 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR050005      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2096 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR050006      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2096 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT114008      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2090 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT114009      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2090 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT114010      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2090 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT114011      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.2090 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR116032      = 1                                        RMB0021 
ACIEM7       MOVE 48 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1916 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR040002      = 1                                        RMB0021 
ACIEM7       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1743 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT114014      = 1                                        RMB0021 
ACIEM7       MOVE 51 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1648 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CC040004      = 1                                        RMB0021 
ACIEM7       MOVE 35 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1507 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR040003      = 1                                        RMB0021 
ACIEM7       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1342 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR040001      = 1                                        RMB0021 
ACIEM7       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1032 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT124023      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1000 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT124024      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1000 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT124025      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1000 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-AT124026      = 1                                        RMB0021 
ACIEM7       MOVE 06 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.1000 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEM7    IF P-CR040004      = 1                                        RMB0021 
ACIEM7       MOVE 05 TO P-ADVERSE-CODE                                  RMB0021 
ACIEM7       IF P-V-ASIGNADA(P-ADVERSE-CODE) = 0 AND P-RAZONES < 4      RMB0021 
ACIEM7          MOVE 0.0653 TO P-DIFFERENCE                             RMB0021 
ACIEM7          PERFORM 18000-P-TRU-INSERTE-ADV-CODE.                   RMB0021 
ACIEME 12001-P-RECDEL-DECDELP.                                          RMB0021 
REMARK*********************************************************************
REMARK*12001-P-RECDEL.                                                  RMB0004
REMARK*********************************************************************
ACIEME*  MIN(TCR100,TBS101,TCC101,TOT101,TCR102,TBS102,TCC102.TOT103,MT)RMB0021 
ACIEME*                     MOS30                                       RMB0021 
ACIEME    MOVE TCR100 TO P-RECDEL                                       RMB0021 
ACIEME    IF P-RECDEL > TBS100                                          RMB0021 
ACIEME       MOVE TBS100 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TCC100                                          RMB0021 
ACIEME       MOVE TCC100 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TOT100                                          RMB0021 
ACIEME       MOVE TOT100 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TMT100                                          RMB0021 
ACIEME       MOVE TMT100 TO P-RECDEL.                                   RMB0021 
ACIEME*                     MOS60                                       RMB0021 
ACIEME    IF P-RECDEL > TCR101                                          RMB0021 
ACIEME       MOVE TCR101 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TBS101                                          RMB0021 
ACIEME       MOVE TBS101 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TCC101                                          RMB0021 
ACIEME       MOVE TCC101 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TOT101                                          RMB0021 
ACIEME       MOVE TOT101 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TMT101                                          RMB0021 
ACIEME       MOVE TMT101 TO P-RECDEL.                                   RMB0021 
ACIEME*                     MOS90                                       RMB0021 
ACIEME    IF P-RECDEL > TCR102                                          RMB0021 
ACIEME       MOVE TCR102 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TBS102                                          RMB0021 
ACIEME       MOVE TBS102 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TCC102                                          RMB0021 
ACIEME       MOVE TCC102 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TOT102                                          RMB0021 
ACIEME       MOVE TOT102 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TMT102                                          RMB0021 
ACIEME       MOVE TMT102 TO P-RECDEL.                                   RMB0021 
ACIEME*                     MOS120                                      RMB0021 
ACIEME    IF P-RECDEL > TCR103                                          RMB0021 
ACIEME       MOVE TCR103 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TBS103                                          RMB0021 
ACIEME       MOVE TBS103 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TCC103                                          RMB0021 
ACIEME       MOVE TCC103 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TOT103                                          RMB0021 
ACIEME       MOVE TOT103 TO P-RECDEL.                                   RMB0021 
ACIEME    IF P-RECDEL > TMT103                                          RMB0021 
ACIEME       MOVE TMT103 TO P-RECDEL.                                   RMB0021 
ACIEME*                     MOSCC                                       RMB0021 
ACIEME    MOVE TCR105 TO P-MOSCC                                        RMB0021 
ACIEME    IF P-MOSCC   > TBS105                                         RMB0021 
ACIEME       MOVE TBS105 TO P-MOSCC                                     RMB0021 
ACIEME    END-IF                                                        RMB0021 
ACIEME    IF P-MOSCC   > TCC105                                         RMB0021 
ACIEME       MOVE TCC105 TO P-MOSCC                                     RMB0021 
ACIEME    END-IF                                                        RMB0021 
ACIEME    IF P-MOSCC   > TOT105                                         RMB0021 
ACIEME       MOVE TOT105 TO P-MOSCC                                     RMB0021 
ACIEME    END-IF                                                        RMB0021 
ACIEME    IF P-MOSCC   > TMT105                                         RMB0021 
ACIEME       MOVE TMT105 TO P-MOSCC                                     RMB0021 
ACIEME    END-IF                                                        RMB0021 
ACIEME*                     RECDELP                                     RMB0021 
ACIEME    IF P-RECDEL < 999                                             RMB0021 
ACIEME       MOVE P-RECDEL TO P-RECDELP                                 RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       MOVE P-MOSCC  TO P-RECDELP                                 RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME 12002-P-TOT90.                                                   RMB0021 
ACIEME    COMPUTE P-TOT90 = TCR066 + TCR073 + TCR075 + TCR079 + TCR083 +RMB0021 
ACIEME                      TCR087 +                                    RMB0021 
ACIEME                      TBS066 + TBS073 + TBS075 + TBS079 + TBS083 +RMB0021 
ACIEME                      TBS087 +                                    RMB0021 
ACIEME                      TCC066 + TCC073 + TCC075 + TCC079 + TCC083 +RMB0021 
ACIEME                      TCC087 +                                    RMB0021 
ACIEME                      TOT066 + TOT073 + TOT075 + TOT079 + TOT083 +RMB0021 
ACIEME                      TOT087 +                                    RMB0021 
ACIEME                      TMT066 + TMT073 + TMT075 + TMT079 + TMT083 +RMB0021 
ACIEME                      TMT087 .                                    RMB0021 
ACIEME 12002-P-TOT120.                                                  RMB0021 
ACIEME   COMPUTE P-TOT120 = TCR067 + TCR076 + TCR080 + TCR084 + TCR088 +RMB0021 
ACIEME                      TBS067 + TBS076 + TBS080 + TBS084 + TBS088 +RMB0021 
ACIEME                      TCC067 + TCC076 + TCC080 + TCC084 + TCC088 +RMB0021 
ACIEME                      TOT067 + TOT076 + TOT080 + TOT084 + TOT088 +RMB0021 
ACIEME                      TMT067 + TMT076 + TMT080 + TMT084 + TMT088. RMB0021 
ACIEME 12002-P-TOT90P.                                                  RMB0021 
ACIEME    PERFORM 12002-P-TOT120.                                       RMB0021 
ACIEME    PERFORM 12002-P-TOT90.                                        RMB0021 
ACIEME    COMPUTE P-TOT90P = P-TOT90 + P-TOT120 + P-DERAT.              RMB0021 
ACIEME 12002-P-DEFOT90P.                                                RMB0021 
ACIEME    PERFORM 12002-P-TOT120.                                       RMB0021 
ACIEME    PERFORM 12002-P-TOT90.                                        RMB0021 
ACIEME    COMPUTE P-DEFOT = TCR092 + TCR094 +                           RMB0021
ACIEME                      TBS092 + TBS094 +                           RMB0021
ACIEME                      TCC092 + TCC094 +                           RMB0021
ACIEME                      TOT092 + TOT094 +                           RMB0021
ACIEME                      TMT092 + TMT094 .                           RMB0021
ACIEME    COMPUTE P-DEFOT90P = P-TOT90 + P-TOT120 + P-DEFOT.            RMB0021 
ACIEME 12003-P-TOT30.                                                   RMB0021 
ACIEME    COMPUTE P-TOT30 = TCR064 + TBS064 + TCC064 + TOT064 + TMT064 +RMB0021 
ACIEME                      TCR068 + TBS068 + TCC068 + TOT068 + TMT068 +RMB0021 
ACIEME                      TCR069 + TBS069 + TCC069 + TOT069 + TMT069 +RMB0021 
ACIEME                      TCR071 + TBS071 + TCC071 + TOT071 + TMT071 +RMB0021 
ACIEME                      TCR077 + TBS077 + TCC077 + TOT077 + TMT077 +RMB0021 
ACIEME                      TCR081 + TBS081 + TCC081 + TOT081 + TMT081 +RMB0021 
ACIEME                      TCR085 + TBS085 + TCC085 + TOT085 + TMT085. RMB0021 
ACIEME 12004-P-TOT60.                                                   RMB0021 
ACIEME    COMPUTE P-TOT60 = TCR065 + TBS065 + TCC065 + TOT065 + TMT065 +RMB0021 
ACIEME                      TCR070 + TBS070 + TCC070 + TOT070 + TMT070 +RMB0021 
ACIEME                      TCR072 + TBS072 + TCC072 + TOT072 + TMT072 +RMB0021 
ACIEME                      TCR074 + TBS074 + TCC074 + TOT074 + TMT074 +RMB0021 
ACIEME                      TCR078 + TBS078 + TCC078 + TOT078 + TMT078 +RMB0021 
ACIEME                      TCR082 + TBS082 + TCC082 + TOT082 + TMT082 +RMB0021 
ACIEME                      TCR086 + TBS086 + TCC086 + TOT086 + TMT086. RMB0021 
ACIEME 12005-P-MOSCR30P.                                                RMB0021 
ACIEME*  P-MOSCR30P = MIN(TCR103,TCR102,TCR101,TCR100)                  RMB0021 
ACIEME*  NO USA 999 si es negativo lo deja en -1                        RMB0021 
ACIEME    MOVE TCR103 TO P-MOSCR30P.                                    RMB0021 
ACIEME    IF P-MOSCR30P > TCR102                                        RMB0021 
ACIEME       MOVE TCR102 TO P-MOSCR30P.                                 RMB0021 
ACIE02    IF P-MOSCR30P > TCR101                                        RMB0004
ACIE02       MOVE TCR101 TO P-MOSCR30P.                                 RMB0004
ACIE02    IF P-MOSCR30P > TCR100                                        RMB0004
ACIE02       MOVE TCR100 TO P-MOSCR30P.                                 RMB0004
ERR004    IF CR103 NOT NUMERIC AND                                      RMB0004 
ERR004       CR102 NOT NUMERIC AND                                      RMB0004 
ERR004       CR101 NOT NUMERIC AND                                      RMB0004 
ERR004       CR100 NOT NUMERIC                                          RMB0004 
ERR004       MOVE -1 TO P-MOSCR30P                                      RMB0004 
ERR004    END-IF.                                                       RMB0004 
ACIEME 12006-P-PCT69.                                                   RMB0021 
ACIEME    COMPUTE P-CBAT69 =                                            RMB0021 
ACIEME                      TCR057 + TCR061 + TCR065 + TCR068 + TCR074 +RMB0021 
ACIEME                      TCR077 + TCR078 + TCR058 + TCR062 + TCR066 +RMB0021 
ACIEME                      TCR069 + TCR070 + TCR075 + TCR079 + TCR081 +RMB0021 
ACIEME                      TCR082 + TCR083 +                           RMB0021 
ACIEME                      TBS057 + TBS061 + TBS065 + TBS068 + TBS074 +RMB0021 
ACIEME                      TBS077 + TBS078 + TBS058 + TBS062 + TBS066 +RMB0021 
ACIEME                      TBS069 + TBS070 + TBS075 + TBS079 + TBS081 +RMB0021 
ACIEME                      TBS082 + TBS083 +                           RMB0021 
ACIEME                      TCC057 + TCC061 + TCC065 + TCC068 + TCC074 +RMB0021 
ACIEME                      TCC077 + TCC078 + TCC058 + TCC062 + TCC066 +RMB0021 
ACIEME                      TCC069 + TCC070 + TCC075 + TCC079 + TCC081 +RMB0021 
ACIEME                      TCC082 + TCC083 +                           RMB0021 
ACIEME                      TOT057 + TOT061 + TOT065 + TOT068 + TOT074 +RMB0021 
ACIEME                      TOT077 + TOT078 + TOT058 + TOT062 + TOT066 +RMB0021 
ACIEME                      TOT069 + TOT070 + TOT075 + TOT079 + TOT081 +RMB0021 
ACIEME                      TOT082 + TOT083 +                           RMB0021 
ACIEME                      TMT057 + TMT061 + TMT065 + TMT068 + TMT074 +RMB0021 
ACIEME                      TMT077 + TMT078 + TMT058 + TMT062 + TMT066 +RMB0021 
ACIEME                      TMT069 + TMT070 + TMT075 + TMT079 + TMT081 +RMB0021 
ACIEME                      TMT082 + TMT083.                            RMB0021 
ACIEME    IF P-SUM001 > 0 AND P-CBAT69 >= 0                             RMB0021 
ACIEME       COMPUTE P-PCT69  ROUNDED = 100 * P-CBAT69 / P-SUM001       RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       MOVE -1 TO P-PCT69                                         RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME 12007-P-PCPTOP12.                                                RMB0021 
REMARK*********************************************************************
ACIEME*12007-P-PCPTOP12.                                                RMB0021 
REMARK*  CUENTAS ABIERTAS ENTRE 0 Y 12 MESES 
REMARK*********************************************************************
ACIEME    COMPUTE P-PCTOP12 = TCR030 + TBS030 + TCC030 + TOT030 + TMT030RMB0021 
ACIEME                      + TCR031 + TBS031 + TCC031 + TOT031 + TMT031RMB0021 
ACIEME    IF P-SUM001 > 0                                               RMB0021 
ACIEME       COMPUTE P-PCTOP12 ROUNDED = 100 *  P-PCTOP12 / P-SUM001    RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       MOVE -1 TO P-PCTOP12                                       RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME 12008-P-PCTCUR.                                                  RMB0021 
ACIEME    IF P-SUM001 > 0                                               RMB0021 
ACIEME       COMPUTE P-PCTCUR ROUNDED = 100 *                           RMB0021 
ACIEME                  (TCR050 + TBS050 + TCC050 + TOT050 + TMT050) /  RMB0021 
ACIEME                                                      P-SUM001    RMB0021 
ACIEME    ELSE                                                          RMB0021 
ACIEME       MOVE -1 TO P-PCTCUR                                        RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME 12009-P-CBCC60.                                                  RMB0021 
ACIEME    COMPUTE P-CBCC60 =                                            RMB0021 
ACIEME                      TCC057 + TCC061 + TCC065 + TCC068 + TCC074 +RMB0021 
ACIEME                      TCC077 + TCC078 .                           RMB0021 
ACIEME 12010-P-MOS60.                                                   RMB0021 
ACIEME    MOVE TCR101 TO P-MOS60 .                                      RMB0021 
ACIEME    IF P-MOS60  > TBS101                                          RMB0021 
ACIEME       MOVE TBS101 TO P-MOS60 .                                   RMB0021 
ACIEME    IF P-MOS60  > TCC101                                          RMB0021 
ACIEME       MOVE TCC101 TO P-MOS60 .                                   RMB0021 
ACIEME    IF P-MOS60  > TOT101                                          RMB0021 
ACIEME       MOVE TOT101 TO P-MOS60 .                                   RMB0021 
ACIEME    IF P-MOS60  > TMT101                                          RMB0021 
ACIEME       MOVE TMT101 TO P-MOS60 .                                   RMB0021 
ACIEME 12011-P-TOT30P.                                                  RMB0021 
ACIEME    PERFORM 12003-P-TOT30.                                        RMB0021 
ACIEME    PERFORM 12004-P-TOT60.                                        RMB0021 
ACIEME    PERFORM 12002-P-TOT90.                                        RMB0021 
ACIEME    PERFORM 12002-P-TOT120.                                       RMB0021 
ACIEME    COMPUTE P-TOT30P = P-TOT30 + P-TOT60 + P-TOT90 + P-TOT120 +   RMB0021 
ACIEME                                                   P-DERAT.       RMB0021 
ACIEME 12012-P-AT104.                                                   RMB0021 
ACIEME*  MIN(TCR104,TBS104,TCC104,TOT104,TMT104)                        RMB0021 
ACIEME    MOVE TCR104 TO P-AT104                                        RMB0021 
ACIEME    IF P-AT104  > TBS104                                          RMB0021 
ACIEME       MOVE TBS104 TO P-AT104 .                                   RMB0021 
ACIEME    IF P-AT104  > TCC104                                          RMB0021 
ACIEME       MOVE TCC104 TO P-AT104 .                                   RMB0021 
ACIEME    IF P-AT104  > TOT104                                          RMB0021 
ACIEME       MOVE TOT104 TO P-AT104 .                                   RMB0021 
ACIEME    IF P-AT104  > TMT104                                          RMB0021 
ACIEME       MOVE TMT104 TO P-AT104 .                                   RMB0021 
ACIEME 11890-EXCLUSIONES-P.                                             RMB0021 
ACIEME    PERFORM 12002-P-DEFOT90P.                                     RMB0021 
ACIEME    PERFORM 12012-P-AT104.                                        RMB0021 
ACIEME    COMPUTE P-SUM002 = TCR002 + TBS002 + TCC002 + TOT002 + TMT002.RMB0021 
QUITAR*   PERFORM 12002-P-TOT90P.                                       RMB0021 
QUITAR*   IF P-DEFOT90P <> P-TOT90P
QUITAR*      IF P-DEFOT90P = P-SUM002 OR P-TOT90P = P-SUM002
QUITAR*         DISPLAY "CAMBIO =",NUM-ID-ALE ," TOT90P=",P-TOT90P,
QUITAR*           " DEFOT90P=",P-DEFOT90P," SUM002=",P-SUM002
QUITAR*      END-IF
QUITAR*   END-IF.
ACIEME    IF P-DEFOT90P = P-SUM002 AND P-SUM002 > 0                     RMB0021 
ACIEME       MOVE 1 TO P-EXCLUSIONES                                    RMB0021 
ACIEME       IF P-APLICAR-EXCLUSION = 1                                 RMB0021 
ACIEME          MOVE 1 TO P-SCORE                                       RMB0021 
ACIEME          MOVE 65 TO P-ADVERSE-RAZON(1)                           RMB0021 
ACIEME          MOVE 0  TO P-ADVERSE-RAZON(2)                           RMB0021 
ACIEME          MOVE 0  TO P-ADVERSE-RAZON(3)                           RMB0021 
ACIEME          MOVE 0  TO P-ADVERSE-RAZON(4)                           RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIEME    IF P-SUM002 = 0 AND P-SUM001 > 0                              RMB0021 
ACIEME       IF P-AT104 > 018                                           RMB0021 
ACIEME          MOVE 2 TO P-EXCLUSIONES                                 RMB0021 
ACIEME          IF P-APLICAR-EXCLUSION = 1                              RMB0021 
ACIEME             MOVE 2 TO P-SCORE                                    RMB0021 
ACIEME             MOVE 66 TO P-ADVERSE-RAZON(1)                        RMB0021 
ACIEME             MOVE 0  TO P-ADVERSE-RAZON(2)                        RMB0021 
ACIEME             MOVE 0  TO P-ADVERSE-RAZON(3)                        RMB0021 
ACIEME             MOVE 0  TO P-ADVERSE-RAZON(4)                        RMB0021 
ACIEME          END-IF                                                  RMB0021 
ACIEME       END-IF                                                     RMB0021 
ACIEME    END-IF.                                                       RMB0021 
ACIERT 18005-P-PREPARE-AA.                                              RMB0004 
REMARK**********************************************************************
REMARK*18005-P-PREPARE-AA.       
REMARK* SE COLOCAN VALORES NEGATIVOS A LAS VARIABLES QUE LO NECESITAN
REMARK* PARA QUE LOS AAC SE CALCULEN CORRECTAMENTE 
REMARK*********************************************************************
ACIEME    EXIT.                                                         RMB0021 
ACIERT 18000-P-TRU-INSERTE-ADV-CODE.                                     RMB0004
REMARK*********************************************************************
REMARK*18000-P-TRU-INSERTE-ADV-CODE.
REMARK*  SE ADICIONA A LA LISTA DE RAZONES LA ENCONTRADA POR VAR DISCRETA *
REMARK*********************************************************************
ACIEME    ADD 1 TO P-RAZONES                                            RMB0021 
ACIEME    MOVE 1 TO P-V-ASIGNADA(P-ADVERSE-CODE)                        RMB0021 
ACIEME    MOVE P-ADVERSE-CODE TO P-ADVERSE-RAZON(P-RAZONES)             RMB0021 
ACIEME    MOVE P-DIFFERENCE  TO P-ADVERSE-DIFF (P-RAZONES).             RMB0021 
ACIEME 18001-P-INSERTE-CONTINUA.                                        RMB0021 
REMARK*********************************************************************
REMARK*18001-P-INSERTE-CONTINUA.
REMARK*  SE ADICIONA A LA LISTA DE RAZONES LA VARIABLE CONTINUA . SE      *
REMARK*  DEZPLAZA TODA LA TABLA HACIA ABAJO CUANDO LA INSERTA.            *
REMARK*********************************************************************
ACIEME    MOVE 1 TO P-RAZONES.                                          RMB0021 
ACIEME    PERFORM UNTIL P-RAZONES > 4 OR P-TEMP1        <= 0            RMB0021 
ACIEME      IF P-TEMP1        > P-ADVERSE-DIFF(P-RAZONES)               RMB0021 
ACIEME         MOVE P-ADVERSE-DIFF (P-RAZONES) TO P-DIFFERENCE-AUX      RMB0021 
ACIEME         MOVE P-ADVERSE-RAZON(P-RAZONES) TO P-ADVERSE-CODE-AUX    RMB0021 
ACIEME         MOVE P-TEMP1        TO P-ADVERSE-DIFF(P-RAZONES)         RMB0021 
ACIEME         MOVE P-ADVERSE-CODE TO P-ADVERSE-RAZON(P-RAZONES)        RMB0021 
ACIEME                              P-ADVERSE-CODE-INI                  RMB0021 
ACIEME         PERFORM UNTIL P-RAZONES >= 4 OR P-ADVERSE-CODE-AUX =     RMB0021 
ACIEME                                       P-ADVERSE-CODE-INI         RMB0021 
ACIEME            ADD      1 TO   P-RAZONES                             RMB0021 
ACIEME            IF P-RAZONES <= 4                                     RMB0021 
ACIEME               MOVE P-ADVERSE-DIFF (P-RAZONES) TO P-DIFFERENCE    RMB0021 
ACIEME               MOVE P-ADVERSE-RAZON(P-RAZONES) TO P-ADVERSE-CODE  RMB0021 
ACIEME               MOVE P-DIFFERENCE-AUX TO P-ADVERSE-DIFF (P-RAZONES)RMB0021 
ACIEME             MOVE P-ADVERSE-CODE-AUX TO P-ADVERSE-RAZON(P-RAZONES)RMB0021 
ACIEME               MOVE P-DIFFERENCE TO P-DIFFERENCE-AUX              RMB0021 
ACIEME               MOVE P-ADVERSE-CODE TO P-ADVERSE-CODE-AUX          RMB0021 
ACIEME            END-IF                                                RMB0021 
ACIEME         END-PERFORM                                              RMB0021 
ACIEME         MOVE 4 TO P-RAZONES                                      RMB0021 
ACIEME      ELSE                                                        RMB0021 
ACIEME         IF P-ADVERSE-RAZON(P-RAZONES) = P-ADVERSE-CODE           RMB0021 
ACIEME            MOVE 4 TO P-RAZONES                                   RMB0021 
ACIEME         END-IF                                                   RMB0021 
ACIEME      END-IF                                                      RMB0021 
ACIEME      ADD 1 TO P-RAZONES                                          RMB0021 
ACIEME    END-PERFORM.                                                  RMB0021 
