      * SCOUSAPI-PROC.v.0005        
REMARK************************************************************************
REMARK* CONJUNTO DE RUTINAS QUE PERMITE CALCULAR EL SCORE GENERICO DE       
REMARK* PREDICCION DE INGRESOS - QUANTO.                                   *
REMARK* ENTRADA :CUANDO SE INVOCA ESTE COPY LAS CARACTERÍSTICAS YA DEBEN       
REMARK*  ESTAR LEÍDAS Y CALCULADAS Y LA FORMA DE LLAMADO ES PERFORM A
REMARK*  5000-CALCULAR-SCORE-USAPI.
REMARK* SALIDAS
REMARK*   EL CALCULO DEL SCORE SE ENTREGA EN SALARIOS MINIMOS EN LAS         
REMARK*   SIGUIENTES VARIABLES
REMARK*      INGRESO-USAPI                      PIC 9(2).9(5).
REMARK*      INGRESO-N-USAPI                    PIC 9(4)V9(6).
REMARK*      INGRESO-INF-USAPI                  PIC 9(2).9(5).
REMARK*      INGRESO-INF-N-USAPI                PIC 9(2)V9(5).
REMARK*      INGRESO-SUP-USAPI                  PIC 9(2).9(5).
REMARK*      INGRESO-SUP-N-USAPI                PIC 9(2)V9(5).
REMARK*      INGRESO-USAPI1                     PIC Z(1).9(04).
REMARK*      INGRESO-USAPI2                     PIC Z(2).9(03).
REMARK*   TAMBIEN SE ENTREGAEL CALCULO EN PESOS DE LA FECHA DE EJECUCION        
REMARK*   EN LAS SIGUIENTES VARIABLES
REMARK*      INGRESO-PESOS-USAPI                PIC 9(09)9.
REMARK*      INGRESO-PESOS-N-USAPI              PIC 9(10).
REMARK*      INGRESO-PESOS-INF-USAPI            PIC 9(09)9.
REMARK*      INGRESO-PESOS-N-INF-USAPI          PIC 9(10).
REMARK*      INGRESO-PESOS-SUP-USAPI            PIC 9(09)9.
REMARK*      INGRESO-PESOS-N-SUP-USAPI          PIC 9(10).
REMARK*  ADICIONALMENTE SE ENTREGAN LAS RAZONES ADVERSAS Y EL SCORE-CARD
REMARK*      ADVERSE-RAZON-USAPI OCCURS 4 TIMES PIC 9(02).
REMARK*      SCORE-CARD-USAPI                   PIC 9(01).
REMARK*
REMARK**********************************************************************
      * RMB0002    | QUANT1 * ASIGNAR LAS VALIABLES S1-INGRESO-C ANTES DEL *
      * C.VELASCO  |          PERFORM 8000-CAL-SALIDA-PESOS-USAPI PARA QUE *
      * 10-AGO-2009|         LOS VALORES EN MILES SEAN CORRECTOS (NO CEROS)*
      **********************************************************************
      * RMB0003    | QUANT2 * SE CAMBIA EL DISPLAY EN LAS RUTINAS DE       *
      * R.MARTINEZ |          AUDITORIA Y DESPLIEGUE DE DUMIES Y CARACTERIS*
      * 14-AGO-2009|         POR "STRING" PARA MANEJO DINAMICO DE ESTO     *
      *            | LEY001  * SE CREA LLAMADO TOTAL SIN APLICAR LEY       *
      **********************************************************************
      * RMB0004    | QUANNW * IMPLEMENTACION DE LA NUEVA VERSION DE QUANTO *
      * R.MARTINEZ |          SE REEMPLAZAN LOS SCORE CARDS POR FILOSOFIA  *
      * 20-NOV-2009|          DE REDES NEURONALES                          *
      **********************************************************************
      * RMB0005    | QUANT3 * SE ADICIONA UN CONTROL PARA QUE NO SE CALCULE*
      * R.MARTINEZ |          QUANTO PARA PERSONAS JURIDICAS               *
      * 05-ABR-2011|                                                       *
      **********************************************************************
       5000-CALCULAR-CAR-SCORE-USAPI.        
REMARK**********************************************************************
REMARK*5000-CALCULAR-CAR-SCORE-USAPI.
REMARK* RUTINA QUE LLAMA LAS CARACTERISTICAS SIN LEY EL SCORE QUANTO
REMARK**********************************************************************
LEY001     MOVE AMNISTIA21-LEEMSTRS TO AMNISTIA21-CARACT.               RMB0003
LEY001     MOVE SW-ART13-AMNIST21   TO AMNISTIA21-ART13-CARACT.         RMB0003 
LEY001     MOVE 0 TO AMNISTIA21-LEEMSTRS .                              RMB0003 
LEY001     MOVE 0 TO SW-ART13-AMNIST21  .                               RMB0003 
QUANT3     IF TIPO-ID-CARACT = 1 OR  TIPO-ID-CARACT = 4                 RMB0005 
QUANT3        PERFORM 1000-CALCULAR-CARACTERISTICAS                     RMB0005 
QUANT3        PERFORM 5000-CALCULAR-SCORE-USAPI                         RMB0005 
QUANT3     ELSE                                                         RMB0005
QUANT3        PERFORM 5000A-INICIALIZAR-USAPI                           RMB0005
QUANT3        MOVE 1 TO SIN-EXCLUSION-USAPI                             RMB0005
QUANT3        MOVE 70  TO  ADVERSE-RAZON-USAPI(1)                       RMB0005
QUANT3     END-IF.                                                      RMB0005 
LEY001     MOVE  AMNISTIA21-CARACT TO AMNISTIA21-LEEMSTRS.              RMB0003
LEY001     MOVE  AMNISTIA21-ART13-CARACT TO SW-ART13-AMNIST21.          RMB0003
       5000-CALCULAR-SCORE-USAPI.        
REMARK**********************************************************************
REMARK*5000-CALCULAR-SCORE-USAPI.
REMARK* RUTINA QUE EXAMINA EL PERFIL DE UNA PERSONA, APLICA EXCLUSIONES
REMARK* Y SI PASA EL FILTRO ESTIMA EL INGRESO DE ELLA.
REMARK**********************************************************************
           PERFORM 5000A-INICIALIZAR-USAPI.        
           PERFORM 5100-VER-EXCLUSIONES-USAPI        
           IF SIN-EXCLUSION-USAPI = 0        
              PERFORM 5200-VER-SCORE-CARD-USAPI        
           END-IF.            
              
       5000A-INICIALIZAR-USAPI.        
REMARK**********************************************************************
REMARK*    SE INICIALIZAN LAS VARIABLES INVOLUCRADAS EN LAS EXCLUSIONES Y
REMARK*    CALCULO DE LA SEGMENTACION A APLICAR.
REMARK**********************************************************************
           INITIALIZE VARIABLES-WORK-USAPI.        
           INITIALIZE VARIABLES-CARACT-USA.        
           MOVE 00DEM001    TO CO00DEM001.            
           MOVE 00DEM002    TO CO00DEM002.            
           MOVE 01NUM001RO  TO CO01NUM001RO.        
           MOVE 01NUM001IN  TO CO01NUM001IN.        
           MOVE 01NUM001VE  TO CO01NUM001VE.        
           MOVE 01NUM001HP  TO CO01NUM001HP.        
           MOVE 01NUM001OT  TO CO01NUM001OT.        
           MOVE 01NUM001CC  TO CO01NUM001CC.        
           MOVE 01NUM001CO  TO CO01NUM001CO.        
           MOVE 01NUM001AH  TO CO01NUM001AH.        
           MOVE 01NUM001CT  TO CO01NUM001CT.        
           MOVE 01NUM002RO  TO CO01NUM002RO.        
           MOVE 01NUM002IN  TO CO01NUM002IN.        
           MOVE 01NUM002VE  TO CO01NUM002VE.        
           MOVE 01NUM002HP  TO CO01NUM002HP.        
           MOVE 02NUM001TO  TO CO02NUM001TO.        
           MOVE 02NUM002TO  TO CO02NUM002TO.        
           MOVE 02EXP001TO  TO CO02EXP001TO.        
              
       5100-VER-EXCLUSIONES-USAPI.        
REMARK**********************************************************************
REMARK*5100-VER-EXCLUSIONES-USAPI.
REMARK* DE ACUERDO A CARACTERISTICAS ESPECIFICAS SE EXAMINA SI ES UNA
REMARK* PERSONA SUJETA A EXLSION EN EL CALCULO DEL INGRESO
REMARK**********************************************************************
           *> CLIENTES TIPO ID 2 OR 3        
           IF TIPO-ID-CARACT NOT = 1 AND TIPO-ID-CARACT NOT = 4        
              MOVE 1 TO SIN-EXCLUSION-USAPI         
              MOVE 70  TO  ADVERSE-RAZON-USAPI(1)          
           END-IF.        
           *> CLIENTES TIPO 5        
           IF SIN-EXCLUSION-USAPI = 0        
              IF CO01NUM001AH = "  -1" AND CO01NUM001CT = "  -1" AND         
                 CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND         
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND         
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND         
                 CO01NUM001CO = "  -1"         
                 MOVE 1 TO SIN-EXCLUSION-USAPI         
                 MOVE 71  TO  ADVERSE-RAZON-USAPI(1)             
              END-IF        
           END-IF.        
           *> CLIENTES TIPO 1 SIN DESEMPEÑO        
           IF SIN-EXCLUSION-USAPI = 0        
              IF (CO01NUM001AH > 0000 OR CO01NUM001CT > 0000 )   AND        
                 CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND         
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND         
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND         
                 CO01NUM001CO = "  -1"         
                 MOVE 1 TO SIN-EXCLUSION-USAPI         
                 MOVE 72  TO  ADVERSE-RAZON-USAPI(1)             
              END-IF        
           END-IF.        
           *> CLIENTES FALLECIDOS                        
           IF SIN-EXCLUSION-USAPI = 0        
              IF CO00DEM001 = 01 OR CO00DEM002 = 01                 
                 MOVE 1 TO SIN-EXCLUSION-USAPI         
                 MOVE 73  TO  ADVERSE-RAZON-USAPI(1)             
              END-IF        
           END-IF.        
           *> CLIENTES QUE SON SOLO CODEUDORES          
           IF SIN-EXCLUSION-USAPI = 0        
              IF CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND         
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND         
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND         
                 CO01NUM001AH = "  -1" AND CO01NUM001CT = "  -1" AND         
                 CO01NUM001CO <> "  -1"         
                 MOVE 1 TO SIN-EXCLUSION-USAPI         
                 MOVE 74  TO  ADVERSE-RAZON-USAPI(1)             
              END-IF        
           END-IF.        
           *> CLIENTES TIPO 1 CODEUDORES                                   
           IF SIN-EXCLUSION-USAPI = 0        
QUANNW        IF (CO01NUM001AH <> "  -1" OR CO01NUM001CT <> "  -1" OR   RMB0004
QUANNW            CO01NUM001CO <> "  -1" ) AND                          RMB0004
                 CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND         
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND         
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" 
                 MOVE 1 TO SIN-EXCLUSION-USAPI         
                 MOVE 75  TO  ADVERSE-RAZON-USAPI(1)             
              END-IF        
           END-IF.        
           *> CLIENTES CON TODO CERRADO                  
           IF SIN-EXCLUSION-USAPI = 0        
              IF CO02NUM001TO > 0000 AND         
                 (CO02NUM002TO NOT NUMERIC OR CO02NUM002TO = 0000 )        
                 MOVE 1 TO SIN-EXCLUSION-USAPI         
                 MOVE 76  TO  ADVERSE-RAZON-USAPI(1)             
              END-IF        
           END-IF.        
           *> SIN CUENTAS ABIERTAS EN SECTOR FINANCIERO        
           IF SIN-EXCLUSION-USAPI = 0        
QUANNW        IF (CO01NUM002RO = 0000 OR CO01NUM002RO = "  -1" ) AND    RMB0004
QUANNW           (CO01NUM002IN = 0000 OR CO01NUM002IN = "  -1" ) AND    RMB0004
QUANNW           (CO01NUM002VE = 0000 OR CO01NUM002VE = "  -1" ) AND    RMB0004
QUANNW           (CO01NUM002HP = 0000 OR CO01NUM002HP = "  -1" )        RMB0004
                 MOVE 1 TO SIN-EXCLUSION-USAPI         
                 MOVE 77  TO  ADVERSE-RAZON-USAPI(1)          
              END-IF        
           END-IF.        
      *    CALCULO DEL SALARIO MINIMO AL RUN DATE        
           IF ANO-SMLMV-CARACT(99) <> 9999        
              PERFORM 1100-CARGA-SAL-MINIMO        
           END-IF.        
           MOVE ANO-RUN-CARACT TO ANO-NOV-SMLMV-CARACT        
           MOVE 1 TO IND-E-CARACT        
           PERFORM UNTIL ANO-SMLMV-CARACT(IND-E-CARACT) = 9999 OR        
                ANO-SMLMV-CARACT(IND-E-CARACT) =        
                ANO-NOV-SMLMV-CARACT        
                ADD 1 TO IND-E-CARACT        
           END-PERFORM        
           IF ANO-SMLMV-CARACT(IND-E-CARACT) <> 9999        
              MOVE VLR-SMLMV-CARACT(IND-E-CARACT) TO VLR-SMLMV-USAPI        
           ELSE        
              MOVE 1 TO SIN-EXCLUSION-USAPI         
              MOVE 78  TO  ADVERSE-RAZON-USAPI(1)          
              DISPLAY "ERROR BUSCANDO SALARIO MINIMO"        
                      ANO-NOV-SMLMV-CARACT         
           END-IF.        
              
       5200-VER-SCORE-CARD-USAPI.        
REMARK**********************************************************************
REMARK*5200-VER-SCORE-CARD-USAPI.
REMARK*    SE EXAMINAN LAS CARACTERISTICAS QUE DETERMINAN A QUE SEGMENTO 
REMARK*    PERTENECE LA PERSONA EXAMINANADA.
REMARK**********************************************************************
QUANNW     PERFORM 5210-CUPOTOTAL-USAPI.                                RMB0004
QUANNW     PERFORM 5220-CUPOTOTALHP-USAPI.                              RMB0004
QUANNW     PERFORM 5230-SECTORES-USAPI.                                 RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF CUPOTOTALHP-USAPI < 0                                     RMB0004
QUANNW        MOVE 13.405   TO          CUPOTOTALHP-AC                  RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CUPOTOTALHP-USAPI TO CUPOTOTALHP-AC                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02NUM003TO TO CO02NUM003TO.                             RMB0004
QUANNW     IF CO02NUM003TO NOT NUMERIC                                  RMB0004
QUANNW        MOVE 0 TO CO02NUM003TO-AC                                 RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO02NUM003TO TO CO02NUM003TO-AC                      RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END026RO TO CO01END026RO.                             RMB0004
QUANNW     IF CO01END026RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END026RO(1:8)  TO CO01END026ROV(1:8)             RMB0004
QUANNW        MOVE CO01END026RO(10:2) TO CO01END026ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END026ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END026RO(1:1) = " "                                   RMB0004
QUANNW        MOVE 0              TO CO01END026RO-AC                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO01END026ROV  TO CO01END026RO-AC                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01EXP001AH TO CO01EXP001AH.                             RMB0004
QUANNW     IF CO01EXP001AH NOT NUMERIC                                  RMB0004
QUANNW        MOVE 0              TO CO01EXP001AH-AC                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO01EXP001AH   TO CO01EXP001AH-AC                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02NUM043RO      TO CO02NUM043RO.                        RMB0004
QUANNW     IF CO02NUM043RO(4:1) = "."                                   RMB0004
QUANNW        MOVE CO02NUM043RO(1:3)  TO CO02NUM043ROV(1:3)             RMB0004
QUANNW        MOVE CO02NUM043RO(05:2) TO CO02NUM043ROV(4:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02NUM043ROV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO02NUM043RO(1:1) = " "                                   RMB0004
QUANNW        MOVE 0              TO CO02NUM043RO-AC                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO02NUM043ROV  TO CO02NUM043RO-AC                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02EXP009TO      TO CO02EXP009TO.                        RMB0004
QUANNW     IF CO02EXP009TO(6:1) = "."                                   RMB0004
QUANNW        MOVE CO02EXP009TO(1:5)  TO CO02EXP009TOV(1:5)             RMB0004
QUANNW        MOVE CO02EXP009TO(07:2) TO CO02EXP009TOV(6:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02EXP009TOV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO02EXP009TO(1:1) = " "                                   RMB0004
QUANNW        MOVE 61.365         TO CO02EXP009TO-AC                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO02EXP009TOV  TO CO02EXP009TO-AC                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM003 TO CO00DEM003  .                               RMB0004
QUANNW     IF CO00DEM003 NOT NUMERIC                                    RMB0004
QUANNW        MOVE 18             TO CO00DEM003-AC                      RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        IF CO00DEM003 < 018     *> NO SE HABIA CONTEMPLADO        RMB0004
QUANNW           MOVE 18          TO CO00DEM003-AC                      RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE CO00DEM003  TO CO00DEM003-AC                      RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     MOVE 00DEM027 TO CO00DEM027  .                               RMB0004
QUANNW     IF CO00DEM027   NOT NUMERIC                                  RMB0004
QUANNW        MOVE 0            TO CO00DEM027-AC                        RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM027   TO CO00DEM027-AC                        RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02NUM042CB      TO CO02NUM042CB.                        RMB0004
QUANNW     IF CO02NUM042CB(4:1) = "."                                   RMB0004
QUANNW        MOVE CO02NUM042CB(1:3)  TO CO02NUM042CBV(1:3)             RMB0004
QUANNW        MOVE CO02NUM042CB(05:2) TO CO02NUM042CBV(4:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02NUM042CBV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO02NUM042CB(1:1) = " "                                   RMB0004
QUANNW        MOVE 0              TO CO02NUM042CB-AC                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO02NUM042CBV  TO CO02NUM042CB-AC                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END007RO      TO CO01END007RO.                        RMB0004
QUANNW     IF CO01END007RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007RO(1:8)  TO CO01END007ROV(1:8)             RMB0004
QUANNW        MOVE CO01END007RO(10:2) TO CO01END007ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF   3.9 > CO01END007ROV                                     RMB0004
QUANNW        MOVE 1 TO CO01END007RO-AC-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007RO-AC-D01                             RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF   3.9 <= CO01END007ROV AND CO01END007ROV < 10.4           RMB0004
QUANNW        MOVE 1 TO CO01END007RO-AC-D02                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007RO-AC-D02                             RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF  10.4 <= CO01END007ROV AND CO01END007ROV < 29.18          RMB0004
QUANNW        MOVE 1 TO CO01END007RO-AC-D03                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007RO-AC-D03                             RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF  29.18 <= CO01END007ROV                                   RMB0004
QUANNW        MOVE 1 TO CO01END007RO-AC-D04                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007RO-AC-D04                             RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01NUM005CT TO CO01NUM005CT.                             RMB0004
QUANNW     IF 0000 = CO01NUM005CT                                       RMB0004
QUANNW        MOVE 1 TO CO01NUM005CT-AC-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01NUM005CT-AC-D01                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0001 <= CO01NUM005CT AND CO01NUM005CT NUMERIC             RMB0004
QUANNW        MOVE 1 TO CO01NUM005CT-AC-D02                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01NUM005CT-AC-D02                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM006 TO CO00DEM006                                  RMB0004
QUANNW     IF CO00DEM006 = "-1"                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM006-AC-D01                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM006(2:1) TO CO00DEM006-AC-D01(1:1)            RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM026 TO CO00DEM026.                                 RMB0004
QUANNW     IF CO00DEM026 = 01 OR 02                                     RMB0004
QUANNW        MOVE 1 TO CO00DEM026-AC-D01                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-AC-D01                               RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO00DEM026 = 03 OR 04                                     RMB0004
QUANNW        MOVE 1 TO CO00DEM026-AC-D02                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-AC-D02                               RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO00DEM026 = 05 OR 06                                     RMB0004
QUANNW        MOVE 1 TO CO00DEM026-AC-D03                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-AC-D03                               RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM030 TO CO00DEM030.                                 RMB0004
QUANNW     IF CO00DEM030 = "  -1"                                       RMB0004
QUANNW        MOVE 1 TO CO00DEM030-AC-D01                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM030-AC-D01                               RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE EXPONENTE-AC        = -1.38184193307829            + RMB0004
QUANNW                      (0.02001563404215 * CUPOTOTALHP-AC)       + RMB0004
QUANNW                      (0.0537346406382158 * CO02NUM003TO-AC)    + RMB0004
QUANNW                      (0.0152285881042132 * CO00DEM027-AC)      + RMB0004
QUANNW                      (0.015318027072943 * CO00DEM003-AC)       + RMB0004
QUANNW                      (0.00092149130737727 * CO01EXP001AH-AC)  +  RMB0004
QUANNW                      (0.00310648905600417 * CO02NUM043RO-AC)   + RMB0004
QUANNW                      (-0.00455931497250883 * CO02EXP009TO-AC)  + RMB0004
QUANNW                      (-0.00155759157311373 * CO02NUM042CB-AC)  + RMB0004
QUANNW                      (0.474103889843154 * CO01END007RO-AC-D03) + RMB0004
QUANNW                      (0.501672573985784 * CO01END007RO-AC-D04) + RMB0004
QUANNW                      (1.37176676596698 * CO01NUM005CT-AC-D01)  + RMB0004
QUANNW                      (1.42099422933571 * CO01NUM005CT-AC-D02)  + RMB0004
QUANNW                      (-0.298730770003236 * CO00DEM006-AC-D01)  + RMB0004
QUANNW                      (-0.613987759658746 * CO00DEM026-AC-D01)  + RMB0004
QUANNW                      (0.945299341876286 * CO00DEM026-AC-D03)   + RMB0004
QUANNW                      (-1.50647631329775 * CO00DEM030-AC-D01).    RMB0004
QUANNW     COMPUTE SEGMENTO-AC  =                                       RMB0004
QUANNW             (1000 / (1 + 2.7182818284 ** (-EXPONENTE-AC))).      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF SEGMENTO-AC <= 179                                        RMB0004
QUANNW        MOVE 4 TO SCORE-CARD-USAPI                                RMB0004
QUANNW        PERFORM 6400-SCORE-CARD4-USAPI                            RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        IF SEGMENTO-AC <= 745                                     RMB0004
QUANNW           MOVE 3 TO SCORE-CARD-USAPI                             RMB0004
QUANNW           PERFORM 6300-SCORE-CARD3-USAPI                         RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           PERFORM 6000-SUBSEGMENTAR-USAPI                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW 5210-CUPOTOTAL-USAPI.                                            RMB0004
QUANNW*    PARA CUPO TOTAL                                              RMB0004
QUANNW     MOVE 01END007RO      TO CO01END007RO.                        RMB0004
QUANNW     IF CO01END007RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007RO(1:8)  TO CO01END007ROV(1:8)             RMB0004
QUANNW        MOVE CO01END007RO(10:2) TO CO01END007ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END007IN      TO CO01END007IN.                        RMB0004
QUANNW     IF CO01END007IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007IN(1:8)  TO CO01END007INV(1:8)             RMB0004
QUANNW        MOVE CO01END007IN(10:2) TO CO01END007INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END007VE      TO CO01END007VE.                        RMB0004
QUANNW     IF CO01END007VE(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007VE(1:8)  TO CO01END007VEV(1:8)             RMB0004
QUANNW        MOVE CO01END007VE(10:2) TO CO01END007VEV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007VEV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END007HP      TO CO01END007HP.                        RMB0004
QUANNW     IF CO01END007HP(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007HP(1:8)  TO CO01END007HPV(1:8)             RMB0004
QUANNW        MOVE CO01END007HP(10:2) TO CO01END007HPV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007HPV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END007OT      TO CO01END007OT.                        RMB0004
QUANNW     IF CO01END007OT(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007OT(1:8)  TO CO01END007OTV(1:8)             RMB0004
QUANNW        MOVE CO01END007OT(10:2) TO CO01END007OTV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007OTV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    CUPO TOTAL A LA FECHA DE TODOS LOS PRODUCTOS                 RMB0004
QUANNW     IF CO01END007RO(1:1) <> " "  OR CO01END007IN(1:1) <> " "  OR RMB0004
QUANNW        CO01END007VE(1:1) <> " "  OR CO01END007HP(1:1) <> " "  OR RMB0004
QUANNW        CO01END007OT(1:1) <> " "                                  RMB0004
QUANNW        COMPUTE CUPOTOTAL-USAPI = CO01END007ROV + CO01END007INV + RMB0004
QUANNW                            CO01END007VEV + CO01END007HPV +       RMB0004
QUANNW                            CO01END007OTV                         RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE -1 TO CUPOTOTAL-USAPI                                RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW 5220-CUPOTOTALHP-USAPI.                                          RMB0004
QUANNW*    CUPO TOTAL A LA FECHA DE TODOS LOS PRODUCTOS                 RMB0004
QUANNW     IF CO01END007RO(1:1) <> " "  OR CO01END007IN(1:1) <> " "  OR RMB0004
QUANNW        CO01END007VE(1:1) <> " "  OR CO01END007OT(1:1) <> " "     RMB0004
QUANNW        COMPUTE CUPOTOTALHP-USAPI = CO01END007ROV + CO01END007INV RMB0004
QUANNW                         +  CO01END007VEV + CO01END007OTV         RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE -1 TO CUPOTOTALHP-USAPI                              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW 5220-SALDOTOTALHP-USAPI.                                         RMB0004
QUANNW*    SALDO TOTAL A  LA FECHA DE TODOS LOS PRODUCTOS               RMB0004
QUANNW     MOVE 01END001RO      TO CO01END001RO.                        RMB0004
QUANNW     IF CO01END001RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END001RO(1:8)  TO CO01END001ROV(1:8)             RMB0004
QUANNW        MOVE CO01END001RO(10:2) TO CO01END001ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END001ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END001IN      TO CO01END001IN.                        RMB0004
QUANNW     IF CO01END001IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END001IN(1:8)  TO CO01END001INV(1:8)             RMB0004
QUANNW        MOVE CO01END001IN(10:2) TO CO01END001INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END001INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END001VE      TO CO01END001VE.                        RMB0004
QUANNW     IF CO01END001VE(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END001VE(1:8)  TO CO01END001VEV(1:8)             RMB0004
QUANNW        MOVE CO01END001VE(10:2) TO CO01END001VEV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END001VEV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END001HP      TO CO01END001HP.                        RMB0004
QUANNW     IF CO01END001HP(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END001HP(1:8)  TO CO01END001HPV(1:8)             RMB0004
QUANNW        MOVE CO01END001HP(10:2) TO CO01END001HPV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END001HPV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END001OT      TO CO01END001OT.                        RMB0004
QUANNW     IF CO01END001OT(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END001OT(1:8)  TO CO01END001OTV(1:8)             RMB0004
QUANNW        MOVE CO01END001OT(10:2) TO CO01END001OTV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END001OTV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO01END001RO(1:1) <> " "  OR CO01END001IN(1:1) <> " "  OR RMB0004
QUANNW        CO01END001VE(1:1) <> " "  OR CO01END001OT(1:1) <> " "     RMB0004
QUANNW        COMPUTE SALDOTOTALHP-USAPI = CO01END001ROV + CO01END001INVRMB0004
QUANNW                         +  CO01END001VEV + CO01END001OTV         RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE -1 TO SALDOTOTALHP-USAPI                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW 5230-SECTORES-USAPI.                                             RMB0004
QUANNW*    RELACIONAMIENTO CON SECTORES                                 RMB0004
QUANNW     IF CO01NUM001RO > 0000  OR CO01NUM001IN > 0000     OR        RMB0004
QUANNW        CO01NUM001VE > 0000  OR CO01NUM001HP > 0000     OR        RMB0004
QUANNW        CO01NUM001OT > 0000                                       RMB0004
QUANNW        MOVE 1 TO FINANCIERO-C                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO FINANCIERO-C                                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO01NUM001OT > 0000                                       RMB0004
QUANNW        MOVE 1 TO REAL-C                                          RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO REAL-C                                          RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO01NUM001CC > 0000                                       RMB0004
QUANNW        MOVE 1 TO TELCOS-C                                        RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO TELCOS-C                                        RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     MOVE SPACES TO TIPOREL-C.                                    RMB0004
QUANNW     IF FINANCIERO-C = 1 AND REAL-C = 0 AND TELCOS-C = 0          RMB0004
QUANNW        MOVE "F" TO TIPOREL-C                                     RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF FINANCIERO-C = 1 AND REAL-C = 1 AND TELCOS-C = 0          RMB0004
QUANNW        MOVE "F-R" TO TIPOREL-C                                   RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF FINANCIERO-C = 1 AND REAL-C = 1 AND TELCOS-C = 1          RMB0004
QUANNW        MOVE "F-R-T" TO TIPOREL-C                                 RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF FINANCIERO-C = 1 AND REAL-C = 0 AND TELCOS-C = 1          RMB0004
QUANNW        MOVE "F-T" TO TIPOREL-C                                   RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF TIPOREL-C = "F"                                           RMB0004
QUANNW        MOVE 1 TO TIPORELD01                                      RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO TIPORELD01                                      RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF TIPOREL-C = "F-R"                                         RMB0004
QUANNW        MOVE 1 TO TIPORELD02                                      RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO TIPORELD02                                      RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF TIPOREL-C = "F-R-T"                                       RMB0004
QUANNW        MOVE 1 TO TIPORELD03                                      RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO TIPORELD03                                      RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF TIPOREL-C = "F-T"                                         RMB0004
QUANNW        MOVE 1 TO TIPORELD04                                      RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO TIPORELD04                                      RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW 5240-CUOTATOTAL-USAPI.                                           RMB0004
QUANNW*    PARA CUOTA TOTAL                                             RMB0004
QUANNW     MOVE 01END005RO      TO CO01END005RO.                        RMB0004
QUANNW     IF CO01END005RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END005RO(1:8)  TO CO01END005ROV(1:8)             RMB0004
QUANNW        MOVE CO01END005RO(10:2) TO CO01END005ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END005ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END005IN      TO CO01END005IN.                        RMB0004
QUANNW     IF CO01END005IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END005IN(1:8)  TO CO01END005INV(1:8)             RMB0004
QUANNW        MOVE CO01END005IN(10:2) TO CO01END005INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END005INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END005VE      TO CO01END005VE.                        RMB0004
QUANNW     IF CO01END005VE(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END005VE(1:8)  TO CO01END005VEV(1:8)             RMB0004
QUANNW        MOVE CO01END005VE(10:2) TO CO01END005VEV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END005VEV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END005HP      TO CO01END005HP.                        RMB0004
QUANNW     IF CO01END005HP(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END005HP(1:8)  TO CO01END005HPV(1:8)             RMB0004
QUANNW        MOVE CO01END005HP(10:2) TO CO01END005HPV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END005HPV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END005OT      TO CO01END005OT.                        RMB0004
QUANNW     IF CO01END005OT(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END005OT(1:8)  TO CO01END005OTV(1:8)             RMB0004
QUANNW        MOVE CO01END005OT(10:2) TO CO01END005OTV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END005OTV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    CUPO TOTAL A LA FECHA DE TODOS LOS PRODUCTOS                 RMB0004
QUANNW     IF CO01END005RO(1:1) <> " "  OR CO01END005IN(1:1) <> " "  OR RMB0004
QUANNW        CO01END005VE(1:1) <> " "  OR CO01END005HP(1:1) <> " "  OR RMB0004
QUANNW        CO01END005OT(1:1) <> " "                                  RMB0004
QUANNW        COMPUTE CUOTATOTAL-USAPI = CO01END005ROV + CO01END005INV +RMB0004
QUANNW                            CO01END005VEV + CO01END005HPV +       RMB0004
QUANNW                            CO01END005OTV                         RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE -1 TO CUOTATOTAL-USAPI                               RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW 5250-CUOTATOTALHP-3-USAPI.                                       RMB0004
QUANNW*    PARA CUOTA HP- 3 TOTAL                                       RMB0004
QUANNW     MOVE 01END035RO      TO CO01END035RO.                        RMB0004
QUANNW     IF CO01END035RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END035RO(1:8)  TO CO01END035ROV(1:8)             RMB0004
QUANNW        MOVE CO01END035RO(10:2) TO CO01END035ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END035ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END035IN      TO CO01END035IN.                        RMB0004
QUANNW     IF CO01END035IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END035IN(1:8)  TO CO01END035INV(1:8)             RMB0004
QUANNW        MOVE CO01END035IN(10:2) TO CO01END035INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END035INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END035VE      TO CO01END035VE.                        RMB0004
QUANNW     IF CO01END035VE(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END035VE(1:8)  TO CO01END035VEV(1:8)             RMB0004
QUANNW        MOVE CO01END035VE(10:2) TO CO01END035VEV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END035VEV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     MOVE 01END035OT      TO CO01END035OT.                        RMB0004
QUANNW     IF CO01END035OT(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END035OT(1:8)  TO CO01END035OTV(1:8)             RMB0004
QUANNW        MOVE CO01END035OT(10:2) TO CO01END035OTV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END035OTV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    CUPO TOTAL A LA FECHA DE TODOS LOS PRODUCTOS                 RMB0004
QUANNW     IF CO01END035RO(1:1) <> " "  OR CO01END035IN(1:1) <> " "  OR RMB0004
QUANNW        CO01END035VE(1:1) <> " "  OR CO01END035OT(1:1) <> " "     RMB0004
QUANNW        COMPUTE CUOTATOTALHP-3-USAPI = CO01END035ROV +            RMB0004
QUANNW                            CO01END035INV + CO01END035VEV +       RMB0004
QUANNW                            CO01END035OTV                         RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE -1 TO CUOTATOTALHP-3-USAPI                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW 6000-SUBSEGMENTAR-USAPI.                                         RMB0004
QUANNW     IF CUPOTOTAL-USAPI < 0                                       RMB0004
QUANNW        MOVE 89.06 TO CUPOTOTAL-ACS1                              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CUPOTOTAL-USAPI TO CUPOTOTAL-ACS1                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END007RO      TO CO01END007RO.                        RMB0004
QUANNW     IF CO01END007RO(9:1) =  "." *> NO NEGATIVO                   RMB0004
QUANNW        MOVE CO01END007RO(1:8)  TO CO01END007ROV(1:8)             RMB0004
QUANNW        MOVE CO01END007RO(10:2) TO CO01END007ROV(9:2)             RMB0004
QUANNW        MOVE CO01END007ROV      TO CO01END007RO-ACS1              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 32.89              TO CO01END007RO-ACS1              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01NUM002CT TO CO01NUM002CT.                             RMB0004
QUANNW     IF CO01NUM002CT(3:1) = "-"                                   RMB0004
QUANNW        MOVE 1 TO CO01NUM002CT-ACS1                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO01NUM002CT TO CO01NUM002CT-ACS1                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01EXP001CC TO CO01EXP001CC.                             RMB0004
QUANNW     IF CO01EXP001CC(2:1) = "-"                                   RMB0004
QUANNW        MOVE 0 TO CO01EXP001CC-ACS1                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO01EXP001CC TO CO01EXP001CC-ACS1                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01ACP008CC TO CO01ACP008CC.                             RMB0004
QUANNW     IF CO01ACP008CC(3:1) = "-"                                   RMB0004
QUANNW        MOVE 0 TO CO01ACP008CC-ACS1                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO01ACP008CC TO CO01ACP008CC-ACS1                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01EXP001CT TO CO01EXP001CT.                             RMB0004
QUANNW     IF CO01EXP001CT(2:1) = "-"                                   RMB0004
QUANNW        MOVE 0 TO CO01EXP001CT-ACS1                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO01EXP001CT TO CO01EXP001CT-ACS1                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM006 TO CO00DEM006                                  RMB0004
QUANNW     IF CO00DEM006 = "-1"                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM006-ACS1-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM006(2:1) TO CO00DEM006-ACS1-D01(1:1)          RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM026 TO CO00DEM026                                  RMB0004
QUANNW     IF CO00DEM026 = "-1"                                         RMB0004
QUANNW        MOVE 1 TO CO00DEM026-ACS1-D00                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-ACS1-D00                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO00DEM026 = 01 OR 02                                     RMB0004
QUANNW        MOVE 1 TO CO00DEM026-ACS1-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-ACS1-D01                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO00DEM026 = 03 OR 04                                     RMB0004
QUANNW        MOVE 1 TO CO00DEM026-ACS1-D02                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-ACS1-D02                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO00DEM026 = 05 OR 06                                     RMB0004
QUANNW        MOVE 1 TO CO00DEM026-ACS1-D03                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-ACS1-D03                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM030 TO CO00DEM030                                  RMB0004
QUANNW     IF CO00DEM030 = "  -1"                                       RMB0004
QUANNW        MOVE 1 TO CO00DEM030-ACS1-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM030-ACS1-D01                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     COMPUTE EXPONENTE-ACS1 = -1.79656111426554 +                 RMB0004
QUANNW                    (0.00682649186703556 * CUPOTOTAL-ACS1) +      RMB0004
QUANNW                    (0.00550327551324166 * CO01END007RO-ACS1) +   RMB0004
QUANNW                    (0.330168477421059 * CO01NUM002CT-ACS1) +     RMB0004
QUANNW                    (0.00250154229416242 * CO01EXP001CC-ACS1) +   RMB0004
QUANNW                    (0.0561296462559504 * CO01ACP008CC-ACS1) +    RMB0004
QUANNW                    (0.00148254184104983 * CO01EXP001CT-ACS1) +   RMB0004
QUANNW                    (-0.550769792816713 * CO00DEM006-AC-D01) +    RMB0004
QUANNW                    (0.609133356597153 * CO00DEM026-ACS1-D03) +   RMB0004
QUANNW                    (-1.40640649560845 * CO00DEM030-ACS1-D01) +   RMB0004
QUANNW                    (0.0402120074366846 * TIPORELD03).            RMB0004
QUANNW     COMPUTE SEGMENTO-ACS1  =                                     RMB0004
QUANNW             (1000 / (1 + 2.7182818284 ** (-EXPONENTE-ACS1))).    RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF SEGMENTO-ACS1 <= 428                                      RMB0004
QUANNW        MOVE 2 TO SCORE-CARD-USAPI                                RMB0004
QUANNW        PERFORM 6200-SCORE-CARD2-USAPI                            RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 1 TO SCORE-CARD-USAPI                                RMB0004
QUANNW        PERFORM 6100-SCORE-CARD1-USAPI                            RMB0004
QUANNW     END-IF.                                                      RMB0004
       6100-SCORE-CARD1-USAPI.        
REMARK********************************************************************
REMARK*6100-SCORE-CARD1-USAPI.
REMARK*    SE CALCULA EL INGRESO PARA LA PERSONA CLASIFICADA EN EL SEGMENTO
REMARK*    UNO ,INGRESOS ENTRE 1 Y 8 SALARIOS MINIMOS,CLIENTES BANCARIZADOS
REMARK*    RESTRINGIDOS
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAPI(1) .        
QUANNW     IF CUPOTOTAL-USAPI < 0                                       RMB0004
QUANNW        MOVE 0     TO CUPOTOTAL-SEG1                              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CUPOTOTAL-USAPI TO CUPOTOTAL-SEG1                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END030RO      TO CO01END030RO.                        RMB0004
QUANNW     IF CO01END030RO(9:1) =  "." *> NO NEGATIVO                   RMB0004
QUANNW        MOVE CO01END030RO(1:8)  TO CO01END030ROV(1:8)             RMB0004
QUANNW        MOVE CO01END030RO(10:2) TO CO01END030ROV(9:2)             RMB0004
QUANNW        MOVE CO01END030ROV      TO CO01END030RO-SEG1              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0                  TO CO01END030RO-SEG1              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01NUM050CT TO CO01NUM050CT.                             RMB0004
QUANNW     IF CO01NUM050CT(3:1) = "-"                                   RMB0004
QUANNW        MOVE 0 TO CO01NUM050CT-SEG1                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO01NUM050CT TO CO01NUM050CT-SEG1                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END006RO      TO CO01END006RO.                        RMB0004
QUANNW     IF CO01END006RO(9:1) =  "." *> NO NEGATIVO                   RMB0004
QUANNW        MOVE CO01END006RO(1:8)  TO CO01END006ROV(1:8)             RMB0004
QUANNW        MOVE CO01END006RO(10:2) TO CO01END006ROV(9:2)             RMB0004
QUANNW        MOVE CO01END006ROV      TO CO01END006RO-SEG1              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0                  TO CO01END006RO-SEG1              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    ACOTACIONES                                                  RMB0004
QUANNW     IF CUPOTOTAL-SEG1 > 532.83                                   RMB0004
QUANNW        MOVE 532.83 TO CUPOTOTAL-SEG1.                            RMB0004
QUANNW     IF CO01END030RO-SEG1 > 27.16                                 RMB0004
QUANNW        MOVE 27.16 TO CO01END030RO-SEG1.                          RMB0004
QUANNW     IF CO01NUM050CT-SEG1 > 5                                     RMB0004
QUANNW        MOVE 5     TO CO01NUM050CT-SEG1.                          RMB0004
QUANNW     IF CO01END006RO-SEG1 > 3.27                                  RMB0004
QUANNW        MOVE 3.27  TO CO01END006RO-SEG1.                          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END010RO  TO CO01END010RO.                            RMB0004
QUANNW     IF CO01END010RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END010RO(1:8)  TO CO01END010ROV(1:8)             RMB0004
QUANNW        MOVE CO01END010RO(10:2) TO CO01END010ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END010ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF 6.69 <= CO01END010ROV AND CO01END010ROV < 13.15           RMB0004
QUANNW        MOVE 1 TO CO01END010RO-SEG1-D03                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END010RO-SEG1-D03                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 13.15 <= CO01END010ROV                                    RMB0004
QUANNW        MOVE 1 TO CO01END010RO-SEG1-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END010RO-SEG1-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END005IN      TO CO01END005IN.                        RMB0004
QUANNW     IF CO01END005IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END005IN(1:8)  TO CO01END005INV(1:8)             RMB0004
QUANNW        MOVE CO01END005IN(10:2) TO CO01END005INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END005INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END005INV < 0.92                                      RMB0004
QUANNW        MOVE 1 TO CO01END005IN-SEG1-D01                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END005IN-SEG1-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0.92 <= CO01END005INV AND CO01END005INV < 1.88            RMB0004
QUANNW        MOVE 1 TO CO01END005IN-SEG1-D02                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END005IN-SEG1-D02                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END035IN      TO CO01END035IN.                        RMB0004
QUANNW     IF CO01END035IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END035IN(1:8)  TO CO01END035INV(1:8)             RMB0004
QUANNW        MOVE CO01END035IN(10:2) TO CO01END035INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END035INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF 3.29 <= CO01END035INV                                     RMB0004
QUANNW        MOVE 1 TO CO01END035IN-SEG1-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END035IN-SEG1-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END021IN      TO CO01END021IN.                        RMB0004
QUANNW     IF CO01END021IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END021IN(1:8)  TO CO01END021INV(1:8)             RMB0004
QUANNW        MOVE CO01END021IN(10:2) TO CO01END021INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END021INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF 37.07 <= CO01END021INV                                    RMB0004
QUANNW        MOVE 1 TO CO01END021IN-SEG1-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END021IN-SEG1-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02EXP012RO      TO CO02EXP012RO.                        RMB0004
QUANNW     IF CO02EXP012RO(6:1) = "."                                   RMB0004
QUANNW        MOVE CO02EXP012RO(1:5)  TO CO02EXP012ROV(1:5)             RMB0004
QUANNW        MOVE CO02EXP012RO(07:2) TO CO02EXP012ROV(6:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02EXP012ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO02EXP012ROV < 50                                        RMB0004
QUANNW        MOVE 1 TO CO02EXP012RO-SEG1-D01                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO02EXP012RO-SEG1-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 50   <= CO02EXP012ROV AND CO02EXP012ROV < 80              RMB0004
QUANNW        MOVE 1 TO CO02EXP012RO-SEG1-D02                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO02EXP012RO-SEG1-D02                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END077RO      TO CO01END077RO.                        RMB0004
QUANNW     IF CO01END077RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END077RO(1:8)  TO CO01END077ROV(1:8)             RMB0004
QUANNW        MOVE CO01END077RO(10:2) TO CO01END077ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END077ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END077ROV < 16.62                                     RMB0004
QUANNW        MOVE 1 TO CO01END077RO-SEG1-D01                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END077RO-SEG1-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END028HP      TO CO01END028HP.                        RMB0004
QUANNW     IF CO01END028HP(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END028HP(1:8)  TO CO01END028HPV(1:8)             RMB0004
QUANNW        MOVE CO01END028HP(10:2) TO CO01END028HPV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END028HPV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END028HPV < 1.52                                      RMB0004
QUANNW        MOVE 1 TO CO01END028HP-SEG1-D01                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END028HP-SEG1-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM006 TO CO00DEM006                                  RMB0004
QUANNW     IF CO00DEM006 = "-1"                                         RMB0004
QUANNW        MOVE 1 TO CO00DEM006-SEG1                                 RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM006(2:1) TO CO00DEM006-SEG1(1:1)              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM030 TO CO00DEM030.                                 RMB0004
QUANNW     IF CO00DEM030 <> "  -1"                                      RMB0004
QUANNW        MOVE 1 TO CO00DEM030-SEG1-D02                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM030-SEG1-D02                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM026 TO CO00DEM026.                                 RMB0004
QUANNW     IF CO00DEM026 = 05                                           RMB0004
QUANNW        MOVE 1 TO CO00DEM026-SEG1-D05                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-SEG1-D05                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO00DEM026 = 06                                           RMB0004
QUANNW        MOVE 1 TO CO00DEM026-SEG1-D06                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-SEG1-D06                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     COMPUTE S1-INGRESO-C      = 7.19924641719601 +               RMB0004
QUANNW               (0.0114845674483187 * CUPOTOTAL-SEG1) +            RMB0004
QUANNW               (0.116003337672041 * CO01END030RO-SEG1) +          RMB0004
QUANNW               (0.654362612651502 * CO01NUM050CT-SEG1) +          RMB0004
QUANNW               (0.621783640318475 * CO01END006RO-SEG1) +          RMB0004
QUANNW               (0.662431371455832 * CO01END010RO-SEG1-D03) +      RMB0004
QUANNW               (0.697268607696142 * CO01END010RO-SEG1-D04) +      RMB0004
QUANNW               (-1.37178647620083 * CO01END005IN-SEG1-D01) +      RMB0004
QUANNW               (-0.99463220177628 * CO01END005IN-SEG1-D02) +      RMB0004
QUANNW               (0.462072288940456 * CO02EXP012RO-SEG1-D01) +      RMB0004
QUANNW               (0.547019344910553 * CO01END077RO-SEG1-D01) +      RMB0004
QUANNW               (-1.17389397578395 * CO01END028HP-SEG1-D01) +      RMB0004
QUANNW               (-1.16722704932149 * CO00DEM006-SEG1) +            RMB0004
QUANNW               (2.14069117450221 * CO00DEM030-SEG1-D02) +         RMB0004
QUANNW               (1.34101207875983 * CO00DEM026-SEG1-D06).          RMB0004
QUANNW     IF S1-INGRESO-C < 1                                          RMB0004
QUANNW        MOVE 1 TO S1-INGRESO-C                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        IF S1-INGRESO-C > 27.92                                   RMB0004
QUANNW           MOVE 27.92   TO S1-INGRESO-C                           RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE S1-INGRESO-C TO S1-INGRESO-C                      RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     COMPUTE S1-INGRESO-INF-C     = S1-INGRESO-C     -            RMB0004
QUANNW        S1-INGRESO-C * K-INTERVALO-USAPI  .                       RMB0004
QUANNW     COMPUTE S1-INGRESO-SUP-C     = S1-INGRESO-C     +            RMB0004
QUANNW        S1-INGRESO-C * K-INTERVALO-USAPI  .                       RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI1 .                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI2 .                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-N-USAPI.                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI  .                    RMB0004
QUANNW     MOVE S1-INGRESO-INF-C TO INGRESO-INF-USAPI .                 RMB0004
QUANNW     MOVE S1-INGRESO-INF-C TO INGRESO-INF-N-USAPI .               RMB0004
QUANNW     MOVE S1-INGRESO-SUP-C TO INGRESO-SUP-USAPI.                  RMB0004
QUANNW     MOVE S1-INGRESO-SUP-C TO INGRESO-SUP-N-USAPI.                RMB0004
QUANNW     PERFORM 8000-CAL-SALIDA-PESOS-USAPI.                         RMB0004
       6200-SCORE-CARD2-USAPI.
REMARK********************************************************************
REMARK*6200-SCORE-CARD2-USAPI.
REMARK*    SE CALCULA EL INGRESO PARA LA PERSONA CLASIFICADA EN EL SEGMENTO
REMARK*    DOS, DE INGRESOS MAS ALTOS (RENTA ALTA)                          
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAPI(1) .
QUANNW     PERFORM 5240-CUOTATOTAL-USAPI.                               RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END030RO      TO CO01END030RO.                        RMB0004
QUANNW     IF CO01END030RO(9:1) =  "." *> NO NEGATIVO                   RMB0004
QUANNW        MOVE CO01END030RO(1:8)  TO CO01END030ROV(1:8)             RMB0004
QUANNW        MOVE CO01END030RO(10:2) TO CO01END030ROV(9:2)             RMB0004
QUANNW        MOVE CO01END030ROV      TO CO01END030RO-SEG2              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 6.19               TO CO01END030RO-SEG2              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF CUOTATOTAL-USAPI < 0                                      RMB0004
QUANNW        MOVE 2.09               TO CUOTATOTAL-SEG2                RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CUOTATOTAL-USAPI   TO CUOTATOTAL-SEG2                RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END028RO      TO CO01END028RO.                        RMB0004
QUANNW     IF CO01END028RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END028RO(1:8)  TO CO01END028ROV(1:8)             RMB0004
QUANNW        MOVE CO01END028RO(10:2) TO CO01END028ROV(9:2)             RMB0004
QUANNW        MOVE CO01END028ROV      TO CO01END028RO-SEG2              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0.44               TO CO01END028RO-SEG2              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF CUPOTOTAL-USAPI < 0                                       RMB0004
QUANNW        MOVE 0               TO CUPOTOTAL-SEG2                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CUPOTOTAL-USAPI TO CUPOTOTAL-SEG2                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END089RO      TO CO01END089RO.                        RMB0004
QUANNW     IF CO01END089RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)             RMB0004
QUANNW        MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)             RMB0004
QUANNW        MOVE CO01END089ROV      TO CO01END089RO-SEG2              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 54.41              TO CO01END089RO-SEG2              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM003 TO CO00DEM003  .                               RMB0004
QUANNW     IF CO00DEM003 NOT NUMERIC                                    RMB0004
QUANNW        MOVE 0              TO CO00DEM003-SEG2                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM003     TO CO00DEM003-SEG2                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    ACOTACION DE VARIABLES                                       RMB0004
QUANNW     IF CO01END030RO-SEG2 > 14.97                                 RMB0004
QUANNW        MOVE 14.97 TO CO01END030RO-SEG2.                          RMB0004
QUANNW     IF CUOTATOTAL-SEG2   > 8.64                                  RMB0004
QUANNW        MOVE  8.64 TO CUOTATOTAL-SEG2.                            RMB0004
QUANNW     IF CO00DEM003-SEG2   > 63                                    RMB0004
QUANNW        MOVE  63   TO CO00DEM003-SEG2.                            RMB0004
QUANNW     IF CO00DEM003-SEG2   < 18                                    RMB0004
QUANNW        MOVE  18   TO CO00DEM003-SEG2.                            RMB0004
QUANNW     IF CO01END028RO-SEG2 >  1.98                                 RMB0004
QUANNW        MOVE  1.98 TO CO01END028RO-SEG2.                          RMB0004
QUANNW     IF CUPOTOTAL-SEG2    > 161.19                                RMB0004
QUANNW        MOVE  161.19 TO CUPOTOTAL-SEG2.                           RMB0004
QUANNW     IF CO01END089RO-SEG2 >  98.35                                RMB0004
QUANNW        MOVE 98.35 TO CO01END089RO-SEG2.                          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END023IN      TO CO01END023IN.                        RMB0004
QUANNW     IF CO01END023IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END023IN(1:8)  TO CO01END023INV(1:8)             RMB0004
QUANNW        MOVE CO01END023IN(10:2) TO CO01END023INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END023INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END023IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END023INV AND CO01END023INV < 0.36         RMB0004
QUANNW           MOVE 1 TO CO01END023IN-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END023IN-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END023IN-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END007IN      TO CO01END007IN.                        RMB0004
QUANNW     IF CO01END007IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007IN(1:8)  TO CO01END007INV(1:8)             RMB0004
QUANNW        MOVE CO01END007IN(10:2) TO CO01END007INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END007IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END007INV AND CO01END007INV < 13.85        RMB0004
QUANNW           MOVE 1 TO CO01END007IN-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END007IN-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007IN-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END005IN      TO CO01END005IN.                        RMB0004
QUANNW     IF CO01END005IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END005IN(1:8)  TO CO01END005INV(1:8)             RMB0004
QUANNW        MOVE CO01END005IN(10:2) TO CO01END005INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END005INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END005IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END005INV AND CO01END005INV <  0.51        RMB0004
QUANNW           MOVE 1 TO CO01END005IN-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END005IN-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END005IN-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END038RO      TO CO01END038RO.                        RMB0004
QUANNW     IF CO01END038RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END038RO(1:8)  TO CO01END038ROV(1:8)             RMB0004
QUANNW        MOVE CO01END038RO(10:2) TO CO01END038ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END038ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END038RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END038ROV AND CO01END038ROV <  4.33        RMB0004
QUANNW           MOVE 1 TO CO01END038RO-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END038RO-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END038RO-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END055IN      TO CO01END055IN.                        RMB0004
QUANNW     IF CO01END055IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END055IN(1:8)  TO CO01END055INV(1:8)             RMB0004
QUANNW        MOVE CO01END055IN(10:2) TO CO01END055INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END055INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END055IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END055INV AND CO01END055INV <  0.45        RMB0004
QUANNW           MOVE 1 TO CO01END055IN-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END055IN-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END055IN-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END052IN      TO CO01END052IN.                        RMB0004
QUANNW     IF CO01END052IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END052IN(1:8)  TO CO01END052INV(1:8)             RMB0004
QUANNW        MOVE CO01END052IN(10:2) TO CO01END052INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END052INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END052IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END052INV AND CO01END052INV <  9.95        RMB0004
QUANNW           MOVE 1 TO CO01END052IN-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END052IN-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END052IN-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END068RO      TO CO01END068RO.                        RMB0004
QUANNW     IF CO01END068RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END068RO(1:8)  TO CO01END068ROV(1:8)             RMB0004
QUANNW        MOVE CO01END068RO(10:2) TO CO01END068ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END068ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END068RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END068ROV AND CO01END068ROV <  4.19        RMB0004
QUANNW           MOVE 1 TO CO01END068RO-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END068RO-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END068RO-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END018RO      TO CO01END018RO.                        RMB0004
QUANNW     IF CO01END018RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END018RO(1:8)  TO CO01END018ROV(1:8)             RMB0004
QUANNW        MOVE CO01END018RO(10:2) TO CO01END018ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END018ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END018RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END018ROV AND CO01END018ROV <  0.44        RMB0004
QUANNW           MOVE 1 TO CO01END018RO-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END018RO-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END018RO-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02END010RO      TO CO02END010RO.                        RMB0004
QUANNW     IF CO02END010RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO02END010RO(1:8)  TO CO02END010ROV(1:8)             RMB0004
QUANNW        MOVE CO02END010RO(10:2) TO CO02END010ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02END010ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO02END010RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO02END010ROV AND CO02END010ROV < 11.93        RMB0004
QUANNW           MOVE 1 TO CO02END010RO-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO02END010RO-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO02END010RO-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END073RO      TO CO01END073RO.                        RMB0004
QUANNW     IF CO01END073RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END073RO(1:8)  TO CO01END073ROV(1:8)             RMB0004
QUANNW        MOVE CO01END073RO(10:2) TO CO01END073ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END073ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END073RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END073ROV AND CO01END073ROV < 22.79        RMB0004
QUANNW           MOVE 1 TO CO01END073RO-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END073RO-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END073RO-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02END010CB      TO CO02END010CB.                        RMB0004
QUANNW     IF CO02END010CB(9:1) = "."                                   RMB0004
QUANNW        MOVE CO02END010CB(1:8)  TO CO02END010CBV(1:8)             RMB0004
QUANNW        MOVE CO02END010CB(10:2) TO CO02END010CBV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02END010CBV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO02END010CB(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO02END010CBV AND CO02END010CBV <  3.98        RMB0004
QUANNW           MOVE 1 TO CO02END010CB-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO02END010CB-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO02END010CB-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END071RO      TO CO01END071RO.                        RMB0004
QUANNW     IF CO01END071RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END071RO(1:8)  TO CO01END071ROV(1:8)             RMB0004
QUANNW        MOVE CO01END071RO(10:2) TO CO01END071ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END071ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END071RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END071ROV AND CO01END071ROV < 23.56        RMB0004
QUANNW           MOVE 1 TO CO01END071RO-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END071RO-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END071RO-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02END007RO      TO CO02END007RO.                        RMB0004
QUANNW     IF CO02END007RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO02END007RO(1:8)  TO CO02END007ROV(1:8)             RMB0004
QUANNW        MOVE CO02END007RO(10:2) TO CO02END007ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02END007ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO02END007RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO02END007ROV AND CO02END007ROV <  5.74        RMB0004
QUANNW           MOVE 1 TO CO02END007RO-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO02END007RO-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO02END007RO-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02END009CB      TO CO02END009CB.                        RMB0004
QUANNW     IF CO02END009CB(9:1) = "."                                   RMB0004
QUANNW        MOVE CO02END009CB(1:8)  TO CO02END009CBV(1:8)             RMB0004
QUANNW        MOVE CO02END009CB(10:2) TO CO02END009CBV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02END009CBV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO02END009CB(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO02END009CBV AND CO02END009CBV <  3.91        RMB0004
QUANNW           MOVE 1 TO CO02END009CB-SEG2-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO02END009CB-SEG2-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO02END009CB-SEG2-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM006 TO CO00DEM006                                  RMB0004
QUANNW     IF CO00DEM006 = "-1"                                         RMB0004
QUANNW        MOVE 1 TO CO00DEM006-SEG2                                 RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM006(2:1) TO CO00DEM006-SEG2(1:1)              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM030 TO CO00DEM030.                                 RMB0004
QUANNW     IF CO00DEM030 =  "  -1"                                      RMB0004
QUANNW        MOVE 1 TO CO00DEM030-SEG2-D02                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM030-SEG2-D02                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM026 TO CO00DEM026.                                 RMB0004
QUANNW     IF 01 <= CO00DEM026  AND CO00DEM026 <= 03                    RMB0004
QUANNW        MOVE 1 TO CO00DEM026-SEG2-D02                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-SEG2-D02                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF CO00DEM026 = 04                                           RMB0004
QUANNW        MOVE 1 TO CO00DEM026-SEG2-D04                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-SEG2-D04                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 05 <= CO00DEM026  AND CO00DEM026 <= 06                    RMB0004
QUANNW        MOVE 1 TO CO00DEM026-SEG2-D05                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-SEG2-D05                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    ESTANDARIZACION DE VARIABLES                                 RMB0004
QUANNW     COMPUTE S-CO00DEM030-SEG2-D02 = -0.5948268320469 +           RMB0004
QUANNW                2.27596664878375 * CO00DEM030-SEG2-D02.           RMB0004
QUANNW     COMPUTE S-CO00DEM003-SEG2 = -4.41184597810805 +              RMB0004
QUANNW                0.10000526411541 * CO00DEM003-SEG2.               RMB0004
QUANNW     COMPUTE S-CO00DEM006-SEG2 = -0.98868044589654 +              RMB0004
QUANNW                2.00011652270768 * CO00DEM006-SEG2.               RMB0004
QUANNW     COMPUTE S-CO01END005IN-SEG2-D01 = -0.38586267071576 +        RMB0004
QUANNW                2.97742476601389 * CO01END005IN-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END007IN-SEG2-D01 = -0.42756913968469 +        RMB0004
QUANNW                2.76634193361204 * CO01END007IN-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END018RO-SEG2-D01 = -0.89761305972673 +        RMB0004
QUANNW                2.01166444365147 * CO01END018RO-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END023IN-SEG2-D01 = -0.42292718808552 +        RMB0004
QUANNW                2.78736981459093 * CO01END023IN-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END028RO-SEG2 = -1.18984804508558 +            RMB0004
QUANNW                2.09552618125101 * CO01END028RO-SEG2.             RMB0004
QUANNW     COMPUTE S-CO01END030RO-SEG2 = -1.16783883747552 +            RMB0004
QUANNW                0.25678621008579 * CO01END030RO-SEG2.             RMB0004
QUANNW     COMPUTE S-CO01END038RO-SEG2-D01 = -0.50515086498476 +        RMB0004
QUANNW                2.48473189855906 * CO01END038RO-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END052IN-SEG2-D01 = -0.59215805914428 +        RMB0004
QUANNW                2.28087453606355 * CO01END052IN-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END055IN-SEG2-D01 = -0.33872086450769 +        RMB0004
QUANNW                3.29096613841747 * CO01END055IN-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END068RO-SEG2-D01 = -0.47795925404166 +        RMB0004
QUANNW                2.57016076067955 * CO01END068RO-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END071RO-SEG2-D01 = -0.53962532125836 +        RMB0004
QUANNW                2.39273901333937 * CO01END071RO-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END073RO-SEG2-D01 = -0.50668265162936 +        RMB0004
QUANNW                2.48027907969293 * CO01END073RO-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO01END089RO-SEG2 = -1.79105268165967 +            RMB0004
QUANNW                0.0341527701149 * CO01END089RO-SEG2.              RMB0004
QUANNW     COMPUTE S-CO02END007RO-SEG2-D01 = -0.48291237680147 +        RMB0004
QUANNW                2.55365464694334 * CO02END007RO-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO02END009CB-SEG2-D01 = -0.50938138506854 +        RMB0004
QUANNW                2.47252157968506 * CO02END009CB-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO02END010CB-SEG2-D01 = -0.5030331479841 +         RMB0004
QUANNW                2.49094801090103 * CO02END010CB-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CO02END010RO-SEG2-D01 = -0.69723782519779 +        RMB0004
QUANNW                2.13145013451106 * CO02END010RO-SEG2-D01.         RMB0004
QUANNW     COMPUTE S-CUOTATOTAL-SEG2 = -1.20406076693429 +              RMB0004
QUANNW                0.45336046891618 * CUOTATOTAL-SEG2.               RMB0004
QUANNW     COMPUTE S-CUPOTOTAL-SEG2 = -1.44552200078893 +               RMB0004
QUANNW                0.02276173748696 * CUPOTOTAL-SEG2.                RMB0004
QUANNW     COMPUTE S-CO00DEM026-SEG2-D02 = -0.64638930911865 +          RMB0004
QUANNW                2.19342459777614 * CO00DEM026-SEG2-D02.           RMB0004
QUANNW     COMPUTE S-CO00DEM026-SEG2-D04 = -0.431728379188 +            RMB0004
QUANNW                2.74796960775459 * CO00DEM026-SEG2-D04.           RMB0004
QUANNW     COMPUTE S-CO00DEM026-SEG2-D05 = -0.40654768285271 +          RMB0004
QUANNW                2.86625195272004 * CO00DEM026-SEG2-D05.           RMB0004
QUANNW     COMPUTE S-TIPORELD03 = -0.83948955793379 +                   RMB0004
QUANNW                2.03067420337324 * TIPORELD03.                    RMB0004
QUANNW     COMPUTE S-TIPORELD04 = -0.87537940577349 +                   RMB0004
QUANNW                2.01772644389451 * TIPORELD04.                    RMB0004
QUANNW*    CALCULO PRIMERA CAPA DE LA RED NEURONAL                      RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW        H11-SEG2 = (0.12567434535882 * S-CO00DEM030-SEG2-D02) +   RMB0004
QUANNW                   (-0.08943189521419 * S-CO00DEM003-SEG2) +      RMB0004
QUANNW                   (-0.05001627576288 * S-CO00DEM006-SEG2) +      RMB0004
QUANNW                   (-0.06811269010908 * S-CO01END005IN-SEG2-D01) +RMB0004
QUANNW                   (0.13338269971577 * S-CO01END007IN-SEG2-D01) + RMB0004
QUANNW                   (0.1402123564076 * S-CO01END018RO-SEG2-D01) +  RMB0004
QUANNW                   (-0.04441174099641 * S-CO01END023IN-SEG2-D01) +RMB0004
QUANNW                   (0.12006501739414 * S-CO01END028RO-SEG2) +     RMB0004
QUANNW                   (-0.00230305383334 * S-CO01END030RO-SEG2) +    RMB0004
QUANNW                   (0.0945321838144 * S-CO01END038RO-SEG2-D01) +  RMB0004
QUANNW                   (0.03510475108457 * S-CO01END052IN-SEG2-D01) + RMB0004
QUANNW                   (0.02520552767771 * S-CO01END055IN-SEG2-D01) + RMB0004
QUANNW                   (-0.05797575911834 * S-CO01END068RO-SEG2-D01) +RMB0004
QUANNW                   (0.17312088918243 * S-CO01END071RO-SEG2-D01) + RMB0004
QUANNW                   (-0.06836298190273 * S-CO01END073RO-SEG2-D01) +RMB0004
QUANNW                   (-0.04517175326368 * S-CO01END089RO-SEG2) +    RMB0004
QUANNW                   (0.02302932178987 * S-CO02end007RO-SEG2-D01) + RMB0004
QUANNW                   (-0.00110772840593 * S-CO02end009CB-SEG2-D01) +RMB0004
QUANNW                   (0.08067231760153 * S-CO02end010CB-SEG2-D01) + RMB0004
QUANNW                   (0.06044325126833 * S-CO02end010RO-SEG2-D01) + RMB0004
QUANNW                   (1.11885671684184 * S-CUOTATOTAL-SEG2) +       RMB0004
QUANNW                   (-0.76009902193505 * S-CUPOTOTAL-SEG2) +       RMB0004
QUANNW                   (0.05226621811829 * S-CO00DEM026-SEG2-D02) +   RMB0004
QUANNW                   (0.02281668850686 * S-CO00DEM026-SEG2-D04) +   RMB0004
QUANNW                   (-0.00012859495647 * S-CO00DEM026-SEG2-D05) +  RMB0004
QUANNW                   (0.12792681132216 * S-TIPORELD03) +            RMB0004
QUANNW                   (0.14837494690319 * S-TIPORELD04).             RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW        H12-SEG2 = (-0.13264884837143 * S-CO00DEM030-SEG2-D02) +  RMB0004
QUANNW                   (-0.01265265982587 * S-CO00DEM003-SEG2) +      RMB0004
QUANNW                   (-0.03419696843688 * S-CO00DEM006-SEG2) +      RMB0004
QUANNW                   (-0.00030226535762 * S-CO01END005IN-SEG2-D01) +RMB0004
QUANNW                   (-0.03495905973802 * S-CO01END007IN-SEG2-D01) +RMB0004
QUANNW                   (-0.04013720282266 * S-CO01END018RO-SEG2-D01) +RMB0004
QUANNW                   (-0.01843511214697 * S-CO01END023IN-SEG2-D01) +RMB0004
QUANNW                   (0.03192612128791 * S-CO01END028RO-SEG2) +     RMB0004
QUANNW                   (0.083404898662 * S-CO01END030RO-SEG2) +       RMB0004
QUANNW                   (-0.01911255390677 * S-CO01END038RO-SEG2-D01) +RMB0004
QUANNW                   (-0.02133116306912 * S-CO01END052IN-SEG2-D01) +RMB0004
QUANNW                   (-0.02658276781032 * S-CO01END055IN-SEG2-D01) +RMB0004
QUANNW                   (0.00260895759409 * S-CO01END068RO-SEG2-D01) + RMB0004
QUANNW                   (-0.00125064295422 * S-CO01END071RO-SEG2-D01) +RMB0004
QUANNW                   (0.02800158378354 * S-CO01END073RO-SEG2-D01) + RMB0004
QUANNW                   (-0.0130302186867 * S-CO01END089RO-SEG2) +     RMB0004
QUANNW                   (-0.01985501201313 * S-CO02end007RO-SEG2-D01) +RMB0004
QUANNW                   (-0.01970987048262 * S-CO02end009CB-SEG2-D01) +RMB0004
QUANNW                   (-0.04088041550946 * S-CO02end010CB-SEG2-D01) +RMB0004
QUANNW                   (-0.04501183320839 * S-CO02end010RO-SEG2-D01) +RMB0004
QUANNW                   (-0.08220205178315 * S-CUOTATOTAL-SEG2) +      RMB0004
QUANNW                   (0.22787830374083 * S-CUPOTOTAL-SEG2) +        RMB0004
QUANNW                   (-0.02549215591355 * S-CO00DEM026-SEG2-D02) +  RMB0004
QUANNW                   (0.00541476801012 * S-CO00DEM026-SEG2-D04) +   RMB0004
QUANNW                   (0.01934259136796 * S-CO00DEM026-SEG2-D05) +   RMB0004
QUANNW                   (0.01271523131418 * S-TIPORELD03) +            RMB0004
QUANNW                   (-0.00063868157544 * S-TIPORELD04).            RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW        H13-SEG2 = (-9.1736236544404 * S-CO00DEM030-SEG2-D02) +   RMB0004
QUANNW                   (-8.18615886623924 * S-CO00DEM003-SEG2) +      RMB0004
QUANNW                   (-13.9967615158091 * S-CO00DEM006-SEG2) +      RMB0004
QUANNW                   (-5.88136731284942 * S-CO01END005IN-SEG2-D01) +RMB0004
QUANNW                   (0.11842028292239 * S-CO01END007IN-SEG2-D01) + RMB0004
QUANNW                   (7.70720978244334 * S-CO01END018RO-SEG2-D01) + RMB0004
QUANNW                   (0.08161502169264 * S-CO01END023IN-SEG2-D01) + RMB0004
QUANNW                   (6.85066410087946 * S-CO01END028RO-SEG2) +     RMB0004
QUANNW                   (5.36094759247846 * S-CO01END030RO-SEG2) +     RMB0004
QUANNW                   (-25.0989438068673 * S-CO01END038RO-SEG2-D01) +RMB0004
QUANNW                   (-2.62284505179988 * S-CO01END052IN-SEG2-D01) +RMB0004
QUANNW                   (-0.22102351726999 * S-CO01END055IN-SEG2-D01) +RMB0004
QUANNW                   (-8.87619798622583 * S-CO01END068RO-SEG2-D01) +RMB0004
QUANNW                   (4.56051891926259 * S-CO01END071RO-SEG2-D01) + RMB0004
QUANNW                   (-0.26223280511545 * S-CO01END073RO-SEG2-D01) +RMB0004
QUANNW                   (1.82886873445989 * S-CO01END089RO-SEG2) +     RMB0004
QUANNW                   (1.81645464668165 * S-CO02end007RO-SEG2-D01) + RMB0004
QUANNW                   (-3.35296558442434 * S-CO02end009CB-SEG2-D01) +RMB0004
QUANNW                   (5.42390864959647 * S-CO02end010CB-SEG2-D01) + RMB0004
QUANNW                   (-11.5681980762085 * S-CO02end010RO-SEG2-D01) +RMB0004
QUANNW                   (9.40175848565896 * S-CUOTATOTAL-SEG2) +       RMB0004
QUANNW                   (9.52131140110358 * S-CUPOTOTAL-SEG2) +        RMB0004
QUANNW                   (-3.25101521814533 * S-CO00DEM026-SEG2-D02) +  RMB0004
QUANNW                   (4.14656246993514 * S-CO00DEM026-SEG2-D04) +   RMB0004
QUANNW                   (6.18179919505148 * S-CO00DEM026-SEG2-D05) +   RMB0004
QUANNW                   (2.04848073499737 * S-TIPORELD03) +            RMB0004
QUANNW                   (1.07021103994519 * S-TIPORELD04).             RMB0004
QUANNW     COMPUTE H11-SEG2  =  ( 0.34875470221066 + H11-SEG2).         RMB0004
QUANNW     COMPUTE H12-SEG2  =  ( 0.07147676701783 + H12-SEG2).         RMB0004
QUANNW     COMPUTE H13-SEG2  =  (-29.4054381320762 + H13-SEG2).         RMB0004
QUANNW     COMPUTE H11A-SEG2=   (2.7182818284 ** (H11-SEG2)  -          RMB0004
QUANNW                           2.7182818284 ** (-H11-SEG2)) /         RMB0004
QUANNW                          (2.7182818284 ** (H11-SEG2) +           RMB0004
QUANNW                           2.7182818284 ** (-H11-SEG2)).          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE H12A-SEG2=   (2.7182818284 ** (H12-SEG2)  -          RMB0004
QUANNW                           2.7182818284 ** (-H12-SEG2)) /         RMB0004
QUANNW                          (2.7182818284 ** (H12-SEG2) +           RMB0004
QUANNW                           2.7182818284 ** (-H12-SEG2)).          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE H13A-SEG2=   (2.7182818284 ** (H13-SEG2)  -          RMB0004
QUANNW                           2.7182818284 ** (-H13-SEG2)) /         RMB0004
QUANNW                          (2.7182818284 ** (H13-SEG2) +           RMB0004
QUANNW                           2.7182818284 ** (-H13-SEG2)).          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE S1-INGRESO-C = 7.4703883363573 +                     RMB0004
QUANNW                          ((1.39807504552871 * H11A-SEG2) +       RMB0004
QUANNW                           (5.67705600028124 * H12A-SEG2) +       RMB0004
QUANNW                           (0.36257989200985 * H13A-SEG2)).       RMB0004
QUANNW     IF S1-INGRESO-C < 1                                          RMB0004
QUANNW        MOVE 1 TO S1-INGRESO-C                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        IF S1-INGRESO-C > 27.92                                   RMB0004
QUANNW           MOVE 27.92   TO S1-INGRESO-C                           RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE S1-INGRESO-C TO S1-INGRESO-C                      RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     COMPUTE S1-INGRESO-INF-C     = S1-INGRESO-C     -            RMB0004
QUANNW        S1-INGRESO-C * K-INTERVALO-USAPI  .                       RMB0004
QUANNW     COMPUTE S1-INGRESO-SUP-C     = S1-INGRESO-C     +            RMB0004
QUANNW        S1-INGRESO-C * K-INTERVALO-USAPI  .                       RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI1 .                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI2 .                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-N-USAPI.                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI  .                    RMB0004
QUANNW     MOVE S1-INGRESO-INF-C TO INGRESO-INF-USAPI .                 RMB0004
QUANNW     MOVE S1-INGRESO-INF-C TO INGRESO-INF-N-USAPI .               RMB0004
QUANNW     MOVE S1-INGRESO-SUP-C TO INGRESO-SUP-USAPI.                  RMB0004
QUANNW     MOVE S1-INGRESO-SUP-C TO INGRESO-SUP-N-USAPI.                RMB0004
QUANNW     PERFORM 8000-CAL-SALIDA-PESOS-USAPI.                         RMB0004
QUANNW 6300-SCORE-CARD3-USAPI.                                          RMB0004
REMARK********************************************************************
REMARK*6300-SCORE-CARD3-USAPI.
REMARK*    SE CALCULA EL INGRESO PARA LA PERSONA CLASIFICADA EN EL SEGMENTO
REMARK*    DOS, DE INGRESOS BAJOS     (RENTA MEDIA-BAJA)  
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAPI(1) .
QUANNW     PERFORM 5220-SALDOTOTALHP-USAPI.                             RMB0004
QUANNW     PERFORM 5250-CUOTATOTALHP-3-USAPI.                           RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF CUPOTOTAL-USAPI < 0                                       RMB0004
QUANNW        MOVE 44.15           TO CUPOTOTAL-SEG3                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CUPOTOTAL-USAPI TO CUPOTOTAL-SEG3                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02NUM003TO      TO CO02NUM003TO.                        RMB0004
QUANNW     IF CO02NUM003TO NOT NUMERIC                                  RMB0004
QUANNW        MOVE 0 TO CO02NUM003TO-SEG3                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO02NUM003TO TO CO02NUM003TO-SEG3                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01EXP001RO      TO CO01EXP001RO.                        RMB0004
QUANNW     IF CO01EXP001RO NOT NUMERIC                                  RMB0004
QUANNW        MOVE 0 TO CO01EXP001RO-SEG3                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO01EXP001RO TO CO01EXP001RO-SEG3                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF SALDOTOTALHP-USAPI < 0                                    RMB0004
QUANNW        MOVE 23.91              TO SALDOTOTALHP-SEG3              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE SALDOTOTALHP-USAPI TO SALDOTOTALHP-SEG3              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02EXP012TO      TO CO02EXP012TO.                        RMB0004
QUANNW     IF CO02EXP012TO(6:1) = "."                                   RMB0004
QUANNW        MOVE CO02EXP012TO(1:5)  TO CO02EXP012TOV(1:5)             RMB0004
QUANNW        MOVE CO02EXP012TO(07:2) TO CO02EXP012TOV(6:2)             RMB0004
QUANNW        MOVE CO02EXP012TOV      TO CO02EXP012TO-SEG3              RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO02EXP012TO-SEG3              RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM003 TO CO00DEM003  .                               RMB0004
QUANNW     IF CO00DEM003 NOT NUMERIC OR CO00DEM003 = 000                RMB0004
QUANNW        MOVE 18             TO CO00DEM003-SEG3                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM003     TO CO00DEM003-SEG3                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     MOVE 02EXP001TO  TO CO02EXP001TO.                            RMB0004
QUANNW     IF CO02EXP001TO NOT NUMERIC THEN                             RMB0004
QUANNW        MOVE 000 TO CO02EXP001TO-SEG3                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO02EXP001TO TO CO02EXP001TO-SEG3                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    ACOTACION DE VARIABLES                                       RMB0004
QUANNW     IF CUPOTOTAL-SEG3   > 97.48                                  RMB0004
QUANNW        MOVE 97.48 TO CUPOTOTAL-SEG3.                             RMB0004
QUANNW     IF CO02EXP001TO-SEG3 > 284                                   RMB0004
QUANNW        MOVE 284   TO CO02EXP001TO-SEG3.                          RMB0004
QUANNW     IF CO02NUM003TO-SEG3 > 10                                    RMB0004
QUANNW        MOVE 10    TO CO02NUM003TO-SEG3.                          RMB0004
QUANNW     IF CO01EXP001RO-SEG3 >  229                                  RMB0004
QUANNW        MOVE 229   TO CO01EXP001RO-SEG3.                          RMB0004
QUANNW     IF SALDOTOTALHP-SEG3    >  53.65                             RMB0004
QUANNW        MOVE   53.65 TO SALDOTOTALHP-SEG3.                        RMB0004
QUANNW     IF CO02EXP012TO-SEG3 > 100                                   RMB0004
QUANNW        MOVE 100   TO CO02EXP012TO-SEG3.                          RMB0004
QUANNW     IF CO00DEM003-SEG3   > 59                                    RMB0004
QUANNW        MOVE  59   TO CO00DEM003-SEG3.                            RMB0004
QUANNW     IF CO00DEM003-SEG3   < 18                                    RMB0004
QUANNW        MOVE  18   TO CO00DEM003-SEG3.                            RMB0004
QUANNW*    VARIABLES DUMMYS                                             RMB0004
QUANNW     MOVE 01END030RO      TO CO01END030RO.                        RMB0004
QUANNW     IF CO01END030RO(9:1) =  "." *> NO NEGATIVO                   RMB0004
QUANNW        MOVE CO01END030RO(1:8)  TO CO01END030ROV(1:8)             RMB0004
QUANNW        MOVE CO01END030RO(10:2) TO CO01END030ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0                  TO CO01END030ROV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF  3.52 <= CO01END030ROV                                    RMB0004
QUANNW        MOVE 1 TO CO01END030RO-SEG3-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END030RO-SEG3-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END023IN      TO CO01END023IN.                        RMB0004
QUANNW     IF CO01END023IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END023IN(1:8)  TO CO01END023INV(1:8)             RMB0004
QUANNW        MOVE CO01END023IN(10:2) TO CO01END023INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END023INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END023IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END023INV AND CO01END023INV < 0.27         RMB0004
QUANNW           MOVE 1 TO CO01END023IN-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END023IN-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END023IN-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF    0.27 <= CO01END023INV AND CO01END023INV < 0.43         RMB0004
QUANNW        MOVE 1 TO CO01END023IN-SEG3-D02                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END023IN-SEG3-D02                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF    0.7 <= CO01END023INV                                   RMB0004
QUANNW        MOVE 1 TO CO01END023IN-SEG3-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END023IN-SEG3-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF   0.77 <= CUOTATOTALHP-3-USAPI AND                        RMB0004
QUANNW                  CUOTATOTALHP-3-USAPI < 1.46                     RMB0004
QUANNW        MOVE 1 TO CUOTATOTALHP-3-SEG3-D03                         RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CUOTATOTALHP-3-SEG3-D03                         RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF   1.46 <= CUOTATOTALHP-3-USAPI                            RMB0004
QUANNW        MOVE 1 TO CUOTATOTALHP-3-SEG3-D04                         RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CUOTATOTALHP-3-SEG3-D04                         RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END010RO      TO CO01END010RO.                        RMB0004
QUANNW     IF CO01END010RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END010RO(1:8)  TO CO01END010ROV(1:8)             RMB0004
QUANNW        MOVE CO01END010RO(10:2) TO CO01END010ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END010ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END010RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END010ROV AND CO01END010ROV <  0.69        RMB0004
QUANNW           MOVE 1 TO CO01END010RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END010RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END010RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 3.83 <= CO01END010ROV                                     RMB0004
QUANNW        MOVE 1 TO CO01END010RO-SEG3-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END010RO-SEG3-D04                           RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01EXP001CC TO CO01EXP001CC                              RMB0004
QUANNW     IF CO01EXP001CC NOT NUMERIC                                  RMB0004
QUANNW        MOVE 1 TO CO01EXP001CC-SEG3-D00                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01EXP001CC-SEG3-D00                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 059 <= CO01EXP001CC AND CO01EXP001CC < 091                RMB0004
QUANNW        MOVE 1 TO CO01EXP001CC-SEG3-D03                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01EXP001CC-SEG3-D03                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 091 <= CO01EXP001CC AND CO01EXP001CC NUMERIC              RMB0004
QUANNW        MOVE 1 TO CO01EXP001CC-SEG3-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01EXP001CC-SEG3-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END040RO      TO CO01END040RO.                        RMB0004
QUANNW     IF CO01END040RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END040RO(1:8)  TO CO01END040ROV(1:8)             RMB0004
QUANNW        MOVE CO01END040RO(10:2) TO CO01END040ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END040ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END040RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END040ROV AND CO01END040ROV < 0.65         RMB0004
QUANNW           MOVE 1 TO CO01END040RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END040RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END040RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END007IN      TO CO01END007IN.                        RMB0004
QUANNW     IF CO01END007IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007IN(1:8)  TO CO01END007INV(1:8)             RMB0004
QUANNW        MOVE CO01END007IN(10:2) TO CO01END007INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END007IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END007INV AND CO01END007INV < 6.5          RMB0004
QUANNW           MOVE 1 TO CO01END007IN-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END007IN-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007IN-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01NUM001CC TO CO01NUM001CC                              RMB0004
QUANNW     IF 0002 <= CO01NUM001CC AND CO01NUM001CC < 0003              RMB0004
QUANNW        MOVE 1 TO CO01NUM001CC-SEG3-D03                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01NUM001CC-SEG3-D03                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0003 <= CO01NUM001CC AND CO01NUM001CC NUMERIC             RMB0004
QUANNW        MOVE 1 TO CO01NUM001CC-SEG3-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01NUM001CC-SEG3-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END050RO      TO CO01END050RO.                        RMB0004
QUANNW     IF CO01END050RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END050RO(1:8)  TO CO01END050ROV(1:8)             RMB0004
QUANNW        MOVE CO01END050RO(10:2) TO CO01END050ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END050ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END050RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END050ROV AND CO01END050ROV < 0.67         RMB0004
QUANNW           MOVE 1 TO CO01END050RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END050RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END050RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END026IN      TO CO01END026IN.                        RMB0004
QUANNW     IF CO01END026IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END026IN(1:8)  TO CO01END026INV(1:8)             RMB0004
QUANNW        MOVE CO01END026IN(10:2) TO CO01END026INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END026INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END026IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END026INV AND CO01END026INV < 2.54         RMB0004
QUANNW           MOVE 1 TO CO01END026IN-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END026IN-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END026IN-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END060RO      TO CO01END060RO.                        RMB0004
QUANNW     IF CO01END060RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END060RO(1:8)  TO CO01END060ROV(1:8)             RMB0004
QUANNW        MOVE CO01END060RO(10:2) TO CO01END060ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END060ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END060RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END060ROV AND CO01END060ROV < 0.67         RMB0004
QUANNW           MOVE 1 TO CO01END060RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END060RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END060RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END070RO      TO CO01END070RO.                        RMB0004
QUANNW     IF CO01END070RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END070RO(1:8)  TO CO01END070ROV(1:8)             RMB0004
QUANNW        MOVE CO01END070RO(10:2) TO CO01END070ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END070ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END070RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END070ROV AND CO01END070ROV < 0.67         RMB0004
QUANNW           MOVE 1 TO CO01END070RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END070RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END070RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END007RO      TO CO01END007RO.                        RMB0004
QUANNW     IF CO01END007RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007RO(1:8)  TO CO01END007ROV(1:8)             RMB0004
QUANNW        MOVE CO01END007RO(10:2) TO CO01END007ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END007RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END007ROV AND CO01END007ROV < 3.9          RMB0004
QUANNW           MOVE 1 TO CO01END007RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END007RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF  3.9 <= CO01END007ROV AND CO01END007ROV < 8.66            RMB0004
QUANNW        MOVE 1 TO CO01END007RO-SEG3-D02                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007RO-SEG3-D02                           RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END037RO      TO CO01END037RO.                        RMB0004
QUANNW     IF CO01END037RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END037RO(1:8)  TO CO01END037ROV(1:8)             RMB0004
QUANNW        MOVE CO01END037RO(10:2) TO CO01END037ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END037ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END037RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END037ROV AND CO01END037ROV < 3.43         RMB0004
QUANNW           MOVE 1 TO CO01END037RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END037RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END037RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01ACP007CT TO CO01ACP007CT                              RMB0004
QUANNW     IF CO01ACP007CT NOT NUMERIC                                  RMB0004
QUANNW        MOVE 1 TO CO01ACP007CT-SEG3-D00                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01ACP007CT-SEG3-D00                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END071RO      TO CO01END071RO.                        RMB0004
QUANNW     IF CO01END071RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END071RO(1:8)  TO CO01END071ROV(1:8)             RMB0004
QUANNW        MOVE CO01END071RO(10:2) TO CO01END071ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END071ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END071RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END071ROV AND CO01END071ROV < 27.72        RMB0004
QUANNW           MOVE 1 TO CO01END071RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END071RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END071RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END072RO      TO CO01END072RO.                        RMB0004
QUANNW     IF CO01END072RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END072RO(1:8)  TO CO01END072ROV(1:8)             RMB0004
QUANNW        MOVE CO01END072RO(10:2) TO CO01END072ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END072ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END072RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END072ROV AND CO01END072ROV < 27.31        RMB0004
QUANNW           MOVE 1 TO CO01END072RO-SEG3-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END072RO-SEG3-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END072RO-SEG3-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END075RO      TO CO01END075RO.                        RMB0004
QUANNW     IF CO01END075RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END075RO(1:8)  TO CO01END075ROV(1:8)             RMB0004
QUANNW        MOVE CO01END075RO(10:2) TO CO01END075ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END075ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END075RO(9:1) = "."                                   RMB0004
QUANNW        IF    87.62 <= CO01END075ROV                              RMB0004
QUANNW           MOVE 1 TO CO01END075RO-SEG3-D04                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END075RO-SEG3-D04                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END075RO-SEG3-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM006 TO CO00DEM006                                  RMB0004
QUANNW     IF CO00DEM006 = "-1"                                         RMB0004
QUANNW        MOVE 1 TO CO00DEM006-SEG3                                 RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM006(2:1) TO CO00DEM006-SEG3(1:1)              RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM030 TO CO00DEM030.                                 RMB0004
QUANNW     IF CO00DEM030 =  "  -1"                                      RMB0004
QUANNW        MOVE 1 TO CO00DEM030-SEG3-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM030-SEG3-D01                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM026 TO CO00DEM026.                                 RMB0004
QUANNW     IF 01 <= CO00DEM026  AND CO00DEM026 <= 03                    RMB0004
QUANNW        MOVE 1 TO CO00DEM026-SEG3-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-SEG3-D01                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 04 <= CO00DEM026  AND CO00DEM026 <= 06                    RMB0004
QUANNW        MOVE 1 TO CO00DEM026-SEG3-D02                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-SEG3-D02                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    ESTANDARIZACION DE VARIABLES                                 RMB0004
QUANNW     COMPUTE S-CO00DEM030-SEG3-D01 = -0.84304857999854 +          RMB0004
QUANNW             2.02921409867714 * CO00DEM030-SEG3-D01.              RMB0004
QUANNW     COMPUTE  S-CO00DEM003-SEG3 = -3.93376304076557 +             RMB0004
QUANNW             0.09932104713752 * CO00DEM003-SEG3.                  RMB0004
QUANNW     COMPUTE  S-CO01ACP007CT-SEG3-D00 = -1.79400682057515 +       RMB0004
QUANNW             2.35141560224558 * CO01ACP007CT-SEG3-D00.            RMB0004
QUANNW     COMPUTE  S-CO01END007IN-SEG3-D01 = -0.36210787860135 +       RMB0004
QUANNW             3.12370246203797 * CO01END007IN-SEG3-D01.            RMB0004
QUANNW     COMPUTE  S-CO01END007RO-SEG3-D01 = -0.47431735784799 +       RMB0004
QUANNW             2.58260021872042 * CO01END007RO-SEG3-D01.            RMB0004
QUANNW     COMPUTE  S-CO01END007RO-SEG3-D02 = -0.47971112440963 +       RMB0004
QUANNW             2.56428891567076 * CO01END007RO-SEG3-D02.            RMB0004
QUANNW     COMPUTE  S-CO01END010RO-SEG3-D01 = -0.45247407811019 +       RMB0004
QUANNW              2.66253473029566 * CO01END010RO-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END010RO-SEG3-D04 = -0.4560044526335 +        RMB0004
QUANNW              2.64895487316138 * CO01END010RO-SEG3-D04.           RMB0004
QUANNW     COMPUTE  S-CO01END023IN-SEG3-D01 = -0.35941547955792 +       RMB0004
QUANNW              3.14169730391119 * CO01END023IN-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END023IN-SEG3-D02 = -0.37475123161499 +       RMB0004
QUANNW              3.04317516675656 * CO01END023IN-SEG3-D02.           RMB0004
QUANNW     COMPUTE  S-CO01END023IN-SEG3-D04 = -0.37089139590094 +       RMB0004
QUANNW              3.06708539559217 * CO01END023IN-SEG3-D04.           RMB0004
QUANNW     COMPUTE  S-CO01END026IN-SEG3-D01 = -0.40258138469948 +       RMB0004
QUANNW              2.8865391486972 * CO01END026IN-SEG3-D01.            RMB0004
QUANNW     COMPUTE  S-CO01END030RO-SEG3-D04 = -0.48028401444411 +       RMB0004
QUANNW              2.56237528979633 * CO01END030RO-SEG3-D04.           RMB0004
QUANNW     COMPUTE  S-CO01END037RO-SEG3-D01 = -0.44010453322374 +       RMB0004
QUANNW              2.71228098375997 * CO01END037RO-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END040RO-SEG3-D01 = -0.4143681647534 +        RMB0004
QUANNW              2.82766928493077 * CO01END040RO-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END050RO-SEG3-D01 = -0.39176754266264 +       RMB0004
QUANNW              2.94428924818415 * CO01END050RO-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END060RO-SEG3-D01 = -0.37922627588241 +       RMB0004
QUANNW              3.01616158274733 * CO01END060RO-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END070RO-SEG3-D01 = -0.36311689201571 +       RMB0004
QUANNW              3.11703767662619 * CO01END070RO-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END071RO-SEG3-D01 = -0.4730220002751 +        RMB0004
QUANNW              2.58707833504103 * CO01END071RO-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END072RO-SEG3-D01 = -0.43556395061338 +       RMB0004
QUANNW              2.73142694560409 * CO01END072RO-SEG3-D01.           RMB0004
QUANNW     COMPUTE  S-CO01END075RO-SEG3-D04 = -0.38057032015626 +       RMB0004
QUANNW              3.00819287294661 * CO01END075RO-SEG3-D04.           RMB0004
QUANNW     COMPUTE  S-CO01EXP001CC-SEG3-D00 = -0.56839926499957 +       RMB0004
QUANNW              2.32771743752743 * CO01EXP001CC-SEG3-D00.           RMB0004
QUANNW     COMPUTE  S-CO01EXP001CC-SEG3-D03 = -0.48513537926162 +       RMB0004
QUANNW              2.54640569454397 * CO01EXP001CC-SEG3-D03.           RMB0004
QUANNW     COMPUTE  S-CO01EXP001CC-SEG3-D04 = -0.48830992836185 +       RMB0004
QUANNW              2.53617973006738 * CO01EXP001CC-SEG3-D04.           RMB0004
QUANNW     COMPUTE  S-CO01EXP001RO-SEG3 = -1.08441461090889 +           RMB0004
QUANNW              0.01517858044249 * CO01EXP001RO-SEG3.               RMB0004
QUANNW     COMPUTE  S-CO01NUM001CC-SEG3-D03 = -0.49673006536673 +       RMB0004
QUANNW              2.50988615533875 * CO01NUM001CC-SEG3-D03.           RMB0004
QUANNW     COMPUTE  S-CO01NUM001CC-SEG3-D04 = -0.66273034366176 +       RMB0004
QUANNW              2.17163236652673 * CO01NUM001CC-SEG3-D04.           RMB0004
QUANNW     COMPUTE  S-CO02EXP001TO-SEG3 = -1.86887249284818 +           RMB0004
QUANNW              0.01415554121272 * CO02EXP001TO-SEG3.               RMB0004
QUANNW     COMPUTE  S-CO02EXP012TO-SEG3 = -3.20670108663652 +           RMB0004
QUANNW              0.0418338041941 * CO02EXP012TO-SEG3.                RMB0004
QUANNW     COMPUTE  S-CO02NUM003TO-SEG3 = -1.8444411574393 +            RMB0004
QUANNW              0.39524723694314 * CO02NUM003TO-SEG3.               RMB0004
QUANNW     COMPUTE  S-CUOTATOTALHP-3-SEG3-D03 = -0.4988890031871 +      RMB0004
QUANNW              2.50333317769659 * CUOTATOTALHP-3-SEG3-D03.         RMB0004
QUANNW     COMPUTE  S-CUOTATOTALHP-3-SEG3-D04 = -0.50280060266353 +     RMB0004
QUANNW              2.49165095580126 * CUOTATOTALHP-3-SEG3-D04.         RMB0004
QUANNW     COMPUTE  S-CUPOTOTAL-SEG3 = -1.16918420681315 +              RMB0004
QUANNW              0.03783354376944 * CUPOTOTAL-SEG3.                  RMB0004
QUANNW     COMPUTE  S-CO00DEM026-SEG3-D01 = -0.6816721821618 +          RMB0004
QUANNW              2.14864587176421 * CO00DEM026-SEG3-D01.             RMB0004
QUANNW     COMPUTE  S-CO00DEM026-SEG3-D02 = -0.44447245141391 +         RMB0004
QUANNW              2.69431977712362 * CO00DEM026-SEG3-D02.             RMB0004
QUANNW     COMPUTE  S-SALDOTOTALHP-SEG3 = -1.04719410138738 +           RMB0004
QUANNW              0.06521628106844 * SALDOTOTALHP-SEG3.               RMB0004
QUANNW     COMPUTE  S-TIPORELD03 = -0.68110821976597 +                  RMB0004
QUANNW              2.1492965738998 * TIPORELD03.                       RMB0004
QUANNW*    CALCULO PRIMERA CAPA DE LA RED NEURONAL                      RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW       H11-SEG3 = (0.20372952972248 * S-CO00DEM030-SEG3-D01) +    RMB0004
QUANNW                (-0.12002394325154 * S-CO00DEM003-SEG3) +         RMB0004
QUANNW                (0.36472375680468 * S-CO01ACP007CT-SEG3-D00) +    RMB0004
QUANNW                (0.07516315368738 * S-CO01END007IN-SEG3-D01) +    RMB0004
QUANNW                (0.14639044904226 * S-CO01END007RO-SEG3-D01) +    RMB0004
QUANNW                (0.04492443352567 * S-CO01END007RO-SEG3-D02) +    RMB0004
QUANNW                (0.12765087777223 * S-CO01END010RO-SEG3-D01) +    RMB0004
QUANNW                (-0.25173172166107 * S-CO01END010RO-SEG3-D04) +   RMB0004
QUANNW                (0.09087707353467 * S-CO01END023IN-SEG3-D01) +    RMB0004
QUANNW                (-0.06748966260415 * S-CO01END023IN-SEG3-D02) +   RMB0004
QUANNW                (0.06319531233748 * S-CO01END023IN-SEG3-D04) +    RMB0004
QUANNW                (0.16728870338002 * S-CO01END026IN-SEG3-D01) +    RMB0004
QUANNW                (0.20239645621044 * S-CO01END030RO-SEG3-D04) +    RMB0004
QUANNW                (-0.0000891552769 * S-CO01END037RO-SEG3-D01) +    RMB0004
QUANNW                (0.14417215085685 * S-CO01END040RO-SEG3-D01) +    RMB0004
QUANNW                (0.04032061301637 * S-CO01END050RO-SEG3-D01) +    RMB0004
QUANNW                (-0.10084992837194 * S-CO01END060RO-SEG3-D01) +   RMB0004
QUANNW                (0.27282540740658 * S-CO01END070RO-SEG3-D01) +    RMB0004
QUANNW                (0.02973844804426 * S-CO01END071RO-SEG3-D01) +    RMB0004
QUANNW                (-0.40888504372911 * S-CO01END072RO-SEG3-D01) +   RMB0004
QUANNW                (-0.39007651445785 * S-CO01END075RO-SEG3-D04) +   RMB0004
QUANNW                (0.28278136511004 * S-CO01EXP001CC-SEG3-D00) +    RMB0004
QUANNW                (-0.02779891582673 * S-CO01EXP001CC-SEG3-D03) +   RMB0004
QUANNW                (-0.16759354467812 * S-CO01EXP001CC-SEG3-D04) +   RMB0004
QUANNW                (-0.04315881011172 * S-CO01EXP001RO-SEG3) +       RMB0004
QUANNW                (0.01730672017883 * S-CO01NUM001CC-SEG3-D03) +    RMB0004
QUANNW                (-0.16151899694783 * S-CO01NUM001CC-SEG3-D04) +   RMB0004
QUANNW                (-0.12228780465961 * S-CO02EXP001TO-SEG3) +       RMB0004
QUANNW                (0.2093090259572 * S-CO02EXP012TO-SEG3) +         RMB0004
QUANNW                (-0.04351290219354 * S-CO02NUM003TO-SEG3) +       RMB0004
QUANNW                (-0.10761010302152 * S-CUOTATOTALHP-3-SEG3-D03) + RMB0004
QUANNW                (-0.2391633685513 * S-CUOTATOTALHP-3-SEG3-D04) +  RMB0004
QUANNW                (-0.11437637227161 * S-CUPOTOTAL-SEG3) +          RMB0004
QUANNW                (-0.01297770634084 * S-CO00DEM026-SEG3-D01) +     RMB0004
QUANNW                (-0.15963266866653 * S-CO00DEM026-SEG3-D02) +     RMB0004
QUANNW                (-0.29347319994725 * S-SALDOTOTALHP-SEG3) +       RMB0004
QUANNW                (0.09218283727565 * S-TIPORELD03).                RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW       H12-SEG3 = (-0.86045662855034 * S-CO00DEM030-SEG3-D01) +   RMB0004
QUANNW                (0.03034306390033 * S-CO00DEM003-SEG3) +          RMB0004
QUANNW                (-0.8894087307701 * S-CO01ACP007CT-SEG3-D00) +    RMB0004
QUANNW                (-0.07999250702095 * S-CO01END007IN-SEG3-D01) +   RMB0004
QUANNW                (-0.03029382268948 * S-CO01END007RO-SEG3-D01) +   RMB0004
QUANNW                (0.35972689373435 * S-CO01END007RO-SEG3-D02) +    RMB0004
QUANNW                (-0.06733253582469 * S-CO01END010RO-SEG3-D01) +   RMB0004
QUANNW                (0.15576117012827 * S-CO01END010RO-SEG3-D04) +    RMB0004
QUANNW                (-0.40641693919893 * S-CO01END023IN-SEG3-D01) +   RMB0004
QUANNW                (-0.2660632950013 * S-CO01END023IN-SEG3-D02) +    RMB0004
QUANNW                (0.58412912908272 * S-CO01END023IN-SEG3-D04) +    RMB0004
QUANNW                (0.06008194658024 * S-CO01END026IN-SEG3-D01) +    RMB0004
QUANNW                (0.27040049047191 * S-CO01END030RO-SEG3-D04) +    RMB0004
QUANNW                (-0.23620332562172 * S-CO01END037RO-SEG3-D01) +   RMB0004
QUANNW                (-0.14869327598309 * S-CO01END040RO-SEG3-D01) +   RMB0004
QUANNW                (-0.09972698268471 * S-CO01END050RO-SEG3-D01) +   RMB0004
QUANNW                (-0.32482107418525 * S-CO01END060RO-SEG3-D01) +   RMB0004
QUANNW                (-0.02857780537746 * S-CO01END070RO-SEG3-D01) +   RMB0004
QUANNW                (0.10798209414 * S-CO01END071RO-SEG3-D01) +       RMB0004
QUANNW                (-0.04730055859218 * S-CO01END072RO-SEG3-D01) +   RMB0004
QUANNW                (-0.25691184046574 * S-CO01END075RO-SEG3-D04) +   RMB0004
QUANNW                (-0.00690801303523 * S-CO01EXP001CC-SEG3-D00) +   RMB0004
QUANNW                (0.03975321911246 * S-CO01EXP001CC-SEG3-D03) +    RMB0004
QUANNW                (0.29615799246692 * S-CO01EXP001CC-SEG3-D04) +    RMB0004
QUANNW                (0.14971692053876 * S-CO01EXP001RO-SEG3) +        RMB0004
QUANNW                (0.11222577698671 * S-CO01NUM001CC-SEG3-D03) +    RMB0004
QUANNW                (0.10677387144327 * S-CO01NUM001CC-SEG3-D04) +    RMB0004
QUANNW                (0.07956512276331 * S-CO02EXP001TO-SEG3) +        RMB0004
QUANNW                (-0.08069786919315 * S-CO02EXP012TO-SEG3) +       RMB0004
QUANNW                (0.57460459736727 * S-CO02NUM003TO-SEG3) +        RMB0004
QUANNW                (0.13894036056146 * S-CUOTATOTALHP-3-SEG3-D03) +  RMB0004
QUANNW                (0.56913366896222 * S-CUOTATOTALHP-3-SEG3-D04) +  RMB0004
QUANNW                (0.25685643601498 * S-CUPOTOTAL-SEG3) +           RMB0004
QUANNW                (-0.23684216539631 * S-CO00DEM026-SEG3-D01) +     RMB0004
QUANNW                (0.27489174330111 * S-CO00DEM026-SEG3-D02) +      RMB0004
QUANNW                (0.27302309019305 * S-SALDOTOTALHP-SEG3) +        RMB0004
QUANNW                (0.11289169691307 * S-TIPORELD03).                RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW       H13-SEG3 = (0.91769335498873 * S-CO00DEM030-SEG3-D01) +    RMB0004
QUANNW                (-0.06189211457558 * S-CO00DEM003-SEG3) +         RMB0004
QUANNW                (0.57912131117045 * S-CO01ACP007CT-SEG3-D00) +    RMB0004
QUANNW                (0.2413191378869 * S-CO01END007IN-SEG3-D01) +     RMB0004
QUANNW                (-0.0026991236584 * S-CO01END007RO-SEG3-D01) +    RMB0004
QUANNW                (0.02854958469778 * S-CO01END007RO-SEG3-D02) +    RMB0004
QUANNW                (-0.02791294991021 * S-CO01END010RO-SEG3-D01) +   RMB0004
QUANNW                (-0.16065352631661 * S-CO01END010RO-SEG3-D04) +   RMB0004
QUANNW                (0.31250887989922 * S-CO01END023IN-SEG3-D01) +    RMB0004
QUANNW                (0.24649861082584 * S-CO01END023IN-SEG3-D02) +    RMB0004
QUANNW                (-0.30358350950895 * S-CO01END023IN-SEG3-D04) +   RMB0004
QUANNW                (0.01763146917071 * S-CO01END026IN-SEG3-D01) +    RMB0004
QUANNW                (-0.28115415645197 * S-CO01END030RO-SEG3-D04) +   RMB0004
QUANNW                (-0.02568230709106 * S-CO01END037RO-SEG3-D01) +   RMB0004
QUANNW                (-0.01885152364213 * S-CO01END040RO-SEG3-D01) +   RMB0004
QUANNW                (0.06857941719294 * S-CO01END050RO-SEG3-D01) +    RMB0004
QUANNW                (0.02997834110705 * S-CO01END060RO-SEG3-D01) +    RMB0004
QUANNW                (0.02477163246199 * S-CO01END070RO-SEG3-D01) +    RMB0004
QUANNW                (-0.07991789745118 * S-CO01END071RO-SEG3-D01) +   RMB0004
QUANNW                (0.05106326811918 * S-CO01END072RO-SEG3-D01) +    RMB0004
QUANNW                (0.15445017311561 * S-CO01END075RO-SEG3-D04) +    RMB0004
QUANNW                (-0.09906372236659 * S-CO01EXP001CC-SEG3-D00) +   RMB0004
QUANNW                (-0.06818398474288 * S-CO01EXP001CC-SEG3-D03) +   RMB0004
QUANNW                (-0.26688096495013 * S-CO01EXP001CC-SEG3-D04) +   RMB0004
QUANNW                (-0.09704279112235 * S-CO01EXP001RO-SEG3) +       RMB0004
QUANNW                (-0.02621555682194 * S-CO01NUM001CC-SEG3-D03) +   RMB0004
QUANNW                (-0.09057453360894 * S-CO01NUM001CC-SEG3-D04) +   RMB0004
QUANNW                (0.05633825215776 * S-CO02EXP001TO-SEG3) +        RMB0004
QUANNW                (-0.02171032692396 * S-CO02EXP012TO-SEG3) +       RMB0004
QUANNW                (-0.1603988319398 * S-CO02NUM003TO-SEG3) +        RMB0004
QUANNW                (0.0034239417237 * S-CUOTATOTALHP-3-SEG3-D03) +   RMB0004
QUANNW                (-0.19230231886845 * S-CUOTATOTALHP-3-SEG3-D04) + RMB0004
QUANNW                (-0.48875284456648 * S-CUPOTOTAL-SEG3) +          RMB0004
QUANNW                (0.16409265380802 * S-CO00DEM026-SEG3-D01) +      RMB0004
QUANNW                (-0.22419941726242 * S-CO00DEM026-SEG3-D02) +     RMB0004
QUANNW                (-0.10185475739994 * S-SALDOTOTALHP-SEG3) +       RMB0004
QUANNW                (-0.00287166568337 * S-TIPORELD03).               RMB0004
QUANNW     COMPUTE H11-SEG3 = (-0.93541289306235 + H11-SEG3).           RMB0004
QUANNW     COMPUTE H12-SEG3 = (0.8543099317691 + H12-SEG3) .            RMB0004
QUANNW     COMPUTE H13-SEG3 = (0.97377994293864 + H13-SEG3) .           RMB0004
QUANNW     COMPUTE H11A-SEG3=   (2.7182818284 ** (H11-SEG3)  -          RMB0004
QUANNW                           2.7182818284 ** (-H11-SEG3)) /         RMB0004
QUANNW                          (2.7182818284 ** (H11-SEG3) +           RMB0004
QUANNW                           2.7182818284 ** (-H11-SEG3)).          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE H12A-SEG3=   (2.7182818284 ** (H12-SEG3)  -          RMB0004
QUANNW                           2.7182818284 ** (-H12-SEG3)) /         RMB0004
QUANNW                          (2.7182818284 ** (H12-SEG3) +           RMB0004
QUANNW                           2.7182818284 ** (-H12-SEG3)).          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE H13A-SEG3=   (2.7182818284 ** (H13-SEG3)  -          RMB0004
QUANNW                           2.7182818284 ** (-H13-SEG3)) /         RMB0004
QUANNW                          (2.7182818284 ** (H13-SEG3) +           RMB0004
QUANNW                           2.7182818284 ** (-H13-SEG3)).          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE S1-INGRESO-C = 1.71040484005256 +                    RMB0004
QUANNW                          ((-0.07851754633729 * H11A-SEG3) +      RMB0004
QUANNW                          (0.09553387266514 * H12A-SEG3) +        RMB0004
QUANNW                          (-0.14107940883178 * H13A-SEG3)).       RMB0004
QUANNW     COMPUTE S1-INGRESO-C = (2.7182818284 ** (S1-INGRESO-C)) - 1  RMB0004
QUANNW     IF S1-INGRESO-C < 1                                          RMB0004
QUANNW        MOVE 1 TO S1-INGRESO-C                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        IF S1-INGRESO-C > 27.92                                   RMB0004
QUANNW           MOVE 27.92   TO S1-INGRESO-C                           RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE S1-INGRESO-C TO S1-INGRESO-C                      RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     COMPUTE S1-INGRESO-INF-C     = S1-INGRESO-C     -            RMB0004
QUANNW        S1-INGRESO-C * K-INTERVALO-USAPI  .                       RMB0004
QUANNW     COMPUTE S1-INGRESO-SUP-C     = S1-INGRESO-C     +            RMB0004
QUANNW        S1-INGRESO-C * K-INTERVALO-USAPI  .                       RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI1 .                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI2 .                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-N-USAPI.                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI  .                    RMB0004
QUANNW     MOVE S1-INGRESO-INF-C TO INGRESO-INF-USAPI .                 RMB0004
QUANNW     MOVE S1-INGRESO-INF-C TO INGRESO-INF-N-USAPI .               RMB0004
QUANNW     MOVE S1-INGRESO-SUP-C TO INGRESO-SUP-USAPI.                  RMB0004
QUANNW     MOVE S1-INGRESO-SUP-C TO INGRESO-SUP-N-USAPI.                RMB0004
QUANNW     PERFORM 8000-CAL-SALIDA-PESOS-USAPI.                         RMB0004
QUANNW 6400-SCORE-CARD4-USAPI.                                          RMB0004
REMARK********************************************************************
REMARK*6400-SCORE-CARD4-USAPI.
REMARK*    SE CALCULA EL INGRESO PARA LA PERSONA CLASIFICADA EN EL SEGMENTO
REMARK*    CUATRO, INGRESOS MAS BAJOS     (RENTA BAJA)
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAPI(1) .
QUANNW     PERFORM 5240-CUOTATOTAL-USAPI.                               RMB0004
QUANNW     IF CUPOTOTAL-USAPI < 0                                       RMB0004
QUANNW        MOVE 7.05     TO CUPOTOTAL-SEG4                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CUPOTOTAL-USAPI TO CUPOTOTAL-SEG4                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02NUM003TO      TO CO02NUM003TO.                        RMB0004
QUANNW     IF CO02NUM003TO NOT NUMERIC                                  RMB0004
QUANNW        MOVE 0 TO CO02NUM003TO-SEG4                               RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO02NUM003TO TO CO02NUM003TO-SEG4                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 02EXP001TO  TO CO02EXP001TO.                            RMB0004
QUANNW     IF CO02EXP001TO NOT NUMERIC THEN                             RMB0004
QUANNW        MOVE 000          TO CO02EXP001TO-SEG4                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO02EXP001TO TO CO02EXP001TO-SEG4                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 00DEM003 TO CO00DEM003  .                               RMB0004
QUANNW     IF CO00DEM003 NOT NUMERIC                                    RMB0004
QUANNW        MOVE 00             TO CO00DEM003-SEG4                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE CO00DEM003     TO CO00DEM003-SEG4                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    ACOTACION DE VARIABLES                                       RMB0004
QUANNW     IF CUPOTOTAL-SEG4   > 46.38                                  RMB0004
QUANNW        MOVE 46.38 TO CUPOTOTAL-SEG4.                             RMB0004
QUANNW     IF CO02EXP001TO-SEG4 > 206                                   RMB0004
QUANNW        MOVE 206   TO CO02EXP001TO-SEG4.                          RMB0004
QUANNW     IF CO02NUM003TO-SEG4 > 07                                    RMB0004
QUANNW        MOVE 07    TO CO02NUM003TO-SEG4.                          RMB0004
QUANNW     IF CO00DEM003-SEG4   > 54                                    RMB0004
QUANNW        MOVE  54   TO CO00DEM003-SEG4.                            RMB0004
QUANNW     IF CO00DEM003-SEG4   < 18                                    RMB0004
QUANNW        MOVE  18   TO CO00DEM003-SEG4.                            RMB0004
QUANNW*    VARIABLES DUMMYS                                             RMB0004
QUANNW     IF   0 <= CUOTATOTAL-USAPI AND CUOTATOTAL-USAPI < 0.21       RMB0004
QUANNW        MOVE 1 TO CUOTATOTAL-SEG4-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CUOTATOTAL-SEG4-D01                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0.21 <= CUOTATOTAL-USAPI AND CUOTATOTAL-USAPI < 0.42      RMB0004
QUANNW        MOVE 1 TO CUOTATOTAL-SEG4-D02                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CUOTATOTAL-SEG4-D02                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0.42 <= CUOTATOTAL-USAPI AND CUOTATOTAL-USAPI < 0.80      RMB0004
QUANNW        MOVE 1 TO CUOTATOTAL-SEG4-D03                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CUOTATOTAL-SEG4-D03                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0.80 <= CUOTATOTAL-USAPI                                  RMB0004
QUANNW        MOVE 1 TO CUOTATOTAL-SEG4-D04                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CUOTATOTAL-SEG4-D04                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END008RO      TO CO01END008RO.                        RMB0004
QUANNW     IF CO01END008RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END008RO(1:8)  TO CO01END008ROV(1:8)             RMB0004
QUANNW        MOVE CO01END008RO(10:2) TO CO01END008ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END008ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF 0 <= CO01END008ROV AND CO01END008ROV < 1.54               RMB0004
QUANNW        AND CO01END008RO(1:1) <> " "        *> MANEJAR EL -1      RMB0004
QUANNW        MOVE 1 TO CO01END008RO-SEG4-D01                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END008RO-SEG4-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 3.87 <= CO01END008ROV                                     RMB0004
QUANNW        MOVE 1 TO CO01END008RO-SEG4-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END008RO-SEG4-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END037RO      TO CO01END037RO.                        RMB0004
QUANNW     IF CO01END037RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END037RO(1:8)  TO CO01END037ROV(1:8)             RMB0004
QUANNW        MOVE CO01END037RO(10:2) TO CO01END037ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END037ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END037RO(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END037ROV AND CO01END037ROV < 1.73         RMB0004
QUANNW           MOVE 1 TO CO01END037RO-SEG4-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END037RO-SEG4-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END037RO-SEG4-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01NUM001CC TO CO01NUM001CC                              RMB0004
QUANNW     IF CO01NUM001CC NOT NUMERIC                                  RMB0004
QUANNW        MOVE 1 TO CO01NUM001CC-SEG4-D00                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01NUM001CC-SEG4-D00                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0003 <= CO01NUM001CC AND CO01NUM001CC NUMERIC             RMB0004
QUANNW        MOVE 1 TO CO01NUM001CC-SEG4-D03                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01NUM001CC-SEG4-D03                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01ACP008CC  TO CO01ACP008CC.                            RMB0004
QUANNW     IF 0001 <= CO01ACP008CC                                      RMB0004
QUANNW        MOVE 1 TO CO01ACP008CC-SEG4-D02                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01ACP008CC-SEG4-D02                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END007IN      TO CO01END007IN.                        RMB0004
QUANNW     IF CO01END007IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END007IN(1:8)  TO CO01END007INV(1:8)             RMB0004
QUANNW        MOVE CO01END007IN(10:2) TO CO01END007INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END007INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END007IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END007INV AND CO01END007INV < 3.53         RMB0004
QUANNW           MOVE 1 TO CO01END007IN-SEG4-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END007IN-SEG4-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007IN-SEG4-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 12.07 <= CO01END007INV                                    RMB0004
QUANNW        MOVE 1 TO CO01END007IN-SEG4-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END007IN-SEG4-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01NUM002CC TO CO01NUM002CC.                             RMB0004
QUANNW     IF 0002 <= CO01NUM002CC                                      RMB0004
QUANNW        MOVE 1 TO CO01NUM002CC-SEG4-D03                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01NUM002CC-SEG4-D03                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END028RO      TO CO01END028RO.                        RMB0004
QUANNW     IF CO01END028RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END028RO(1:8)  TO CO01END028ROV(1:8)             RMB0004
QUANNW        MOVE CO01END028RO(10:2) TO CO01END028ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0.00               TO CO01END028ROV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0.36 <= CO01END028ROV                                     RMB0004
QUANNW        MOVE 1 TO CO01END028RO-SEG4-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END028RO-SEG4-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END013RO      TO CO01END013RO.                        RMB0004
QUANNW     IF CO01END013RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END013RO(1:8)  TO CO01END013ROV(1:8)             RMB0004
QUANNW        MOVE CO01END013RO(10:2) TO CO01END013ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0.00               TO CO01END013ROV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 0.37 <= CO01END013ROV                                     RMB0004
QUANNW        MOVE 1 TO CO01END013RO-SEG4-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END013RO-SEG4-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END030RO      TO CO01END030RO.                        RMB0004
QUANNW     IF CO01END030RO(9:1) =  "." *> NO NEGATIVO                   RMB0004
QUANNW        MOVE CO01END030RO(1:8)  TO CO01END030ROV(1:8)             RMB0004
QUANNW        MOVE CO01END030RO(10:2) TO CO01END030ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0                  TO CO01END030ROV                  RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF  1.72 <= CO01END030ROV                                    RMB0004
QUANNW        MOVE 1 TO CO01END030RO-SEG4-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END030RO-SEG4-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END010RO      TO CO01END010RO.                        RMB0004
QUANNW     IF CO01END010RO(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END010RO(1:8)  TO CO01END010ROV(1:8)             RMB0004
QUANNW        MOVE CO01END010RO(10:2) TO CO01END010ROV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END010ROV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF 1.83 <= CO01END010ROV                                     RMB0004
QUANNW        MOVE 1 TO CO01END010RO-SEG4-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END010RO-SEG4-D04                           RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END003CC      TO CO01END003CC.                        RMB0004
QUANNW     IF CO01END003CC(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END003CC(1:8)  TO CO01END003CCV(1:8)             RMB0004
QUANNW        MOVE CO01END003CC(10:2) TO CO01END003CCV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END003CCV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END003CC(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END003CCV                                  RMB0004
QUANNW           MOVE 1 TO CO01END003CC-SEG4-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END003CC-SEG4-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END003CC-SEG4-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01NUM003AH TO CO01NUM003AH                              RMB0004
QUANNW     IF 0001 <= CO01NUM003AH                                      RMB0004
QUANNW        MOVE 1 TO CO01NUM003AH-SEG4-D02                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01NUM003AH-SEG4-D02                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END026IN      TO CO01END026IN.                        RMB0004
QUANNW     IF CO01END026IN(9:1) = "."                                   RMB0004
QUANNW        MOVE CO01END026IN(1:8)  TO CO01END026INV(1:8)             RMB0004
QUANNW        MOVE CO01END026IN(10:2) TO CO01END026INV(9:2)             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE ZEROS              TO CO01END026INV                  RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW     IF CO01END026IN(9:1) = "."                                   RMB0004
QUANNW        IF    0 <= CO01END026INV AND CO01END026INV < 1.33         RMB0004
QUANNW           MOVE 1 TO CO01END026IN-SEG4-D01                        RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE 0 TO CO01END026IN-SEG4-D01                        RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END026IN-SEG4-D01                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     IF 7.03 <= CO01END026INV                                     RMB0004
QUANNW        MOVE 1 TO CO01END026IN-SEG4-D04                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END026IN-SEG4-D04                           RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     MOVE 01END033CC      TO CO01END033CC.                        RMB0004
QUANNW     IF CO01END033CC(9:1) <> "."                                  RMB0004
QUANNW        MOVE 1 TO CO01END033CC-SEG4-D00                           RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO01END033CC-SEG4-D00                           RMB0004
QUANNW     END-IF                                                       RMB0004
QUANNW*    OTRAS DUMMIES                                                RMB0004
QUANNW     MOVE 00DEM030 TO CO00DEM030.                                 RMB0004
QUANNW     IF CO00DEM030 = "  -1"                                       RMB0004
QUANNW        MOVE 1 TO CO00DEM030-SEG4-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM030-SEG4-D01                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*                                                                 RMB0004
QUANNW     IF 01 <= CO00DEM026  AND CO00DEM026 <= 02                    RMB0004
QUANNW        MOVE 1 TO CO00DEM026-SEG4-D01                             RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        MOVE 0 TO CO00DEM026-SEG4-D01                             RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW*    ESTANDARIZACION DE VARIABLES                                 RMB0004
QUANNW     COMPUTE S-CO00DEM030-SEG4-D01 = -5.42738057921664 +          RMB0004
QUANNW             5.61163033744296 * CO00DEM030-SEG4-D01.              RMB0004
QUANNW     COMPUTE  S-CO00DEM003-SEG4 = -3.82883063778328 +             RMB0004
QUANNW             0.10746599073693 * CO00DEM003-SEG4.                  RMB0004
QUANNW     COMPUTE  S-CO01ACP008CC-SEG4-D02 = -0.56970304380189 +       RMB0004
QUANNW             2.3249921727654 * CO01ACP008CC-SEG4-D02.             RMB0004
QUANNW     COMPUTE  S-CO01END003CC-SEG4-D01 = -0.73433929488619 +       RMB0004
QUANNW             2.09609886091604 * CO01END003CC-SEG4-D01.            RMB0004
QUANNW     COMPUTE  S-CO01END007IN-SEG4-D01 = -0.36080834684616 +       RMB0004
QUANNW             3.13234500408778 * CO01END007IN-SEG4-D01.            RMB0004
QUANNW     COMPUTE  S-CO01END007IN-SEG4-D04 = -0.36262988295111 +       RMB0004
QUANNW             3.12024475844025 * CO01END007IN-SEG4-D04.            RMB0004
QUANNW     COMPUTE  S-CO01END008RO-SEG4-D01 = -0.42657530450635 +       RMB0004
QUANNW             2.77081218122877 * CO01END008RO-SEG4-D01.            RMB0004
QUANNW     COMPUTE  S-CO01END008RO-SEG4-D04 = -0.42913512783047 +       RMB0004
QUANNW             2.75938845521111 * CO01END008RO-SEG4-D04.            RMB0004
QUANNW     COMPUTE  S-CO01END010RO-SEG4-D04 = -0.40513753082628 +       RMB0004
QUANNW             2.87341924613264 * CO01END010RO-SEG4-D04.            RMB0004
QUANNW     COMPUTE  S-CO01END013RO-SEG4-D04 = -0.42025029600037 +       RMB0004
QUANNW             2.79976928513629 * CO01END013RO-SEG4-D04.            RMB0004
QUANNW     COMPUTE  S-CO01END026IN-SEG4-D01 = -0.37405267620572 +       RMB0004
QUANNW             3.0474557104161 * CO01END026IN-SEG4-D01.             RMB0004
QUANNW     COMPUTE  S-CO01END026IN-SEG4-D04 = -0.37310119740114 +       RMB0004
QUANNW             3.05332191630636 * CO01END026IN-SEG4-D04.            RMB0004
QUANNW     COMPUTE  S-CO01END028RO-SEG4-D04 = -0.43891142915186 +       RMB0004
QUANNW             2.7172607568402 * CO01END028RO-SEG4-D04.             RMB0004
QUANNW     COMPUTE  S-CO01END030RO-SEG4-D04 = -0.43203560597519 +       RMB0004
QUANNW             2.74664473932589 * CO01END030RO-SEG4-D04.            RMB0004
QUANNW     COMPUTE  S-CO01END033CC-SEG4-D00 = -1.48466452125077 +       RMB0004
QUANNW             2.1582130200594 * CO01END033CC-SEG4-D00.             RMB0004
QUANNW     COMPUTE  S-CO01END037RO-SEG4-D01 = -0.37892522237322 +       RMB0004
QUANNW             3.01795134277739 * CO01END037RO-SEG4-D01.            RMB0004
QUANNW     COMPUTE  S-CO01NUM001CC-SEG4-D00 = -0.88668139474329 +       RMB0004
QUANNW             2.01447494657754 * CO01NUM001CC-SEG4-D00.            RMB0004
QUANNW     COMPUTE  S-CO01NUM001CC-SEG4-D03 = -0.41460193758933 +       RMB0004
QUANNW             2.82653846962113 * CO01NUM001CC-SEG4-D03.            RMB0004
QUANNW     COMPUTE  S-CO01NUM002CC-SEG4-D03 = -0.42801921429758 +       RMB0004
QUANNW             2.76434787927111 * CO01NUM002CC-SEG4-D03.            RMB0004
QUANNW     COMPUTE  S-CO01NUM003AH-SEG4-D02 = -0.96954599424393 +       RMB0004
QUANNW             2.00094993532534 * CO01NUM003AH-SEG4-D02.            RMB0004
QUANNW     COMPUTE  S-CO02EXP001TO-SEG4 = -1.54523042541911 +           RMB0004
QUANNW             0.01787546151347 * CO02EXP001TO-SEG4.                RMB0004
QUANNW     COMPUTE  S-CO02NUM003TO-SEG4 = -1.684305396117 +             RMB0004
QUANNW             0.53776910741717 * CO02NUM003TO-SEG4.                RMB0004
QUANNW     COMPUTE  S-CUOTATOTAL-SEG4-D01 = -0.49559075994955 +         RMB0004
QUANNW             2.51337163952988 * CUOTATOTAL-SEG4-D01.              RMB0004
QUANNW     COMPUTE  S-CUOTATOTAL-SEG4-D02 = -0.49980114311312 +         RMB0004
QUANNW             2.50058400105978 * CUOTATOTAL-SEG4-D02.              RMB0004
QUANNW     COMPUTE  S-CUOTATOTAL-SEG4-D03 = -0.49960991961505 +         RMB0004
QUANNW             2.50115856839563 * CUOTATOTAL-SEG4-D03.              RMB0004
QUANNW     COMPUTE  S-CUOTATOTAL-SEG4-D04 = -0.50247675171239 +         RMB0004
QUANNW             2.49260575990033 * CUOTATOTAL-SEG4-D04.              RMB0004
QUANNW     COMPUTE  S-CUPOTOTAL-SEG4 = -0.96698575188867 +              RMB0004
QUANNW             0.08523532193225 * CUPOTOTAL-SEG4.                   RMB0004
QUANNW     COMPUTE  S-CO00DEM026-SEG4-D01 = -0.48036514431349 +         RMB0004
QUANNW             2.56210144712541 * CO00DEM026-SEG4-D01.              RMB0004
QUANNW*    CALCULO PRIMERA CAPA DE LA RED NEURONAL                      RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW       H11-SEG4 = (0.01845108354765 * S-CO00DEM030-SEG4-D01) +    RMB0004
QUANNW                  (0.10562945660416 * S-CO00DEM003-SEG4) +        RMB0004
QUANNW                  (-0.04982206777613 * S-CO01ACP008CC-SEG4-D02) + RMB0004
QUANNW                  (0.07616639522343 * S-CO01END003CC-SEG4-D01) +  RMB0004
QUANNW                  (-0.04801027164982 * S-CO01END007IN-SEG4-D01) + RMB0004
QUANNW                  (-0.00060406318964 * S-CO01END007IN-SEG4-D04) + RMB0004
QUANNW                  (-0.55969939742798 * S-CO01END008RO-SEG4-D01) + RMB0004
QUANNW                  (-0.24458792124355 * S-CO01END008RO-SEG4-D04) + RMB0004
QUANNW                  (-0.08413323168775 * S-CO01END010RO-SEG4-D04) + RMB0004
QUANNW                  (-0.13872340989404 * S-CO01END013RO-SEG4-D04) + RMB0004
QUANNW                  (-0.11304708848464 * S-CO01END026IN-SEG4-D01) + RMB0004
QUANNW                  (-0.00438672872715 * S-CO01END026IN-SEG4-D04) + RMB0004
QUANNW                  (-0.21194506177556 * S-CO01END028RO-SEG4-D04) + RMB0004
QUANNW                  (-0.09319341966108 * S-CO01END030RO-SEG4-D04) + RMB0004
QUANNW                  (-0.00932566798871 * S-CO01END033CC-SEG4-D00) + RMB0004
QUANNW                  (-1.24855940771225 * S-CO01END037RO-SEG4-D01) + RMB0004
QUANNW                  (0.05661076876988 * S-CO01NUM001CC-SEG4-D00) +  RMB0004
QUANNW                  (-0.0197881101937 * S-CO01NUM001CC-SEG4-D03) +  RMB0004
QUANNW                  (0.0503318826283 * S-CO01NUM002CC-SEG4-D03) +   RMB0004
QUANNW                  (0.06096934649485 * S-CO01NUM003AH-SEG4-D02) +  RMB0004
QUANNW                  (-0.22610942944743 * S-CO02EXP001TO-SEG4) +     RMB0004
QUANNW                  (-0.29898069760532 * S-CO02NUM003TO-SEG4) +     RMB0004
QUANNW                  (-1.41931227819959 * S-CUOTATOTAL-SEG4-D01) +   RMB0004
QUANNW                  (-0.20650483850577 * S-CUOTATOTAL-SEG4-D02) +   RMB0004
QUANNW                  (-0.13274770183483 * S-CUOTATOTAL-SEG4-D03) +   RMB0004
QUANNW                  (0.08871756789923 * S-CUOTATOTAL-SEG4-D04) +    RMB0004
QUANNW                  (0.19233710138673 * S-CUPOTOTAL-SEG4) +         RMB0004
QUANNW                  (0.00608894527032 * S-CO00DEM026-SEG4-D01).     RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW       H12-SEG4 = (-0.01411382749339 * S-CO00DEM030-SEG4-D01) +   RMB0004
QUANNW                  (-0.03158407966823 * S-CO00DEM003-SEG4) +       RMB0004
QUANNW                  (-0.0390584392136 * S-CO01ACP008CC-SEG4-D02) +  RMB0004
QUANNW                  (-0.04362888394147 * S-CO01END003CC-SEG4-D01) + RMB0004
QUANNW                  (0.03643631137997 * S-CO01END007IN-SEG4-D01) +  RMB0004
QUANNW                  (-0.06904689251338 * S-CO01END007IN-SEG4-D04) + RMB0004
QUANNW                  (0.04939443483092 * S-CO01END008RO-SEG4-D01) +  RMB0004
QUANNW                  (-0.00417733076318 * S-CO01END008RO-SEG4-D04) + RMB0004
QUANNW                  (-0.05852057940323 * S-CO01END010RO-SEG4-D04) + RMB0004
QUANNW                  (-0.04143066618483 * S-CO01END013RO-SEG4-D04) + RMB0004
QUANNW                  (0.02164367299797 * S-CO01END026IN-SEG4-D01) +  RMB0004
QUANNW                  (-0.05072593625603 * S-CO01END026IN-SEG4-D04) + RMB0004
QUANNW                  (-0.06551237076901 * S-CO01END028RO-SEG4-D04) + RMB0004
QUANNW                  (-0.0534774745417 * S-CO01END030RO-SEG4-D04) +  RMB0004
QUANNW                  (0.01111669569456 * S-CO01END033CC-SEG4-D00) +  RMB0004
QUANNW                  (0.00035144992755 * S-CO01END037RO-SEG4-D01) +  RMB0004
QUANNW                  (0.0307963973324 * S-CO01NUM001CC-SEG4-D00) +   RMB0004
QUANNW                  (-0.027357554504 * S-CO01NUM001CC-SEG4-D03) +   RMB0004
QUANNW                  (-0.02325241489241 * S-CO01NUM002CC-SEG4-D03) + RMB0004
QUANNW                  (-0.03895207402048 * S-CO01NUM003AH-SEG4-D02) + RMB0004
QUANNW                  (-0.05200559847512 * S-CO02EXP001TO-SEG4) +     RMB0004
QUANNW                  (-0.06264298521781 * S-CO02NUM003TO-SEG4) +     RMB0004
QUANNW                  (-0.03772951664408 * S-CUOTATOTAL-SEG4-D01) +   RMB0004
QUANNW                  (-0.08580993444631 * S-CUOTATOTAL-SEG4-D02) +   RMB0004
QUANNW                  (-0.13411934810289 * S-CUOTATOTAL-SEG4-D03) +   RMB0004
QUANNW                  (-0.20404035031642 * S-CUOTATOTAL-SEG4-D04) +   RMB0004
QUANNW                  (0.02436578060299 * S-CUPOTOTAL-SEG4) +         RMB0004
QUANNW                  (0.05353927959226 * S-CO00DEM026-SEG4-D01).     RMB0004
QUANNW     COMPUTE                                                      RMB0004
QUANNW       H13-SEG4 = (-0.75320155223384 * S-CO00DEM030-SEG4-D01) +   RMB0004
QUANNW                  (0.00400740736804 * S-CO00DEM003-SEG4) +        RMB0004
QUANNW                  (0.10158640183065 * S-CO01ACP008CC-SEG4-D02) +  RMB0004
QUANNW                  (-0.01649421804587 * S-CO01END003CC-SEG4-D01) + RMB0004
QUANNW                  (-0.16653868630155 * S-CO01END007IN-SEG4-D01) + RMB0004
QUANNW                  (-0.06267819590164 * S-CO01END007IN-SEG4-D04) + RMB0004
QUANNW                  (-0.16644636915567 * S-CO01END008RO-SEG4-D01) + RMB0004
QUANNW                  (0.26702251201711 * S-CO01END008RO-SEG4-D04) +  RMB0004
QUANNW                  (0.02249488652047 * S-CO01END010RO-SEG4-D04) +  RMB0004
QUANNW                  (0.11516576685566 * S-CO01END013RO-SEG4-D04) +  RMB0004
QUANNW                  (-0.12430782285716 * S-CO01END026IN-SEG4-D01) + RMB0004
QUANNW                  (0.03080980897615 * S-CO01END026IN-SEG4-D04) +  RMB0004
QUANNW                  (0.1250204342051 * S-CO01END028RO-SEG4-D04) +   RMB0004
QUANNW                  (0.12364270228478 * S-CO01END030RO-SEG4-D04) +  RMB0004
QUANNW                  (-0.02171740232004 * S-CO01END033CC-SEG4-D00) + RMB0004
QUANNW                  (-0.13508408418393 * S-CO01END037RO-SEG4-D01) + RMB0004
QUANNW                  (-0.03459713162959 * S-CO01NUM001CC-SEG4-D00) + RMB0004
QUANNW                  (0.07413336211968 * S-CO01NUM001CC-SEG4-D03) +  RMB0004
QUANNW                  (-0.01498892748092 * S-CO01NUM002CC-SEG4-D03) + RMB0004
QUANNW                  (0.118226794815 * S-CO01NUM003AH-SEG4-D02) +    RMB0004
QUANNW                  (0.41504668905584 * S-CO02EXP001TO-SEG4) +      RMB0004
QUANNW                  (0.03235870319176 * S-CO02NUM003TO-SEG4) +      RMB0004
QUANNW                  (-0.30588925542858 * S-CUOTATOTAL-SEG4-D01) +   RMB0004
QUANNW                  (-0.68392091561374 * S-CUOTATOTAL-SEG4-D02) +   RMB0004
QUANNW                  (-0.79169245142586 * S-CUOTATOTAL-SEG4-D03) +   RMB0004
QUANNW                  (-0.58404365317173 * S-CUOTATOTAL-SEG4-D04) +   RMB0004
QUANNW                  (0.17957574368411 * S-CUPOTOTAL-SEG4) +         RMB0004
QUANNW                  (-0.23169686583765 * S-CO00DEM026-SEG4-D01).    RMB0004
QUANNW     COMPUTE H11-SEG4 = (-3.89244280529556 + H11-SEG4).           RMB0004
QUANNW     COMPUTE H12-SEG4 = (-0.59075680815565 + H12-SEG4).           RMB0004
QUANNW     COMPUTE H13-SEG4 = (-1.07224691310801 + H13-SEG4).           RMB0004
QUANNW     COMPUTE H11A-SEG4=   (2.7182818284 ** (H11-SEG4)  -          RMB0004
QUANNW                           2.7182818284 ** (-H11-SEG4)) /         RMB0004
QUANNW                          (2.7182818284 ** (H11-SEG4) +           RMB0004
QUANNW                           2.7182818284 ** (-H11-SEG4)).          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE H12A-SEG4=   (2.7182818284 ** (H12-SEG4)  -          RMB0004
QUANNW                           2.7182818284 ** (-H12-SEG4)) /         RMB0004
QUANNW                          (2.7182818284 ** (H12-SEG4) +           RMB0004
QUANNW                           2.7182818284 ** (-H12-SEG4)).          RMB0004
QUANNW*                                                                 RMB0004
QUANNW     COMPUTE H13A-SEG4=   (2.7182818284 ** (H13-SEG4)  -          RMB0004
QUANNW                           2.7182818284 ** (-H13-SEG4)) /         RMB0004
QUANNW                          (2.7182818284 ** (H13-SEG4) +           RMB0004
QUANNW                           2.7182818284 ** (-H13-SEG4)).          RMB0004
QUANNW*    CALCULO 3 ETAPA                                              RMB0004
QUANNW     COMPUTE S1-INGRESO-C = 2.46097112226757 +                    RMB0004
QUANNW                          ((1.29064865398364 * H11A-SEG4) +       RMB0004
QUANNW                          (-0.46501356339512 * H12A-SEG4) +       RMB0004
QUANNW                          (0.12059677659222 * H13A-SEG4)).        RMB0004
QUANNW     COMPUTE S1-INGRESO-C = (2.7182818284 ** (S1-INGRESO-C)) - 1  RMB0004
QUANNW     IF S1-INGRESO-C < 1                                          RMB0004
QUANNW        MOVE 1 TO S1-INGRESO-C                                    RMB0004
QUANNW     ELSE                                                         RMB0004
QUANNW        IF S1-INGRESO-C > 27.92                                   RMB0004
QUANNW           MOVE 27.92   TO S1-INGRESO-C                           RMB0004
QUANNW        ELSE                                                      RMB0004
QUANNW           MOVE S1-INGRESO-C TO S1-INGRESO-C                      RMB0004
QUANNW        END-IF                                                    RMB0004
QUANNW     END-IF.                                                      RMB0004
QUANNW     COMPUTE S1-INGRESO-INF-C     = S1-INGRESO-C     -            RMB0004
QUANNW        S1-INGRESO-C * K-INTERVALO-USAPI  .                       RMB0004
QUANNW     COMPUTE S1-INGRESO-SUP-C     = S1-INGRESO-C     +            RMB0004
QUANNW        S1-INGRESO-C * K-INTERVALO-USAPI  .                       RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI1 .                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI2 .                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-N-USAPI.                    RMB0004
QUANNW     MOVE S1-INGRESO-C     TO INGRESO-USAPI  .                    RMB0004
QUANNW     MOVE S1-INGRESO-INF-C TO INGRESO-INF-USAPI .                 RMB0004
QUANNW     MOVE S1-INGRESO-INF-C TO INGRESO-INF-N-USAPI .               RMB0004
QUANNW     MOVE S1-INGRESO-SUP-C TO INGRESO-SUP-USAPI.                  RMB0004
QUANNW     MOVE S1-INGRESO-SUP-C TO INGRESO-SUP-N-USAPI.                RMB0004
QUANNW     PERFORM 8000-CAL-SALIDA-PESOS-USAPI.                         RMB0004
       6000-DESPLEGAR-AUDITORIA-USAPI.        
REMARK*******************************************************************
REMARK*6000-DESPLEGAR-AUDITORIA-USAPI.
REMARK*    ESTA RUTINA PERMITE GENERAR PARA AUDITORIA LA INFORMACION
REMARK*    COMPLETA SOBRE EL INGRESO, INTERVALOS, DUMIES CARACT ETC
REMARK*    LA INFORMACION SE REGRESA EN LA VARIABLE AREA-VALI-USAPI
REMARK*******************************************************************
QUANT2     MOVE SPACES TO AREA-VALI-USAPI   .                           RMB0003 
QUANT2     STRING  TIPO-ID-CARACT,                                      RMB0003 
                   NRO-ID-CARACT           ,";",        
                   SCORE-CARD-USAPI        ,";",        
                   ADVERSE-RAZON-USAPI(1)  ,";",        
                   INGRESO-USAPI           ,";",        
                   INGRESO-INF-USAPI       ,";",        
                   INGRESO-SUP-USAPI               
QUANT2         INTO AREA-VALI-USAPI   .                                 RMB0003 
           PERFORM 7000-DESPLEGAR-CARACT-USAPI.        
           EVALUATE SCORE-CARD-USAPI        
             WHEN 1         
                MOVE DUMMYS-S1-USAPI TO DUMMIES-DESPLEGAR-USAPI        
                PERFORM 6500-DESPLEGAR-DUMMIES-USAPI        
             WHEN 2         
                MOVE DUMMYS-S2-USAPI TO DUMMIES-DESPLEGAR-USAPI        
                PERFORM 6500-DESPLEGAR-DUMMIES-USAPI        
             WHEN 3         
                MOVE DUMMYS-S3-USAPI TO DUMMIES-DESPLEGAR-USAPI        
                PERFORM 6500-DESPLEGAR-DUMMIES-USAPI        
             WHEN 4         
                MOVE DUMMYS-S4-USAPI TO DUMMIES-DESPLEGAR-USAPI        
                PERFORM 6500-DESPLEGAR-DUMMIES-USAPI        
             WHEN ANY        
                MOVE ";" TO DUMMIES-DESPLEGAR-USAPI        
                PERFORM 6500-DESPLEGAR-DUMMIES-USAPI        
           END-EVALUATE.        
              
       6500-DESPLEGAR-DUMMIES-USAPI.        
REMARK*******************************************************************
REMARK*6500-DESPLEGAR-DUMMIES-USAPI.
REMARK*    RUTINA QUE PERMITE DESPLEGAR LOS VALORES DE LAS VARIABLES 
REMARK*    DUMMIES PARA SEGUIMIENTO. ENTRADA : DUMMIES-DESPLEGAR-USAPI
REMARK*    EJEMPLO DE SU USO:
REMARK*          DISPLAY TIPO-ID-CARACT,NRO-ID-CARACT,";",INGRESO-USAPI1
REMARK*             NO ADVANCING
REMARK*          MOVE DUMMYS-01-USAPI TO DUMMIES-DESPLEGAR-USAPI
REMARK*          PERFORM 6500-DESPLEGAR-DUMMIES-USAPI
REMARK*
REMARK*******************************************************************
           MOVE 1 TO I-USAPI.        
           PERFORM UNTIL I-USAPI > 100        
             IF DUMMIES-DESPLEGAR-USAPI(I-USAPI:1) NOT = " "        
                COMPUTE J-USAPI = I-USAPI + 1        
                IF DUMMIES-DESPLEGAR-USAPI(J-USAPI:1) NOT = " "        
QUANT2             STRING AREA-VALI-USAPI DELIMITED BY "               "RMB0003 
QUANT2                     ";",DUMMIES-DESPLEGAR-USAPI(I-USAPI:1)       RMB0003 
QUANT2             INTO AREA-VALI-USAPI                                 RMB0003 
                ELSE        
QUANT2             STRING AREA-VALI-USAPI DELIMITED BY "               "RMB0003 
QUANT2                     ";",DUMMIES-DESPLEGAR-USAPI(I-USAPI:1)       RMB0003 
QUANT2             INTO AREA-VALI-USAPI                                 RMB0003 
                END-IF        
             END-IF        
             ADD 1 TO I-USAPI        
           END-PERFORM.        
              
       7000-DESPLEGAR-CARACT-USAPI.        
REMARK*******************************************************************
REMARK*7000-DESPLEGAR-CARACT-USAPI.
REMARK*    SE DESPLIEGAN LAS CARACTERISTICAS PARA CADA SCORE CARD PARA 
REMARK*    EFECTOS DE DEBUG Y AUDITORIA
REMARK*******************************************************************
           EVALUATE SCORE-CARD-USAPI        
             WHEN 1         
QUANT2          STRING AREA-VALI-USAPI    DELIMITED BY SPACES,          RMB0003 
QUANT2                  ";"                                             RMB0003 
                00DEM003 , ";"                               
                00DEM003 , ";"                               
                00DEM006 , ";"                               
                02EXP006TO , ";"                               
                02NUM005TO , ";"                               
                01END008RO , ";"                               
                01END011RO , ";"                               
                01END028RO , ";"                               
                01END030RO , ";"                               
                01END039RO , ";"                               
                01EXP001AH , ";"                               
                01EXP001RO , ";"                               
                01EXP002RO , ";"                               
                01EXP006RO , ";"                               
                01INQ002   , ";"                               
                01NUM001CC , ";"                               
                02END007CB , ";"                               
                01END007RO , ";"                               
                01END007IN , ";"                               
                01END007VE , ";"                               
                01END007HP , ";"                               
                01END007OT , ";"                               
                01END001RO , ";"                               
                01END001IN , ";"                               
                01END001VE , ";"                               
                01END001HP , ";"                               
                01END001OT , ";"                               
                01NUM001RO , ";"                               
                01NUM001IN , ";"                               
                01NUM001VE , ";"                               
                01NUM001HP , ";"                               
                01NUM001OT , ";"                               
                01NUM001CC         
QUANT2          INTO AREA-VALI-USAPI                                    RMB0003 
             WHEN 2         
QUANT2          STRING AREA-VALI-USAPI    DELIMITED BY SPACES,          RMB0003 
QUANT2                  ";"                                             RMB0003 
                00DEM006   , ";"                          
                02EXP001TO , ";"                          
                01NUM001CC , ";"                          
                01NUM001CT , ";"                          
                02NUM080MX , ";"                          
                01EXP001CC , ";"                          
                01EXP001RO , ";"                          
                01ACP006IN , ";"                          
                01END005RO , ";"                          
                01END007IN , ";"                          
                01END008RO , ";"                          
                01END023IN , ";"                          
                01END028RO , ";"                          
                01END030RO , ";"                          
                01END031IN , ";"                          
                01END047RO , ";"                          
                01END070RO , ";"                          
                01END007RO , ";"                          
                01END007IN , ";"                          
                01END007VE , ";"                          
                01END007HP , ";"                          
                01END007OT , ";"                          
                01MOR054CC         
QUANT2          INTO AREA-VALI-USAPI                                    RMB0003 
             WHEN 3         
QUANT2          STRING AREA-VALI-USAPI    DELIMITED BY SPACES,          RMB0003 
QUANT2                  ";"                                             RMB0003 
                00DEM006   , ";"                        
                01NUM001CC , ";"                        
                01END009RO , ";"                        
                01END018IN , ";"                        
                01END028RO , ";"                        
                01END007RO , ";"                        
                01END007IN , ";"                        
                01END007VE , ";"                        
                01END007HP , ";"                        
                01END007OT , ";"                        
                01EXP001CC , ";"                        
                01EXP001RO , ";"                        
                01EXP003RO , ";"                        
                02EXP009TO , ";"                        
                02EXP010RO , ";"                        
                01NUM050CC , ";"                        
                01NUM050CT , ";"                        
                02NUM080MX , ";"                        
                01MOR040CC , ";"                        
                01MOR061RO , ";"                        
                01ACP008CT         
QUANT2          INTO AREA-VALI-USAPI                                    RMB0003 
             WHEN 4         
QUANT2          STRING AREA-VALI-USAPI    DELIMITED BY SPACES,          RMB0003 
QUANT2                  ";"                                             RMB0003 
                00DEM006   , ";"                       
                02EXP001TO , ";"                       
                02NUM005TO , ";"                       
                01NUM001RO , ";"                       
                01NUM001IN , ";"                       
                01NUM001VE , ";"                       
                01NUM001HP , ";"                       
                01NUM001OT , ";"                       
                01NUM001CC , ";"                       
                01END007RO , ";"             
                01END007IN , ";"            
                01END007VE , ";"           
                01END007HP , ";"          
                01END007OT , ";"             
                01EXP001CC , ";"            
                01EXP001CT , ";"           
                01EXP001RO , ";"          
                01EXP001VE , ";"              
                01EXP002HP , ";"             
                02EXP009TO , ";"            
                01ACP007CT , ";"                       
                01ACP008CC , ";"                       
                01END005RO , ";"           
                01END009RO , ";"                       
                01END028IN , ";"               
                01END028RO , ";"              
                01END051IN , ";"             
                01END071RO , ";"            
                01NUM001HP , ";"                       
                02NUM003TO , ";"                       
                02NUM086MX , ";"           
                01MOR040CC         
QUANT2          INTO AREA-VALI-USAPI                                    RMB0003 
             WHEN ANY        
QUANT2          STRING AREA-VALI-USAPI    DELIMITED BY SPACES,          RMB0003 
QUANT2                  ";"                                             RMB0003 
                00DEM001 , ";"                        
                00DEM002 , ";"                        
                01NUM001RO  , ";"                        
                01NUM001IN  , ";"                        
                01NUM001VE  , ";"                        
                01NUM001HP  , ";"                        
                01NUM001OT  , ";"                        
                01NUM001CC  , ";"                        
                01NUM001CO  , ";"                        
                01NUM001AH  , ";"                        
                01NUM001CT  , ";"                        
                01NUM002RO  , ";"                        
                01NUM002IN  , ";"                        
                01NUM002VE  , ";"                        
                01NUM002HP  , ";"                        
                02NUM001TO  , ";"                        
                02NUM002TO  , ";"                        
                02EXP001TO          
QUANT2          INTO AREA-VALI-USAPI                                    RMB0003 
           END-EVALUATE.        
              
       8000-CAL-SALIDA-PESOS-USAPI.        
REMARK*******************************************************************
REMARK*8000-CALCULAR-SALIDA-PESOS-USAPI.
REMARK*    SE CALCULA EL INGRESO EN PESOS CON BASE AL SALARIO MINIMO 
REMARK*    CALCULADO Al RUN DATE DE LLAMDO A LA RUTINA DE CARACTERISTICAS
REMARK*******************************************************************
           COMPUTE INGRESO-PESOS-N-USAPI =         
                          (INGRESO-N-USAPI * VLR-SMLMV-USAPI) / 1000.        
           MOVE INGRESO-PESOS-N-USAPI TO INGRESO-PESOS-USAPI.        
           COMPUTE INGRESO-PESOS-N-INF-USAPI =        
                   INGRESO-PESOS-N-USAPI -         
                   INGRESO-PESOS-N-USAPI * K-INTERVALO-USAPI.        
           MOVE INGRESO-PESOS-N-INF-USAPI TO INGRESO-PESOS-INF-USAPI.        
           COMPUTE INGRESO-PESOS-N-SUP-USAPI =        
                   INGRESO-PESOS-N-USAPI +         
                   INGRESO-PESOS-N-USAPI * K-INTERVALO-USAPI.        
           MOVE INGRESO-PESOS-N-SUP-USAPI TO INGRESO-PESOS-SUP-USAPI.        
