      * SCOUSAAA-PROC.v.0004
REMARK************************************************************************
REMARK* CONJUNTO DE RUTINAS QUE PERMITE CALCULAR EL SCORE GENERICO DE
REMARK* ACIERTA AA  .                                                      *
REMARK* ENTRADA :CUANDO SE INVOCA ESTE COPY LAS CARACTERÍSTICAS YA DEBEN
REMARK*  ESTAR LEÍDAS Y CALCULADAS Y LA FORMA DE LLAMADO ES PERFORM A
REMARK*  5000-CALCULAR-SCORE-USAAA.
REMARK*      HAY QUE LLENAR EL PARAMETRO PORTAFOLIO-USAAA CON:
REMARK*          DCOM   : SEGMENTO TELCOS SCORCARD 1 Y 2
REMARK*          DFDI   : SEGMENTO FINANCIERO DISCRIMINADO ,3,4,5,6,9
REMARK*          DFGE   : SEGMENTO FINANCIERO GENERICO  ,3,4,5,6,9
REMARK*          DCOO   : SEGMENTO COOPERATIVO SCORCAR 7 Y 8   
REMARK* SALIDAS
REMARK*   EL CALCULO DEL SCORE SE ENTREGA EN NUMERICO                  
REMARK*   SIGUIENTES VARIABLES
REMARK*      SCORE-USAAA                        PIC 9(3).
REMARK*      PROBABILIDAD-USAAA                 PIC 9(3).
REMARK*  ADICIONALMENTE SE ENTREGAN LAS RAZONES ADVERSAS Y EL SCORE-CARD
REMARK*      ADVERSE-RAZON-USAAA OCCURS 4 TIMES PIC 9(02).
REMARK*      SCORE-CARD-USAAA                   PIC 9(01).
REMARK*  PARA EL PORTAFOLIO "DFDI" SE ADICIONAN LOS SCORES DISCRIMINADOS:
REMARK*      ROTATIVO             ADVERSE-RAZON-USAAA(2)
REMARK*      INSTALAMENTO         ADVERSE-RAZON-USAAA(3)
REMARK*      VEHICULO             ADVERSE-RAZON-USAAA(4)
REMARK*
REMARK**********************************************************************
      * RMB0002     * DTRN01 : SCORCARD 3 : ROTATIVOS Y TC NUEVOS      *
      * R.MARTINEZ  * DTRE01 : SCORCARD 4 : ROTATIVOS Y TC RXISTENTES  *
      * 2012-OCT-10 * DINT01 : SCORCARD 5 : INSTALAMENTOS NUEVOS Y EXIS*
      *             * DHVT01 : SCORCARD 6 : HIPO Y AUTOMO NUEVOS Y EXIS*
      *             * DFUT01 : SCORCARD 9 : FINANCIERO UN NUEVOS Y EXIS*
      *             * ACIFAC : GENERICOS POR CAMBIO DE FACTURACION     *
      ******************************************************************     
REMARK* RMB0003     * DCPN01 : SCORCARD 7 : COOPERATIVO    NUEVOS      *
REMARK* R.MARTINEZ  * DCPE01 : SCORCARD 8 : COOPERATIVO    EXISTENTES  *
REMARK* 2012-DIC-05 * COMB01 : ADICION DEL MANEJO DE COMBOS            *
REMARK******************************************************************     
REMARK* RMB0004     * EXCL01 : SE CORRIGE LA EXCLUSION 075 PARA QUE    *
REMARK* R.MARTINEZ  *        : MANEJE BIEN LAS CARTERAS CASTIGAS.      *
REMARK* 2013-ENE-25 *        : COPIA LA ESTRATEGIA HECHA EN  ACIERTA + *
REMARK******************************************************************     
       5000-CALCULAR-CAR-SCORE-USAAA.
REMARK**********************************************************************
REMARK*5000-CALCULAR-CAR-SCORE-USAAA.
REMARK* RUTINA QUE LLAMA LAS CARACTERISTICAS SIN LEY EL SCORE PREDICTA HD
REMARK**********************************************************************
           MOVE AMNISTIA21-LEEMSTRS TO AMNISTIA21-CARACT.      
           MOVE SW-ART13-AMNIST21   TO AMNISTIA21-ART13-CARACT.
           MOVE 0 TO AMNISTIA21-LEEMSTRS .
           MOVE 0 TO SW-ART13-AMNIST21  .  
           IF TIPO-ID-CARACT = 1 OR TIPO-ID-CARACT  = 4    
              PERFORM 1000-CALCULAR-CARACTERISTICAS       
              PERFORM 5000-CALCULAR-SCORE-USAAA          
           ELSE                                         
              PERFORM 5000A-INICIALIZAR-USAAA          
              MOVE 1 TO SIN-EXCLUSION-USAAA           
              MOVE 70  TO  ADVERSE-RAZON-USAAA(1)     
COMB01        MOVE 70  TO  ADVERSE-RAZON-COMBO-USAAA(1)                 RMB0003
           END-IF.                                    
           MOVE  AMNISTIA21-CARACT TO AMNISTIA21-LEEMSTRS.
           MOVE  AMNISTIA21-ART13-CARACT TO SW-ART13-AMNIST21.
       5000-CALCULAR-SCORE-USAAA.
REMARK**********************************************************************
REMARK*5000-CALCULAR-SCORE-USAAA.
REMARK* RUTINA QUE EXAMINA EL SEGMENTO DE QUIEN COSULTA, APLICA EXCLUSIONES
REMARK* Y SI PASA EL FILTRO ESTIMA EL SCORE   DE ELLA.
REMARK**********************************************************************
COMB01     IF PORTAFOLIO-USAAA = "CTRO" OR "CINT" OR "CHVT"             RMB0003
COMB01        PERFORM 5000-CALCULAR-COMBO-USAAA                         RMB0003
COMB01     ELSE                                                         RMB0003
COMB01        PERFORM 5000-CALCULAR-UNSOLO-USAAA                        RMB0003
COMB01     END-IF.                                                      RMB0003
COMB01 5000-CALCULAR-COMBO-USAAA.                                       RMB0003
REMARK********************************************************************
REMARK*5000-CALCULAR-COMBO-USAAA.
REMARK*    SE CALCULA DOS SCORES . EL FINACIERO ESPECIFICO Y EL GENERICO
REMARK********************************************************************
COMB01     INITIALIZE INF-SCORE-COMBO-USAAA.                            RMB0003
COMB01     MOVE PORTAFOLIO-USAAA TO PORTAFOLIO-COMBO-USAAA.             RMB0003
COMB01     EVALUATE PORTAFOLIO-USAAA                                    RMB0003
COMB01       WHEN "CTRO"                                                RMB0003
COMB01         MOVE "DTRO" TO PORTAFOLIO-USAAA                          RMB0003
COMB01         PERFORM 5000-CALCULAR-UNSOLO-USAAA                       RMB0003
COMB01       WHEN "CINT"                                                RMB0003
COMB01         MOVE "DINT" TO PORTAFOLIO-USAAA                          RMB0003
COMB01         PERFORM 5000-CALCULAR-UNSOLO-USAAA                       RMB0003
COMB01       WHEN "CHVT"                                                RMB0003
COMB01         MOVE "DHVT" TO PORTAFOLIO-USAAA                          RMB0003
COMB01         PERFORM 5000-CALCULAR-UNSOLO-USAAA                       RMB0003
COMB01     END-EVALUATE.                                                RMB0003
COMB01     MOVE SCORE-USAAA TO SCORE-COMBO-USAAA.                       RMB0003
COMB01     MOVE PROBABILIDAD-USAAA TO PROBABILIDAD-COMBO-USAAA.         RMB0003
COMB01     MOVE SCORE-CARD-USAAA TO SCORE-CARD-COMBO-USAAA.             RMB0003
COMB01     MOVE ADVERSE-RAZON-USAAA(1) TO ADVERSE-RAZON-COMBO-USAAA(1). RMB0003
COMB01     MOVE ADVERSE-RAZON-USAAA(2) TO ADVERSE-RAZON-COMBO-USAAA(2). RMB0003
COMB01     MOVE ADVERSE-RAZON-USAAA(3) TO ADVERSE-RAZON-COMBO-USAAA(3). RMB0003
COMB01     MOVE ADVERSE-RAZON-USAAA(4) TO ADVERSE-RAZON-COMBO-USAAA(4). RMB0003
COMB01     MOVE "DFGE" TO PORTAFOLIO-USAAA.                             RMB0003
COMB01     PERFORM 5000-CALCULAR-UNSOLO-USAAA.                          RMB0003
COMB01     MOVE PORTAFOLIO-COMBO-USAAA TO PORTAFOLIO-USAAA.             RMB0003
COMB01 5000-CALCULAR-UNSOLO-USAAA.                                      RMB0003
REMARK********************************************************************
REMARK*5000-CALCULAR-UNSOLO-USAAA.
REMARK*    SE CALCULA CADA SCORE POR SEPARADO
REMARK********************************************************************
           PERFORM 5000A-INICIALIZAR-USAAA.
           PERFORM 5100-VER-EXCLUSIONES-USAAA
           IF SIN-EXCLUSION-USAAA = 0
              PERFORM 5200-VER-SCORE-CARD-USAAA
           END-IF.    
       5000A-INICIALIZAR-USAAA.
REMARK**********************************************************************
REMARK*    SE INICIALIZAN LAS VARIABLES INVOLUCRADAS EN LAS EXCLUSIONES Y
REMARK*    CALCULO DE LA SEGMENTACION A APLICAR.
REMARK**********************************************************************
           INITIALIZE VARIABLES-WORK-USAAA.
      *    EXCLUSION FALLECIDOS
           MOVE 00DEM001    TO CO00DEM001.    
           MOVE 00DEM002    TO CO00DEM002.    
      *    EXCLUSION TIPO 5 O TIPO 1 SIN DESEMPEÑO O SOLO CODEUDORES
           MOVE 01NUM001RO  TO CO01NUM001RO.
           MOVE 01NUM001IN  TO CO01NUM001IN.
           MOVE 01NUM001VE  TO CO01NUM001VE.
           MOVE 01NUM001HP  TO CO01NUM001HP.
           MOVE 01NUM001OT  TO CO01NUM001OT.
           MOVE 01NUM001CC  TO CO01NUM001CC.
           MOVE 01NUM001CO  TO CO01NUM001CO.
           MOVE 01NUM001AH  TO CO01NUM001AH.
           MOVE 01NUM001CT  TO CO01NUM001CT.
       5100-VER-EXCLUSIONES-USAAA.
REMARK**********************************************************************
REMARK*5100-VER-EXCLUSIONES-USAAA.
REMARK* DE ACUERDO A CARACTERISTICAS ESPECIFICAS SE EXAMINA SI ES UNA
REMARK* PERSONA SUJETA A EXCLUSION EN EL CALCULO DE ACIERTA AA   
REMARK**********************************************************************
           *> PORTAFOLIO INVALIDO               
ACIFAC     IF PORTAFOLIO-USAAA <> "DCOM" AND <> "DTRO" AND              RMB0002
ACIFAC                         <> "DINT" AND <> "DHVT" AND              RMB0002
                               <> "DFGE" AND <> "DCOO"
                   MOVE 1 TO SIN-EXCLUSION-USAAA
                   MOVE 77  TO  ADVERSE-RAZON-USAAA(1)
                   MOVE 0   TO SCORE-USAAA
           END-IF.                      
           *> CLIENTES TIPO ID 2 OR 3
           IF SIN-EXCLUSION-USAAA = 0
              IF TIPO-ID-CARACT NOT = 1 AND TIPO-ID-CARACT NOT = 4
                 MOVE 1 TO SIN-EXCLUSION-USAAA 
                 MOVE 70  TO  ADVERSE-RAZON-USAAA(1)  
                 MOVE 0   TO SCORE-USAAA
              END-IF
           END-IF.
           *> CLIENTES TIPO 5
           IF SIN-EXCLUSION-USAAA = 0
              IF CO01NUM001AH = "  -1" AND CO01NUM001CT = "  -1" AND 
                 CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND 
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND 
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND 
                 CO01NUM001CO = "  -1" 
                 MOVE 1 TO SIN-EXCLUSION-USAAA 
                 MOVE 71  TO  ADVERSE-RAZON-USAAA(1)     
                 MOVE 0   TO SCORE-USAAA
              END-IF
           END-IF.
           *> CLIENTES TIPO 1 SIN DESEMPEÑO
           IF SIN-EXCLUSION-USAAA = 0
              IF (CO01NUM001AH > 0000 OR CO01NUM001CT > 0000 )   AND
                 CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND 
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND 
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND 
                 CO01NUM001CO = "  -1" 
                 MOVE 1 TO SIN-EXCLUSION-USAAA 
                 MOVE 72  TO  ADVERSE-RAZON-USAAA(1)     
                 MOVE 0   TO SCORE-USAAA
              END-IF
           END-IF.
           *> CLIENTES FALLECIDOS                
           IF SIN-EXCLUSION-USAAA = 0
              IF CO00DEM001 = 01 OR CO00DEM002 = 01         
                 MOVE 1 TO SIN-EXCLUSION-USAAA 
                 MOVE 73  TO  ADVERSE-RAZON-USAAA(1)     
                 MOVE 3   TO SCORE-USAAA
              END-IF
           END-IF.
           *> CLIENTES QUE SON SOLO CODEUDORES  
           IF SIN-EXCLUSION-USAAA = 0
              IF CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND 
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND 
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND 
                 CO01NUM001CO <> "  -1" 
                 MOVE 1 TO SIN-EXCLUSION-USAAA 
                 MOVE 74  TO  ADVERSE-RAZON-USAAA(1)     
                 MOVE 4   TO SCORE-USAAA
              END-IF
           END-IF.
           *> EXCLUSIONES POR MOROSIDAD. DEPENDE DEL SEGMENTO
           IF SIN-EXCLUSION-USAAA = 0 
              EVALUATE PORTAFOLIO-USAAA
                WHEN "DCOM"
                  PERFORM 5110-EXCLUSION-DCOM-USAAA
ACIFAC          WHEN "DTRO"                                             RMB0002
ACIFAC            PERFORM 5110-EXCLUSION-DTRO-USAAA                     RMB0002
ACIFAC          WHEN "DINT"                                             RMB0002
ACIFAC            PERFORM 5110-EXCLUSION-DINT-USAAA                     RMB0002
ACIFAC          WHEN "DHVT"                                             RMB0002
ACIFAC            PERFORM 5110-EXCLUSION-DHVT-USAAA                     RMB0002
                WHEN "DFGE"
ACIFAC            PERFORM 5110-EXCLUSION-DFGE-USAAA                     RMB0002
                WHEN "DCOO"
                  PERFORM 5110-EXCLUSION-DCOO-USAAA
                WHEN ANY      
                   MOVE 1 TO SIN-EXCLUSION-USAAA 
                   MOVE 77  TO  ADVERSE-RAZON-USAAA(1)     
                   MOVE 0   TO SCORE-USAAA
              END-EVALUATE
           END-IF.
      *    CALCULO DEL SALARIO MINIMO AL RUN DATE
           IF ANO-SMLMV-CARACT(99) <> 9999
              PERFORM 1100-CARGA-SAL-MINIMO
           END-IF.
           MOVE ANO-RUN-CARACT TO ANO-NOV-SMLMV-CARACT
           MOVE 1 TO IND-E-CARACT
           PERFORM UNTIL ANO-SMLMV-CARACT(IND-E-CARACT) = 9999 OR
                ANO-SMLMV-CARACT(IND-E-CARACT) =
                ANO-NOV-SMLMV-CARACT
                ADD 1 TO IND-E-CARACT
           END-PERFORM
           IF ANO-SMLMV-CARACT(IND-E-CARACT) <> 9999
              MOVE VLR-SMLMV-CARACT(IND-E-CARACT) TO VLR-SMLMV-USAAA
           ELSE
              MOVE 1 TO SIN-EXCLUSION-USAAA 
              MOVE 78  TO  ADVERSE-RAZON-USAAA(1)  
              DISPLAY "ERROR BUSCANDO SALARIO MINIMO"
                      ANO-NOV-SMLMV-CARACT 
           END-IF.
EXCL01 6000-QTOTABHD-USAAA.                                             RMB0004
REMARK********************************************************************
REMARK*6000-QTOTABHD-USAAA.
REMARK*    CALCULO DEL TOTAL DE OBLIGACIONES ABIERTAS DE UNA PERSONA
REMARK*    INCLUYENDO CODEUDORES
REMARK********************************************************************
EXCL01     MOVE 01NUM002CC TO CO01NUM002CC                              RMB0004
EXCL01     IF CO01NUM002CC NUMERIC                                      RMB0004
EXCL01        MOVE CO01NUM002CC TO CO01NUM002CCV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO01NUM002CCV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     MOVE 01NUM002RO TO CO01NUM002RO                              RMB0004
EXCL01     IF CO01NUM002RO NUMERIC                                      RMB0004
EXCL01        MOVE CO01NUM002RO TO CO01NUM002ROV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO01NUM002ROV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     MOVE 01NUM002IN TO CO01NUM002IN                              RMB0004
EXCL01     IF CO01NUM002IN NUMERIC                                      RMB0004
EXCL01        MOVE CO01NUM002IN TO CO01NUM002INV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO01NUM002INV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     MOVE 01NUM002OT TO CO01NUM002OT                              RMB0004
EXCL01     IF CO01NUM002OT NUMERIC                                      RMB0004
EXCL01        MOVE CO01NUM002OT TO CO01NUM002OTV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO01NUM002OTV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     MOVE 01NUM002CO TO CO01NUM002CO                              RMB0004
EXCL01     IF CO01NUM002CO NUMERIC                                      RMB0004
EXCL01        MOVE CO01NUM002CO TO CO01NUM002COV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO01NUM002COV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     MOVE 01NUM002VE TO CO01NUM002VE                              RMB0004
EXCL01     IF CO01NUM002VE NUMERIC                                      RMB0004
EXCL01        MOVE CO01NUM002VE TO CO01NUM002VEV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO01NUM002VEV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     MOVE 01NUM002HP TO CO01NUM002HP                              RMB0004
EXCL01     IF CO01NUM002HP NUMERIC                                      RMB0004
EXCL01        MOVE CO01NUM002HP TO CO01NUM002HPV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO01NUM002HPV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     COMPUTE AA-QTOTABHD  = CO01NUM002CCV + CO01NUM002ROV         RMB0004
EXCL01                      + CO01NUM002INV + CO01NUM002OTV             RMB0004
EXCL01                      + CO01NUM002COV + CO01NUM002VEV             RMB0004
EXCL01                      + CO01NUM002HPV .                           RMB0004
EXCL01 5100-MORAS-Y-CASTIGOS-SCOUSAAA.                                  RMB0004
REMARK**********************************************************************
REMARK*5100-MORAS-Y-CASTIGOS-SCOUSAAA.
REMARK*    SE CALCULA LAS MORAS DETALLADAS Y LOS CASTIGOS DE LA PERSONA
REMARK**********************************************************************
EXCL01*    CALCULO DE MORAS                                             RMB0004
EXCL01     INITIALIZE AA-DMOR  AA-QTOT090  AA-QTOT120.                  RMB0004
EXCL01     INITIALIZE AA-EMOR  AA-QALDIA   AA-QTOT030   AA-QTOT060      RMB0004
EXCL01     PERFORM 6500-QALDIA-USAAA.                                   RMB0004
EXCL01     PERFORM 6500-QTOT030-USAAA                                   RMB0004
EXCL01     PERFORM 6500-QTOT060-USAAA                                   RMB0004
EXCL01     PERFORM 6500-QTOT090-USAAA                                   RMB0004
EXCL01     PERFORM 6500-QTOT120-USAAA                                   RMB0004
EXCL01*    CALCULO PARA CASTIGADAS                                      RMB0004
EXCL01     PERFORM 6000-QTOTABHD-USAAA                                  RMB0004
EXCL01     MOVE 02NUM018TO  TO CO02NUM018TO.                            RMB0004 
EXCL01     IF CO02NUM018TO NUMERIC                                      RMB0004
EXCL01        MOVE CO02NUM018TO TO CO02NUM018TOV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO02NUM018TOV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     MOVE 02NUM020TO  TO CO02NUM020TO.                            RMB0004
EXCL01     IF CO02NUM020TO NUMERIC                                      RMB0004
EXCL01        MOVE CO02NUM020TO TO CO02NUM020TOV                        RMB0004
EXCL01     ELSE                                                         RMB0004
EXCL01        MOVE ZERO         TO CO02NUM020TOV                        RMB0004
EXCL01     END-IF.                                                      RMB0004
EXCL01     COMPUTE AA-QCTASDEFAULT = CO02NUM018TOV + CO02NUM020TOV.     RMB0004
       5110-EXCLUSION-DCOM-USAAA.
EXCL01*    PERFORM 6000-QTOTAB-USAAA.                                   RMB0004
EXCL01*    PERFORM 6000-M120-USAAA.                                     RMB0004
EXCL01*    COMPUTE AA-DMOR =  AA-M120.                                  RMB0004
EXCL01     PERFORM 5100-MORAS-Y-CASTIGOS-SCOUSAAA.                      RMB0004
EXCL01     COMPUTE AA-DMOR = AA-QTOT120                                 RMB0004
EXCL01     COMPUTE AA-EMOR = AA-QALDIA + AA-QTOT030 + AA-QTOT060        RMB0004
EXCL01                  + AA-QTOT090                                    RMB0004
EXCL01*    IF AA-QTOTAB > 0 AND AA-QTOTAB = AA-DMOR                     RMB0004
EXCL01     IF (AA-DMOR > 0 AND AA-EMOR = 0 ) OR   *> MORAS              RMB0004
EXCL01        AA-QCTASDEFAULT > 0 AND             *> CASTIGOS           RMB0004
EXCL01           AA-QCTASDEFAULT = AA-QTOTABHD                          RMB0004
                 MOVE 1 TO SIN-EXCLUSION-USAAA
                 MOVE 75  TO  ADVERSE-RAZON-USAAA(1)
                 MOVE 1   TO SCORE-USAAA
           END-IF.
       5110-EXCLUSION-DTRO-USAAA.
EXCL01*    PERFORM 6000-QTOTAB-USAAA.                                   RMB0004
EXCL01*    PERFORM 6000-M120-USAAA.                                     RMB0004
EXCL01*    PERFORM 6000-M90-USAAA.                                      RMB0004
EXCL01*    COMPUTE AA-DMOR =  AA-M90 + AA-M120.                         RMB0004
EXCL01     PERFORM 5100-MORAS-Y-CASTIGOS-SCOUSAAA.                      RMB0004
EXCL01     COMPUTE AA-DMOR = AA-QTOT090 + AA-QTOT120                    RMB0004
EXCL01     COMPUTE AA-EMOR = AA-QALDIA + AA-QTOT030 + AA-QTOT060        RMB0004
EXCL01*    IF AA-QTOTAB > 0 AND AA-QTOTAB = AA-DMOR                     RMB0004
EXCL01     IF (AA-DMOR > 0 AND AA-EMOR = 0 ) OR    *> MORAS             RMB0004
EXCL01        AA-QCTASDEFAULT > 0 AND        *> CASTIGOS                RMB0004
EXCL01           AA-QCTASDEFAULT = AA-QTOTABHD                          RMB0004
DTRN01           MOVE 1 TO SIN-EXCLUSION-USAAA                          RMB0002
DTRN01           MOVE 75  TO  ADVERSE-RAZON-USAAA(1)                    RMB0002
DTRN01           MOVE 1   TO SCORE-USAAA                                RMB0002
DTRN01     END-IF.                                                      RMB0002
DINT01 5110-EXCLUSION-DINT-USAAA.                                       RMB0002
EXCL01*    PERFORM 6000-QTOTAB-USAAA.                                   RMB0004
EXCL01*    PERFORM 6000-M120-USAAA.                                     RMB0004
EXCL01*    COMPUTE AA-DMOR =  AA-M120.                                  RMB0004
EXCL01     PERFORM 5100-MORAS-Y-CASTIGOS-SCOUSAAA.                      RMB0004
EXCL01     COMPUTE AA-DMOR = AA-QTOT120                                 RMB0004
EXCL01     COMPUTE AA-EMOR = AA-QALDIA + AA-QTOT030 + AA-QTOT060        RMB0004
EXCL01                  + AA-QTOT090                                    RMB0004
EXCL01*    IF AA-QTOTAB > 0 AND AA-QTOTAB = AA-DMOR                     RMB0004
EXCL01     IF (AA-DMOR > 0 AND AA-EMOR = 0 ) OR   *> MORAS              RMB0004
EXCL01        AA-QCTASDEFAULT > 0 AND             *> CASTIGOS           RMB0004
EXCL01           AA-QCTASDEFAULT = AA-QTOTABHD                          RMB0004
DINT01           MOVE 1 TO SIN-EXCLUSION-USAAA                          RMB0002
DINT01           MOVE 75  TO  ADVERSE-RAZON-USAAA(1)                    RMB0002
DINT01           MOVE 1   TO SCORE-USAAA                                RMB0002
DINT01     END-IF.                                                      RMB0002
ACIFAC 5110-EXCLUSION-DHVT-USAAA.                                       RMB0002
EXCL01*    PERFORM 6000-QTOTAB-USAAA.                                   RMB0004
EXCL01*    PERFORM 6000-M90-USAAA.                                      RMB0004
EXCL01*    PERFORM 6000-M120-USAAA.                                     RMB0004
EXCL01*    COMPUTE AA-DMOR =  AA-M90 + AA-M120.                         RMB0004
EXCL01     PERFORM 5100-MORAS-Y-CASTIGOS-SCOUSAAA.                      RMB0004
EXCL01     COMPUTE AA-DMOR = AA-QTOT090 + AA-QTOT120                    RMB0004
EXCL01     COMPUTE AA-EMOR = AA-QALDIA + AA-QTOT030 + AA-QTOT060        RMB0004
EXCL01*    IF AA-QTOTAB > 0 AND AA-QTOTAB = AA-DMOR                     RMB0004
EXCL01     IF (AA-DMOR > 0 AND AA-EMOR = 0 ) OR   *> MORAS              RMB0004
EXCL01        AA-QCTASDEFAULT > 0 AND             *> CASTIGOS           RMB0004
EXCL01           AA-QCTASDEFAULT = AA-QTOTABHD                          RMB0004
DHVT01           MOVE 1 TO SIN-EXCLUSION-USAAA                          RMB0002
DHVT01           MOVE 75  TO  ADVERSE-RAZON-USAAA(1)                    RMB0002
DHVT01           MOVE 1   TO SCORE-USAAA                                RMB0002
DHVT01     END-IF.                                                      RMB0002
ACIFAC 5110-EXCLUSION-DFGE-USAAA.                                       RMB0002
EXCL01*    PERFORM 6000-QTOTAB-USAAA.                                   RMB0004
EXCL01*    PERFORM 6000-M90-USAAA.                                      RMB0004
EXCL01*    PERFORM 6000-M120-USAAA.                                     RMB0004
EXCL01*    COMPUTE AA-DMOR =  AA-M90 + AA-M120.                         RMB0004
EXCL01     PERFORM 5100-MORAS-Y-CASTIGOS-SCOUSAAA.                      RMB0004
EXCL01     COMPUTE AA-DMOR = AA-QTOT090 + AA-QTOT120                    RMB0004
EXCL01     COMPUTE AA-EMOR = AA-QALDIA + AA-QTOT030 + AA-QTOT060        RMB0004
EXCL01*    IF AA-QTOTAB > 0 AND AA-QTOTAB = AA-DMOR                     RMB0004
EXCL01     IF (AA-DMOR > 0 AND AA-EMOR = 0 ) OR   *> MORAS              RMB0004
EXCL01        AA-QCTASDEFAULT > 0 AND             *> CASTIGOS           RMB0004
EXCL01           AA-QCTASDEFAULT = AA-QTOTABHD                          RMB0004
DFUT01           MOVE 1 TO SIN-EXCLUSION-USAAA                          RMB0002
DFUT01           MOVE 75  TO  ADVERSE-RAZON-USAAA(1)                    RMB0002
DFUT01           MOVE 1   TO SCORE-USAAA                                RMB0002
DFUT01     END-IF.                                                      RMB0002
       5110-EXCLUSION-DCOO-USAAA.
EXCL01*    PERFORM 6000-QTOTAB-USAAA.                                   RMB0004
EXCL01*    PERFORM 6000-M90-USAAA.                                      RMB0004
EXCL01*    PERFORM 6000-M120-USAAA.                                     RMB0004
EXCL01*    COMPUTE AA-DMOR =  AA-M90 + AA-M120.                         RMB0004
EXCL01     PERFORM 5100-MORAS-Y-CASTIGOS-SCOUSAAA.                      RMB0004
EXCL01     COMPUTE AA-DMOR = AA-QTOT090 + AA-QTOT120                    RMB0004
EXCL01     COMPUTE AA-EMOR = AA-QALDIA + AA-QTOT030 + AA-QTOT060        RMB0004
EXCL01*    IF AA-QTOTAB > 0 AND AA-QTOTAB = AA-DMOR                     RMB0004
EXCL01     IF (AA-DMOR > 0 AND AA-EMOR = 0 ) OR   *> MORAS              RMB0004
EXCL01        AA-QCTASDEFAULT > 0 AND             *> CASTIGOS           RMB0004
EXCL01           AA-QCTASDEFAULT = AA-QTOTABHD                          RMB0004
DCPN01           MOVE 1 TO SIN-EXCLUSION-USAAA                          RMB0003
DCPN01           MOVE 75  TO  ADVERSE-RAZON-USAAA(1)                    RMB0003
DCPN01           MOVE 1   TO SCORE-USAAA                                RMB0003
DCPN01     END-IF.                                                      RMB0003
       5200-VER-SCORE-CARD-USAAA.
REMARK**********************************************************************
REMARK*5200-VER-SCORE-CARD-USAAA.
REMARK*    SE EXAMINAN LAS CARACTERISTICAS QUE DETERMINAN A QUE SCORECARD
REMARK*    PERTENECE LA PERSONA EXAMINANADA.
REMARK**********************************************************************
           EVALUATE PORTAFOLIO-USAAA
             WHEN "DCOM"
                IF 01DEM031  = 0
ACIFAC*            COMUNICACION NUEVOS                                  RMB0002
                   MOVE 1 TO SCORE-CARD-USAAA
                   PERFORM 6100-SCORE-CARD1-USAAA
                ELSE
ACIFAC*            COMUNICACION EXISTENTES                              RMB0002
                   MOVE 2 TO SCORE-CARD-USAAA
                   PERFORM 6200-SCORE-CARD2-USAAA
                END-IF
ACIFAC       WHEN "DTRO"                                                RMB0002
                IF 01DEM031  = 0
ACIFAC*            ROTATIVOS NUEVOS                                     RMB0002
                   MOVE 3 TO SCORE-CARD-USAAA
                   PERFORM 6300-SCORE-CARD3-USAAA
                ELSE
ACIFAC*            ROTATIVOS EXISTENTES                                 RMB0002
                   MOVE 4 TO SCORE-CARD-USAAA
                   PERFORM 6400-SCORE-CARD4-USAAA
                END-IF
ACIFAC       WHEN "DINT"                                                RMB0002
ACIFAC*         INSTALAMENTOS                                           RMB0002
ACIFAC          MOVE 5 TO SCORE-CARD-USAAA                              RMB0002
ACIFAC          PERFORM 6500-SCORE-CARD5-USAAA                          RMB0002
ACIFAC       WHEN "DHVT"                                                RMB0002
ACIFAC*         VEHICULOS                                               RMB0002
ACIFAC          MOVE 6 TO SCORE-CARD-USAAA                              RMB0002
ACIFAC          PERFORM 6600-SCORE-CARD6-USAAA                          RMB0002
             WHEN "DFGE"
ACIFAC*         FINACIERO UNICO                                         RMB0002
ACIFAC          MOVE 9 TO SCORE-CARD-USAAA                              RMB0002
                PERFORM 6800-SCORE-CARD9-USAAA
             WHEN "DCOO"
                IF 01DEM031  = 0
                   MOVE 7 TO SCORE-CARD-USAAA
                   PERFORM 6700-SCORE-CARD7-USAAA
                ELSE
                   MOVE 8 TO SCORE-CARD-USAAA
                   PERFORM 6800-SCORE-CARD8-USAAA
                END-IF
             WHEN ANY      
                DISPLAY "SCOUSAAA:ERR 002 PORTAFOLIO INVALIDO=",
                PORTAFOLIO-USAAA
           END-EVALUATE.
       6000-M30-USAAA.
REMARK**************************************************************
REMARK*6000-M30-USAAA.
REMARK*    NUMERO TOTAL MORAS de 30 DIAS
REMARK**************************************************************
           IF 01MOR002RO(1:1) = " " MOVE ZEROS      TO CO01MOR002ROV
           ELSE                     MOVE 01MOR002RO TO CO01MOR002ROV.
           IF 01MOR002IN(1:1) = " " MOVE ZEROS      TO CO01MOR002INV
           ELSE                     MOVE 01MOR002IN TO CO01MOR002INV.
           IF 01MOR002OT(1:1) = " " MOVE ZEROS      TO CO01MOR002OTV
           ELSE                     MOVE 01MOR002OT TO CO01MOR002OTV.
           IF 01MOR002VE(1:1) = " " MOVE ZEROS      TO CO01MOR002VEV
           ELSE                     MOVE 01MOR002VE TO CO01MOR002VEV.
           IF 01MOR002CC(1:1) = " " MOVE ZEROS      TO CO01MOR002CCV
           ELSE                     MOVE 01MOR002CC TO CO01MOR002CCV.
           IF 01MOR002HP(1:1) = " " MOVE ZEROS      TO CO01MOR002HPV
           ELSE                     MOVE 01MOR002HP TO CO01MOR002HPV.
           COMPUTE AA-M30       = CO01MOR002ROV + CO01MOR002INV +
                                  CO01MOR002VEV + CO01MOR002HPV +
                                  CO01MOR002CCV + CO01MOR002OTV .
       6000-M60-USAAA.
REMARK**************************************************************
REMARK*6000-M60-USAAA.
REMARK*    NUMERO TOTAL MORAS DE  60 DIAS
REMARK**************************************************************
           IF 01MOR003RO(1:1) = " " MOVE ZEROS      TO CO01MOR003ROV
           ELSE                     MOVE 01MOR003RO TO CO01MOR003ROV.
           IF 01MOR003IN(1:1) = " " MOVE ZEROS      TO CO01MOR003INV
           ELSE                     MOVE 01MOR003IN TO CO01MOR003INV.
           IF 01MOR003OT(1:1) = " " MOVE ZEROS      TO CO01MOR003OTV
           ELSE                     MOVE 01MOR003OT TO CO01MOR003OTV.
           IF 01MOR003VE(1:1) = " " MOVE ZEROS      TO CO01MOR003VEV
           ELSE                     MOVE 01MOR003VE TO CO01MOR003VEV.
           IF 01MOR003CC(1:1) = " " MOVE ZEROS      TO CO01MOR003CCV
           ELSE                     MOVE 01MOR003CC TO CO01MOR003CCV.
           IF 01MOR003HP(1:1) = " " MOVE ZEROS      TO CO01MOR003HPV
           ELSE                     MOVE 01MOR003HP TO CO01MOR003HPV.
           COMPUTE AA-M60       = CO01MOR003ROV + CO01MOR003INV +
                                  CO01MOR003VEV + CO01MOR003HPV +
                                  CO01MOR003CCV + CO01MOR003OTV .
       6000-M90-USAAA.
REMARK**************************************************************
REMARK*6000-M90-USAAA.
REMARK*    NUMERO TOTAL MORAS DE  90 DIAS
REMARK**************************************************************
           IF 01MOR004RO(1:1) = " " MOVE ZEROS      TO CO01MOR004ROV
           ELSE                     MOVE 01MOR004RO TO CO01MOR004ROV.
           IF 01MOR004IN(1:1) = " " MOVE ZEROS      TO CO01MOR004INV
           ELSE                     MOVE 01MOR004IN TO CO01MOR004INV.
           IF 01MOR004OT(1:1) = " " MOVE ZEROS      TO CO01MOR004OTV
           ELSE                     MOVE 01MOR004OT TO CO01MOR004OTV.
           IF 01MOR004VE(1:1) = " " MOVE ZEROS      TO CO01MOR004VEV
           ELSE                     MOVE 01MOR004VE TO CO01MOR004VEV.
           IF 01MOR004CC(1:1) = " " MOVE ZEROS      TO CO01MOR004CCV
           ELSE                     MOVE 01MOR004CC TO CO01MOR004CCV.
           IF 01MOR004HP(1:1) = " " MOVE ZEROS      TO CO01MOR004HPV
           ELSE                     MOVE 01MOR004HP TO CO01MOR004HPV.
           COMPUTE AA-M90       = CO01MOR004ROV + CO01MOR004INV +
                                  CO01MOR004VEV + CO01MOR004HPV +
                                  CO01MOR004CCV + CO01MOR004OTV .
       6000-M120-USAAA.
REMARK**************************************************************
REMARK*6000-M120-USAAA.
REMARK*    NUMERO TOTAL MORAS DE 120 DIAS
REMARK**************************************************************
           IF 01MOR005RO(1:1) = " " MOVE ZEROS      TO CO01MOR005ROV
           ELSE                     MOVE 01MOR005RO TO CO01MOR005ROV.
           IF 01MOR005IN(1:1) = " " MOVE ZEROS      TO CO01MOR005INV
           ELSE                     MOVE 01MOR005IN TO CO01MOR005INV.
           IF 01MOR005OT(1:1) = " " MOVE ZEROS      TO CO01MOR005OTV
           ELSE                     MOVE 01MOR005OT TO CO01MOR005OTV.
           IF 01MOR005VE(1:1) = " " MOVE ZEROS      TO CO01MOR005VEV
           ELSE                     MOVE 01MOR005VE TO CO01MOR005VEV.
           IF 01MOR005CC(1:1) = " " MOVE ZEROS      TO CO01MOR005CCV
           ELSE                     MOVE 01MOR005CC TO CO01MOR005CCV.
           IF 01MOR005HP(1:1) = " " MOVE ZEROS      TO CO01MOR005HPV
           ELSE                     MOVE 01MOR005HP TO CO01MOR005HPV.
           COMPUTE AA-M120      = CO01MOR005ROV + CO01MOR005INV +
                                  CO01MOR005VEV + CO01MOR005HPV +
                                  CO01MOR005CCV + CO01MOR005OTV .
       6000-QTOTAB-USAAA.
REMARK********************************************************************
REMARK*6000-QTOTAB-USAAA.
REMARK*    CALCULO DEL TOTAL DE OBLIGACIONES ABIERTAS DE UNA PERSONA
REMARK********************************************************************
           MOVE 01NUM002CC TO CO01NUM002CC
           IF CO01NUM002CC NUMERIC
              MOVE CO01NUM002CC TO CO01NUM002CCV
           ELSE
              MOVE ZERO         TO CO01NUM002CCV
           END-IF.
           MOVE 01NUM002RO TO CO01NUM002RO
           IF CO01NUM002RO NUMERIC
              MOVE CO01NUM002RO TO CO01NUM002ROV
           ELSE
              MOVE ZERO         TO CO01NUM002ROV
           END-IF.
           MOVE 01NUM002IN TO CO01NUM002IN
           IF CO01NUM002IN NUMERIC
              MOVE CO01NUM002IN TO CO01NUM002INV
           ELSE
              MOVE ZERO         TO CO01NUM002INV
           END-IF.
           MOVE 01NUM002OT TO CO01NUM002OT
           IF CO01NUM002OT NUMERIC
              MOVE CO01NUM002OT TO CO01NUM002OTV
           ELSE
              MOVE ZERO         TO CO01NUM002OTV
           END-IF.
           MOVE 01NUM002VE TO CO01NUM002VE
           IF CO01NUM002VE NUMERIC
              MOVE CO01NUM002VE TO CO01NUM002VEV
           ELSE
              MOVE ZERO         TO CO01NUM002VEV
           END-IF.
           MOVE 01NUM002HP TO CO01NUM002HP
           IF CO01NUM002HP NUMERIC
              MOVE CO01NUM002HP TO CO01NUM002HPV
           ELSE
              MOVE ZERO         TO CO01NUM002HPV
           END-IF.
           COMPUTE AA-QTOTAB  = CO01NUM002CCV + CO01NUM002ROV
                              + CO01NUM002INV + CO01NUM002OTV
                              + CO01NUM002VEV + CO01NUM002HPV.
DTRN01 6500-QTOT-USAAA.                                                 RMB0002
REMARK********************************************************************
REMARK*    CALCULO DEL TOTAL DE OBLIGACIONES  DE UNA PERSONA
REMARK********************************************************************
DTRN01     MOVE 01NUM001CC TO CO01NUM001CC                              RMB0002
DTRN01     IF CO01NUM001CC NUMERIC                                      RMB0002
DTRN01        MOVE CO01NUM001CC TO CO01NUM001CCV                        RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE ZERO         TO CO01NUM001CCV                        RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     MOVE 01NUM001RO TO CO01NUM001RO                              RMB0002
DTRN01     IF CO01NUM001RO NUMERIC                                      RMB0002
DTRN01        MOVE CO01NUM001RO TO CO01NUM001ROV                        RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE ZERO         TO CO01NUM001ROV                        RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     MOVE 01NUM001IN TO CO01NUM001IN                              RMB0002
DTRN01     IF CO01NUM001IN NUMERIC                                      RMB0002
DTRN01        MOVE CO01NUM001IN TO CO01NUM001INV                        RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE ZERO         TO CO01NUM001INV                        RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     MOVE 01NUM001OT TO CO01NUM001OT                              RMB0002
DTRN01     IF CO01NUM001OT NUMERIC                                      RMB0002
DTRN01        MOVE CO01NUM001OT TO CO01NUM001OTV                        RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE ZERO         TO CO01NUM001OTV                        RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     MOVE 01NUM001VE TO CO01NUM001VE                              RMB0002
DTRN01     IF CO01NUM001VE NUMERIC                                      RMB0002
DTRN01        MOVE CO01NUM001VE TO CO01NUM001VEV                        RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE ZERO         TO CO01NUM001VEV                        RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     MOVE 01NUM001HP TO CO01NUM001HP                              RMB0002
DTRN01     IF CO01NUM001HP NUMERIC                                      RMB0002
DTRN01        MOVE CO01NUM001HP TO CO01NUM001HPV                        RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE ZERO         TO CO01NUM001HPV                        RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     COMPUTE AA-QTOT    = CO01NUM001CCV + CO01NUM001ROV           RMB0002
DTRN01                        + CO01NUM001INV + CO01NUM001OTV           RMB0002
DTRN01                        + CO01NUM001VEV + CO01NUM001HPV.          RMB0002
       6100-SCORE-CARD1-USAAA.
REMARK********************************************************************
REMARK*6100-SCORE-CARD1-USAAA.
REMARK*    SE CALCULA EL SCORE DE TELCOS SIN NINGUNA RELACION CON EL       
REMARK*    CONSULTADO                        
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
REMARK********************************************************************
REMARK*    CALCULO DE VARIABLES HIBRIDAS
REMARK********************************************************************
      *    CALCULO DE PRQALDIA
           PERFORM 6500-QALDIA-USAAA.
           PERFORM 6500-QTOT030-USAAA.
           PERFORM 6500-QTOT060-USAAA.
           PERFORM 6500-QTOT090-USAAA.
           PERFORM 6500-QTOT120-USAAA.
           PERFORM 6500-QTOTCC-USAAA.
           PERFORM 6500-QTOTCR-USAAA.
           COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +
                               AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +
                               AA-QTOTCR.
           IF AA-QTOTMR > 0
              COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )
           ELSE
              MOVE 0 TO AA-PRQALDIA
           END-IF.
      *    CALCULO DE TIPORELD01 Y TIPORELD02
           PERFORM 6500-SECTORES-USAAA.     
      *    CALCULO DE MMAXHIS                             
           PERFORM 6500-MMAXHIS-USAAA.
      *    CALCULO RECMORA001VSA
           PERFORM 6500-RECMORA030-USAAA.
           PERFORM 6500-RECMORA060-USAAA.
           PERFORM 6500-RECMORA090-USAAA.
           PERFORM 6500-RECMORA120-USAAA.
           PERFORM 6500-RECMORACC-USAAA.    
           MOVE AA-RECMORA030 TO AA-RECMORA001
           IF AA-RECMORA060 < AA-RECMORA001
              MOVE AA-RECMORA060 TO AA-RECMORA001
           END-IF.
           IF AA-RECMORA090 < AA-RECMORA001
              MOVE AA-RECMORA090 TO AA-RECMORA001
           END-IF.
           IF AA-RECMORA120 < AA-RECMORA001
              MOVE AA-RECMORA120 TO AA-RECMORA001
           END-IF.
           IF AA-RECMORACC  < AA-RECMORA001
              MOVE AA-RECMORACC  TO AA-RECMORA001
           END-IF.
           MOVE 02NUM018TO TO CO02NUM018TO.                         
           MOVE 01NUM018CO TO CO01NUM018CO.                        
           IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND
              CO02NUM018TO <> CO01NUM018CO AND                   
              AA-RECMORA001 > 0                                 
              MOVE 0 TO AA-RECMORA001VSA                       
           ELSE                                               
              MOVE AA-RECMORA001 TO AA-RECMORA001VSA 
           END-IF.                                           
      *    CALCULO EVER03006P      
           PERFORM 6500-EVER03006P-USAAA.
      *    CALCULO EXPOSICION      
           PERFORM 6500-EXPOSICION-USAAA.
      *    ELIMINAR 999 EN RECMORA
           PERFORM 6500-ELIMIN-999-RECMORA-USAAA.
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES  
REMARK********************************************************************
           MOVE AA-TIPORELD01 TO AA-S1-TIPORELD01-DCCN
*
           MOVE AA-TIPORELD04 TO AA-S1-TIPORELD04-DCCN
*
           MOVE 02EXP008TO      TO CO02EXP008TO.
           IF CO02EXP008TO(6:1) = "."
              MOVE CO02EXP008TO(1:5)  TO CO02EXP008TOV(1:5)
              MOVE CO02EXP008TO(07:2) TO CO02EXP008TOV(6:2)
           ELSE
              MOVE 60                 TO CO02EXP008TOV         
           END-IF
           MOVE CO02EXP008TOV TO AA-S1-CO02EXP008TO-DCCN
*
           MOVE 02EXP001TO      TO CO02EXP001TO.
           IF 02EXP001TO(1:1) = " " MOVE ZEROS      TO CO02EXP001TOV
           ELSE                     MOVE 02EXP001TO TO CO02EXP001TOV.
           MOVE CO02EXP001TOV TO AA-S1-CO02EXP001TO-DCCN
*
           MOVE AA-PRQALDIA TO AA-S1-PRQALDIA-DCCN 
*
           MOVE 02NUM029TO      TO CO02NUM029TO.
           IF 02NUM029TO(1:1) = " " MOVE ZEROS      TO CO02NUM029TOV
           ELSE                     MOVE 02NUM029TO TO CO02NUM029TOV.
           MOVE CO02NUM029TOV TO AA-S1-CO02NUM029TO-DCCN
*
           MOVE 02EXP006TO      TO CO02EXP006TO.
           IF 02EXP006TO(1:1) = " " MOVE ZEROS      TO CO02EXP006TOV
           ELSE                     MOVE 02EXP006TO TO CO02EXP006TOV.
           MOVE CO02EXP006TOV TO AA-S1-CO02EXP006TO-DCCN
      *****************************************************************
      *    ACOTACIONES                    
      *****************************************************************
           IF AA-S1-CO02EXP008TO-DCCN > 100 
             MOVE 100 TO AA-S1-CO02EXP008TO-DCCN.
*
           IF AA-S1-CO02EXP001TO-DCCN > 267 
              MOVE 267 TO AA-S1-CO02EXP001TO-DCCN.
*
           IF AA-S1-PRQALDIA-DCCN     > 1   
             MOVE 1   TO AA-S1-PRQALDIA-DCCN    .
*
           IF AA-S1-CO02NUM029TO-DCCN > 17  
              MOVE  17 TO AA-S1-CO02NUM029TO-DCCN.
*
           IF AA-S1-CO02EXP006TO-DCCN > 115 
              MOVE 115 TO AA-S1-CO02EXP006TO-DCCN.
      *****************************************************************
      *    CALCULO DE DUMMYS
      *****************************************************************
           IF 0 <= AA-MMAXHIS AND AA-MMAXHIS < 2 
              MOVE 1 TO AA-S1-MMAXHIS-DCCND01 
           ELSE 
              MOVE 0 TO AA-S1-MMAXHIS-DCCND01 
           END-IF
           IF 2 <= AA-MMAXHIS 
              MOVE 1 TO AA-S1-MMAXHIS-DCCND02 
           ELSE 
              MOVE 0 TO AA-S1-MMAXHIS-DCCND02 
           END-IF
*
           MOVE 02END015CB  TO CO02END015CB.
           IF CO02END015CB(1:1) NUMERIC
              MOVE CO02END015CB(1:8)  TO CO02END015CBV(1:8)
              MOVE CO02END015CB(10:2) TO CO02END015CBV(9:2)
           END-IF
           IF CO02END015CB(1:1) NUMERIC
              IF 0 <= CO02END015CBV AND CO02END015CBV < 0.65
                 MOVE 1 TO AA-S1-CO02END015CB-DCCND01 
              ELSE
                 MOVE 0 TO AA-S1-CO02END015CB-DCCND01 
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO02END015CB-DCCND01 
           END-IF.
           IF CO02END015CB(1:1) NUMERIC
              IF 0.65 <= CO02END015CBV 
                 MOVE 1 TO AA-S1-CO02END015CB-DCCND02 
              ELSE
                 MOVE 0 TO AA-S1-CO02END015CB-DCCND02 
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO02END015CB-DCCND02 
           END-IF.
*
           IF 0 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 3   
              MOVE 1 TO AA-S1-RECMORA001VSA-DCCND01 
           ELSE 
              MOVE 0 TO AA-S1-RECMORA001VSA-DCCND01
           END-IF.
           IF 3 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 10.9
              MOVE 1 TO AA-S1-RECMORA001VSA-DCCND02 
           ELSE 
              MOVE 0 TO AA-S1-RECMORA001VSA-DCCND02
           END-IF.
           IF 10.9 <= AA-RECMORA001VSA 
              MOVE 1 TO AA-S1-RECMORA001VSA-DCCND03 
           ELSE 
              MOVE 0 TO AA-S1-RECMORA001VSA-DCCND03
           END-IF.
*
           MOVE 01END089RO      TO CO01END089RO.
           IF CO01END089RO(1:1) NUMERIC
              MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)
              MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)
           END-IF
           IF CO01END089RO(1:1)  NUMERIC 
              IF 0 <= CO01END089ROV AND CO01END089ROV < 32.07
                 MOVE 1 TO AA-S1-CO01END089RO-DCCND01 
              ELSE
                 MOVE 0 TO AA-S1-CO01END089RO-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END089RO-DCCND01
           END-IF.
           IF CO01END089RO(1:1)  NUMERIC 
              IF 32.07 <= CO01END089ROV AND CO01END089ROV < 63.18
                 MOVE 1 TO AA-S1-CO01END089RO-DCCND02 
              ELSE
                 MOVE 0 TO AA-S1-CO01END089RO-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END089RO-DCCND02
           END-IF.
           IF CO01END089RO(1:1)  NUMERIC 
              IF 63.18 <= CO01END089ROV AND CO01END089ROV < 86.16
                 MOVE 1 TO AA-S1-CO01END089RO-DCCND03 
              ELSE
                 MOVE 0 TO AA-S1-CO01END089RO-DCCND03
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END089RO-DCCND03
           END-IF.
           IF CO01END089RO(1:1)  NUMERIC 
              IF 86.16 <= CO01END089ROV 
                 MOVE 1 TO AA-S1-CO01END089RO-DCCND04 
              ELSE
                 MOVE 0 TO AA-S1-CO01END089RO-DCCND04
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END089RO-DCCND04
           END-IF.
*
           MOVE 01END088RO      TO CO01END088RO.
           IF CO01END088RO(1:1) NUMERIC
              MOVE CO01END088RO(1:8)  TO CO01END088ROV(1:8)
              MOVE CO01END088RO(10:2) TO CO01END088ROV(9:2)
           END-IF
           IF CO01END088RO(1:1)  NUMERIC
              IF 0 <= CO01END088ROV AND CO01END088ROV < 32.57
                 MOVE 1 TO AA-S1-CO01END088RO-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01END088RO-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END088RO-DCCND01
           END-IF.
           IF CO01END088RO(1:1)  NUMERIC
              IF 32.57 <= CO01END088ROV AND CO01END088ROV < 63.74
                 MOVE 1 TO AA-S1-CO01END088RO-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01END088RO-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END088RO-DCCND02
           END-IF.
           IF CO01END088RO(1:1)  NUMERIC
              IF 63.74 <= CO01END088ROV AND CO01END088ROV < 86.53
                 MOVE 1 TO AA-S1-CO01END088RO-DCCND03
              ELSE
                 MOVE 0 TO AA-S1-CO01END088RO-DCCND03
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END088RO-DCCND03
           END-IF.
           IF CO01END088RO(1:1)  NUMERIC
              IF 86.53 <= CO01END088ROV 
                 MOVE 1 TO AA-S1-CO01END088RO-DCCND04
              ELSE
                 MOVE 0 TO AA-S1-CO01END088RO-DCCND04
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END088RO-DCCND04
           END-IF.
*
           MOVE 01EXP001RO      TO CO01EXP001RO.
           IF CO01EXP001RO(1:1) NUMERIC    
              MOVE CO01EXP001RO       TO CO01EXP001ROV
           END-IF
           IF CO01EXP001RO(1:1)  NOT NUMERIC
              MOVE 1 TO AA-S1-CO01EXP001RO-DCCND00
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001RO-DCCND00
           END-IF.
           IF CO01EXP001RO(1:1)  NUMERIC
              IF 0 <= CO01EXP001ROV AND CO01EXP001ROV < 20.15
                 MOVE 1 TO AA-S1-CO01EXP001RO-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01EXP001RO-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001RO-DCCND01
           END-IF.
           IF CO01EXP001RO(1:1)  NUMERIC
              IF 20.15 <= CO01EXP001ROV AND CO01EXP001ROV < 44.83
                 MOVE 1 TO AA-S1-CO01EXP001RO-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01EXP001RO-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001RO-DCCND02
           END-IF.
           IF CO01EXP001RO(1:1)  NUMERIC
              IF 44.83 <= CO01EXP001ROV AND CO01EXP001ROV < 118.14 
                 MOVE 1 TO AA-S1-CO01EXP001RO-DCCND03
              ELSE
                 MOVE 0 TO AA-S1-CO01EXP001RO-DCCND03
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001RO-DCCND03
           END-IF.
           IF CO01EXP001RO(1:1)  NUMERIC
              IF 118.14 <= CO01EXP001ROV 
                 MOVE 1 TO AA-S1-CO01EXP001RO-DCCND04
              ELSE
                 MOVE 0 TO AA-S1-CO01EXP001RO-DCCND04
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001RO-DCCND04
           END-IF.
*
           MOVE 01EXP001AH      TO CO01EXP001AH.
           IF CO01EXP001AH(1:1) NUMERIC    
              MOVE CO01EXP001AH       TO CO01EXP001AHV
           END-IF
           IF CO01EXP001AH(1:1)  NOT NUMERIC
              MOVE 1 TO AA-S1-CO01EXP001AH-DCCND00
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001AH-DCCND00
           END-IF.
           IF CO01EXP001AH(1:1)  NUMERIC
              IF 0 <= CO01EXP001AHV AND CO01EXP001AHV < 36.44
                 MOVE 1 TO AA-S1-CO01EXP001AH-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01EXP001AH-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001AH-DCCND01
           END-IF.
           IF CO01EXP001AH(1:1)  NUMERIC
              IF 36.44 <= CO01EXP001AHV AND CO01EXP001AHV < 70.57
                 MOVE 1 TO AA-S1-CO01EXP001AH-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01EXP001AH-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001AH-DCCND02
           END-IF.
           IF CO01EXP001AH(1:1)  NUMERIC
              IF 70.57 <= CO01EXP001AHV AND CO01EXP001AHV < 123.61 
                 MOVE 1 TO AA-S1-CO01EXP001AH-DCCND03
              ELSE
                 MOVE 0 TO AA-S1-CO01EXP001AH-DCCND03
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001AH-DCCND03
           END-IF.
           IF CO01EXP001AH(1:1)  NUMERIC
              IF 123.61 <= CO01EXP001AHV 
                 MOVE 1 TO AA-S1-CO01EXP001AH-DCCND04
              ELSE
                 MOVE 0 TO AA-S1-CO01EXP001AH-DCCND04
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01EXP001AH-DCCND04
           END-IF.
*
           MOVE 01MOR040RO      TO CO01MOR040RO.
           IF CO01MOR040RO(1:1) NUMERIC    
              MOVE CO01MOR040RO       TO CO01MOR040ROV
           END-IF
           IF CO01MOR040RO(1:1)  NUMERIC
              IF 0 <= CO01MOR040ROV AND CO01MOR040ROV < 1        
                 MOVE 1 TO AA-S1-CO01MOR040RO-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01MOR040RO-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01MOR040RO-DCCND01
           END-IF.
           IF CO01MOR040RO(1:1)  NUMERIC
              IF 1 <= CO01MOR040ROV AND CO01MOR040ROV < 2        
                 MOVE 1 TO AA-S1-CO01MOR040RO-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01MOR040RO-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01MOR040RO-DCCND02
           END-IF.
           IF CO01MOR040RO(1:1)  NUMERIC
              IF 2 <= CO01MOR040ROV 
                 MOVE 1 TO AA-S1-CO01MOR040RO-DCCND03
              ELSE
                 MOVE 0 TO AA-S1-CO01MOR040RO-DCCND03
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01MOR040RO-DCCND03
           END-IF.
*
           IF 0 <= AA-EVER03006P AND AA-EVER03006P < 0.25
              MOVE 1 TO AA-S1-EVER03006P-DCCND01 
           ELSE 
              MOVE 0 TO AA-S1-EVER03006P-DCCND01
           END-IF.
           IF 0.25 <= AA-EVER03006P 
              MOVE 1 TO AA-S1-EVER03006P-DCCND02 
           ELSE 
              MOVE 0 TO AA-S1-EVER03006P-DCCND02
           END-IF.
*
           MOVE 01END030RO      TO CO01END030RO.
           IF CO01END030RO(1:1) NUMERIC
              MOVE CO01END030RO(1:8)  TO CO01END030ROV(1:8)
              MOVE CO01END030RO(10:2) TO CO01END030ROV(9:2)
           END-IF
           IF CO01END030RO(1:1)  NUMERIC
              IF 0 <= CO01END030ROV AND CO01END030ROV < 0.37   
                 MOVE 1 TO AA-S1-CO01END030RO-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01END030RO-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END030RO-DCCND01
           END-IF.
           IF CO01END030RO(1:1)  NUMERIC
              IF  0.37 <= CO01END030ROV AND CO01END030ROV <  1.2   
                 MOVE 1 TO AA-S1-CO01END030RO-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01END030RO-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END030RO-DCCND02
           END-IF.
           IF CO01END030RO(1:1)  NUMERIC
              IF  1.2  <= CO01END030ROV AND CO01END030ROV < 3.08   
                 MOVE 1 TO AA-S1-CO01END030RO-DCCND03
              ELSE
                 MOVE 0 TO AA-S1-CO01END030RO-DCCND03
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END030RO-DCCND03
           END-IF.
           IF CO01END030RO(1:1)  NUMERIC
              IF  3.08 <= CO01END030ROV 
                 MOVE 1 TO AA-S1-CO01END030RO-DCCND04
              ELSE
                 MOVE 0 TO AA-S1-CO01END030RO-DCCND04
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END030RO-DCCND04
           END-IF.
*
           MOVE 01MOR062RO      TO CO01MOR062RO.
           IF CO01MOR062RO(1:1) NUMERIC
              MOVE CO01MOR062RO       TO CO01MOR062ROV
           END-IF
           IF CO01MOR062RO(1:1)  NUMERIC
              IF 0 <= CO01MOR062ROV AND CO01MOR062ROV < 1
                 MOVE 1 TO AA-S1-CO01MOR062RO-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01MOR062RO-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01MOR062RO-DCCND01
           END-IF.
           IF CO01MOR062RO(1:1)  NUMERIC
              IF 1 <= CO01MOR062ROV 
                 MOVE 1 TO AA-S1-CO01MOR062RO-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01MOR062RO-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01MOR062RO-DCCND02
           END-IF.
*
           IF AA-EXPOSICION < 2.47
              MOVE 1 TO AA-S1-EXPOSICION-DCCND01
           ELSE
              MOVE 0 TO AA-S1-EXPOSICION-DCCND01
           END-IF.
           IF 2.47 <= AA-EXPOSICION AND AA-EXPOSICION < 7.87
              MOVE 1 TO AA-S1-EXPOSICION-DCCND02
           ELSE
              MOVE 0 TO AA-S1-EXPOSICION-DCCND02
           END-IF.
           IF 7.87 <= AA-EXPOSICION AND AA-EXPOSICION < 27.13 
              MOVE 1 TO AA-S1-EXPOSICION-DCCND03
           ELSE
              MOVE 0 TO AA-S1-EXPOSICION-DCCND03
           END-IF.
           IF 27.13 <= AA-EXPOSICION 
              MOVE 1 TO AA-S1-EXPOSICION-DCCND04
           ELSE
              MOVE 0 TO AA-S1-EXPOSICION-DCCND04
           END-IF.
*
           MOVE 01END022RO      TO CO01END022RO.
           IF CO01END022RO(1:1) NUMERIC
              MOVE CO01END022RO(1:8)  TO CO01END022ROV(1:8)
              MOVE CO01END022RO(10:2) TO CO01END022ROV(9:2)
           END-IF
           IF CO01END022RO(1:1)  NUMERIC
              IF 0 <= CO01END022ROV AND CO01END022ROV < 0.01
                 MOVE 1 TO AA-S1-CO01END022RO-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01END022RO-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END022RO-DCCND01
           END-IF.
           IF CO01END022RO(1:1)  NUMERIC
              IF  0.01 <= CO01END022ROV 
                 MOVE 1 TO AA-S1-CO01END022RO-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01END022RO-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01END022RO-DCCND02
           END-IF.
*
           MOVE 01MOR055CC      TO CO01MOR055CC.
           IF CO01MOR055CC(1:1) NUMERIC
              MOVE CO01MOR055CC       TO CO01MOR055CCV
           END-IF
           IF CO01MOR055CC(1:1)  NUMERIC
              IF 0 <= CO01MOR055CCV AND CO01MOR055CCV < 1
                 MOVE 1 TO AA-S1-CO01MOR055CC-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01MOR055CC-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01MOR055CC-DCCND01
           END-IF.
           IF CO01MOR055CC(1:1)  NUMERIC
              IF 1 <= CO01MOR055CCV
                 MOVE 1 TO AA-S1-CO01MOR055CC-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01MOR055CC-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01MOR055CC-DCCND02
           END-IF.
*
           MOVE 01NUM050RO      TO CO01NUM050RO.
           IF CO01NUM050RO(1:1) NUMERIC
              MOVE CO01NUM050RO       TO CO01NUM050ROV
           END-IF
           IF CO01NUM050RO(1:1)  NUMERIC
              IF 0 <= CO01NUM050ROV AND CO01NUM050ROV < 0.94
                 MOVE 1 TO AA-S1-CO01NUM050RO-DCCND01
              ELSE
                 MOVE 0 TO AA-S1-CO01NUM050RO-DCCND01
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01NUM050RO-DCCND01
           END-IF.
           IF CO01NUM050RO(1:1)  NUMERIC
              IF 0.94 <= CO01NUM050ROV AND CO01NUM050ROV < 2    
                 MOVE 1 TO AA-S1-CO01NUM050RO-DCCND02
              ELSE
                 MOVE 0 TO AA-S1-CO01NUM050RO-DCCND02
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01NUM050RO-DCCND01
           END-IF.
           IF CO01NUM050RO(1:1)  NUMERIC
              IF 2 <= CO01NUM050ROV
                 MOVE 1 TO AA-S1-CO01NUM050RO-DCCND03
              ELSE
                 MOVE 0 TO AA-S1-CO01NUM050RO-DCCND03
              END-IF
           ELSE
              MOVE 0 TO AA-S1-CO01NUM050RO-DCCND03
           END-IF.
           COMPUTE AA-S1-EXPONENTE              = 0.756507907349518 + 
                  (AA-S1-CO02EXP008TO-DCCN     * -0.00344032622123293) + 
                  (AA-S1-CO02EXP001TO-DCCN     * 0.00204345104836843) + 
                  (AA-S1-PRQALDIA-DCCN         * 0.193466311383486) + 
                  (AA-S1-CO02NUM029TO-DCCN     * 0.0185970530036857) + 
                  (AA-S1-CO02EXP006TO-DCCN     * 0.00209661609206721) + 
                  (AA-S1-MMAXHIS-DCCND02       * -0.429539126501729) + 
                  (AA-S1-CO02end015CB-DCCND02  * -0.304805348684901) + 
                  (AA-S1-RECMORA001VSA-DCCND01 * -0.406942204478714) + 
                  (AA-S1-CO01END089RO-DCCND04  * -0.292770028900652) + 
                  (AA-S1-TIPORELD01-DCCN       * 0.201335816376428) + 
                  (AA-S1-CO01END088RO-DCCND01  * 0.365151513984611) + 
                  (AA-S1-CO01EXP001RO-DCCND04  * 0.247223329612578) + 
                  (AA-S1-CO01EXP001AH-DCCND00  * -0.11829228496699) + 
                  (AA-S1-CO01MOR040RO-DCCND03  * 0.165952304511341) + 
                  (AA-S1-TIPORELD04-DCCN       * 0.147503034238019) + 
                  (AA-S1-EVER03006P-DCCND02    * -0.179211222196262) + 
                  (AA-S1-CO01END030RO-DCCND04  * 0.235168533414298) + 
                  (AA-S1-CO01MOR062RO-DCCND01  * 0.206107107865234) + 
                  (AA-S1-CO01END088RO-DCCND02  * 0.185999913749878) + 
                  (AA-S1-EXPOSICION-DCCND01    * -0.0872351805359107) + 
                  (AA-S1-CO01END030RO-DCCND03  * 0.150857328602515) + 
                  (AA-S1-CO01END022RO-DCCND02  * -0.0819867759662279) + 
                  (AA-S1-CO01MOR055CC-DCCND01  * 0.257998143028414) + 
                  (AA-S1-CO01NUM050RO-DCCND03  * 0.0319328452568861).
*
          COMPUTE AA-SCOREN = 
             ( 1000 / (1 + 2.7182818284590452 ** (- AA-S1-EXPONENTE))). 
          COMPUTE PROBABILIDAD-USAAA = AA-SCOREN. 
*
          COMPUTE AA-SCOREN = 
             ( 400.0000000000 + 110.321693765613 * AA-S1-EXPONENTE). 
          COMPUTE SCORE-USAAA  = AA-SCOREN. 
          IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.   
          IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.        
       6200-SCORE-CARD2-USAAA.
REMARK*******************************************************************
REMARK*6200-SCORE-CARD2-USAAA.
REMARK*    SE CALCULA EL SCORE DE TELCOS DONDE HAY   RELACION CON EL       
REMARK*    CONSULTADO                        
REMARK*******************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 2
REMARK********************************************************************
REMARK********************************************************************
REMARK*    CALCULO DE VARIABLES HIBRIDAS
REMARK********************************************************************
      *    CALCULO DE PRQALDIA
           PERFORM 6500-QALDIA-USAAA.
           PERFORM 6500-QTOT030-USAAA.
           PERFORM 6500-QTOT060-USAAA.
           PERFORM 6500-QTOT090-USAAA.
           PERFORM 6500-QTOT120-USAAA.
           PERFORM 6500-QTOTCC-USAAA.
           PERFORM 6500-QTOTCR-USAAA.
           COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +
                               AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +
                               AA-QTOTCR.
           IF AA-QTOTMR > 0
              COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )
           ELSE
              MOVE 0 TO AA-PRQALDIA
           END-IF.
      *    CALCULO RECMORA001VSA
           PERFORM 6500-RECMORA030-USAAA.
           PERFORM 6500-RECMORA060-USAAA.
           PERFORM 6500-RECMORA090-USAAA.
           PERFORM 6500-RECMORA120-USAAA.
           PERFORM 6500-RECMORACC-USAAA.
           MOVE AA-RECMORA030 TO AA-RECMORA001
           IF AA-RECMORA060 < AA-RECMORA001
              MOVE AA-RECMORA060 TO AA-RECMORA001
           END-IF.
           IF AA-RECMORA090 < AA-RECMORA001
              MOVE AA-RECMORA090 TO AA-RECMORA001
           END-IF.
           IF AA-RECMORA120 < AA-RECMORA001
              MOVE AA-RECMORA120 TO AA-RECMORA001
           END-IF.
           IF AA-RECMORACC  < AA-RECMORA001
              MOVE AA-RECMORACC  TO AA-RECMORA001
           END-IF.
           MOVE 02NUM018TO TO CO02NUM018TO.                             
           MOVE 01NUM018CO TO CO01NUM018CO.                             
           IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      
              CO02NUM018TO <> CO01NUM018CO AND                          
              AA-RECMORA001 > 0                                         
              MOVE 0 TO AA-RECMORA001VSA                                
           ELSE                                                         
              MOVE AA-RECMORA001 TO AA-RECMORA001VSA
           END-IF.                                                      
      *    CALCULO DE MMAXHIS
           PERFORM 6500-MMAXHIS-USAAA.
      *    MORA MAXIMA DE 24    
           PERFORM 6500-MMAX24-USAAA.
      *    MESES DESDE LA MORA DE 120 MAS RECIENTE
           PERFORM 6500-RECMORA120-USAAA.
      *    CALCULO DE TIPORELD04 
           PERFORM 6500-SECTORES-USAAA.
           MOVE AA-TIPORELD04 TO AA-S2-TIPORELD04-DCCE
      *    ELIMINAR 999 EN RECMORA
           PERFORM 6500-ELIMIN-999-RECMORA-USAAA.
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES Y ACOTACIONES
REMARK********************************************************************
           MOVE AA-PRQALDIA TO AA-S2-PRQALDIA-DCCE
           IF AA-S2-PRQALDIA-DCCE     > 1
             MOVE 1   TO AA-S2-PRQALDIA-DCCE    
           END-IF.
*
           MOVE 02EXP001TO      TO CO02EXP001TO.
           IF 02EXP001TO(1:1) = " " MOVE ZEROS      TO CO02EXP001TOV
           ELSE                     MOVE 02EXP001TO TO CO02EXP001TOV.
           MOVE CO02EXP001TOV TO AA-S2-CO02EXP001TO-DCCE
           IF AA-S2-CO02EXP001TO-DCCE > 287
              MOVE 287 TO AA-S2-CO02EXP001TO-DCCE
           END-IF.
*
           MOVE 01EXP001CC      TO CO01EXP001CC.
           IF 01EXP001CC(1:1) = " " MOVE ZEROS      TO CO01EXP001CCV
           ELSE                     MOVE 01EXP001CC TO CO01EXP001CCV.
           MOVE CO01EXP001CCV TO AA-S2-CO01EXP001CC-DCCE
           IF AA-S2-CO01EXP001CC-DCCE > 145
              MOVE 145 TO AA-S2-CO01EXP001CC-DCCE
           END-IF.
*
           MOVE 02NUM042CB      TO CO02NUM042CB.
           IF 02NUM042CB(1:1) = " " MOVE ZEROS      TO CO02NUM042CBV
           ELSE                     MOVE 02NUM042CB TO CO02NUM042CBV.
           MOVE CO02NUM042CBV TO AA-S2-CO02NUM042CB-DCCE
           IF AA-S2-CO02NUM042CB-DCCE > 100
              MOVE 100 TO AA-S2-CO02NUM042CB-DCCE
           END-IF.
*
           MOVE 02EXP006TO      TO CO02EXP006TO.
           IF 02EXP006TO(1:1) = " " MOVE ZEROS      TO CO02EXP006TOV
           ELSE                     MOVE 02EXP006TO TO CO02EXP006TOV.
           MOVE CO02EXP006TOV TO AA-S2-CO02EXP006TO-DCCE
           IF AA-S2-CO02EXP006TO-DCCE > 104
              MOVE 104 TO AA-S2-CO02EXP006TO-DCCE 
           END-IF.
*
           MOVE 01NUM050CC      TO CO01NUM050CC.
           IF 01NUM050CC(1:1) = " " MOVE ZEROS      TO CO01NUM050CCV
           ELSE                     MOVE 01NUM050CC TO CO01NUM050CCV.
           MOVE CO01NUM050CCV TO AA-S2-CO01NUM050CC-DCCE
           IF AA-S2-CO01NUM050CC-DCCE > 5    
              MOVE 5   TO AA-S2-CO01NUM050CC-DCCE
           END-IF.
      *****************************************************************
      *    CALCULO DE DUMMYS
      *****************************************************************
           IF 0 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 3.12
              MOVE 1 TO AA-S2-RECMORA001VSA-DCCED01
           ELSE
              MOVE 0 TO AA-S2-RECMORA001VSA-DCCED01
           END-IF.
           IF 3.12 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 12.54
              MOVE 1 TO AA-S2-RECMORA001VSA-DCCED02
           ELSE
              MOVE 0 TO AA-S2-RECMORA001VSA-DCCED02
           END-IF.
           IF 12.54 <= AA-RECMORA001VSA
              MOVE 1 TO AA-S2-RECMORA001VSA-DCCED03
           ELSE
              MOVE 0 TO AA-S2-RECMORA001VSA-DCCED03
           END-IF.
*
           IF 0 <= AA-MMAXHIS AND AA-MMAXHIS < 1
              MOVE 1 TO AA-S2-MMAXHIS-DCCED01
           ELSE
              MOVE 0 TO AA-S2-MMAXHIS-DCCED01
           END-IF
           IF 1 <= AA-MMAXHIS AND AA-MMAXHIS < 3
              MOVE 1 TO AA-S2-MMAXHIS-DCCED02
           ELSE
              MOVE 0 TO AA-S2-MMAXHIS-DCCED02
           END-IF
           IF 3 <= AA-MMAXHIS
              MOVE 1 TO AA-S2-MMAXHIS-DCCED03
           ELSE
              MOVE 0 TO AA-S2-MMAXHIS-DCCED03
           END-IF
*
           MOVE 01END027CC      TO CO01END027CC.
           IF CO01END027CC(1:1) NUMERIC
              MOVE CO01END027CC(1:8)  TO CO01END027CCV(1:8)
              MOVE CO01END027CC(10:2) TO CO01END027CCV(9:2)
           END-IF
           IF CO01END027CC(1:1)  NUMERIC
              IF 0 <= CO01END027CCV AND CO01END027CCV < 0.02    
                 MOVE 1 TO AA-S2-CO01END027CC-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01END027CC-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END027CC-DCCED01
           END-IF.
           IF CO01END027CC(1:1)  NUMERIC
              IF 0.02  <= CO01END027CCV
                 MOVE 1 TO AA-S2-CO01END027CC-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01END027CC-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END027CC-DCCED02
           END-IF.
*
           MOVE 01END027RO      TO CO01END027RO.
           IF CO01END027RO(1:1) NUMERIC
              MOVE CO01END027RO(1:8)  TO CO01END027ROV(1:8)
              MOVE CO01END027RO(10:2) TO CO01END027ROV(9:2)
           END-IF
           IF CO01END027RO(1:1)  NUMERIC
              IF 0 <= CO01END027ROV AND CO01END027ROV < 0.01
                 MOVE 1 TO AA-S2-CO01END027RO-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01END027RO-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END027RO-DCCED01
           END-IF.
           IF CO01END027RO(1:1)  NUMERIC
              IF 0.01  <= CO01END027ROV
                 MOVE 1 TO AA-S2-CO01END027RO-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01END027RO-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END027RO-DCCED02
           END-IF.
*
           MOVE 01MOR033RO      TO CO01MOR033RO.
           IF CO01MOR033RO(1:1) NUMERIC
              MOVE CO01MOR033RO       TO CO01MOR033ROV
           END-IF
           IF CO01MOR033RO(1:1) NOT  NUMERIC
              MOVE 1 TO AA-S2-CO01MOR033RO-DCCED00
           ELSE
              MOVE 0 TO AA-S2-CO01MOR033RO-DCCED00
           END-IF.
           IF CO01MOR033RO(1:1)  NUMERIC
              IF 0 <= CO01MOR033ROV AND CO01MOR033ROV < 2
                 MOVE 1 TO AA-S2-CO01MOR033RO-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01MOR033RO-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01MOR033RO-DCCED01
           END-IF.
           IF CO01MOR033RO(1:1)  NUMERIC
              IF 2 <= CO01MOR033ROV AND CO01MOR033ROV < 3
                 MOVE 1 TO AA-S2-CO01MOR033RO-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01MOR033RO-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01MOR033RO-DCCED02
           END-IF.
           IF CO01MOR033RO(1:1)  NUMERIC
              IF 3 <= CO01MOR033ROV
                 MOVE 1 TO AA-S2-CO01MOR033RO-DCCED03
              ELSE
                 MOVE 0 TO AA-S2-CO01MOR033RO-DCCED03
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01MOR033RO-DCCED03
           END-IF.
*
           MOVE 01END030RO      TO CO01END030RO.
           IF CO01END030RO(1:1) NUMERIC
              MOVE CO01END030RO(1:8)  TO CO01END030ROV(1:8)
              MOVE CO01END030RO(10:2) TO CO01END030ROV(9:2)
           END-IF
           IF CO01END030RO(1:1)  NUMERIC
              IF 0 <= CO01END030ROV AND CO01END030ROV < 0.62
                 MOVE 1 TO AA-S2-CO01END030RO-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01END030RO-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END030RO-DCCED01
           END-IF.
           IF CO01END030RO(1:1)  NUMERIC
              IF 0.62 <= CO01END030ROV AND CO01END030ROV < 1.78
                 MOVE 1 TO AA-S2-CO01END030RO-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01END030RO-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END030RO-DCCED02
           END-IF.
           IF CO01END030RO(1:1)  NUMERIC
              IF 1.78 <= CO01END030ROV AND CO01END030ROV < 4.4    
                 MOVE 1 TO AA-S2-CO01END030RO-DCCED03
              ELSE
                 MOVE 0 TO AA-S2-CO01END030RO-DCCED03
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END030RO-DCCED03
           END-IF.
           IF CO01END030RO(1:1)  NUMERIC
              IF 4.4   <= CO01END030ROV
                 MOVE 1 TO AA-S2-CO01END030RO-DCCED04
              ELSE
                 MOVE 0 TO AA-S2-CO01END030RO-DCCED04
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END030RO-DCCED04
           END-IF.
*
           MOVE 02END015CB  TO CO02END015CB.
           IF CO02END015CB(1:1) NUMERIC
              MOVE CO02END015CB(1:8)  TO CO02END015CBV(1:8)
              MOVE CO02END015CB(10:2) TO CO02END015CBV(9:2)
           END-IF
           IF CO02END015CB(1:1) NUMERIC
              IF 0 <= CO02END015CBV AND CO02END015CBV < 0.41
                 MOVE 1 TO AA-S2-CO02END015CB-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO02END015CB-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO02END015CB-DCCED01
           END-IF.
           IF CO02END015CB(1:1) NUMERIC
              IF 0.41 <= CO02END015CBV
                 MOVE 1 TO AA-S2-CO02END015CB-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO02END015CB-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO02END015CB-DCCED02
           END-IF.
*
           MOVE 01END092RO      TO CO01END092RO.
           IF CO01END092RO(1:1) NUMERIC
              MOVE CO01END092RO(1:8)  TO CO01END092ROV(1:8)
              MOVE CO01END092RO(10:2) TO CO01END092ROV(9:2)
           END-IF
           IF CO01END092RO(1:1)  NUMERIC
              IF 0 <= CO01END092ROV AND CO01END092ROV < 10.35
                 MOVE 1 TO AA-S2-CO01END092RO-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01END092RO-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END092RO-DCCED01
           END-IF.
           IF CO01END092RO(1:1)  NUMERIC
              IF 10.35 <= CO01END092ROV AND CO01END092ROV < 24.2 
                 MOVE 1 TO AA-S2-CO01END092RO-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01END092RO-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END092RO-DCCED02
           END-IF.
           IF CO01END092RO(1:1)  NUMERIC
              IF 24.2  <= CO01END092ROV AND CO01END092ROV < 47.63
                 MOVE 1 TO AA-S2-CO01END092RO-DCCED03
              ELSE
                 MOVE 0 TO AA-S2-CO01END092RO-DCCED03
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END092RO-DCCED03
           END-IF.
           IF CO01END092RO(1:1)  NUMERIC
              IF 47.63 <= CO01END092ROV
                 MOVE 1 TO AA-S2-CO01END092RO-DCCED04
              ELSE
                 MOVE 0 TO AA-S2-CO01END092RO-DCCED04
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END092RO-DCCED04
           END-IF.
*
           MOVE 01EXP001AH      TO CO01EXP001AH.
           IF CO01EXP001AH(1:1) NUMERIC
              MOVE CO01EXP001AH       TO CO01EXP001AHV
           END-IF
           IF CO01EXP001AH(1:1)  NOT NUMERIC
              MOVE 1 TO AA-S2-CO01EXP001AH-DCCED00
           ELSE
              MOVE 0 TO AA-S2-CO01EXP001AH-DCCED00
           END-IF.
           IF CO01EXP001AH(1:1)  NUMERIC
              IF 0 <= CO01EXP001AHV AND CO01EXP001AHV < 45.89
                 MOVE 1 TO AA-S2-CO01EXP001AH-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01EXP001AH-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01EXP001AH-DCCED01
           END-IF.
           IF CO01EXP001AH(1:1)  NUMERIC
              IF 45.89 <= CO01EXP001AHV AND CO01EXP001AHV < 82.61
                 MOVE 1 TO AA-S2-CO01EXP001AH-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01EXP001AH-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01EXP001AH-DCCED02
           END-IF.
           IF CO01EXP001AH(1:1)  NUMERIC
              IF 82.61 <= CO01EXP001AHV AND CO01EXP001AHV < 135.01
                 MOVE 1 TO AA-S2-CO01EXP001AH-DCCED03
              ELSE
                 MOVE 0 TO AA-S2-CO01EXP001AH-DCCED03
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01EXP001AH-DCCED03
           END-IF.
           IF CO01EXP001AH(1:1)  NUMERIC
              IF 135.01 <= CO01EXP001AHV
                 MOVE 1 TO AA-S2-CO01EXP001AH-DCCED04
              ELSE
                 MOVE 0 TO AA-S2-CO01EXP001AH-DCCED04
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01EXP001AH-DCCED04
           END-IF.
*
           MOVE 01MOR009CC      TO CO01MOR009CC.
           IF CO01MOR009CC(1:1) NUMERIC
              MOVE CO01MOR009CC       TO CO01MOR009CCV
           END-IF
           IF CO01MOR009CC(1:1)  NUMERIC
              IF 0 <= CO01MOR009CCV AND CO01MOR009CCV < 1
                 MOVE 1 TO AA-S2-CO01MOR009CC-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01MOR009CC-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01MOR009CC-DCCED01
           END-IF.
           IF CO01MOR009CC(1:1)  NUMERIC
              IF 1 <= CO01MOR009CCV
                 MOVE 1 TO AA-S2-CO01MOR009CC-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01MOR009CC-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01MOR009CC-DCCED02
           END-IF.
*
           MOVE 01NUM050AH      TO CO01NUM050AH.
           IF CO01NUM050AH(1:1) NUMERIC
              MOVE CO01NUM050AH       TO CO01NUM050AHV
           END-IF
           IF CO01NUM050AH(1:1) NOT  NUMERIC
              MOVE 1 TO AA-S2-CO01NUM050AH-DCCED00
           ELSE
              MOVE 0 TO AA-S2-CO01NUM050AH-DCCED00
           END-IF
           IF CO01NUM050AH(1:1)  NUMERIC
              IF 0 <= CO01NUM050AHV AND CO01NUM050AHV < 1       
                 MOVE 1 TO AA-S2-CO01NUM050AH-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01NUM050AH-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01NUM050AH-DCCED01
           END-IF.
           IF CO01NUM050AH(1:1)  NUMERIC
              IF 1    <= CO01NUM050AHV AND CO01NUM050AHV < 2
                 MOVE 1 TO AA-S2-CO01NUM050AH-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01NUM050AH-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01NUM050AH-DCCED01
           END-IF.
           IF CO01NUM050AH(1:1)  NUMERIC
              IF 2 <= CO01NUM050AHV
                 MOVE 1 TO AA-S2-CO01NUM050AH-DCCED03
              ELSE
                 MOVE 0 TO AA-S2-CO01NUM050AH-DCCED03
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01NUM050AH-DCCED03
           END-IF.
*
           IF 0 <= AA-MMAX24  AND AA-MMAX24  < 2
              MOVE 1 TO AA-S2-MMAX24-DCCED01
           ELSE
              MOVE 0 TO AA-S2-MMAX24-DCCED01
           END-IF
           IF 2 <= AA-MMAX24 
              MOVE 1 TO AA-S2-MMAX24-DCCED02
           ELSE
              MOVE 0 TO AA-S2-MMAX24-DCCED02
           END-IF
*
           IF 0 <= AA-RECMORA120  AND AA-RECMORA120  < 2
              MOVE 1 TO AA-S2-RECMORA120-DCCED01
           ELSE
              MOVE 0 TO AA-S2-RECMORA120-DCCED01
           END-IF
           IF 2 <= AA-RECMORA120  
              MOVE 1 TO AA-S2-RECMORA120-DCCED02
           ELSE
              MOVE 0 TO AA-S2-RECMORA120-DCCED02
           END-IF
*
           MOVE 01END071RO      TO CO01END071RO.
           IF CO01END071RO(1:1) NUMERIC
              MOVE CO01END071RO(1:8)  TO CO01END071ROV(1:8)
              MOVE CO01END071RO(10:2) TO CO01END071ROV(9:2)
           END-IF
           IF CO01END071RO(1:1)  NUMERIC
              IF 0 <= CO01END071ROV AND CO01END071ROV < 25.47
                 MOVE 1 TO AA-S2-CO01END071RO-DCCED01
              ELSE
                 MOVE 0 TO AA-S2-CO01END071RO-DCCED01
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END071RO-DCCED01
           END-IF.
           IF CO01END071RO(1:1)  NUMERIC
              IF 25.47 <= CO01END071ROV AND CO01END071ROV < 55.45
                 MOVE 1 TO AA-S2-CO01END071RO-DCCED02
              ELSE
                 MOVE 0 TO AA-S2-CO01END071RO-DCCED02
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END071RO-DCCED02
           END-IF.
           IF CO01END071RO(1:1)  NUMERIC
              IF 55.45 <= CO01END071ROV AND CO01END071ROV < 83.35
                 MOVE 1 TO AA-S2-CO01END071RO-DCCED03
              ELSE
                 MOVE 0 TO AA-S2-CO01END071RO-DCCED03
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END071RO-DCCED03
           END-IF.
           IF CO01END071RO(1:1)  NUMERIC
              IF 83.35  <= CO01END071ROV
                 MOVE 1 TO AA-S2-CO01END071RO-DCCED04
              ELSE
                 MOVE 0 TO AA-S2-CO01END071RO-DCCED04
              END-IF
           ELSE
              MOVE 0 TO AA-S2-CO01END071RO-DCCED04
           END-IF.
           COMPUTE   
                 AA-S2-EXPONENTE = 0.540029201961117 + 
                (AA-S2-PRQALDIA-DCCE * 0.330937592599727) + 
                (AA-S2-CO02EXP001TO-DCCE * 0.00096042334768377) + 
                (AA-S2-CO01EXP001CC-DCCE * 0.00421741288326723) + 
                (AA-S2-CO02NUM042CB-DCCE * -0.00475588941910042) + 
                (AA-S2-CO02EXP006TO-DCCE * 0.00935515942758703) + 
                (AA-S2-CO01NUM050CC-DCCE * 0.052228354649971) + 
                (AA-S2-RECMORA001VSA-DCCED01 * -0.420674002235437) + 
                (AA-S2-MMAXHIS-DCCED01 * 0.498396782997891) + 
                (AA-S2-MMAXHIS-DCCED02 * 0.325203260449194) + 
                (AA-S2-CO01END027CC-DCCED01 * 0.506090752275124) + 
                (AA-S2-CO01END027RO-DCCED01 * 0.197910488406771) + 
                (AA-S2-CO01MOR033RO-DCCED00 * -0.104744086096822) + 
                (AA-S2-CO01MOR033RO-DCCED02 * 0.183794847829539) + 
                (AA-S2-CO01MOR033RO-DCCED03 * 0.284519725845049) + 
                (AA-S2-CO01END030RO-DCCED01 * -0.186365878978875) + 
                (AA-S2-CO01END030RO-DCCED03 * 0.136233576280088) + 
                (AA-S2-CO01END030RO-DCCED04 * 0.205640162476688) + 
                (AA-S2-CO02END015CB-DCCED01 * 0.107728472859104) + 
                (AA-S2-CO02END015CB-DCCED02 * -0.165721926380589) + 
                (AA-S2-CO01END092RO-DCCED01 * -0.153129971716385) + 
                (AA-S2-CO01END092RO-DCCED04 * 0.175657497650932) + 
                (AA-S2-CO01EXP001AH-DCCED00 * -0.142156941746533) + 
                (AA-S2-CO01MOR009CC-DCCED02 * -0.339490788274381) + 
                (AA-S2-CO01NUM050AH-DCCED01 * -0.198408569882946) + 
                (AA-S2-CO01NUM050AH-DCCED03 * 0.134711827731912) + 
                (AA-S2-MMAX24-DCCED02 * -0.143171574014672) + 
                (AA-S2-RECMORA120-DCCED01 * -0.223653711596704) + 
                (AA-S2-CO01END071RO-DCCED01 * 0.199175648390095) + 
                (AA-S2-CO01END071RO-DCCED04 * -0.24608674579614) + 
                (AA-S2-TIPORELD04-DCCE * 0.113175284048051).
*
          COMPUTE AA-SCOREN = 
             ( 1000 / (1 + 2.7182818284590452 ** (- AA-S2-EXPONENTE))). 
          COMPUTE PROBABILIDAD-USAAA = AA-SCOREN. 
*
          COMPUTE AA-SCOREN = 
             ( 400.0000000000 + 110.321693765613 * AA-S2-EXPONENTE). 
          COMPUTE SCORE-USAAA = AA-SCOREN. 
          IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.   
          IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.        
       6300-SCORE-CARD3-USAAA.
REMARK*******************************************************************
REMARK*6300-SCORE-CARD3-USAAA.
REMARK*    SE CALCULA EL SCORE DE FINANCIERO ROTATIVO SIN NINGUNA          
REMARK*    RELACION CON EL CONSULTADO                        
REMARK*******************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
DTRN01*    CALCULO DE PRQTOTAB                                          RMB0002
DTRN01     PERFORM 6000-QTOTAB-USAAA.                                   RMB0002
DTRN01     PERFORM 6500-QTOT-USAAA.                                     RMB0002
DTRN01     IF AA-QTOT <> 0                                              RMB0002
DTRN01        COMPUTE AA-PROQTOTAB ROUNDED = (AA-QTOTAB / AA-QTOT )     RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE -1 TO AA-PROQTOTAB                                   RMB0002
DTRN01     END-IF                                                       RMB0002
*
DTRN01*    CALCULO DE PRQALDIA                                          RMB0002
DTRN01     PERFORM 6500-QALDIA-USAAA.                                   RMB0002
DTRN01     PERFORM 6500-QTOT030-USAAA.                                  RMB0002
DTRN01     PERFORM 6500-QTOT060-USAAA.                                  RMB0002
DTRN01     PERFORM 6500-QTOT090-USAAA.                                  RMB0002
DTRN01     PERFORM 6500-QTOT120-USAAA.                                  RMB0002
DTRN01     PERFORM 6500-QTOTCC-USAAA.                                   RMB0002
DTRN01     PERFORM 6500-QTOTCR-USAAA.                                   RMB0002
DTRN01     COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +    RMB0002
DTRN01                         AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +    RMB0002
DTRN01                         AA-QTOTCR.                               RMB0002
DTRN01     IF AA-QTOTMR > 0                                             RMB0002
DTRN01        COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-PRQALDIA                                     RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01*    CALCULO DE MMAXHIS                                           RMB0002
DTRN01     PERFORM 6500-MMAXHIS-USAAA.                                  RMB0002
DTRN01*    CALCULO RECMORA001                                           RMB0002
DTRN01     PERFORM 6500-RECMORA030-USAAA.                               RMB0002
DTRN01     PERFORM 6500-RECMORA060-USAAA.                               RMB0002
DTRN01     PERFORM 6500-RECMORA090-USAAA.                               RMB0002
DTRN01     PERFORM 6500-RECMORA120-USAAA.                               RMB0002
DTRN01     PERFORM 6500-RECMORACC-USAAA.                                RMB0002
DTRN01     MOVE AA-RECMORA030 TO AA-RECMORA001                          RMB0002
DTRN01     IF AA-RECMORA060 < AA-RECMORA001                             RMB0002
DTRN01        MOVE AA-RECMORA060 TO AA-RECMORA001                       RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF AA-RECMORA090 < AA-RECMORA001                             RMB0002
DTRN01        MOVE AA-RECMORA090 TO AA-RECMORA001                       RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF AA-RECMORA120 < AA-RECMORA001                             RMB0002
DTRN01        MOVE AA-RECMORA120 TO AA-RECMORA001                       RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF AA-RECMORACC  < AA-RECMORA001                             RMB0002
DTRN01        MOVE AA-RECMORACC  TO AA-RECMORA001                       RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01*    CALCULO RECMORA001VSA                                        RMB0002
DTRN01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0002
DTRN01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0002
DTRN01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0002
DTRN01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0002
DTRN01        AA-RECMORA001 > 0                                         RMB0002
DTRN01        MOVE 0 TO AA-RECMORA001VSA                                RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE AA-RECMORA001 TO AA-RECMORA001VSA                    RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01*    ELIMINAR 999 EN RECMORA                                      RMB0002
DTRN01     PERFORM 6500-ELIMIN-999-RECMORA-USAAA.                       RMB0002
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 3
REMARK********************************************************************
DTRN01     MOVE 02EXP001TO      TO CO02EXP001TO.                        RMB0002
DTRN01     IF 02EXP001TO(1:1) = " " MOVE ZEROS      TO CO02EXP001TOV    RMB0002
DTRN01     ELSE                     MOVE 02EXP001TO TO CO02EXP001TOV.   RMB0002
DTRN01     MOVE CO02EXP001TOV TO AA-S3-CO02EXP001TO-DTRN.               RMB0002
DTRN01     IF AA-S3-CO02EXP001TO-DTRN > 277                             RMB0002
DTRN01        MOVE 277 TO AA-S3-CO02EXP001TO-DTRN                       RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     MOVE 02EXP006TO      TO CO02EXP006TO.                        RMB0002
DTRN01     IF 02EXP006TO(1:1) = " " MOVE ZEROS      TO CO02EXP006TOV    RMB0002
DTRN01     ELSE                     MOVE 02EXP006TO TO CO02EXP006TOV.   RMB0002
DTRN01     MOVE CO02EXP006TOV TO AA-S3-CO02EXP006TO-DTRN                RMB0002
DTRN01     IF AA-S3-CO02EXP006TO-DTRN > 103                             RMB0002
DTRN01        MOVE 103 TO AA-S3-CO02EXP006TO-DTRN                       RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     MOVE 02EXP008TO      TO CO02EXP008TO.                        RMB0002
DTRN01     IF 02EXP008TO(1:1) = " " MOVE ZEROS      TO CO02EXP008TOV    RMB0002
DTRN01     ELSE                     MOVE 02EXP008TO TO CO02EXP008TOV.   RMB0002
DTRN01     MOVE CO02EXP008TOV TO AA-S3-CO02EXP008TO-DTRN                RMB0002
DTRN01     IF AA-S3-CO02EXP008TO-DTRN > 100                             RMB0002
DTRN01        MOVE 103 TO AA-S3-CO02EXP008TO-DTRN                       RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     IF AA-PROQTOTAB < 0                                          RMB0002
DTRN01        MOVE 0 TO AA-S3-PROQTOTAB-DTRN                            RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE AA-PROQTOTAB TO AA-S3-PROQTOTAB-DTRN                 RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF AA-S3-PROQTOTAB-DTRN > 1                                  RMB0002
DTRN01        MOVE 1 TO AA-S3-PROQTOTAB-DTRN                            RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     IF AA-PRQALDIA  < 0                                          RMB0002
DTRN01        MOVE 0 TO AA-S3-PRQALDIA-DTRN                             RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE AA-PRQALDIA  TO AA-S3-PRQALDIA-DTRN                  RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF AA-S3-PRQALDIA-DTRN > 1                                   RMB0002
DTRN01        MOVE 1 TO AA-S3-PRQALDIA-DTRN                             RMB0002
DTRN01     END-IF.                                                      RMB0002
REMARK********************************************************************
REMARK*    CALCULOS DE VARIABLES DUMMYS SEGMENTO 3
REMARK********************************************************************
DTRN01     MOVE 01END030RO      TO CO01END030RO.                        RMB0002
DTRN01     IF CO01END030RO(1:1) NUMERIC                                 RMB0002
DTRN01        MOVE CO01END030RO(1:8)  TO CO01END030ROV(1:8)             RMB0002
DTRN01        MOVE CO01END030RO(10:2) TO CO01END030ROV(9:2)             RMB0002
DTRN01     END-IF                                                       RMB0002
DTRN01     IF CO01END030RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 0.43 <= CO01END030ROV AND CO01END030ROV < 1.25         RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01END030RO-DTRND02                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01END030RO-DTRND02                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01END030RO-DTRND02                      RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF CO01END030RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 1.25 <= CO01END030ROV AND CO01END030ROV < 3.16         RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01END030RO-DTRND03                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01END030RO-DTRND03                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01END030RO-DTRND03                      RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF CO01END030RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 3.16 <= CO01END030ROV                                  RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01END030RO-DTRND04                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01END030RO-DTRND04                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01END030RO-DTRND04                      RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     MOVE 01END089RO      TO CO01END089RO.                        RMB0002
DTRN01     IF CO01END089RO(1:1) NUMERIC                                 RMB0002
DTRN01        MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)             RMB0002
DTRN01        MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)             RMB0002
DTRN01     END-IF                                                       RMB0002
DTRN01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 0 <= CO01END089ROV AND CO01END089ROV < 30.12           RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01END089RO-DTRND01                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01END089RO-DTRND01                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01END089RO-DTRND01                      RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 83.94 <= CO01END089ROV                                 RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01END089RO-DTRND04                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01END089RO-DTRND04                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01END089RO-DTRND04                      RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     MOVE 01EXP001RO      TO CO01EXP001RO.                        RMB0002
DTRN01     IF CO01EXP001RO(1:1) NUMERIC                                 RMB0002
DTRN01        MOVE CO01EXP001RO       TO CO01EXP001ROV                  RMB0002
DTRN01     END-IF                                                       RMB0002
DTRN01     IF CO01EXP001RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 0 <= CO01EXP001ROV AND CO01EXP001ROV < 21              RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01EXP001RO-DTRND01                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01EXP001RO-DTRND01                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01EXP001RO-DTRND01                      RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF CO01EXP001RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 122.82 <= CO01EXP001ROV AND CO01EXP001ROV              RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01EXP001RO-DTRND04                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01EXP001RO-DTRND04                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01EXP001RO-DTRND04                      RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     MOVE 01MOR068RO      TO CO01MOR068RO.                        RMB0002
DTRN01     IF CO01MOR068RO(1:1) NUMERIC                                 RMB0002
DTRN01        MOVE CO01MOR068RO       TO CO01MOR068ROV                  RMB0002
DTRN01     END-IF                                                       RMB0002
DTRN01     IF CO01MOR068RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 1 <= CO01MOR068ROV                                     RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01MOR068RO-DTRND02                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01MOR068RO-DTRND02                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01MOR068RO-DTRND02                      RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     MOVE 01END092RO      TO CO01END092RO.                        RMB0002
DTRN01     IF CO01END092RO(1:1) NUMERIC                                 RMB0002
DTRN01        MOVE CO01END092RO(1:8)  TO CO01END092ROV(1:8)             RMB0002
DTRN01        MOVE CO01END092RO(10:2) TO CO01END092ROV(9:2)             RMB0002
DTRN01     END-IF                                                       RMB0002
DTRN01     IF CO01END092RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 0 <= CO01END092ROV AND CO01END092ROV < 9.66            RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01END092RO-DTRND01                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01END092RO-DTRND01                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01END092RO-DTRND01                      RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF CO01END092RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 45.52 <= CO01END092ROV                                 RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01END092RO-DTRND04                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01END092RO-DTRND04                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01END092RO-DTRND04                      RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     MOVE 01MOR074CC      TO CO01MOR074CC.                        RMB0002
DTRN01     IF CO01MOR074CC(1:1) NUMERIC                                 RMB0002
DTRN01        MOVE CO01MOR074CC       TO CO01MOR074CCV                  RMB0002
DTRN01     END-IF                                                       RMB0002
DTRN01     IF CO01MOR074CC(1:1)  NUMERIC                                RMB0002
DTRN01        IF 0 <= CO01MOR074CCV AND CO01MOR074CCV < 1               RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01MOR074CC-DTRND01                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01MOR074CC-DTRND01                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01MOR074CC-DTRND01                      RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     MOVE 01MOR047RO      TO CO01MOR047RO.                        RMB0002
DTRN01     IF CO01MOR047RO(1:1) NUMERIC                                 RMB0002
DTRN01        MOVE CO01MOR047RO       TO CO01MOR047ROV                  RMB0002
DTRN01     END-IF                                                       RMB0002
DTRN01     IF CO01MOR047RO(1:1)  NUMERIC                                RMB0002
DTRN01        IF 2 <= CO01MOR047ROV                                     RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01MOR047RO-DTRND03                   RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01MOR047RO-DTRND03                   RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01MOR047RO-DTRND03                      RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     IF 0 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 8            RMB0002
DTRN01        MOVE 1 TO AA-S3-RECMORA001VSA-DTRND01                     RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-RECMORA001VSA-DTRND01                     RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     IF 16.88 <= AA-RECMORA001VSA                                 RMB0002
DTRN01        MOVE 1 TO AA-S3-RECMORA001VSA-DTRND03                     RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-RECMORA001VSA-DTRND03                     RMB0002
DTRN01     END-IF.                                                      RMB0002
*
DTRN01     IF 1 <= AA-MMAXHIS                                           RMB0002
DTRN01        MOVE 1 TO AA-S3-MMAXHIS-DTRND02                           RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-MMAXHIS-DTRND02                           RMB0002
DTRN01     END-IF                                                       RMB0002
*
DTRN01     MOVE 01INQ016        TO CO01INQ016  .                        RMB0002
DTRN01     IF CO01INQ016  (1:1) NUMERIC                                 RMB0002
DTRN01        MOVE CO01INQ016         TO CO01INQ016V                    RMB0002
DTRN01     END-IF                                                       RMB0002
DTRN01     IF CO01INQ016  (1:1)  NUMERIC                                RMB0002
DTRN01        IF 2 <= CO01INQ016V                                       RMB0002
DTRN01           MOVE 1 TO AA-S3-CO01INQ016-DTRND02                     RMB0002
DTRN01        ELSE                                                      RMB0002
DTRN01           MOVE 0 TO AA-S3-CO01INQ016-DTRND02                     RMB0002
DTRN01        END-IF                                                    RMB0002
DTRN01     ELSE                                                         RMB0002
DTRN01        MOVE 0 TO AA-S3-CO01INQ016-DTRND02                        RMB0002
DTRN01     END-IF.                                                      RMB0002
DTRN01     COMPUTE                                                      RMB0002
DTRN01           AA-S3-EXPONENTE = 2.16002832244677 +                   RMB0002
DTRN01          (AA-S3-CO02EXP001TO-DTRN * 0.00104734005877538) +       RMB0002
DTRN01          (AA-S3-CO02EXP006TO-DTRN * 0.00637891733046571) +       RMB0002
DTRN01          (AA-S3-CO02EXP008TO-DTRN * -0.00673963285986247) +      RMB0002
DTRN01          (AA-S3-PROQTOTAB-DTRN * -0.409008100719587) +           RMB0002
DTRN01          (AA-S3-PRQALDIA-DTRN * 0.537443167022554) +             RMB0002
DTRN01          (AA-S3-CO01END030RO-DTRND02 * 0.244762124780151) +      RMB0002
DTRN01          (AA-S3-CO01END030RO-DTRND03 * 0.445652630009138) +      RMB0002
DTRN01          (AA-S3-CO01END030RO-DTRND04 * 0.67860276731568) +       RMB0002
DTRN01          (AA-S3-CO01END089RO-DTRND01 * 0.319166729465078) +      RMB0002
DTRN01          (AA-S3-CO01END089RO-DTRND04 * -0.318520738959837) +     RMB0002
DTRN01          (AA-S3-CO01EXP001RO-DTRND01 * -0.1477963373389) +       RMB0002
DTRN01          (AA-S3-CO01EXP001RO-DTRND04 * 0.218030967614173) +      RMB0002
DTRN01          (AA-S3-CO01MOR068RO-DTRND02 * 0.458592460897973) +      RMB0002
DTRN01          (AA-S3-CO01END092RO-DTRND01 * -0.207397524080302) +     RMB0002
DTRN01          (AA-S3-CO01END092RO-DTRND04 * 0.269981123195007) +      RMB0002
DTRN01          (AA-S3-CO01MOR074CC-DTRND01 * 0.25157562727694) +       RMB0002
DTRN01          (AA-S3-CO01MOR047RO-DTRND03 * 0.0941085824347264) +     RMB0002
DTRN01          (AA-S3-RECMORA001VSA-DTRND01 * -0.426773779602227) +    RMB0002
DTRN01          (AA-S3-RECMORA001VSA-DTRND03 * 0.118557919952929) +     RMB0002
DTRN01          (AA-S3-MMAXHIS-DTRND02 * -0.456702340824274) +          RMB0002
DTRN01          (AA-S3-CO01INQ016-DTRND02 * -0.394327459472137).        RMB0002
*
DTRN01    COMPUTE AA-SCOREN =                                           RMB0002
DTRN01       ( 1000 / (1 + 2.7182818284590452 ** (- AA-S3-EXPONENTE))). RMB0002
DTRN01    COMPUTE PROBABILIDAD-USAAA = AA-SCOREN.                       RMB0002
*
DTRN01    COMPUTE AA-SCOREN =                                           RMB0002
DTRN01       ( 400.0000000000 + 110.321693765613 * AA-S3-EXPONENTE).    RMB0002
DTRN01    COMPUTE SCORE-USAAA = AA-SCOREN.                              RMB0002
DTRN01    IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.                RMB0002
DTRN01    IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.                RMB0002
       6400-SCORE-CARD4-USAAA.
REMARK********************************************************************
REMARK*6400-SCORE-CARD4-USAAA.
REMARK*    SE CALCULA EL SCORE DE FINANCIERO ROTATIVO CON ALGUNA           
REMARK*    RELACION CON EL CONSULTADO                        
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
DTRE01     PERFORM 6500-EXPOSICION-USAAA.                               RMB0002
*
DTRE01*    CALCULO DE PRQALDIA                                          RMB0002
DTRE01     PERFORM 6500-QALDIA-USAAA.                                   RMB0002
DTRE01     PERFORM 6500-QTOT030-USAAA.                                  RMB0002
DTRE01     PERFORM 6500-QTOT060-USAAA.                                  RMB0002
DTRE01     PERFORM 6500-QTOT090-USAAA.                                  RMB0002
DTRE01     PERFORM 6500-QTOT120-USAAA.                                  RMB0002
DTRE01     PERFORM 6500-QTOTCC-USAAA.                                   RMB0002
DTRE01     PERFORM 6500-QTOTCR-USAAA.                                   RMB0002
DTRE01     COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +    RMB0002
DTRE01                         AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +    RMB0002
DTRE01                         AA-QTOTCR.                               RMB0002
DTRE01     IF AA-QTOTMR > 0                                             RMB0002
DTRE01        COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-PRQALDIA                                     RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01*    CALCULO DE MMAXHIS                                           RMB0002
DTRE01     PERFORM 6500-MMAXHIS-USAAA.                                  RMB0002
DTRE01*    CALCULO RECMORA001                                           RMB0002
DTRE01     PERFORM 6500-RECMORA030-USAAA.                               RMB0002
DTRE01     PERFORM 6500-RECMORA060-USAAA.                               RMB0002
DTRE01     PERFORM 6500-RECMORA090-USAAA.                               RMB0002
DTRE01     PERFORM 6500-RECMORA120-USAAA.                               RMB0002
DTRE01     PERFORM 6500-RECMORACC-USAAA.                                RMB0002
DTRE01     MOVE AA-RECMORA030 TO AA-RECMORA001                          RMB0002
DTRE01     IF AA-RECMORA060 < AA-RECMORA001                             RMB0002
DTRE01        MOVE AA-RECMORA060 TO AA-RECMORA001                       RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF AA-RECMORA090 < AA-RECMORA001                             RMB0002
DTRE01        MOVE AA-RECMORA090 TO AA-RECMORA001                       RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF AA-RECMORA120 < AA-RECMORA001                             RMB0002
DTRE01        MOVE AA-RECMORA120 TO AA-RECMORA001                       RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF AA-RECMORACC  < AA-RECMORA001                             RMB0002
DTRE01        MOVE AA-RECMORACC  TO AA-RECMORA001                       RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01*    CALCULO RECMORA001VSA                                        RMB0002
DTRE01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0002
DTRE01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0002
DTRE01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0002
DTRE01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0002
DTRE01        AA-RECMORA001 > 0                                         RMB0002
DTRE01        MOVE 0 TO AA-RECMORA001VSA                                RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE AA-RECMORA001 TO AA-RECMORA001VSA                    RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01*    ELIMINAR 999 EN RECMORA                                      RMB0002
DTRE01     PERFORM 6500-ELIMIN-999-RECMORA-USAAA.                       RMB0002
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 4
REMARK********************************************************************
DTRE01     MOVE 02EXP006TO      TO CO02EXP006TO.                        RMB0002
DTRE01     IF 02EXP006TO(1:1) = " " MOVE 60         TO CO02EXP006TOV    RMB0002
DTRE01     ELSE                     MOVE 02EXP006TO TO CO02EXP006TOV.   RMB0002
DTRE01     MOVE CO02EXP006TOV TO AA-S4-CO02EXP006TO-DTRE                RMB0002
DTRE01     IF AA-S4-CO02EXP006TO-DTRE > 109                             RMB0002
DTRE01        MOVE 109 TO AA-S4-CO02EXP006TO-DTRE                       RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE 01NUM050RO      TO CO01NUM050RO.                        RMB0002
DTRE01     IF 01NUM050RO(1:1) = " " MOVE ZEROS      TO CO01NUM050ROV    RMB0002
DTRE01     ELSE                     MOVE 01NUM050RO TO CO01NUM050ROV.   RMB0002
DTRE01     MOVE CO01NUM050ROV TO AA-S4-CO01NUM050RO-DTRE                RMB0002
DTRE01     IF AA-S4-CO01NUM050RO-DTRE > 9                               RMB0002
DTRE01        MOVE 9   TO AA-S4-CO01NUM050RO-DTRE                       RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE AA-PRQALDIA TO AA-S4-PRQALDIA-DTRE.                     RMB0002
DTRE01     IF AA-S4-PRQALDIA-DTRE > 1                                   RMB0002
DTRE01        MOVE 1 TO AA-S4-PRQALDIA-DTRE                             RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE 02NUM042CB      TO CO02NUM042CB.                        RMB0002
DTRE01     IF 02NUM042CB(1:1) = " " MOVE ZEROS      TO CO02NUM042CBV    RMB0002
DTRE01     ELSE                     MOVE 02NUM042CB TO CO02NUM042CBV.   RMB0002
DTRE01     MOVE CO02NUM042CBV TO AA-S4-CO02NUM042CB-DTRE                RMB0002
DTRE01     IF AA-S4-CO02NUM042CB-DTRE > 100                             RMB0002
DTRE01        MOVE 100 TO AA-S4-CO02NUM042CB-DTRE                       RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE 01ACP004RO      TO CO01ACP004RO.                        RMB0002
DTRE01     IF 01ACP004RO(1:1) = " " MOVE 2          TO CO01ACP004ROV    RMB0002
DTRE01     ELSE                     MOVE 01ACP004RO TO CO01ACP004ROV.   RMB0002
DTRE01     MOVE CO01ACP004ROV TO AA-S4-CO01ACP004RO-DTRE                RMB0002
DTRE01     IF AA-S4-CO01ACP004RO-DTRE > 6                               RMB0002
DTRE01        MOVE 6   TO AA-S4-CO01ACP004RO-DTRE                       RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     IF AA-PREEXPOSICIONIN < 0                                    RMB0002
DTRE01        MOVE 0 TO AA-S4-PREEXPOSICIONIN-DTRE                      RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE AA-PREEXPOSICIONIN TO AA-S4-PREEXPOSICIONIN-DTRE     RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF AA-S4-PREEXPOSICIONIN-DTRE > 1                            RMB0002
DTRE01        MOVE 1 TO AA-S4-PREEXPOSICIONIN-DTRE                      RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE 02EXP008TO      TO CO02EXP008TO.                        RMB0002
DTRE01     IF 02EXP008TO(1:1) = " " MOVE ZEROS      TO CO02EXP008TOV    RMB0002
DTRE01     ELSE                     MOVE 02EXP008TO TO CO02EXP008TOV.   RMB0002
DTRE01     MOVE CO02EXP008TOV TO AA-S4-CO02EXP008TO-DTRE                RMB0002
DTRE01     IF AA-S4-CO02EXP008TO-DTRE > 75                              RMB0002
DTRE01        MOVE 75  TO AA-S4-CO02EXP008TO-DTRE                       RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01***************************************************************** RMB0002
DTRE01*    CALCULO DE DUMMYS                                            RMB0002
DTRE01***************************************************************** RMB0002
DTRE01     MOVE 01END092RO      TO CO01END092RO.                        RMB0002
DTRE01     IF CO01END092RO(1:1) NUMERIC                                 RMB0002
DTRE01        MOVE CO01END092RO(1:8)  TO CO01END092ROV(1:8)             RMB0002
DTRE01        MOVE CO01END092RO(10:2) TO CO01END092ROV(9:2)             RMB0002
DTRE01     END-IF                                                       RMB0002
DTRE01     IF CO01END092RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 26.45 <= CO01END092ROV AND CO01END092ROV < 49.48       RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END092RO-DTRED03                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END092RO-DTRED03                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END092RO-DTRED03                      RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF CO01END092RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 49.48 <= CO01END092ROV                                 RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END092RO-DTRED04                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END092RO-DTRED04                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END092RO-DTRED04                      RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE 01END071RO      TO CO01END071RO.                        RMB0002
DTRE01     IF CO01END071RO(1:1) NUMERIC                                 RMB0002
DTRE01        MOVE CO01END071RO(1:8)  TO CO01END071ROV(1:8)             RMB0002
DTRE01        MOVE CO01END071RO(10:2) TO CO01END071ROV(9:2)             RMB0002
DTRE01     END-IF                                                       RMB0002
DTRE01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 0    <= CO01END071ROV AND CO01END071ROV < 27.35        RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END071RO-DTRED01                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END071RO-DTRED01                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END071RO-DTRED01                      RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 27.35 <= CO01END071ROV AND CO01END071ROV < 56.14       RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END071RO-DTRED02                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END071RO-DTRED02                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END071RO-DTRED02                      RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 82.01 <= CO01END071ROV                                 RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END071RO-DTRED04                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END071RO-DTRED04                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END071RO-DTRED04                      RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE 01END089RO      TO CO01END089RO.                        RMB0002
DTRE01     IF CO01END089RO(1:1) NUMERIC                                 RMB0002
DTRE01        MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)             RMB0002
DTRE01        MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)             RMB0002
DTRE01     END-IF                                                       RMB0002
DTRE01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 0 <= CO01END089ROV AND CO01END089ROV < 28.5            RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END089RO-DTRED01                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END089RO-DTRED01                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END089RO-DTRED01                      RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 28.5 <= CO01END089ROV AND CO01END089ROV < 56.65        RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END089RO-DTRED02                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END089RO-DTRED02                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END089RO-DTRED02                      RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 79.05 <= CO01END089ROV                                 RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END089RO-DTRED04                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END089RO-DTRED04                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END089RO-DTRED04                      RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE 01END010RO      TO CO01END010RO.                        RMB0002
DTRE01     IF CO01END010RO(1:1) NUMERIC                                 RMB0002
DTRE01        MOVE CO01END010RO(1:8)  TO CO01END010ROV(1:8)             RMB0002
DTRE01        MOVE CO01END010RO(10:2) TO CO01END010ROV(9:2)             RMB0002
DTRE01     END-IF                                                       RMB0002
DTRE01     IF CO01END010RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 2.16 <= CO01END010ROV AND CO01END010ROV < 5.22         RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END010RO-DTRED03                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END010RO-DTRED03                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END010RO-DTRED03                      RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF CO01END010RO(1:1)  NUMERIC                                RMB0002
DTRE01        IF 5.22 <= CO01END010ROV                                  RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01END010RO-DTRED04                   RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01END010RO-DTRED04                   RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01END010RO-DTRED04                      RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     MOVE 01INQ017        TO CO01INQ017  .                        RMB0002
DTRE01     IF CO01INQ017  (1:1) NUMERIC                                 RMB0002
DTRE01        MOVE CO01INQ017         TO CO01INQ017V                    RMB0002
DTRE01     END-IF                                                       RMB0002
DTRE01     IF CO01INQ017  (1:1)  NOT NUMERIC                            RMB0002
DTRE01        MOVE 1 TO AA-S4-CO01INQ017-DTRED00                        RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01INQ017-DTRED00                        RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF CO01INQ017  (1:1)  NUMERIC                                RMB0002
DTRE01        IF 2 <= CO01INQ017V AND CO01INQ017V < 3                   RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01INQ017-DTRED02                     RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01INQ017-DTRED02                     RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01INQ017-DTRED02                        RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF CO01INQ017  (1:1)  NUMERIC                                RMB0002
DTRE01        IF 3 <= CO01INQ017V                                       RMB0002
DTRE01           MOVE 1 TO AA-S4-CO01INQ017-DTRED03                     RMB0002
DTRE01        ELSE                                                      RMB0002
DTRE01           MOVE 0 TO AA-S4-CO01INQ017-DTRED03                     RMB0002
DTRE01        END-IF                                                    RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-CO01INQ017-DTRED03                        RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     IF 0 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 6            RMB0002
DTRE01        MOVE 1 TO AA-S4-RECMORA001VSA-DTRED01                     RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-RECMORA001VSA-DTRED01                     RMB0002
DTRE01     END-IF.                                                      RMB0002
DTRE01     IF 6 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 15           RMB0002
DTRE01        MOVE 1 TO AA-S4-RECMORA001VSA-DTRED02                     RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-RECMORA001VSA-DTRED02                     RMB0002
DTRE01     END-IF.                                                      RMB0002
*
DTRE01     IF 2 <= AA-MMAXHIS                                           RMB0002
DTRE01        MOVE 1 TO AA-S4-MMAXHIS-DTRED02                           RMB0002
DTRE01     ELSE                                                         RMB0002
DTRE01        MOVE 0 TO AA-S4-MMAXHIS-DTRED02                           RMB0002
DTRE01     END-IF                                                       RMB0002
*
DTRE01     COMPUTE                                                      RMB0002
DTRE01           AA-S4-EXPONENTE = 2.50650260609909 +                   RMB0002
DTRE01          (AA-S4-CO02EXP006TO-DTRE * 0.0099816308358122) +        RMB0002
DTRE01          (AA-S4-CO01NUM050RO-DTRE * 0.0836297107093468) +        RMB0002
DTRE01          (AA-S4-PRQALDIA-DTRE * 0.953950873392059) +             RMB0002
DTRE01          (AA-S4-CO02NUM042CB-DTRE * -0.00679276532905383) +      RMB0002
DTRE01          (AA-S4-CO01ACP004RO-DTRE * -0.0995983512223878) +       RMB0002
DTRE01          (AA-S4-PREEXPOSICIONIN-DTRE * -0.244996730346691) +     RMB0002
DTRE01          (AA-S4-CO02EXP008TO-DTRE * -0.007507425254573) +        RMB0002
DTRE01          (AA-S4-CO01END092RO-DTRED03 * 0.147935467727473) +      RMB0002
DTRE01          (AA-S4-CO01END092RO-DTRED04 * 0.253028540378739) +      RMB0002
DTRE01          (AA-S4-CO01END071RO-DTRED01 * 0.369083173273486) +      RMB0002
DTRE01          (AA-S4-CO01END071RO-DTRED02 * 0.301081045292067) +      RMB0002
DTRE01          (AA-S4-CO01END071RO-DTRED04 * -0.338159935896673) +     RMB0002
DTRE01          (AA-S4-CO01END089RO-DTRED01 * 0.229209748986827) +      RMB0002
DTRE01          (AA-S4-CO01END089RO-DTRED02 * 0.177023743513138) +      RMB0002
DTRE01          (AA-S4-CO01END089RO-DTRED04 * -0.188951513767361) +     RMB0002
DTRE01          (AA-S4-CO01END010RO-DTRED03 * 0.104057785366257) +      RMB0002
DTRE01          (AA-S4-CO01END010RO-DTRED04 * 0.277373734138514) +      RMB0002
DTRE01          (AA-S4-CO01INQ017-DTRED00 * 0.257417987210384) +        RMB0002
DTRE01          (AA-S4-CO01INQ017-DTRED02 * -0.224282520125901) +       RMB0002
DTRE01          (AA-S4-CO01INQ017-DTRED03 * -0.571253870563982) +       RMB0002
DTRE01          (AA-S4-RECMORA001VSA-DTRED01 * -0.555548462857749) +    RMB0002
DTRE01          (AA-S4-RECMORA001VSA-DTRED02 * -0.258145138338064) +    RMB0002
DTRE01          (AA-S4-MMAXHIS-DTRED02 * -0.399364291783047)            RMB0002
*
DTRE01    COMPUTE AA-SCOREN =                                           RMB0002
DTRE01       ( 1000 / (1 + 2.7182818284590452 ** (- AA-S4-EXPONENTE))). RMB0002
DTRE01    COMPUTE PROBABILIDAD-USAAA = AA-SCOREN.                       RMB0002
*
DTRE01    COMPUTE AA-SCOREN =                                           RMB0002
DTRE01       ( 400.0000000000 + 110.321693765613 * AA-S4-EXPONENTE).    RMB0002
DTRE01    COMPUTE SCORE-USAAA = AA-SCOREN.                              RMB0002
DTRE01    IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.                RMB0002
DTRE01    IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.                RMB0002
       6500-SCORE-CARD5-USAAA.
REMARK********************************************************************
REMARK*6500-SCORE-CARD5-USAAA.
REMARK*    SE CALCULA EL SCORE DE FINANCIERO DE INSTALAMENTOS              
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
DINT01*    CALCULO DE PRQALDIA                                          RMB0002
DINT01     PERFORM 6500-QALDIA-USAAA.                                   RMB0002
DINT01     PERFORM 6500-QTOT030-USAAA.                                  RMB0002
DINT01     PERFORM 6500-QTOT060-USAAA.                                  RMB0002
DINT01     PERFORM 6500-QTOT090-USAAA.                                  RMB0002
DINT01     PERFORM 6500-QTOT120-USAAA.                                  RMB0002
DINT01     PERFORM 6500-QTOTCC-USAAA.                                   RMB0002
DINT01     PERFORM 6500-QTOTCR-USAAA.                                   RMB0002
DINT01     COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +    RMB0002
DINT01                         AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +    RMB0002
DINT01                         AA-QTOTCR.                               RMB0002
DINT01     IF AA-QTOTMR > 0                                             RMB0002
DINT01        COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-PRQALDIA                                     RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01*    CALCULO DE MMAXHIS                                           RMB0002
DINT01     PERFORM 6500-MMAXHIS-USAAA.                                  RMB0002
DINT01*    CALCULO RECMORA001                                           RMB0002
DINT01     PERFORM 6500-RECMORA030-USAAA.                               RMB0002
DINT01     PERFORM 6500-RECMORA060-USAAA.                               RMB0002
DINT01     PERFORM 6500-RECMORA090-USAAA.                               RMB0002
DINT01     PERFORM 6500-RECMORA120-USAAA.                               RMB0002
DINT01     PERFORM 6500-RECMORACC-USAAA.                                RMB0002
DINT01     MOVE AA-RECMORA030 TO AA-RECMORA001                          RMB0002
DINT01     IF AA-RECMORA060 < AA-RECMORA001                             RMB0002
DINT01        MOVE AA-RECMORA060 TO AA-RECMORA001                       RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF AA-RECMORA090 < AA-RECMORA001                             RMB0002
DINT01        MOVE AA-RECMORA090 TO AA-RECMORA001                       RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF AA-RECMORA120 < AA-RECMORA001                             RMB0002
DINT01        MOVE AA-RECMORA120 TO AA-RECMORA001                       RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF AA-RECMORACC  < AA-RECMORA001                             RMB0002
DINT01        MOVE AA-RECMORACC  TO AA-RECMORA001                       RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01*    ELIMINAR 999 EN RECMORA                                      RMB0002
DINT01     PERFORM 6500-ELIMIN-999-RECMORA-USAAA.                       RMB0002
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGEMENTO 5
REMARK********************************************************************
DINT01     MOVE AA-PRQALDIA TO AA-S5-PRQALDIA-DINT.                     RMB0002
DINT01     IF AA-S5-PRQALDIA-DINT > 1                                   RMB0002
DINT01        MOVE 1 TO AA-S5-PRQALDIA-DINT                             RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 02NUM042CB      TO CO02NUM042CB.                        RMB0002
DINT01     IF 02NUM042CB(1:1) = " " MOVE ZEROS      TO CO02NUM042CBV    RMB0002
DINT01     ELSE                     MOVE 02NUM042CB TO CO02NUM042CBV.   RMB0002
DINT01     MOVE CO02NUM042CBV TO AA-S5-CO02NUM042CB-DINT                RMB0002
DINT01     IF AA-S5-CO02NUM042CB-DINT > 100                             RMB0002
DINT01        MOVE 100 TO AA-S5-CO02NUM042CB-DINT                       RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 02EXP001TO      TO CO02EXP001TO.                        RMB0002
DINT01     IF 02EXP001TO(1:1) = " " MOVE ZEROS      TO CO02EXP001TOV    RMB0002
DINT01     ELSE                     MOVE 02EXP001TO TO CO02EXP001TOV.   RMB0002
DINT01     MOVE CO02EXP001TOV TO AA-S5-CO02EXP001TO-DINT.               RMB0002
DINT01     IF AA-S5-CO02EXP001TO-DINT > 313                             RMB0002
DINT01        MOVE 313 TO AA-S5-CO02EXP001TO-DINT                       RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 02NUM005TO      TO CO02NUM005TO.                        RMB0002
DINT01     IF 02NUM005TO(1:1) = " " MOVE ZEROS      TO CO02NUM005TOV    RMB0002
DINT01     ELSE                     MOVE 02NUM005TO TO CO02NUM005TOV.   RMB0002
DINT01     MOVE CO02NUM005TOV TO AA-S5-CO02NUM005TO-DINT.               RMB0002
DINT01     IF AA-S5-CO02NUM005TO-DINT > 42                              RMB0002
DINT01        MOVE 42  TO AA-S5-CO02NUM005TO-DINT                       RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01***************************************************************** RMB0002
DINT01*    CALCULO DE DUMMYS                                            RMB0002
DINT01***************************************************************** RMB0002
DINT01     IF 0 <= AA-RECMORA001 AND AA-RECMORA001 < 3.63               RMB0002
DINT01        MOVE 1 TO AA-S5-RECMORA001-DINTD01                        RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-RECMORA001-DINTD01                        RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 02END015CB  TO CO02END015CB.                            RMB0002
DINT01     IF CO02END015CB(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO02END015CB(1:8)  TO CO02END015CBV(1:8)             RMB0002
DINT01        MOVE CO02END015CB(10:2) TO CO02END015CBV(9:2)             RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO02END015CB(1:1) NUMERIC                                 RMB0002
DINT01        IF 0.31 <= CO02END015CBV                                  RMB0002
DINT01           MOVE 1 TO AA-S5-CO02END015CB-DINTD02                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO02END015CB-DINTD02                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO02END015CB-DINTD02                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     IF 0 <= AA-RECMORA030 AND AA-RECMORA030 < 5                  RMB0002
DINT01        MOVE 1 TO AA-S5-RECMORA030-DINTD01                        RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-RECMORA030-DINTD01                        RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01END089RO      TO CO01END089RO.                        RMB0002
DINT01     IF CO01END089RO(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)             RMB0002
DINT01        MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)             RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 0 <= CO01END089ROV AND CO01END089ROV < 36.76           RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END089RO-DINTD01                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END089RO-DINTD01                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END089RO-DINTD01                      RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 36.76 <= CO01END089ROV AND CO01END089ROV < 63.97       RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END089RO-DINTD02                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END089RO-DINTD02                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END089RO-DINTD02                      RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 84.47 <= CO01END089ROV                                 RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END089RO-DINTD04                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END089RO-DINTD04                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END089RO-DINTD04                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01MOR046RO      TO CO01MOR046RO.                        RMB0002
DINT01     IF CO01MOR046RO(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01MOR046RO       TO CO01MOR046ROV                  RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01MOR046RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 0 <= CO01MOR046ROV AND CO01MOR046ROV < 1               RMB0002
DINT01           MOVE 1 TO AA-S5-CO01MOR046RO-DINTD01                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01MOR046RO-DINTD01                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01MOR046RO-DINTD01                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     IF 2 <= AA-MMAXHIS                                           RMB0002
DINT01        MOVE 1 TO AA-S5-MMAXHIS-DINTD03                           RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-MMAXHIS-DINTD03                           RMB0002
DINT01     END-IF                                                       RMB0002
*
DINT01     MOVE 01END017RO      TO CO01END017RO.                        RMB0002
DINT01     IF CO01END017RO(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01END017RO(1:8)  TO CO01END017ROV(1:8)             RMB0002
DINT01        MOVE CO01END017RO(10:2) TO CO01END017ROV(9:2)             RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01END017RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 0.01 <= CO01END017ROV                                  RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END017RO-DINTD02                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END017RO-DINTD02                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END017RO-DINTD02                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01END071RO      TO CO01END071RO.                        RMB0002
DINT01     IF CO01END071RO(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01END071RO(1:8)  TO CO01END071ROV(1:8)             RMB0002
DINT01        MOVE CO01END071RO(10:2) TO CO01END071ROV(9:2)             RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 0    <= CO01END071ROV AND CO01END071ROV < 34.96        RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END071RO-DINTD01                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END071RO-DINTD01                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END071RO-DINTD01                      RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 34.96 <= CO01END071ROV AND CO01END071ROV < 63.27       RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END071RO-DINTD02                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END071RO-DINTD02                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END071RO-DINTD02                      RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 86.95 <= CO01END071ROV                                 RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END071RO-DINTD04                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END071RO-DINTD04                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END071RO-DINTD04                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01EXP001RO      TO CO01EXP001RO.                        RMB0002
DINT01     IF CO01EXP001RO(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01EXP001RO       TO CO01EXP001ROV                  RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01EXP001RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 0 <= CO01EXP001ROV AND CO01EXP001ROV < 30.38           RMB0002
DINT01           MOVE 1 TO AA-S5-CO01EXP001RO-DINTD01                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01EXP001RO-DINTD01                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01EXP001RO-DINTD01                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01END070RO      TO CO01END070RO.                        RMB0002
DINT01     IF CO01END070RO(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01END070RO(1:8)  TO CO01END070ROV(1:8)             RMB0002
DINT01        MOVE CO01END070RO(10:2) TO CO01END070ROV(9:2)             RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01END070RO(1:1)  NUMERIC                                RMB0002
DINT01        IF 0    <= CO01END070ROV AND CO01END070ROV <  0.34        RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END070RO-DINTD01                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END070RO-DINTD01                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END070RO-DINTD01                      RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF CO01END070RO(1:1)  NUMERIC                                RMB0002
DINT01        IF  1.72 <= CO01END070ROV AND CO01END070ROV <  5.05       RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END070RO-DINTD03                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END070RO-DINTD03                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END070RO-DINTD03                      RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF CO01END070RO(1:1)  NUMERIC                                RMB0002
DINT01        IF  5.05 <= CO01END070ROV                                 RMB0002
DINT01           MOVE 1 TO AA-S5-CO01END070RO-DINTD04                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01END070RO-DINTD04                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01END070RO-DINTD04                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01EXP001AH      TO CO01EXP001AH.                        RMB0002
DINT01     IF CO01EXP001AH(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01EXP001AH       TO CO01EXP001AHV                  RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01EXP001AH(1:1)  NUMERIC                                RMB0002
DINT01        IF 141.68 <= CO01EXP001AHV                                RMB0002
DINT01           MOVE 1 TO AA-S5-CO01EXP001AH-DINTD04                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01EXP001AH-DINTD04                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01EXP001AH-DINTD04                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01ACP007CT      TO CO01ACP007CT.                        RMB0002
DINT01     IF CO01ACP007CT(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01ACP007CT       TO CO01ACP007CTV                  RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01ACP007CT(1:1)  NUMERIC                                RMB0002
DINT01        IF   1    <= CO01ACP007CTV                                RMB0002
DINT01           MOVE 1 TO AA-S5-CO01ACP007CT-DINTD02                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01ACP007CT-DINTD02                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01ACP007CT-DINTD02                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01MOR009CC      TO CO01MOR009CC.                        RMB0002
DINT01     IF CO01MOR009CC(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01MOR009CC       TO CO01MOR009CCV                  RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01MOR009CC(1:1)  NUMERIC                                RMB0002
DINT01        IF 0 <= CO01MOR009CCV AND CO01MOR009CCV < 1               RMB0002
DINT01           MOVE 1 TO AA-S5-CO01MOR009CC-DINTD01                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01MOR009CC-DINTD01                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01MOR009CC-DINTD01                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01MOR054IN      TO CO01MOR054IN.                        RMB0002
DINT01     IF CO01MOR054IN(1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01MOR054IN       TO CO01MOR054INV                  RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01MOR054IN(1:1)  NUMERIC                                RMB0002
DINT01        IF 0 <= CO01MOR054INV AND CO01MOR054INV < 1               RMB0002
DINT01           MOVE 1 TO AA-S5-CO01MOR054IN-DINTD01                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01MOR054IN-DINTD01                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01MOR054IN-DINTD01                      RMB0002
DINT01     END-IF.                                                      RMB0002
DINT01     IF CO01MOR054IN(1:1)  NUMERIC                                RMB0002
DINT01        IF 1 <=  CO01MOR054INV                                    RMB0002
DINT01           MOVE 1 TO AA-S5-CO01MOR054IN-DINTD02                   RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01MOR054IN-DINTD02                   RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01MOR054IN-DINTD02                      RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     MOVE 01INQ025        TO CO01INQ025  .                        RMB0002
DINT01     IF CO01INQ025  (1:1) NUMERIC                                 RMB0002
DINT01        MOVE CO01INQ025         TO CO01INQ025V                    RMB0002
DINT01     END-IF                                                       RMB0002
DINT01     IF CO01INQ025  (1:1)  NUMERIC                                RMB0002
DINT01        IF 2 <= CO01INQ025V                                       RMB0002
DINT01           MOVE 1 TO AA-S5-CO01INQ025-DINTD03                     RMB0002
DINT01        ELSE                                                      RMB0002
DINT01           MOVE 0 TO AA-S5-CO01INQ025-DINTD03                     RMB0002
DINT01        END-IF                                                    RMB0002
DINT01     ELSE                                                         RMB0002
DINT01        MOVE 0 TO AA-S5-CO01INQ025-DINTD03                        RMB0002
DINT01     END-IF.                                                      RMB0002
*
DINT01     COMPUTE                                                      RMB0002
DINT01           AA-S5-EXPONENTE = 2.01479519671931 +                   RMB0002
DINT01          (AA-S5-PRQALDIA-DINT        * 0.893191407686053) +      RMB0002
DINT01          (AA-S5-CO02NUM042CB-DINT    * -0.00758477829861706) +   RMB0002
DINT01          (AA-S5-CO02EXP001TO-DINT    * 0.00221497883005786) +    RMB0002
DINT01          (AA-S5-CO02NUM005TO-DINT    * 0.0067766308467504) +     RMB0002
DINT01          (AA-S5-RECMORA001-DINTD01   * -0.115744838307031) +     RMB0002
DINT01          (AA-S5-CO02END015CB-DINTD02 * -0.732429617190354) +     RMB0002
DINT01          (AA-S5-RECMORA030-DINTD01   * -0.278658181610554) +     RMB0002
DINT01          (AA-S5-CO01END089RO-DINTD01 * 0.366446340578242) +      RMB0002
DINT01          (AA-S5-CO01END089RO-DINTD02 * 0.214380069956298) +      RMB0002
DINT01          (AA-S5-CO01END089RO-DINTD04 * -0.184556464505395) +     RMB0002
DINT01          (AA-S5-CO01MOR046RO-DINTD01 * 0.304925995566543) +      RMB0002
DINT01          (AA-S5-MMAXHIS-DINTD03      * -0.469416677316358) +     RMB0002
DINT01          (AA-S5-CO01END017RO-DINTD02 * -0.373306734974282) +     RMB0002
DINT01          (AA-S5-CO01END071RO-DINTD01 * 0.384801414983065) +      RMB0002
DINT01          (AA-S5-CO01END071RO-DINTD02 * 0.21805071915204) +       RMB0002
DINT01          (AA-S5-CO01END071RO-DINTD04 * -0.255969322795542) +     RMB0002
DINT01          (AA-S5-CO01EXP001RO-DINTD01 * -0.421112288800988) +     RMB0002
DINT01          (AA-S5-CO01END070RO-DINTD01 * -0.0736922281823448) +    RMB0002
DINT01          (AA-S5-CO01END070RO-DINTD03 * 0.156574172531047) +      RMB0002
DINT01          (AA-S5-CO01END070RO-DINTD04 * 0.278252320499173) +      RMB0002
DINT01          (AA-S5-CO01EXP001AH-DINTD04 * 0.103284773118345) +      RMB0002
DINT01          (AA-S5-CO01ACP007CT-DINTD02 * -0.565198914412701) +     RMB0002
DINT01          (AA-S5-CO01MOR009CC-DINTD01 * 0.0750417753252263) +     RMB0002
DINT01          (AA-S5-CO01MOR054IN-DINTD01 * -0.142288835466278) +     RMB0002
DINT01          (AA-S5-CO01MOR054IN-DINTD02 * 0.185335058688169) +      RMB0002
DINT01          (AA-S5-CO01INQ025-DINTD03   * -0.469938039519278).      RMB0002
*
DINT01    COMPUTE AA-SCOREN =                                           RMB0002
DINT01       ( 1000 / (1 + 2.7182818284590452 ** (- AA-S5-EXPONENTE))). RMB0002
DINT01    COMPUTE PROBABILIDAD-USAAA = AA-SCOREN.                       RMB0002
*
DINT01    COMPUTE AA-SCOREN =                                           RMB0002
DINT01       ( 400.0000000000 + 110.321693765613 * AA-S5-EXPONENTE).    RMB0002
DINT01    COMPUTE SCORE-USAAA = AA-SCOREN.                              RMB0002
DINT01    IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.                RMB0002
DINT01    IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.                RMB0002
       6600-SCORE-CARD6-USAAA.
REMARK********************************************************************
REMARK*6600-SCORE-CARD6-USAAA.
REMARK*    SE CALCULA EL SCORE DE FINANCIERO DE VEHICULOS                  
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
DHVT01*    CALCULO DE PRQALDIA                                          RMB0002
DHVT01     PERFORM 6500-QALDIA-USAAA.                                   RMB0002
DHVT01     PERFORM 6500-QTOT030-USAAA.                                  RMB0002
DHVT01     PERFORM 6500-QTOT060-USAAA.                                  RMB0002
DHVT01     PERFORM 6500-QTOT090-USAAA.                                  RMB0002
DHVT01     PERFORM 6500-QTOT120-USAAA.                                  RMB0002
DHVT01     PERFORM 6500-QTOTCC-USAAA.                                   RMB0002
DHVT01     PERFORM 6500-QTOTCR-USAAA.                                   RMB0002
DHVT01     COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +    RMB0002
DHVT01                         AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +    RMB0002
DHVT01                         AA-QTOTCR.                               RMB0002
DHVT01     IF AA-QTOTMR > 0                                             RMB0002
DHVT01        COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-PRQALDIA                                     RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01*    CALCULO DE MMAXHIS                                           RMB0002
DHVT01     PERFORM 6500-MMAXHIS-USAAA.                                  RMB0002
DHVT01*    CALCULO RECMORA001                                           RMB0002
DHVT01     PERFORM 6500-RECMORA030-USAAA.                               RMB0002
DHVT01     PERFORM 6500-RECMORA060-USAAA.                               RMB0002
DHVT01     PERFORM 6500-RECMORA090-USAAA.                               RMB0002
DHVT01     PERFORM 6500-RECMORA120-USAAA.                               RMB0002
DHVT01     PERFORM 6500-RECMORACC-USAAA.                                RMB0002
DHVT01     MOVE AA-RECMORA030 TO AA-RECMORA001                          RMB0002
DHVT01     IF AA-RECMORA060 < AA-RECMORA001                             RMB0002
DHVT01        MOVE AA-RECMORA060 TO AA-RECMORA001                       RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01     IF AA-RECMORA090 < AA-RECMORA001                             RMB0002
DHVT01        MOVE AA-RECMORA090 TO AA-RECMORA001                       RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01     IF AA-RECMORA120 < AA-RECMORA001                             RMB0002
DHVT01        MOVE AA-RECMORA120 TO AA-RECMORA001                       RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01     IF AA-RECMORACC  < AA-RECMORA001                             RMB0002
DHVT01        MOVE AA-RECMORACC  TO AA-RECMORA001                       RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01*    CALCULO RECMORA001VSA                                        RMB0002
DHVT01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0002
DHVT01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0002
DHVT01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0002
DHVT01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0002
DHVT01        AA-RECMORA001 > 0                                         RMB0002
DHVT01        MOVE 0 TO AA-RECMORA001VSA                                RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE AA-RECMORA001 TO AA-RECMORA001VSA                    RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01*    ELIMINAR 999 EN RECMORA                                      RMB0002
DHVT01     PERFORM 6500-ELIMIN-999-RECMORA-USAAA.                       RMB0002
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 6
REMARK********************************************************************
DHVT01     MOVE 02NUM042CB      TO CO02NUM042CB.                        RMB0002
DHVT01     IF 02NUM042CB(1:1) = " " MOVE ZEROS      TO CO02NUM042CBV    RMB0002
DHVT01     ELSE                     MOVE 02NUM042CB TO CO02NUM042CBV.   RMB0002
DHVT01     MOVE CO02NUM042CBV TO AA-S6-CO02NUM042CB-DHVT                RMB0002
DHVT01     IF AA-S6-CO02NUM042CB-DHVT > 100                             RMB0002
DHVT01        MOVE 100 TO AA-S6-CO02NUM042CB-DHVT                       RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     MOVE AA-PRQALDIA TO AA-S6-PRQALDIA-DHVT.                     RMB0002
DHVT01     IF AA-S6-PRQALDIA-DHVT > 1                                   RMB0002
DHVT01        MOVE 1 TO AA-S6-PRQALDIA-DHVT                             RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     MOVE 02EXP009TO      TO CO02EXP009TO.                        RMB0002
DHVT01     IF 02EXP009TO(1:1) = " " MOVE ZEROS      TO CO02EXP009TOV    RMB0002
DHVT01     ELSE                     MOVE 02EXP009TO TO CO02EXP009TOV.   RMB0002
DHVT01     MOVE CO02EXP009TOV TO AA-S6-CO02EXP009TO-DHVT.               RMB0002
DHVT01     IF AA-S6-CO02EXP009TO-DHVT > 100                             RMB0002
DHVT01        MOVE 100 TO AA-S6-CO02EXP009TO-DHVT                       RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01***************************************************************** RMB0002
DHVT01*    CALCULO DE DUMMYS                                            RMB0002
DHVT01***************************************************************** RMB0002
DHVT01     IF 0 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 6            RMB0002
DHVT01        MOVE 1 TO AA-S6-RECMORA001VSA-DHVTD01                     RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-RECMORA001VSA-DHVTD01                     RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     MOVE 01END071RO      TO CO01END071RO.                        RMB0002
DHVT01     IF CO01END071RO(1:1) NUMERIC                                 RMB0002
DHVT01        MOVE CO01END071RO(1:8)  TO CO01END071ROV(1:8)             RMB0002
DHVT01        MOVE CO01END071RO(10:2) TO CO01END071ROV(9:2)             RMB0002
DHVT01     END-IF                                                       RMB0002
DHVT01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DHVT01        IF 0 <= CO01END071ROV AND CO01END071ROV < 18.86           RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01END071RO-DHVTD01                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01END071RO-DHVTD01                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01END071RO-DHVTD01                      RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DHVT01        IF 18.86 <= CO01END071ROV AND CO01END071ROV < 46.6        RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01END071RO-DHVTD02                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01END071RO-DHVTD02                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01END071RO-DHVTD02                      RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01     IF CO01END071RO(1:1)  NUMERIC                                RMB0002
DHVT01        IF 76.49 <= CO01END071ROV                                 RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01END071RO-DHVTD04                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01END071RO-DHVTD04                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01END071RO-DHVTD04                      RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     MOVE 01END089RO      TO CO01END089RO.                        RMB0002
DHVT01     IF CO01END089RO(1:1) NUMERIC                                 RMB0002
DHVT01        MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)             RMB0002
DHVT01        MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)             RMB0002
DHVT01     END-IF                                                       RMB0002
DHVT01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DHVT01        IF 0 <= CO01END089ROV AND CO01END089ROV < 21.45           RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01END089RO-DHVTD01                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01END089RO-DHVTD01                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01END089RO-DHVTD01                      RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DHVT01        IF 21.45 <= CO01END089ROV AND CO01END089ROV < 48.61       RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01END089RO-DHVTD02                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01END089RO-DHVTD02                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01END089RO-DHVTD02                      RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     IF 0 <= AA-RECMORA030 AND AA-RECMORA030 < 7                  RMB0002
DHVT01        MOVE 1 TO AA-S6-RECMORA030-DHVTD01                        RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-RECMORA030-DHVTD01                        RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01     IF 7 <= AA-RECMORA030 AND AA-RECMORA030 < 16                 RMB0002
DHVT01        MOVE 1 TO AA-S6-RECMORA030-DHVTD02                        RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-RECMORA030-DHVTD02                        RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     IF 0 <= AA-MMAXHIS AND AA-MMAXHIS < 2                        RMB0002
DHVT01        MOVE 1 TO AA-S6-MMAXHIS-DHVTD01                           RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-MMAXHIS-DHVTD01                           RMB0002
DHVT01     END-IF                                                       RMB0002
*
DHVT01     MOVE 01END015RO      TO CO01END015RO.                        RMB0002
DHVT01     IF CO01END015RO(1:1) NUMERIC                                 RMB0002
DHVT01        MOVE CO01END015RO(1:8)  TO CO01END015ROV(1:8)             RMB0002
DHVT01        MOVE CO01END015RO(10:2) TO CO01END015ROV(9:2)             RMB0002
DHVT01     END-IF                                                       RMB0002
DHVT01     IF CO01END015RO(1:1)  NUMERIC                                RMB0002
DHVT01        IF 2.61 <= CO01END015ROV AND CO01END015ROV < 6.21         RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01END015RO-DHVTD03                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01END015RO-DHVTD03                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01END015RO-DHVTD03                      RMB0002
DHVT01     END-IF.                                                      RMB0002
DHVT01     IF CO01END015RO(1:1)  NUMERIC                                RMB0002
DHVT01        IF 6.21 <= CO01END015ROV                                  RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01END015RO-DHVTD04                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01END015RO-DHVTD04                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01END015RO-DHVTD04                      RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     MOVE 01INQ017        TO CO01INQ017  .                        RMB0002
DHVT01     IF CO01INQ017  (1:1) NUMERIC                                 RMB0002
DHVT01        MOVE CO01INQ017         TO CO01INQ017V                    RMB0002
DHVT01     END-IF                                                       RMB0002
DHVT01     IF CO01INQ017  (1:1)  NUMERIC                                RMB0002
DHVT01        IF 3 <= CO01INQ017V                                       RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01INQ017-DHVTD02                     RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01INQ017-DHVTD02                     RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01INQ017-DHVTD02                        RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     MOVE 01MOR009CC      TO CO01MOR009CC.                        RMB0002
DHVT01     IF CO01MOR009CC(1:1) NUMERIC                                 RMB0002
DHVT01        MOVE CO01MOR009CC       TO CO01MOR009CCV                  RMB0002
DHVT01     END-IF                                                       RMB0002
DHVT01     IF CO01MOR009CC(1:1)  NUMERIC                                RMB0002
DHVT01        IF 0 <= CO01MOR009CCV AND CO01MOR009CCV < 1               RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01MOR009CC-DHVTD01                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01MOR009CC-DHVTD01                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01MOR009CC-DHVTD01                      RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     MOVE 01MOR067RO      TO CO01MOR067RO.                        RMB0002
DHVT01     IF CO01MOR067RO(1:1) NUMERIC                                 RMB0002
DHVT01        MOVE CO01MOR067RO       TO CO01MOR067ROV                  RMB0002
DHVT01     END-IF                                                       RMB0002
DHVT01     IF CO01MOR067RO(1:1)  NUMERIC                                RMB0002
DHVT01        IF 0 <= CO01MOR067ROV AND CO01MOR067ROV < 1               RMB0002
DHVT01           MOVE 1 TO AA-S6-CO01MOR067RO-DHVTD01                   RMB0002
DHVT01        ELSE                                                      RMB0002
DHVT01           MOVE 0 TO AA-S6-CO01MOR067RO-DHVTD01                   RMB0002
DHVT01        END-IF                                                    RMB0002
DHVT01     ELSE                                                         RMB0002
DHVT01        MOVE 0 TO AA-S6-CO01MOR067RO-DHVTD01                      RMB0002
DHVT01     END-IF.                                                      RMB0002
*
DHVT01     COMPUTE                                                      RMB0002
DHVT01           AA-S6-EXPONENTE = 2.87262241140757 +                   RMB0002
DHVT01          (AA-S6-CO02NUM042CB-DHVT * -0.0100532998584682) +       RMB0002
DHVT01          (AA-S6-PRQALDIA-DHVT * 1.04053795499282) +              RMB0002
DHVT01          (AA-S6-CO02EXP009TO-DHVT * -0.00920851495874948) +      RMB0002
DHVT01          (AA-S6-RECMORA001VSA-DHVTD01 * -0.278925633871566) +    RMB0002
DHVT01          (AA-S6-CO01END071RO-DHVTD01 * 0.432200195477845) +      RMB0002
DHVT01          (AA-S6-CO01END071RO-DHVTD02 * 0.326071715561251) +      RMB0002
DHVT01          (AA-S6-CO01END071RO-DHVTD04 * -0.561449436152477) +     RMB0002
DHVT01          (AA-S6-CO01END089RO-DHVTD01 * 0.433444395820514) +      RMB0002
DHVT01          (AA-S6-CO01END089RO-DHVTD02 * 0.340613200216082) +      RMB0002
DHVT01          (AA-S6-RECMORA030-DHVTD01 * -0.567695118779128) +       RMB0002
DHVT01          (AA-S6-RECMORA030-DHVTD02 * -0.331022905167224) +       RMB0002
DHVT01          (AA-S6-MMAXHIS-DHVTD01 * 0.777428452533831) +           RMB0002
DHVT01          (AA-S6-CO01END015RO-DHVTD03 * 0.24277708011573) +       RMB0002
DHVT01          (AA-S6-CO01END015RO-DHVTD04 * 0.477252369773504) +      RMB0002
DHVT01          (AA-S6-CO01INQ017-DHVTD02 * -0.32993658699919) +        RMB0002
DHVT01          (AA-S6-CO01MOR009CC-DHVTD01 * 0.0750461559435727) +     RMB0002
DHVT01          (AA-S6-CO01MOR067RO-DHVTD01 * 0.164475831866231)        RMB0002
*
DHVT01    COMPUTE AA-SCOREN =                                           RMB0002
DHVT01       ( 1000 / (1 + 2.7182818284590452 ** (- AA-S6-EXPONENTE))). RMB0002
DHVT01    COMPUTE PROBABILIDAD-USAAA = AA-SCOREN.                       RMB0002
*
DHVT01    COMPUTE AA-SCOREN =                                           RMB0002
DHVT01       ( 400.0000000000 + 110.321693765613 * AA-S6-EXPONENTE).    RMB0002
DHVT01    COMPUTE SCORE-USAAA = AA-SCOREN.                              RMB0002
DHVT01    IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.                RMB0002
DHVT01    IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.                RMB0002
       6700-SCORE-CARD7-USAAA.
REMARK********************************************************************
REMARK*6700-SCORE-CARD7-USAAA.
REMARK*    SE CALCULA EL SCORE DE COOPERATIVAS SIN NINGUNA                 
REMARK*    RELACION CON EL CONSULTADO                                 
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
DCPN01*    CALCULO DE MOB12                                             RMB0003
DCPN01     PERFORM 6500-MOB12-USAAA.                                    RMB0003
DCPN01*    CALCULO DE PRQALDIA                                          RMB0003
DCPN01     PERFORM 6500-QALDIA-USAAA.                                   RMB0003
DCPN01     PERFORM 6500-QTOT030-USAAA.                                  RMB0003
DCPN01     PERFORM 6500-QTOT060-USAAA.                                  RMB0003
DCPN01     PERFORM 6500-QTOT090-USAAA.                                  RMB0003
DCPN01     PERFORM 6500-QTOT120-USAAA.                                  RMB0003
DCPN01     PERFORM 6500-QTOTCC-USAAA.                                   RMB0003
DCPN01     PERFORM 6500-QTOTCR-USAAA.                                   RMB0003
DCPN01     COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +    RMB0003
DCPN01                         AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +    RMB0003
DCPN01                         AA-QTOTCR.                               RMB0003
DCPN01     IF AA-QTOTMR > 0                                             RMB0003
DCPN01        COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )    RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-PRQALDIA                                     RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01*    CALCULO DE MMAXHIS                                           RMB0003
DCPN01     PERFORM 6500-MMAXHIS-USAAA.                                  RMB0003
DCPN01*    CALCULO RECMORA001                                           RMB0003
DCPN01     PERFORM 6500-RECMORA030-USAAA.                               RMB0003
DCPN01     PERFORM 6500-RECMORA060-USAAA.                               RMB0003
DCPN01     PERFORM 6500-RECMORA090-USAAA.                               RMB0003
DCPN01     PERFORM 6500-RECMORA120-USAAA.                               RMB0003
DCPN01     PERFORM 6500-RECMORACC-USAAA.                                RMB0003
DCPN01     MOVE AA-RECMORA030 TO AA-RECMORA001                          RMB0003
DCPN01     IF AA-RECMORA060 < AA-RECMORA001                             RMB0003
DCPN01        MOVE AA-RECMORA060 TO AA-RECMORA001                       RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01     IF AA-RECMORA090 < AA-RECMORA001                             RMB0003
DCPN01        MOVE AA-RECMORA090 TO AA-RECMORA001                       RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01     IF AA-RECMORA120 < AA-RECMORA001                             RMB0003
DCPN01        MOVE AA-RECMORA120 TO AA-RECMORA001                       RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01     IF AA-RECMORACC  < AA-RECMORA001                             RMB0003
DCPN01        MOVE AA-RECMORACC  TO AA-RECMORA001                       RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01*    CALCULO RECMORA001VSA                                        RMB0003
DCPN01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0003
DCPN01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0003
DCPN01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0003
DCPN01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0003
DCPN01        AA-RECMORA001 > 0                                         RMB0003
DCPN01        MOVE 0 TO AA-RECMORA001VSA                                RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE AA-RECMORA001 TO AA-RECMORA001VSA                    RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01*    ELIMINAR 999 EN RECMORA                                      RMB0003
DCPN01     PERFORM 6500-ELIMIN-999-RECMORA-USAAA.                       RMB0003
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 6
REMARK********************************************************************
DCPN01     MOVE AA-MOB12    TO AA-S7-MOB12-DCPN.                        RMB0003
DCPN01     IF AA-S7-MOB12-DCPN    > 4                                   RMB0003
DCPN01        MOVE 4  TO AA-S7-MOB12-DCPN                               RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     MOVE 02EXP006TO      TO CO02EXP006TO.                        RMB0003
DCPN01     IF 02EXP006TO(1:1) = " " MOVE 49         TO CO02EXP006TOV    RMB0003
DCPN01     ELSE                     MOVE 02EXP006TO TO CO02EXP006TOV.   RMB0003
DCPN01     MOVE CO02EXP006TOV TO AA-S7-CO02EXP006TO-DCPN.               RMB0003
DCPN01     IF AA-S7-CO02EXP006TO-DCPN > 102                             RMB0003
DCPN01        MOVE 102 TO AA-S7-CO02EXP006TO-DCPN                       RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     MOVE AA-PRQALDIA TO AA-S7-PRQALDIA-DCPN.                     RMB0003
DCPN01     IF AA-S7-PRQALDIA-DCPN > 1                                   RMB0003
DCPN01        MOVE 1 TO AA-S7-PRQALDIA-DCPN                             RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01***************************************************************** RMB0003
DCPN01*    CALCULO DE DUMMYS                                            RMB0003
DCPN01***************************************************************** RMB0003
DCPN01     MOVE 00DEM003    TO CO00DEM003.                              RMB0003
DCPN01     IF 000 <= CO00DEM003 AND CO00DEM003 < 029                    RMB0003
DCPN01        MOVE 1 TO AA-S7-CO00DEM003-DCPND01                        RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO00DEM003-DCPND01                        RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01     IF 029 <= CO00DEM003 AND CO00DEM003 < 038                    RMB0003
DCPN01        MOVE 1 TO AA-S7-CO00DEM003-DCPND02                        RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO00DEM003-DCPND02                        RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     IF 0 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 3            RMB0003
DCPN01        MOVE 1 TO AA-S7-RECMORA001VSA-DCPND01                     RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-RECMORA001VSA-DCPND01                     RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01     IF 3 <= AA-RECMORA001VSA AND AA-RECMORA001VSA < 10           RMB0003
DCPN01        MOVE 1 TO AA-S7-RECMORA001VSA-DCPND02                     RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-RECMORA001VSA-DCPND02                     RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     IF 0 <= AA-MMAXHIS AND AA-MMAXHIS < 2                        RMB0003
DCPN01        MOVE 1 TO AA-S7-MMAXHIS-DCPND01                           RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-MMAXHIS-DCPND01                           RMB0003
DCPN01     END-IF                                                       RMB0003
*
DCPN01     MOVE 01INQ017        TO CO01INQ017  .                        RMB0003
DCPN01     IF CO01INQ017  (1:1) NUMERIC                                 RMB0003
DCPN01        MOVE CO01INQ017         TO CO01INQ017V                    RMB0003
DCPN01     END-IF                                                       RMB0003
DCPN01     IF CO01INQ017  (1:1)  NUMERIC                                RMB0003
DCPN01        IF 2 <= CO01INQ017V AND CO01INQ017V < 3                   RMB0003
DCPN01           MOVE 1 TO AA-S7-CO01INQ017-DCPND02                     RMB0003
DCPN01        ELSE                                                      RMB0003
DCPN01           MOVE 0 TO AA-S7-CO01INQ017-DCPND02                     RMB0003
DCPN01        END-IF                                                    RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO01INQ017-DCPND02                        RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01     IF CO01INQ017  (1:1)  NUMERIC                                RMB0003
DCPN01        IF 3 <= CO01INQ017V                                       RMB0003
DCPN01           MOVE 1 TO AA-S7-CO01INQ017-DCPND03                     RMB0003
DCPN01        ELSE                                                      RMB0003
DCPN01           MOVE 0 TO AA-S7-CO01INQ017-DCPND03                     RMB0003
DCPN01        END-IF                                                    RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO01INQ017-DCPND03                        RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     MOVE 01MOR055CC      TO CO01MOR055CC.                        RMB0003
DCPN01     IF CO01MOR055CC(1:1) NUMERIC                                 RMB0003
DCPN01        MOVE CO01MOR055CC       TO CO01MOR055CCV                  RMB0003
DCPN01     END-IF                                                       RMB0003
DCPN01     IF CO01MOR055CC(1:1)  NUMERIC                                RMB0003
DCPN01        IF 0 <= CO01MOR055CCV AND CO01MOR055CCV < 1               RMB0003
DCPN01           MOVE 1 TO AA-S7-CO01MOR055CC-DCPND01                   RMB0003
DCPN01        ELSE                                                      RMB0003
DCPN01           MOVE 0 TO AA-S7-CO01MOR055CC-DCPND01                   RMB0003
DCPN01        END-IF                                                    RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO01MOR055CC-DCPND01                      RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     MOVE 01END089RO      TO CO01END089RO.                        RMB0003
DCPN01     IF CO01END089RO(1:1) NUMERIC                                 RMB0003
DCPN01        MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)             RMB0003
DCPN01        MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)             RMB0003
DCPN01     END-IF                                                       RMB0003
DCPN01     IF CO01END089RO(1:1)  NUMERIC                                RMB0003
DCPN01        IF 0 <= CO01END089ROV AND CO01END089ROV < 71.36           RMB0003
DCPN01           MOVE 1 TO AA-S7-CO01END089RO-DCPND01                   RMB0003
DCPN01        ELSE                                                      RMB0003
DCPN01           MOVE 0 TO AA-S7-CO01END089RO-DCPND01                   RMB0003
DCPN01        END-IF                                                    RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO01END089RO-DCPND01                      RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01     IF CO01END089RO(1:1)  NUMERIC                                RMB0003
DCPN01        IF 71.36 <= CO01END089ROV                                 RMB0003
DCPN01           MOVE 1 TO AA-S7-CO01END089RO-DCPND02                   RMB0003
DCPN01        ELSE                                                      RMB0003
DCPN01           MOVE 0 TO AA-S7-CO01END089RO-DCPND02                   RMB0003
DCPN01        END-IF                                                    RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO01END089RO-DCPND02                      RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     MOVE 01END027CC      TO CO01END027CC.                        RMB0003
DCPN01     IF CO01END027CC(1:1) NUMERIC                                 RMB0003
DCPN01        MOVE CO01END027CC(1:8)  TO CO01END027CCV(1:8)             RMB0003
DCPN01        MOVE CO01END027CC(10:2) TO CO01END027CCV(9:2)             RMB0003
DCPN01     END-IF                                                       RMB0003
DCPN01     IF CO01END027CC(1:1)  NUMERIC                                RMB0003
DCPN01        IF 0 <= CO01END027CCV AND CO01END027CCV < 0.04            RMB0003
DCPN01           MOVE 1 TO AA-S7-CO01END027CC-DCPND01                   RMB0003
DCPN01        ELSE                                                      RMB0003
DCPN01           MOVE 0 TO AA-S7-CO01END027CC-DCPND01                   RMB0003
DCPN01        END-IF                                                    RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO01END027CC-DCPND01                      RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     MOVE 02END015CB  TO CO02END015CB.                            RMB0003
DCPN01     IF CO02END015CB(1:1) NUMERIC                                 RMB0003
DCPN01        MOVE CO02END015CB(1:8)  TO CO02END015CBV(1:8)             RMB0003
DCPN01        MOVE CO02END015CB(10:2) TO CO02END015CBV(9:2)             RMB0003
DCPN01     END-IF                                                       RMB0003
DCPN01     IF CO02END015CB(1:1) NOT NUMERIC                             RMB0003
DCPN01        MOVE 1 TO AA-S7-CO02END015CB-DCPND00                      RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO02END015CB-DCPND00                      RMB0003
DCPN01     END-IF.                                                      RMB0003
DCPN01     IF CO02END015CB(1:1) NUMERIC                                 RMB0003
DCPN01        IF 0.51 <= CO02END015CBV                                  RMB0003
DCPN01           MOVE 1 TO AA-S7-CO02END015CB-DCPND02                   RMB0003
DCPN01        ELSE                                                      RMB0003
DCPN01           MOVE 0 TO AA-S7-CO02END015CB-DCPND02                   RMB0003
DCPN01        END-IF                                                    RMB0003
DCPN01     ELSE                                                         RMB0003
DCPN01        MOVE 0 TO AA-S7-CO02END015CB-DCPND02                      RMB0003
DCPN01     END-IF.                                                      RMB0003
*
DCPN01     COMPUTE                                                      RMB0003
DCPN01           AA-S7-EXPONENTE = 1.95430214380289 +                   RMB0003
DCPN01          (AA-S7-MOB12-DCPN * -0.103870972321446) +               RMB0003
DCPN01          (AA-S7-CO02EXP006TO-DCPN * 0.00638270909705039) +       RMB0003
DCPN01          (AA-S7-PRQALDIA-DCPN * 0.309168328568107) +             RMB0003
DCPN01          (AA-S7-CO00DEM003-DCPND01 * -0.350886638092673) +       RMB0003
DCPN01          (AA-S7-CO00DEM003-DCPND02 * -0.157075147335248) +       RMB0003
DCPN01          (AA-S7-RECMORA001VSA-DCPND01 * -0.399457813501833) +    RMB0003
DCPN01          (AA-S7-RECMORA001VSA-DCPND02 * -0.1430177197661) +      RMB0003
DCPN01          (AA-S7-MMAXHIS-DCPND01 * 0.330172003818283) +           RMB0003
DCPN01          (AA-S7-CO01INQ017-DCPND02 * -0.277890271596794) +       RMB0003
DCPN01          (AA-S7-CO01INQ017-DCPND03 * -0.663254865964326) +       RMB0003
DCPN01          (AA-S7-CO01MOR055CC-DCPND01 * 0.279936215827117) +      RMB0003
DCPN01          (AA-S7-CO01END089RO-DCPND01 * 0.408207845839876) +      RMB0003
DCPN01          (AA-S7-CO01END089RO-DCPND02 * -0.144043871786253) +     RMB0003
DCPN01          (AA-S7-CO01END027CC-DCPND01 * 0.257220687356696) +      RMB0003
DCPN01          (AA-S7-CO02END015CB-DCPND00 * 0.109528826489926) +      RMB0003
DCPN01          (AA-S7-CO02END015CB-DCPND02 * -0.187274373553608) .     RMB0003
*
DCPN01    COMPUTE AA-SCOREN =                                           RMB0003
DCPN01       ( 1000 / (1 + 2.7182818284590452 ** (- AA-S7-EXPONENTE))). RMB0003
DCPN01    COMPUTE PROBABILIDAD-USAAA = AA-SCOREN.                       RMB0003
*
DCPN01    COMPUTE AA-SCOREN =                                           RMB0003
DCPN01       ( 400.0000000000 + 110.321693765613 * AA-S7-EXPONENTE).    RMB0003
DCPN01    COMPUTE SCORE-USAAA = AA-SCOREN.                              RMB0003
DCPN01    IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.                RMB0003
DCPN01    IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.                RMB0003
       6800-SCORE-CARD8-USAAA.
REMARK********************************************************************
REMARK*6800-SCORE-CARD8-USAAA.
REMARK*    SE CALCULA EL SCORE DE COOPERATIVAS CON ALGUNA                  
REMARK*    RELACION CON EL CONSULTADO                                 
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
DCPE01*    CALCULO DE PRQALDIA                                          RMB0003
DCPE01     PERFORM 6500-QALDIA-USAAA.                                   RMB0003
DCPE01     PERFORM 6500-QTOT030-USAAA.                                  RMB0003
DCPE01     PERFORM 6500-QTOT060-USAAA.                                  RMB0003
DCPE01     PERFORM 6500-QTOT090-USAAA.                                  RMB0003
DCPE01     PERFORM 6500-QTOT120-USAAA.                                  RMB0003
DCPE01     PERFORM 6500-QTOTCC-USAAA.                                   RMB0003
DCPE01     PERFORM 6500-QTOTCR-USAAA.                                   RMB0003
DCPE01     COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +    RMB0003
DCPE01                         AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +    RMB0003
DCPE01                         AA-QTOTCR.                               RMB0003
DCPE01     IF AA-QTOTMR > 0                                             RMB0003
DCPE01        COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-PRQALDIA                                     RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01*    CALCULO RECMORA001                                           RMB0003
DCPE01     PERFORM 6500-RECMORA030-USAAA.                               RMB0003
DCPE01     PERFORM 6500-RECMORA060-USAAA.                               RMB0003
DCPE01     PERFORM 6500-RECMORA090-USAAA.                               RMB0003
DCPE01     PERFORM 6500-RECMORA120-USAAA.                               RMB0003
DCPE01     PERFORM 6500-RECMORACC-USAAA.                                RMB0003
DCPE01     MOVE AA-RECMORA030 TO AA-RECMORA001                          RMB0003
DCPE01     IF AA-RECMORA060 < AA-RECMORA001                             RMB0003
DCPE01        MOVE AA-RECMORA060 TO AA-RECMORA001                       RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF AA-RECMORA090 < AA-RECMORA001                             RMB0003
DCPE01        MOVE AA-RECMORA090 TO AA-RECMORA001                       RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF AA-RECMORA120 < AA-RECMORA001                             RMB0003
DCPE01        MOVE AA-RECMORA120 TO AA-RECMORA001                       RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF AA-RECMORACC  < AA-RECMORA001                             RMB0003
DCPE01        MOVE AA-RECMORACC  TO AA-RECMORA001                       RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01*    CALCULO MMAX48                                               RMB0003
DCPE01     PERFORM 6500-MMAX48-USAAA.                                   RMB0003
DCPE01*    CALCULO EVER03006P                                           RMB0003
DCPE01     PERFORM 6500-EVER03006P-USAAA.                               RMB0003
DCPE01*    ELIMINAR 999 EN RECMORA                                      RMB0003
DCPE01     PERFORM 6500-ELIMIN-999-RECMORA-USAAA.                       RMB0003
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 6
REMARK********************************************************************
*
DCPE01     MOVE AA-PRQALDIA TO AA-S8-PRQALDIA-DCPE.                     RMB0003
DCPE01     IF AA-S8-PRQALDIA-DCPE > 1                                   RMB0003
DCPE01        MOVE 1 TO AA-S8-PRQALDIA-DCPE                             RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 01MOR040IN      TO CO01MOR040IN.                        RMB0003
DCPE01     IF 01MOR040IN(1:1) = " " MOVE ZEROS      TO CO01MOR040INV    RMB0003
DCPE01     ELSE                     MOVE 01MOR040IN TO CO01MOR040INV.   RMB0003
DCPE01     MOVE CO01MOR040INV TO AA-S8-CO01MOR040IN-DCPE.               RMB0003
DCPE01     IF AA-S8-CO01MOR040IN-DCPE > 4                               RMB0003
DCPE01        MOVE 4   TO AA-S8-CO01MOR040IN-DCPE                       RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 02NUM042CB      TO CO02NUM042CB.                        RMB0003
DCPE01     IF 02NUM042CB(1:1) = " " MOVE ZEROS      TO CO02NUM042CBV    RMB0003
DCPE01     ELSE                     MOVE 02NUM042CB TO CO02NUM042CBV.   RMB0003
DCPE01     MOVE CO02NUM042CBV TO AA-S8-CO02NUM042CB-DCPE                RMB0003
DCPE01     IF AA-S8-CO02NUM042CB-DCPE > 100                             RMB0003
DCPE01        MOVE 100 TO AA-S8-CO02NUM042CB-DCPE                       RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 02EXP006TO      TO CO02EXP006TO.                        RMB0003
DCPE01     IF 02EXP006TO(1:1) = " " MOVE 46         TO CO02EXP006TOV    RMB0003
DCPE01     ELSE                     MOVE 02EXP006TO TO CO02EXP006TOV.   RMB0003
DCPE01     MOVE CO02EXP006TOV TO AA-S8-CO02EXP006TO-DCPE.               RMB0003
DCPE01     IF AA-S8-CO02EXP006TO-DCPE > 89                              RMB0003
DCPE01        MOVE 89  TO AA-S8-CO02EXP006TO-DCPE                       RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01***************************************************************** RMB0003
DCPE01*    CALCULO DE DUMMYS                                            RMB0003
DCPE01***************************************************************** RMB0003
DCPE01     IF 0 <= AA-RECMORA001 AND AA-RECMORA001 < 2                  RMB0003
DCPE01        MOVE 1 TO AA-S8-RECMORA001-DCPED01                        RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-RECMORA001-DCPED01                        RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 01END017IN      TO CO01END017IN.                        RMB0003
DCPE01     IF CO01END017IN(1:1) NUMERIC                                 RMB0003
DCPE01        MOVE CO01END017IN(1:8)  TO CO01END017INV(1:8)             RMB0003
DCPE01        MOVE CO01END017IN(10:2) TO CO01END017INV(9:2)             RMB0003
DCPE01     END-IF                                                       RMB0003
DCPE01     IF CO01END017IN(1:1)  NUMERIC                                RMB0003
DCPE01        IF 0.04 <= CO01END017INV                                  RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01END017IN-DCPED02                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01END017IN-DCPED02                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-CO01END017IN-DCPED02                      RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     IF 0 <= AA-MMAX48     AND AA-MMAX48     < 2                  RMB0003
DCPE01        MOVE 1 TO AA-S8-MMAX48-DCPED01                            RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-MMAX48-DCPED01                            RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 01END089RO      TO CO01END089RO.                        RMB0003
DCPE01     IF CO01END089RO(1:1) NUMERIC                                 RMB0003
DCPE01        MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)             RMB0003
DCPE01        MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)             RMB0003
DCPE01     END-IF                                                       RMB0003
DCPE01     IF CO01END089RO(1:1)  NUMERIC                                RMB0003
DCPE01        IF 0 <= CO01END089ROV AND CO01END089ROV < 41.78           RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01END089RO-DCPED01                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01END089RO-DCPED01                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-CO01END089RO-DCPED01                      RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF CO01END089RO(1:1)  NUMERIC                                RMB0003
DCPE01        IF 88.47 <= CO01END089ROV                                 RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01END089RO-DCPED04                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01END089RO-DCPED04                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-CO01END089RO-DCPED04                      RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 01MOR056RO      TO CO01MOR056RO.                        RMB0003
DCPE01     IF CO01MOR056RO(1:1) NUMERIC                                 RMB0003
DCPE01        MOVE CO01MOR056RO       TO CO01MOR056ROV                  RMB0003
DCPE01     END-IF                                                       RMB0003
DCPE01     IF CO01MOR056RO(1:1)  NUMERIC                                RMB0003
DCPE01        IF 0.02 <= CO01MOR056ROV                                  RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01MOR056RO-DCPED02                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01MOR056RO-DCPED02                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-CO01MOR056RO-DCPED02                      RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 01INQ017        TO CO01INQ017  .                        RMB0003
DCPE01     IF CO01INQ017  (1:1) NUMERIC                                 RMB0003
DCPE01        MOVE CO01INQ017         TO CO01INQ017V                    RMB0003
DCPE01     END-IF                                                       RMB0003
DCPE01     IF CO01INQ017  (1:1)  NUMERIC                                RMB0003
DCPE01        IF 2 <= CO01INQ017V                                       RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01INQ017-DCPED02                     RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01INQ017-DCPED02                     RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-CO01INQ017-DCPED02                        RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 01END027CC      TO CO01END027CC.                        RMB0003
DCPE01     IF CO01END027CC(1:1) NUMERIC                                 RMB0003
DCPE01        MOVE CO01END027CC(1:8)  TO CO01END027CCV(1:8)             RMB0003
DCPE01        MOVE CO01END027CC(10:2) TO CO01END027CCV(9:2)             RMB0003
DCPE01     END-IF                                                       RMB0003
DCPE01     IF CO01END027CC(1:1)  NUMERIC                                RMB0003
DCPE01        IF 0 <= CO01END027CCV AND CO01END027CCV < 0.04            RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01END027CC-DCPED01                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01END027CC-DCPED01                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-CO01END027CC-DCPED01                      RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 02NUM030TO      TO CO02NUM030TO.                        RMB0003
DCPE01     MOVE CO02NUM030TO    TO CO02NUM030TOV.                       RMB0003
DCPE01     IF 02NUM030TO(1:1) <> " "                                    RMB0003
DCPE01        IF 1 <= CO02NUM030TOV                                     RMB0003
DCPE01           MOVE 1 TO AA-S8-CO02NUM030TO-DCPED02                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO02NUM030TO-DCPED02                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-CO02NUM030TO-DCPED02                      RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     IF 0 <= AA-EVER03006P AND AA-EVER03006P < 1                  RMB0003
DCPE01        MOVE 1 TO AA-S8-EVER03006P-DCPED01                        RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-EVER03006P-DCPED01                        RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 01ACP015IN      TO CO01ACP015IN.                        RMB0003
DCPE01     MOVE CO01ACP015IN    TO CO01ACP015INV.                       RMB0003
DCPE01     IF 01ACP015IN(1:1) NUMERIC                                   RMB0003
DCPE01        IF 3.93 <= CO01ACP015INV AND CO01ACP015INV < 7.97         RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01ACP015IN-DCPED03                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01ACP015IN-DCPED03                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01         MOVE 0 TO AA-S8-CO01ACP015IN-DCPED03                     RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF 01ACP015IN(1:1) NUMERIC                                   RMB0003
DCPE01        IF 7.97 <= CO01ACP015INV                                  RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01ACP015IN-DCPED04                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01ACP015IN-DCPED04                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01         MOVE 0 TO AA-S8-CO01ACP015IN-DCPED04                     RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     MOVE 01MOR054IN      TO CO01MOR054IN.                        RMB0003
DCPE01     IF CO01MOR054IN(1:1) NUMERIC                                 RMB0003
DCPE01        MOVE CO01MOR054IN       TO CO01MOR054INV                  RMB0003
DCPE01     END-IF                                                       RMB0003
DCPE01     IF CO01MOR054IN(1:1)  NUMERIC                                RMB0003
DCPE01        IF 1 <= CO01MOR054INV                                     RMB0003
DCPE01           MOVE 1 TO AA-S8-CO01MOR054IN-DCPED02                   RMB0003
DCPE01        ELSE                                                      RMB0003
DCPE01           MOVE 0 TO AA-S8-CO01MOR054IN-DCPED02                   RMB0003
DCPE01        END-IF                                                    RMB0003
DCPE01     ELSE                                                         RMB0003
DCPE01        MOVE 0 TO AA-S8-CO01MOR054IN-DCPED02                      RMB0003
DCPE01     END-IF.                                                      RMB0003
*
DCPE01     COMPUTE                                                      RMB0003
DCPE01           AA-S8-EXPONENTE = 2.57119277576597 +                   RMB0003
DCPE01          (AA-S8-PRQALDIA-DCPE * 0.854782056445818) +             RMB0003
DCPE01          (AA-S8-CO01MOR040IN-DCPE * 0.0451836514919691) +        RMB0003
DCPE01          (AA-S8-CO02NUM042CB-DCPE * -0.0112530194457343) +       RMB0003
DCPE01          (AA-S8-CO02EXP006TO-DCPE * 0.0114903766493103) +        RMB0003
DCPE01          (AA-S8-RECMORA001-DCPED01 * -0.35168505957453) +        RMB0003
DCPE01          (AA-S8-CO01END017IN-DCPED02 * -0.505520897822874) +     RMB0003
DCPE01          (AA-S8-MMAX48-DCPED01 * 0.209681524531116) +            RMB0003
DCPE01          (AA-S8-CO01END089RO-DCPED01 * 0.450614114926494) +      RMB0003
DCPE01          (AA-S8-CO01END089RO-DCPED04 * -0.359470090087653) +     RMB0003
DCPE01          (AA-S8-CO01MOR056RO-DCPED02 * -0.144530984295101) +     RMB0003
DCPE01          (AA-S8-CO01INQ017-DCPED02 * -0.513852534911068) +       RMB0003
DCPE01          (AA-S8-CO01END027CC-DCPED01 * 0.202794155737566) +      RMB0003
DCPE01          (AA-S8-CO02NUM030TO-DCPED02 * 0.286551127255064) +      RMB0003
DCPE01          (AA-S8-EVER03006P-DCPED01 * 0.379127125882687) +        RMB0003
DCPE01          (AA-S8-CO01ACP015IN-DCPED03 * 0.0822947691619087) +     RMB0003
DCPE01          (AA-S8-CO01ACP015IN-DCPED04 * 0.249315001551269) +      RMB0003
DCPE01          (AA-S8-CO01MOR054IN-DCPED02 * 0.310650592126923).       RMB0003
*
DCPE01    COMPUTE AA-SCOREN =                                           RMB0003
DCPE01       ( 1000 / (1 + 2.7182818284590452 ** (- AA-S8-EXPONENTE))). RMB0003
DCPE01    COMPUTE PROBABILIDAD-USAAA = AA-SCOREN.                       RMB0003
*
DCPE01    COMPUTE AA-SCOREN =                                           RMB0003
DCPE01       ( 400.0000000000 + 110.321693765613 * AA-S8-EXPONENTE).    RMB0003
DCPE01    COMPUTE SCORE-USAAA = AA-SCOREN.                              RMB0003
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 8
REMARK********************************************************************
DCPE01    IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.                RMB0003
DCPE01    IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.                RMB0003
       6800-SCORE-CARD9-USAAA.
REMARK********************************************************************
REMARK*6800-SCORE-CARD9-USAAA.
REMARK*    SE CALCULA EL SCORE DE GENERICO DEL FINANCIERO                  
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAAA(1) .
DFUT01*    CALCULO DE PRQALDIA                                          RMB0002
DFUT01     PERFORM 6500-QALDIA-USAAA.                                   RMB0002
DFUT01     PERFORM 6500-QTOT030-USAAA.                                  RMB0002
DFUT01     PERFORM 6500-QTOT060-USAAA.                                  RMB0002
DFUT01     PERFORM 6500-QTOT090-USAAA.                                  RMB0002
DFUT01     PERFORM 6500-QTOT120-USAAA.                                  RMB0002
DFUT01     PERFORM 6500-QTOTCC-USAAA.                                   RMB0002
DFUT01     PERFORM 6500-QTOTCR-USAAA.                                   RMB0002
DFUT01     COMPUTE AA-QTOTMR = AA-QALDIA + AA-QTOT030 + AA-QTOT060 +    RMB0002
DFUT01                         AA-QTOT090 + AA-QTOT120 + AA-QTOTCC +    RMB0002
DFUT01                         AA-QTOTCR.                               RMB0002
DFUT01     IF AA-QTOTMR > 0                                             RMB0002
DFUT01        COMPUTE AA-PRQALDIA ROUNDED = (AA-QALDIA / AA-QTOTMR )    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-PRQALDIA                                     RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01*    CALCULO DE MOB60M                                            RMB0002
DFUT01     PERFORM 6500-MOB60M-USAAA.                                   RMB0002
DFUT01*    CALCULO DE MOB12                                             RMB0002
DFUT01     PERFORM 6500-MOB12-USAAA.                                    RMB0002
DFUT01*    CALCULO DE MMAXHIS                                           RMB0002
DFUT01     PERFORM 6500-MMAXHIS-USAAA.                                  RMB0002
DFUT01*    CALCULO RECMORA001                                           RMB0002
DFUT01     PERFORM 6500-RECMORA030-USAAA.                               RMB0002
DFUT01     PERFORM 6500-RECMORA060-USAAA.                               RMB0002
DFUT01     PERFORM 6500-RECMORA090-USAAA.                               RMB0002
DFUT01     PERFORM 6500-RECMORA120-USAAA.                               RMB0002
DFUT01     PERFORM 6500-RECMORACC-USAAA.                                RMB0002
DFUT01     MOVE AA-RECMORA030 TO AA-RECMORA001                          RMB0002
DFUT01     IF AA-RECMORA060 < AA-RECMORA001                             RMB0002
DFUT01        MOVE AA-RECMORA060 TO AA-RECMORA001                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF AA-RECMORA090 < AA-RECMORA001                             RMB0002
DFUT01        MOVE AA-RECMORA090 TO AA-RECMORA001                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF AA-RECMORA120 < AA-RECMORA001                             RMB0002
DFUT01        MOVE AA-RECMORA120 TO AA-RECMORA001                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF AA-RECMORACC  < AA-RECMORA001                             RMB0002
DFUT01        MOVE AA-RECMORACC  TO AA-RECMORA001                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01*    CALCULO RECMORA001VSA                                        RMB0002
DFUT01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0002
DFUT01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0002
DFUT01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0002
DFUT01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0002
DFUT01        AA-RECMORA001 > 0                                         RMB0002
DFUT01        MOVE 0 TO AA-RECMORA001VSA                                RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE AA-RECMORA001 TO AA-RECMORA001VSA                    RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01*    ELIMINAR 999 EN RECMORA                                      RMB0002
DFUT01     PERFORM 6500-ELIMIN-999-RECMORA-USAAA.                       RMB0002
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO UNICO FINANCIERO
REMARK********************************************************************
DFUT01     MOVE 02EXP006TO      TO CO02EXP006TO.                        RMB0002
DFUT01     IF 02EXP006TO(1:1) = " " MOVE 21         TO CO02EXP006TOV    RMB0002
DFUT01     ELSE                     MOVE 02EXP006TO TO CO02EXP006TOV.   RMB0002
DFUT01     MOVE CO02EXP006TOV TO AA-S9-CO02EXP006TO-DPU.                RMB0002
DFUT01     IF AA-S9-CO02EXP006TO-DPU  > 105                             RMB0002
DFUT01        MOVE 105 TO AA-S9-CO02EXP006TO-DPU                        RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE AA-PRQALDIA TO AA-S9-PRQALDIA-DPU .                     RMB0002
DFUT01     IF AA-S9-PRQALDIA-DPU  > 1                                   RMB0002
DFUT01        MOVE 1 TO AA-S9-PRQALDIA-DPU                              RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE AA-MOB60M   TO AA-S9-MOB60M-DPU.                        RMB0002
DFUT01     IF AA-S9-MOB60M-DPU     > 10                                 RMB0002
DFUT01        MOVE 10 TO AA-S9-MOB60M-DPU                               RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     MOVE 02NUM042CB      TO CO02NUM042CB.                        RMB0002
DFUT01     IF 02NUM042CB(1:1) = " " MOVE ZEROS      TO CO02NUM042CBV    RMB0002
DFUT01     ELSE                     MOVE 02NUM042CB TO CO02NUM042CBV.   RMB0002
DFUT01     MOVE CO02NUM042CBV TO AA-S9-CO02NUM042CB-DPU                 RMB0002
DFUT01     IF AA-S9-CO02NUM042CB-DPU  > 100                             RMB0002
DFUT01        MOVE 100 TO AA-S9-CO02NUM042CB-DPU                        RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE 02EXP007TO      TO CO02EXP007TO.                        RMB0002
DFUT01     IF CO02EXP007TO(6:1) = "."                                   RMB0002
DFUT01        MOVE CO02EXP007TO(1:5)  TO CO02EXP007TOV(1:5)             RMB0002
DFUT01        MOVE CO02EXP007TO(07:2) TO CO02EXP007TOV(6:2)             RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE ZEROS              TO CO02EXP007TOV                  RMB0002
DFUT01     END-IF                                                       RMB0002
DFUT01     MOVE CO02EXP007TOV TO AA-S9-CO02EXP007TO-DPU                 RMB0002
DFUT01     IF AA-S9-CO02EXP007TO-DPU  > 66.67                           RMB0002
DFUT01        MOVE 66.67 TO AA-S9-CO02EXP007TO-DPU                      RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE AA-MOB12    TO AA-S9-MOB12-DPU.                         RMB0002
DFUT01     IF AA-S9-MOB12-DPU     > 7                                   RMB0002
DFUT01        MOVE 7  TO AA-S9-MOB12-DPU                                RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01***************************************************************** RMB0002
DFUT01*    CALCULO DE DUMMYS                                            RMB0002
DFUT01***************************************************************** RMB0002
DFUT01     MOVE 00DEM003    TO CO00DEM003.                              RMB0002
DFUT01     IF 048 <= CO00DEM003                                         RMB0002
DFUT01        MOVE 1 TO AA-S9-CO00DEM003-DPUD04                         RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO00DEM003-DPUD04                         RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE 01END089RO      TO CO01END089RO.                        RMB0002
DFUT01     IF CO01END089RO(1:1) NUMERIC                                 RMB0002
DFUT01        MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)             RMB0002
DFUT01        MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)             RMB0002
DFUT01     END-IF                                                       RMB0002
DFUT01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF 59.58 <= CO01END089ROV AND CO01END089ROV < 82.17       RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01END089RO-DPUD03                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01END089RO-DPUD03                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01END089RO-DPUD03                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF CO01END089RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF 82.17 <= CO01END089ROV                                 RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01END089RO-DPUD04                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01END089RO-DPUD04                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01END089RO-DPUD04                       RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     IF AA-RECMORA001VSA < 5                                      RMB0002
DFUT01        MOVE 1 TO AA-S9-RECMORA001VSA-DPUD01                      RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-RECMORA001VSA-DPUD01                      RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE 01MOR060RO      TO CO01MOR060RO.                        RMB0002
DFUT01     IF CO01MOR060RO(1:1) NUMERIC                                 RMB0002
DFUT01        MOVE CO01MOR060RO       TO CO01MOR060ROV                  RMB0002
DFUT01     END-IF                                                       RMB0002
DFUT01     IF CO01MOR060RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF 0 <= CO01MOR060ROV AND CO01MOR060ROV < 1               RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01MOR060RO-DPUD01                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01MOR060RO-DPUD01                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01MOR060RO-DPUD01                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF CO01MOR060RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF 1 <= CO01MOR060ROV                                     RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01MOR060RO-DPUD02                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01MOR060RO-DPUD02                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01MOR060RO-DPUD02                       RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     IF 2 <= AA-MMAXHIS                                           RMB0002
DFUT01        MOVE 1 TO AA-S9-MMAXHIS-DPUD02                            RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-MMAXHIS-DPUD02                            RMB0002
DFUT01     END-IF                                                       RMB0002
*
DFUT01     MOVE 01NUM050RO      TO CO01NUM050RO.                        RMB0002
DFUT01     IF CO01NUM050RO(1:1) NUMERIC                                 RMB0002
DFUT01        MOVE CO01NUM050RO       TO CO01NUM050ROV                  RMB0002
DFUT01     END-IF                                                       RMB0002
DFUT01     IF CO01NUM050RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF 1 <= CO01NUM050ROV AND CO01NUM050ROV < 3               RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01NUM050RO-DPUD02                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01NUM050RO-DPUD02                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01NUM050RO-DPUD02                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF CO01NUM050RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF 3 <= CO01NUM050ROV                                     RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01NUM050RO-DPUD03                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01NUM050RO-DPUD03                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01NUM050RO-DPUD03                       RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE 01INQ017        TO CO01INQ017  .                        RMB0002
DFUT01     IF CO01INQ017  (1:1) NUMERIC                                 RMB0002
DFUT01        MOVE CO01INQ017         TO CO01INQ017V                    RMB0002
DFUT01     END-IF                                                       RMB0002
DFUT01     IF CO01INQ017  (1:1)  NUMERIC                                RMB0002
DFUT01        IF CO01INQ017V < 2                                        RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01INQ017-DPUD01                      RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01INQ017-DPUD01                      RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 1 TO AA-S9-CO01INQ017-DPUD01 *> VA 1 POR SER < 2     RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF CO01INQ017  (1:1)  NUMERIC                                RMB0002
DFUT01        IF 3 <= CO01INQ017V                                       RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01INQ017-DPUD03                      RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01INQ017-DPUD03                      RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01INQ017-DPUD03                         RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE 01END020RO      TO CO01END020RO.                        RMB0002
DFUT01     IF CO01END020RO(1:1) NUMERIC                                 RMB0002
DFUT01        MOVE CO01END020RO(1:8)  TO CO01END020ROV(1:8)             RMB0002
DFUT01        MOVE CO01END020RO(10:2) TO CO01END020ROV(9:2)             RMB0002
DFUT01     END-IF                                                       RMB0002
DFUT01     IF CO01END020RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF  CO01END020ROV < 0.63                                  RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01END020RO-DPUD01                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01END020RO-DPUD01                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 1 TO AA-S9-CO01END020RO-DPUD01 *> VA 1 POR SER < 0.63RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF CO01END020RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF 0.63 <= CO01END020ROV AND CO01END020ROV < 1.77         RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01END020RO-DPUD02                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01END020RO-DPUD02                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01END020RO-DPUD02                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF CO01END020RO(1:1)  NUMERIC                                RMB0002
DFUT01        IF  4.49 <= CO01END020ROV                                 RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01END020RO-DPUD04                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01END020RO-DPUD04                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01END020RO-DPUD04                       RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE 01MOR060CC      TO CO01MOR060CC.                        RMB0002
DFUT01     IF CO01MOR060CC(1:1) NUMERIC                                 RMB0002
DFUT01        MOVE CO01MOR060CC       TO CO01MOR060CCV                  RMB0002
DFUT01     END-IF                                                       RMB0002
DFUT01     IF CO01MOR060CC(1:1)  NUMERIC                                RMB0002
DFUT01        IF 0 <= CO01MOR060CCV AND CO01MOR060CCV < 1               RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01MOR060CC-DPUD01                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01MOR060CC-DPUD01                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01MOR060CC-DPUD01                       RMB0002
DFUT01     END-IF.                                                      RMB0002
DFUT01     IF CO01MOR060CC(1:1)  NUMERIC                                RMB0002
DFUT01        IF 1 <= CO01MOR060CCV                                     RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01MOR060CC-DPUD02                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01MOR060CC-DPUD02                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01MOR060CC-DPUD02                       RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     MOVE 01END017IN      TO CO01END017IN.                        RMB0002
DFUT01     IF CO01END017IN(1:1) NUMERIC                                 RMB0002
DFUT01        MOVE CO01END017IN(1:8)  TO CO01END017INV(1:8)             RMB0002
DFUT01        MOVE CO01END017IN(10:2) TO CO01END017INV(9:2)             RMB0002
DFUT01     END-IF                                                       RMB0002
DFUT01     IF CO01END017IN(1:1)  NUMERIC                                RMB0002
DFUT01        IF 0.01 <= CO01END017INV                                  RMB0002
DFUT01           MOVE 1 TO AA-S9-CO01END017IN-DPUD02                    RMB0002
DFUT01        ELSE                                                      RMB0002
DFUT01           MOVE 0 TO AA-S9-CO01END017IN-DPUD02                    RMB0002
DFUT01        END-IF                                                    RMB0002
DFUT01     ELSE                                                         RMB0002
DFUT01        MOVE 0 TO AA-S9-CO01END017IN-DPUD02                       RMB0002
DFUT01     END-IF.                                                      RMB0002
*
DFUT01     COMPUTE                                                      RMB0002
DFUT01           AA-S9-EXPONENTE = 2.49390371193464 +                   RMB0002
DFUT01          (AA-S9-CO02EXP006TO-DPU * 0.00962565053255312) +        RMB0002
DFUT01          (AA-S9-PRQALDIA-DPU * 1.01797600542744) +               RMB0002
DFUT01          (AA-S9-MOB60M-DPU * 0.0737146155290281) +               RMB0002
DFUT01          (AA-S9-CO02NUM042CB-DPU * -0.00820333727312719) +       RMB0002
DFUT01          (AA-S9-CO02EXP007TO-DPU * -0.00567824081776764) +       RMB0002
DFUT01          (AA-S9-MOB12-DPU * -0.0596035005866085) +               RMB0002
DFUT01          (AA-S9-CO00DEM003-DPUD04 * 0.0857474420683266) +        RMB0002
DFUT01          (AA-S9-CO01END089RO-DPUD03 * -0.410110970960899) +      RMB0002
DFUT01          (AA-S9-CO01END089RO-DPUD04 * -0.70056004503504) +       RMB0002
DFUT01          (AA-S9-RECMORA001VSA-DPUD01 * -0.372311661418595) +     RMB0002
DFUT01          (AA-S9-CO01MOR060RO-DPUD01 * 0.297821931378993) +       RMB0002
DFUT01          (AA-S9-CO01MOR060RO-DPUD02 * -0.351455278275151) +      RMB0002
DFUT01          (AA-S9-MMAXHIS-DPUD02 * -0.72876826897054) +            RMB0002
DFUT01          (AA-S9-CO01NUM050RO-DPUD02 * 0.22232583163106) +        RMB0002
DFUT01          (AA-S9-CO01NUM050RO-DPUD03 * 0.249236778230884) +       RMB0002
DFUT01          (AA-S9-CO01INQ017-DPUD01 * 0.131076953923632) +         RMB0002
DFUT01          (AA-S9-CO01INQ017-DPUD03 * -0.301130515733036) +        RMB0002
DFUT01          (AA-S9-CO01END020RO-DPUD01 * -0.317231902203161) +      RMB0002
DFUT01          (AA-S9-CO01END020RO-DPUD02 * -0.120742410717848) +      RMB0002
DFUT01          (AA-S9-CO01END020RO-DPUD04 * 0.161629996851654) +       RMB0002
DFUT01          (AA-S9-CO01MOR060CC-DPUD01 * 0.149784885489206) +       RMB0002
DFUT01          (AA-S9-CO01MOR060CC-DPUD02 * -0.0590958504020993) +     RMB0002
DFUT01          (AA-S9-CO01END017IN-DPUD02 * -0.462215502284069).       RMB0002
*
DFUT01    COMPUTE AA-SCOREN =                                           RMB0002
DFUT01       ( 1000 / (1 + 2.7182818284590452 ** (- AA-S9-EXPONENTE))). RMB0002
DFUT01    COMPUTE PROBABILIDAD-USAAA = AA-SCOREN.                       RMB0002
*
DFUT01    COMPUTE AA-SCOREN =                                           RMB0002
DFUT01       ( 400.0000000000 + 110.321693765613 * AA-S9-EXPONENTE).    RMB0002
DFUT01    COMPUTE SCORE-USAAA = AA-SCOREN.                              RMB0002
DFUT01    IF AA-SCOREN   <= 150 MOVE 150 TO SCORE-USAAA.                RMB0002
DFUT01    IF AA-SCOREN   >= 999 MOVE 999 TO SCORE-USAAA.                RMB0002
       6500-QALDIA-USAAA.
REMARK*******************************************************************
REMARK*6500-QALDIA-USAAA.
REMARK*    TOTAL DE PRODUSCTOS AL DIA
REMARK*******************************************************************
           IF 01MOR001RO(1:1) = " " MOVE ZEROS      TO CO01MOR001ROV
           ELSE                     MOVE 01MOR001RO TO CO01MOR001ROV.
           IF 01MOR001IN(1:1) = " " MOVE ZEROS      TO CO01MOR001INV
           ELSE                     MOVE 01MOR001IN TO CO01MOR001INV.
           IF 01MOR001OT(1:1) = " " MOVE ZEROS      TO CO01MOR001OTV
           ELSE                     MOVE 01MOR001OT TO CO01MOR001OTV.
           IF 01MOR001VE(1:1) = " " MOVE ZEROS      TO CO01MOR001VEV
           ELSE                     MOVE 01MOR001VE TO CO01MOR001VEV.
           IF 01MOR001CC(1:1) = " " MOVE ZEROS      TO CO01MOR001CCV
           ELSE                     MOVE 01MOR001CC TO CO01MOR001CCV.
           IF 01MOR001HP(1:1) = " " MOVE ZEROS      TO CO01MOR001HPV
           ELSE                     MOVE 01MOR001HP TO CO01MOR001HPV.
           COMPUTE AA-QALDIA    = CO01MOR001ROV + CO01MOR001INV +
                                  CO01MOR001VEV + CO01MOR001HPV +
                                  CO01MOR001CCV + CO01MOR001OTV .
       6500-QTOT030-USAAA.
REMARK*******************************************************************
REMARK*6500-QTOT030-USAAA.
REMARK*    TOTAL DE PRODUCTOS MOROSOS A 030
REMARK*******************************************************************
           IF 01MOR002RO(1:1) = " " MOVE ZEROS      TO CO01MOR002ROV
           ELSE                     MOVE 01MOR002RO TO CO01MOR002ROV.
           IF 01MOR002IN(1:1) = " " MOVE ZEROS      TO CO01MOR002INV
           ELSE                     MOVE 01MOR002IN TO CO01MOR002INV.
           IF 01MOR002OT(1:1) = " " MOVE ZEROS      TO CO01MOR002OTV
           ELSE                     MOVE 01MOR002OT TO CO01MOR002OTV.
           IF 01MOR002VE(1:1) = " " MOVE ZEROS      TO CO01MOR002VEV
           ELSE                     MOVE 01MOR002VE TO CO01MOR002VEV.
           IF 01MOR002CC(1:1) = " " MOVE ZEROS      TO CO01MOR002CCV
           ELSE                     MOVE 01MOR002CC TO CO01MOR002CCV.
           IF 01MOR002HP(1:1) = " " MOVE ZEROS      TO CO01MOR002HPV
           ELSE                     MOVE 01MOR002HP TO CO01MOR002HPV.
           COMPUTE AA-QTOT030   = CO01MOR002ROV + CO01MOR002INV +
                                  CO01MOR002VEV + CO01MOR002HPV +
                                  CO01MOR002CCV + CO01MOR002OTV .
       6500-QTOT060-USAAA.
REMARK*******************************************************************
REMARK*6500-QTOT060-USAAA.
REMARK*    TOTAL DE PRODUCTOS MOROSOS A 060
REMARK*******************************************************************
           IF 01MOR003RO(1:1) = " " MOVE ZEROS      TO CO01MOR003ROV
           ELSE                     MOVE 01MOR003RO TO CO01MOR003ROV.
           IF 01MOR003IN(1:1) = " " MOVE ZEROS      TO CO01MOR003INV
           ELSE                     MOVE 01MOR003IN TO CO01MOR003INV.
           IF 01MOR003OT(1:1) = " " MOVE ZEROS      TO CO01MOR003OTV
           ELSE                     MOVE 01MOR003OT TO CO01MOR003OTV.
           IF 01MOR003VE(1:1) = " " MOVE ZEROS      TO CO01MOR003VEV
           ELSE                     MOVE 01MOR003VE TO CO01MOR003VEV.
           IF 01MOR003CC(1:1) = " " MOVE ZEROS      TO CO01MOR003CCV
           ELSE                     MOVE 01MOR003CC TO CO01MOR003CCV.
           IF 01MOR003HP(1:1) = " " MOVE ZEROS      TO CO01MOR003HPV
           ELSE                     MOVE 01MOR003HP TO CO01MOR003HPV.
           COMPUTE AA-QTOT060   = CO01MOR003ROV + CO01MOR003INV +
                                  CO01MOR003VEV + CO01MOR003HPV +
                                  CO01MOR003CCV + CO01MOR003OTV .
       6500-QTOT090-USAAA.
REMARK*******************************************************************
REMARK*6500-QTOT090-USAAA.
REMARK*    TOTAL DE PRODUCTOS MOROSOS A 090
REMARK*******************************************************************
           IF 01MOR004RO(1:1) = " " MOVE ZEROS      TO CO01MOR004ROV
           ELSE                     MOVE 01MOR004RO TO CO01MOR004ROV.
           IF 01MOR004IN(1:1) = " " MOVE ZEROS      TO CO01MOR004INV
           ELSE                     MOVE 01MOR004IN TO CO01MOR004INV.
           IF 01MOR004OT(1:1) = " " MOVE ZEROS      TO CO01MOR004OTV
           ELSE                     MOVE 01MOR004OT TO CO01MOR004OTV.
           IF 01MOR004VE(1:1) = " " MOVE ZEROS      TO CO01MOR004VEV
           ELSE                     MOVE 01MOR004VE TO CO01MOR004VEV.
           IF 01MOR004CC(1:1) = " " MOVE ZEROS      TO CO01MOR004CCV
           ELSE                     MOVE 01MOR004CC TO CO01MOR004CCV.
           IF 01MOR004HP(1:1) = " " MOVE ZEROS      TO CO01MOR004HPV
           ELSE                     MOVE 01MOR004HP TO CO01MOR004HPV.
           COMPUTE AA-QTOT090   = CO01MOR004ROV + CO01MOR004INV +
                                  CO01MOR004VEV + CO01MOR004HPV +
                                  CO01MOR004CCV + CO01MOR004OTV .
       6500-QTOT120-USAAA.
REMARK*******************************************************************
REMARK*6500-QTOT120-USAAA.
REMARK*    TOTAL DE PRODUCTOS MOROSOS A 120
REMARK*******************************************************************
           IF 01MOR005RO(1:1) = " " MOVE ZEROS      TO CO01MOR005ROV
           ELSE                     MOVE 01MOR005RO TO CO01MOR005ROV.
           IF 01MOR005IN(1:1) = " " MOVE ZEROS      TO CO01MOR005INV
           ELSE                     MOVE 01MOR005IN TO CO01MOR005INV.
           IF 01MOR005OT(1:1) = " " MOVE ZEROS      TO CO01MOR005OTV
           ELSE                     MOVE 01MOR005OT TO CO01MOR005OTV.
           IF 01MOR005VE(1:1) = " " MOVE ZEROS      TO CO01MOR005VEV
           ELSE                     MOVE 01MOR005VE TO CO01MOR005VEV.
           IF 01MOR005CC(1:1) = " " MOVE ZEROS      TO CO01MOR005CCV
           ELSE                     MOVE 01MOR005CC TO CO01MOR005CCV.
           IF 01MOR005HP(1:1) = " " MOVE ZEROS      TO CO01MOR005HPV
           ELSE                     MOVE 01MOR005HP TO CO01MOR005HPV.
           COMPUTE AA-QTOT120   = CO01MOR005ROV + CO01MOR005INV +
                                  CO01MOR005VEV + CO01MOR005HPV +
                                  CO01MOR005CCV + CO01MOR005OTV .
       6500-QTOTCC-USAAA.
REMARK*******************************************************************
REMARK*6500-QTOTCC-USAAA.
REMARK*    TOTAL DE PRODUCTOS CASTIGADOS     
REMARK*******************************************************************
           IF 01MOR006RO(1:1) = " " MOVE ZEROS      TO CO01MOR006ROV
           ELSE                     MOVE 01MOR006RO TO CO01MOR006ROV.
           IF 01MOR006IN(1:1) = " " MOVE ZEROS      TO CO01MOR006INV
           ELSE                     MOVE 01MOR006IN TO CO01MOR006INV.
           IF 01MOR006OT(1:1) = " " MOVE ZEROS      TO CO01MOR006OTV
           ELSE                     MOVE 01MOR006OT TO CO01MOR006OTV.
           IF 01MOR006VE(1:1) = " " MOVE ZEROS      TO CO01MOR006VEV
           ELSE                     MOVE 01MOR006VE TO CO01MOR006VEV.
           IF 01MOR006CC(1:1) = " " MOVE ZEROS      TO CO01MOR006CCV
           ELSE                     MOVE 01MOR006CC TO CO01MOR006CCV.
           IF 01MOR006HP(1:1) = " " MOVE ZEROS      TO CO01MOR006HPV
           ELSE                     MOVE 01MOR006HP TO CO01MOR006HPV.
           COMPUTE AA-QTOTCC    = CO01MOR006ROV + CO01MOR006INV +
                                  CO01MOR006VEV + CO01MOR006HPV +
                                  CO01MOR006CCV + CO01MOR006OTV .
       6500-QTOTCR-USAAA.
REMARK*******************************************************************
REMARK*6500-QTOTCR-USAAA.
REMARK*    TOTAL DE PRODUCTOS RECUPERADA     
REMARK*******************************************************************
           IF 01MOR007RO(1:1) = " " MOVE ZEROS      TO CO01MOR007ROV
           ELSE                     MOVE 01MOR007RO TO CO01MOR007ROV.
           IF 01MOR007IN(1:1) = " " MOVE ZEROS      TO CO01MOR007INV
           ELSE                     MOVE 01MOR007IN TO CO01MOR007INV.
           IF 01MOR007OT(1:1) = " " MOVE ZEROS      TO CO01MOR007OTV
           ELSE                     MOVE 01MOR007OT TO CO01MOR007OTV.
           IF 01MOR007VE(1:1) = " " MOVE ZEROS      TO CO01MOR007VEV
           ELSE                     MOVE 01MOR007VE TO CO01MOR007VEV.
           IF 01MOR007CC(1:1) = " " MOVE ZEROS      TO CO01MOR007CCV
           ELSE                     MOVE 01MOR007CC TO CO01MOR007CCV.
           IF 01MOR007HP(1:1) = " " MOVE ZEROS      TO CO01MOR007HPV
           ELSE                     MOVE 01MOR007HP TO CO01MOR007HPV.
           COMPUTE AA-QTOTCR    = CO01MOR007ROV + CO01MOR007INV +
                                  CO01MOR007VEV + CO01MOR007HPV +
                                  CO01MOR007CCV + CO01MOR007OTV .
       6500-SECTORES-USAAA.
REMARK*******************************************************************
REMARK*6500-SECTORES-USAAAA.
REMARK*    RELACIONAMIENTO CON SECTORES 
REMARK*******************************************************************
           MOVE 01NUM001RO  TO CO01NUM001RO.
           MOVE 01NUM001IN  TO CO01NUM001IN.
           MOVE 01NUM001VE  TO CO01NUM001VE.
           MOVE 01NUM001HP  TO CO01NUM001HP.
           MOVE 01NUM001OT  TO CO01NUM001OT.
           MOVE 01NUM001CC  TO CO01NUM001CC.
           IF CO01NUM001RO > 0000  OR CO01NUM001IN > 0000     OR 
              CO01NUM001VE > 0000  OR CO01NUM001HP > 0000     OR
              CO01NUM001OT > 0000                              
              MOVE 1 TO AA-FINANCIERO                         
           ELSE                                              
              MOVE 0 TO AA-FINANCIERO                       
           END-IF.                                         
           IF CO01NUM001OT > 0000                         
              MOVE 1 TO AA-REAL                          
           ELSE                                         
              MOVE 0 TO AA-REAL                        
           END-IF.                                    
           IF CO01NUM001CC > 0000                    
              MOVE 1 TO AA-TELCOS                   
           ELSE                                    
              MOVE 0 TO AA-TELCOS                 
           END-IF.                               
           MOVE SPACES TO AA-TIPOREL                               
           IF AA-FINANCIERO = 1 AND AA-REAL = 0 AND AA-TELCOS = 0    
              MOVE "F" TO AA-TIPOREL                     
           END-IF.                                       
           IF AA-FINANCIERO = 1 AND AA-REAL = 1 AND AA-TELCOS = 0
              MOVE "F-R" TO AA-TIPOREL                 
           END-IF.                                    
           IF AA-FINANCIERO = 1 AND AA-REAL = 1 AND AA-TELCOS = 1
              MOVE "F-R-T" TO AA-TIPOREL                        
           END-IF.                                             
           IF AA-FINANCIERO = 1 AND AA-REAL = 0 AND AA-TELCOS = 1 
              MOVE "F-T" TO AA-TIPOREL                           
           END-IF.                                              
           IF AA-TIPOREL = "F"                                 
              MOVE 1 TO AA-TIPORELD01                         
           ELSE                                              
              MOVE 0 TO AA-TIPORELD01                       
           END-IF.                                         
           IF AA-TIPOREL = "F-R"                          
              MOVE 1 TO AA-TIPORELD02                    
           ELSE                                         
              MOVE 0 TO AA-TIPORELD02                  
           END-IF.                                    
           IF AA-TIPOREL = "F-R-T"                   
              MOVE 1 TO AA-TIPORELD03               
           ELSE                                    
              MOVE 0 TO AA-TIPORELD03             
           END-IF.                               
           IF AA-TIPOREL = "F-T"                
              MOVE 1 TO AA-TIPORELD04          
           ELSE                               
              MOVE 0 TO AA-TIPORELD04        
           END-IF.                          
       6500-MMAXHIS-USAAA.
REMARK*******************************************************************
REMARK*6500-MMAXHIS-USAAA.      
REMARK*    MORA MAXIMA HISTORICA
REMARK*******************************************************************
           IF 01MOR009RO(1:1) = " " MOVE ZEROS      TO CO01MOR009ROV
           ELSE                     MOVE 01MOR009RO TO CO01MOR009ROV.
           IF 01MOR009IN(1:1) = " " MOVE ZEROS      TO CO01MOR009INV
           ELSE                     MOVE 01MOR009IN TO CO01MOR009INV.
           IF 01MOR009OT(1:1) = " " MOVE ZEROS      TO CO01MOR009OTV
           ELSE                     MOVE 01MOR009OT TO CO01MOR009OTV.
           IF 01MOR009VE(1:1) = " " MOVE ZEROS      TO CO01MOR009VEV
           ELSE                     MOVE 01MOR009VE TO CO01MOR009VEV.
           IF 01MOR009CC(1:1) = " " MOVE ZEROS      TO CO01MOR009CCV
           ELSE                     MOVE 01MOR009CC TO CO01MOR009CCV.
           IF 01MOR009HP(1:1) = " " MOVE ZEROS      TO CO01MOR009HPV
           ELSE                     MOVE 01MOR009HP TO CO01MOR009HPV.
           MOVE CO01MOR009ROV TO AA-MMAXHIS
           IF CO01MOR009INV > AA-MMAXHIS
              MOVE CO01MOR009INV TO AA-MMAXHIS
           END-IF.
           IF CO01MOR009OTV > AA-MMAXHIS
              MOVE CO01MOR009OTV TO AA-MMAXHIS
           END-IF.
           IF CO01MOR009VEV > AA-MMAXHIS
              MOVE CO01MOR009VEV TO AA-MMAXHIS
           END-IF.
           IF CO01MOR009CCV > AA-MMAXHIS
              MOVE CO01MOR009CCV TO AA-MMAXHIS
           END-IF.
           IF CO01MOR009HPV > AA-MMAXHIS
              MOVE CO01MOR009HPV TO AA-MMAXHIS
           END-IF.
       6500-RECMORA030-USAAA.
REMARK*******************************************************************
REMARK*6500-RECMORA030-USAAA.   
REMARK*    MESES DE LA MORA DE 30 MAS RECIENTE
REMARK*******************************************************************
           MOVE 01MOR075RO  TO CO01MOR075RO.
           MOVE 01MOR075IN  TO CO01MOR075IN.
           MOVE 01MOR075OT  TO CO01MOR075OT.
           MOVE 01MOR075VE  TO CO01MOR075VE.
           MOVE 01MOR075CC  TO CO01MOR075CC.
           MOVE 01MOR075HP  TO CO01MOR075HP.
           IF CO01MOR075RO NUMERIC
              MOVE CO01MOR075RO TO CO01MOR075ROV
           ELSE
              MOVE 999          TO CO01MOR075ROV
           END-IF.
           IF CO01MOR075IN NUMERIC
              MOVE CO01MOR075IN TO CO01MOR075INV
           ELSE
              MOVE 999          TO CO01MOR075INV
           END-IF.
           IF CO01MOR075OT NUMERIC
              MOVE CO01MOR075OT TO CO01MOR075OTV
           ELSE
              MOVE 999          TO CO01MOR075OTV
           END-IF.
           IF CO01MOR075VE NUMERIC
              MOVE CO01MOR075VE TO CO01MOR075VEV
           ELSE
              MOVE 999          TO CO01MOR075VEV
           END-IF.
           IF CO01MOR075CC NUMERIC
              MOVE CO01MOR075CC TO CO01MOR075CCV
           ELSE
              MOVE 999          TO CO01MOR075CCV
           END-IF.
           IF CO01MOR075HP NUMERIC
              MOVE CO01MOR075HP TO CO01MOR075HPV
           ELSE
              MOVE 999          TO CO01MOR075HPV
           END-IF.
      *
           MOVE CO01MOR075ROV TO AA-RECMORA030
           IF CO01MOR075INV < AA-RECMORA030
              MOVE CO01MOR075INV TO AA-RECMORA030
           END-IF.
           IF CO01MOR075OTV < AA-RECMORA030
              MOVE CO01MOR075OTV TO AA-RECMORA030
           END-IF.
           IF CO01MOR075VEV < AA-RECMORA030
              MOVE CO01MOR075VEV TO AA-RECMORA030
           END-IF.
           IF CO01MOR075CCV < AA-RECMORA030
              MOVE CO01MOR075CCV TO AA-RECMORA030
           END-IF.
           IF CO01MOR075HPV < AA-RECMORA030
              MOVE CO01MOR075HPV TO AA-RECMORA030
           END-IF.
       6500-RECMORA060-USAAA.
REMARK*******************************************************************
REMARK*6500-RECMORA060-USAAA.   
REMARK*    MESES DE LA MORA DE 60 MAS RECIENTE
REMARK*******************************************************************
           MOVE 01MOR076RO  TO CO01MOR076RO.
           MOVE 01MOR076IN  TO CO01MOR076IN.
           MOVE 01MOR076OT  TO CO01MOR076OT.
           MOVE 01MOR076VE  TO CO01MOR076VE.
           MOVE 01MOR076CC  TO CO01MOR076CC.
           MOVE 01MOR076HP  TO CO01MOR076HP.
           IF CO01MOR076RO NUMERIC
              MOVE CO01MOR076RO TO CO01MOR076ROV
           ELSE
              MOVE 999          TO CO01MOR076ROV
           END-IF.
           IF CO01MOR076IN NUMERIC
              MOVE CO01MOR076IN TO CO01MOR076INV
           ELSE
              MOVE 999          TO CO01MOR076INV
           END-IF.
           IF CO01MOR076OT NUMERIC
              MOVE CO01MOR076OT TO CO01MOR076OTV
           ELSE
              MOVE 999          TO CO01MOR076OTV
           END-IF.
           IF CO01MOR076VE NUMERIC
              MOVE CO01MOR076VE TO CO01MOR076VEV
           ELSE
              MOVE 999          TO CO01MOR076VEV
           END-IF.
           IF CO01MOR076CC NUMERIC
              MOVE CO01MOR076CC TO CO01MOR076CCV
           ELSE
              MOVE 999          TO CO01MOR076CCV
           END-IF.
           IF CO01MOR076HP NUMERIC
              MOVE CO01MOR076HP TO CO01MOR076HPV
           ELSE
              MOVE 999          TO CO01MOR076HPV
           END-IF.
      *
           MOVE CO01MOR076ROV TO AA-RECMORA060
           IF CO01MOR076INV < AA-RECMORA060
              MOVE CO01MOR076INV TO AA-RECMORA060
           END-IF.
           IF CO01MOR076OTV < AA-RECMORA060
              MOVE CO01MOR076OTV TO AA-RECMORA060
           END-IF.
           IF CO01MOR076VEV < AA-RECMORA060
              MOVE CO01MOR076VEV TO AA-RECMORA060
           END-IF.
           IF CO01MOR076CCV < AA-RECMORA060
              MOVE CO01MOR076CCV TO AA-RECMORA060
           END-IF.
           IF CO01MOR076HPV < AA-RECMORA060
              MOVE CO01MOR076HPV TO AA-RECMORA060
           END-IF.
       6500-RECMORA090-USAAA.
REMARK*******************************************************************
REMARK*6500-RECMORA090-USAAA.   
REMARK*    MESES DE LA MORA DE 90 MAS RECIENTE
REMARK*******************************************************************
           MOVE 01MOR077RO  TO CO01MOR077RO.
           MOVE 01MOR077IN  TO CO01MOR077IN.
           MOVE 01MOR077OT  TO CO01MOR077OT.
           MOVE 01MOR077VE  TO CO01MOR077VE.
           MOVE 01MOR077CC  TO CO01MOR077CC.
           MOVE 01MOR077HP  TO CO01MOR077HP.
           IF CO01MOR077RO NUMERIC
              MOVE CO01MOR077RO TO CO01MOR077ROV
           ELSE
              MOVE 999          TO CO01MOR077ROV
           END-IF.
           IF CO01MOR077IN NUMERIC
              MOVE CO01MOR077IN TO CO01MOR077INV
           ELSE
              MOVE 999          TO CO01MOR077INV
           END-IF.
           IF CO01MOR077OT NUMERIC
              MOVE CO01MOR077OT TO CO01MOR077OTV
           ELSE
              MOVE 999          TO CO01MOR077OTV
           END-IF.
           IF CO01MOR077VE NUMERIC
              MOVE CO01MOR077VE TO CO01MOR077VEV
           ELSE
              MOVE 999          TO CO01MOR077VEV
           END-IF.
           IF CO01MOR077CC NUMERIC
              MOVE CO01MOR077CC TO CO01MOR077CCV
           ELSE
              MOVE 999          TO CO01MOR077CCV
           END-IF.
           IF CO01MOR077HP NUMERIC
              MOVE CO01MOR077HP TO CO01MOR077HPV
           ELSE
              MOVE 999          TO CO01MOR077HPV
           END-IF.
      *
           MOVE CO01MOR077ROV TO AA-RECMORA090
           IF CO01MOR077INV < AA-RECMORA090
              MOVE CO01MOR077INV TO AA-RECMORA090
           END-IF.
           IF CO01MOR077OTV < AA-RECMORA090
              MOVE CO01MOR077OTV TO AA-RECMORA090
           END-IF.
           IF CO01MOR077VEV < AA-RECMORA090
              MOVE CO01MOR077VEV TO AA-RECMORA090
           END-IF.
           IF CO01MOR077CCV < AA-RECMORA090
              MOVE CO01MOR077CCV TO AA-RECMORA090
           END-IF.
           IF CO01MOR077HPV < AA-RECMORA090
              MOVE CO01MOR077HPV TO AA-RECMORA090
           END-IF.
       6500-RECMORA120-USAAA.
REMARK*******************************************************************
REMARK*6500-RECMORA120-USAAA.   
REMARK*    MESES DE LA MORA DE 120 MAS RECIENTE
REMARK*******************************************************************
           MOVE 01MOR078RO  TO CO01MOR078RO.
           MOVE 01MOR078IN  TO CO01MOR078IN.
           MOVE 01MOR078OT  TO CO01MOR078OT.
           MOVE 01MOR078VE  TO CO01MOR078VE.
           MOVE 01MOR078CC  TO CO01MOR078CC.
           MOVE 01MOR078HP  TO CO01MOR078HP.
           IF CO01MOR078RO NUMERIC
              MOVE CO01MOR078RO TO CO01MOR078ROV
           ELSE
              MOVE 999          TO CO01MOR078ROV
           END-IF.
           IF CO01MOR078IN NUMERIC
              MOVE CO01MOR078IN TO CO01MOR078INV
           ELSE
              MOVE 999          TO CO01MOR078INV
           END-IF.
           IF CO01MOR078OT NUMERIC
              MOVE CO01MOR078OT TO CO01MOR078OTV
           ELSE
              MOVE 999          TO CO01MOR078OTV
           END-IF.
           IF CO01MOR078VE NUMERIC
              MOVE CO01MOR078VE TO CO01MOR078VEV
           ELSE
              MOVE 999          TO CO01MOR078VEV
           END-IF.
           IF CO01MOR078CC NUMERIC
              MOVE CO01MOR078CC TO CO01MOR078CCV
           ELSE
              MOVE 999          TO CO01MOR078CCV
           END-IF.
           IF CO01MOR078HP NUMERIC
              MOVE CO01MOR078HP TO CO01MOR078HPV
           ELSE
              MOVE 999          TO CO01MOR078HPV
           END-IF.
      *
           MOVE CO01MOR078ROV TO AA-RECMORA120
           IF CO01MOR078INV < AA-RECMORA120
              MOVE CO01MOR078INV TO AA-RECMORA120
           END-IF.
           IF CO01MOR078OTV < AA-RECMORA120
              MOVE CO01MOR078OTV TO AA-RECMORA120
           END-IF.
           IF CO01MOR078VEV < AA-RECMORA120
              MOVE CO01MOR078VEV TO AA-RECMORA120
           END-IF.
           IF CO01MOR078CCV < AA-RECMORA120
              MOVE CO01MOR078CCV TO AA-RECMORA120
           END-IF.
           IF CO01MOR078HPV < AA-RECMORA120
              MOVE CO01MOR078HPV TO AA-RECMORA120
           END-IF.
       6500-RECMORACC-USAAA.   
REMARK**********************************************************************
REMARK*6500-RECMORACC-USAAA.
REAMRK*    CALCULO DEL ESTADO DE MORAS CRITICOS
REMARK**********************************************************************
           MOVE 01MOR079RO  TO CO01MOR079RO.
           MOVE 01MOR079IN  TO CO01MOR079IN.
           MOVE 01MOR079OT  TO CO01MOR079OT.
           MOVE 01MOR079VE  TO CO01MOR079VE.
           MOVE 01MOR079CC  TO CO01MOR079CC.
           MOVE 01MOR079HP  TO CO01MOR079HP.
           IF CO01MOR079RO NUMERIC
              MOVE CO01MOR079RO TO CO01MOR079ROV
           ELSE
              MOVE 999          TO CO01MOR079ROV
           END-IF.
           IF CO01MOR079IN NUMERIC
              MOVE CO01MOR079IN TO CO01MOR079INV
           ELSE
              MOVE 999          TO CO01MOR079INV
           END-IF.
           IF CO01MOR079OT NUMERIC
              MOVE CO01MOR079OT TO CO01MOR079OTV
           ELSE
              MOVE 999          TO CO01MOR079OTV
           END-IF.
           IF CO01MOR079VE NUMERIC
              MOVE CO01MOR079VE TO CO01MOR079VEV
           ELSE
              MOVE 999          TO CO01MOR079VEV
           END-IF.
           IF CO01MOR079CC NUMERIC
              MOVE CO01MOR079CC TO CO01MOR079CCV
           ELSE
              MOVE 999          TO CO01MOR079CCV
           END-IF.
           IF CO01MOR079HP NUMERIC
              MOVE CO01MOR079HP TO CO01MOR079HPV
           ELSE
              MOVE 999          TO CO01MOR079HPV
           END-IF.
      *
           MOVE CO01MOR079ROV TO AA-RECMORACC.
           IF CO01MOR079INV < AA-RECMORACC
              MOVE CO01MOR079INV TO AA-RECMORACC
           END-IF.
           IF CO01MOR079OTV < AA-RECMORACC
              MOVE CO01MOR079OTV TO AA-RECMORACC
           END-IF.
           IF CO01MOR079VEV < AA-RECMORACC
              MOVE CO01MOR079VEV TO AA-RECMORACC
           END-IF.
           IF CO01MOR079CCV < AA-RECMORACC
              MOVE CO01MOR079CCV TO AA-RECMORACC
           END-IF.
           IF CO01MOR079HPV < AA-RECMORACC
              MOVE CO01MOR079HPV TO AA-RECMORACC
           END-IF.
       6500-ELIMIN-999-RECMORA-USAAA.
REMARK*******************************************************************
REMARK*6500-ELIMIN-999-RECMORA-USAAA.
REMARK*    ELIMINACION DE FALSOS 999             
REMARK*******************************************************************
           IF AA-RECMORACC  = 999 MOVE -1 TO AA-RECMORACC .
           IF AA-RECMORA120 = 999 MOVE -1 TO AA-RECMORA120.
           IF AA-RECMORA090 = 999 MOVE -1 TO AA-RECMORA090.
           IF AA-RECMORA060 = 999 MOVE -1 TO AA-RECMORA060.
           IF AA-RECMORA030 = 999 MOVE -1 TO AA-RECMORA030.
           IF AA-RECMORA001VSA = 999 MOVE -1 TO AA-RECMORA001VSA.
           IF AA-RECMORA001 = 999 MOVE -1 TO AA-RECMORA001.
       6500-EVER03006P-USAAA.
REMARK*******************************************************************
REMARK*6500-EVER03006P-USAAA.
REMARK*    NUMERO DE MORAS 030 EN LOS ULTIMOS 6 MESES
REMARK*******************************************************************
           IF 01MOR034RO(1:1) = " " MOVE ZEROS      TO CO01MOR034ROV
           ELSE                     MOVE 01MOR034RO TO CO01MOR034ROV.
           IF 01MOR034IN(1:1) = " " MOVE ZEROS      TO CO01MOR034INV
           ELSE                     MOVE 01MOR034IN TO CO01MOR034INV.
           IF 01MOR034OT(1:1) = " " MOVE ZEROS      TO CO01MOR034OTV
           ELSE                     MOVE 01MOR034OT TO CO01MOR034OTV.
           IF 01MOR034VE(1:1) = " " MOVE ZEROS      TO CO01MOR034VEV
           ELSE                     MOVE 01MOR034VE TO CO01MOR034VEV.
           IF 01MOR034CC(1:1) = " " MOVE ZEROS      TO CO01MOR034CCV
           ELSE                     MOVE 01MOR034CC TO CO01MOR034CCV.
           IF 01MOR034HP(1:1) = " " MOVE ZEROS      TO CO01MOR034HPV
           ELSE                     MOVE 01MOR034HP TO CO01MOR034HPV.
           COMPUTE AA-EVER03006P = CO01MOR034ROV + CO01MOR034INV +
                                   CO01MOR034VEV + CO01MOR034HPV +
                                   CO01MOR034CCV + CO01MOR034OTV .
       6500-EXPOSICION-USAAA.
REMARK*******************************************************************
REMARK*6500-EXPOSICION-USAAA.
REMARK*    CALCULO DE LA EXPOSICION                         
REMARK*******************************************************************
           MOVE 01END007RO      TO CO01END007RO.
           IF CO01END007RO(1:1) NUMERIC
              MOVE CO01END007RO(1:8)  TO CO01END007ROV(1:8)
              MOVE CO01END007RO(10:2) TO CO01END007ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END007ROV
           END-IF.
           MOVE 01END001IN      TO CO01END001IN.
           IF CO01END001IN(1:1) NUMERIC
              MOVE CO01END001IN(1:8)  TO CO01END001INV(1:8)
              MOVE CO01END001IN(10:2) TO CO01END001INV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END001INV
           END-IF.
           MOVE 01END001VE      TO CO01END001VE.
           IF CO01END001VE(1:1) NUMERIC
              MOVE CO01END001VE(1:8)  TO CO01END001VEV(1:8)
              MOVE CO01END001VE(10:2) TO CO01END001VEV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END001VEV
           END-IF.
           MOVE 01END001HP      TO CO01END001HP.
           IF CO01END001HP(1:1) NUMERIC
              MOVE CO01END001HP(1:8)  TO CO01END001HPV(1:8)
              MOVE CO01END001HP(10:2) TO CO01END001HPV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END001HPV
           END-IF.
           MOVE 01END001OT      TO CO01END001OT.
           IF CO01END001OT(1:1) NUMERIC
              MOVE CO01END001OT(1:8)  TO CO01END001OTV(1:8)
              MOVE CO01END001OT(10:2) TO CO01END001OTV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END001OTV
           END-IF.
           IF CO01END007RO(1:1) NUMERIC OR
              CO01END001IN(1:1) NUMERIC OR
              CO01END001VE(1:1) NUMERIC OR
              CO01END001HP(1:1) NUMERIC OR
              CO01END001OT(1:1) NUMERIC     
              COMPUTE AA-EXPOSICION = CO01END007ROV + CO01END001INV +
                                      CO01END001VEV + CO01END001HPV +
                                      CO01END001OTV 
           ELSE
              MOVE -1 TO  AA-EXPOSICION 
           END-IF.
           IF AA-EXPOSICION > 0
              COMPUTE AA-PREEXPOSICIONRO ROUNDED = 
                     (CO01END007ROV / AA-EXPOSICION )
           ELSE
              MOVE 0 TO AA-PREEXPOSICIONRO
           END-IF.
           IF AA-EXPOSICION > 0
              COMPUTE AA-PREEXPOSICIONIN ROUNDED = 
                     (CO01END001INV / AA-EXPOSICION )
           ELSE
              MOVE 0 TO AA-PREEXPOSICIONIN
           END-IF.
           IF AA-EXPOSICION > 0
              COMPUTE AA-PREEXPOSICIONVE ROUNDED = 
                     (CO01END001VEV / AA-EXPOSICION )
           ELSE
              MOVE 0 TO AA-PREEXPOSICIONVE
           END-IF.
           IF AA-EXPOSICION > 0
              COMPUTE AA-PREEXPOSICIONHP ROUNDED = 
                     (CO01END001HPV / AA-EXPOSICION )
           ELSE
              MOVE 0 TO AA-PREEXPOSICIONHP
           END-IF.
           IF AA-EXPOSICION > 0
              COMPUTE AA-PREEXPOSICIONOT ROUNDED = 
                     (CO01END001OTV / AA-EXPOSICION )
           ELSE
              MOVE 0 TO AA-PREEXPOSICIONOT
           END-IF.
       6500-MMAX24-USAAA.
REMARK*******************************************************************
REMARK*6500-MMAX24-USAAA.
REMARK*    CALCULO DE LA MORA MAXIMA EN LOS ULTIMOS 24 MESES
REMARK*******************************************************************
      *    MORA MAXIMA EN LOS ULTIMOS 24 MESES
           IF 01MOR060RO(1:1) = " " MOVE ZEROS      TO CO01MOR060ROV
           ELSE                     MOVE 01MOR060RO TO CO01MOR060ROV.
           IF 01MOR060IN(1:1) = " " MOVE ZEROS      TO CO01MOR060INV
           ELSE                     MOVE 01MOR060IN TO CO01MOR060INV.
           IF 01MOR060OT(1:1) = " " MOVE ZEROS      TO CO01MOR060OTV
           ELSE                     MOVE 01MOR060OT TO CO01MOR060OTV.
           IF 01MOR060VE(1:1) = " " MOVE ZEROS      TO CO01MOR060VEV
           ELSE                     MOVE 01MOR060VE TO CO01MOR060VEV.
           IF 01MOR060CC(1:1) = " " MOVE ZEROS      TO CO01MOR060CCV
           ELSE                     MOVE 01MOR060CC TO CO01MOR060CCV.
           IF 01MOR060HP(1:1) = " " MOVE ZEROS      TO CO01MOR060HPV
           ELSE                     MOVE 01MOR060HP TO CO01MOR060HPV.
           MOVE CO01MOR060ROV TO AA-MMAX24 
           IF CO01MOR060INV > AA-MMAX24 
              MOVE CO01MOR060INV TO AA-MMAX24 
           END-IF.
           IF CO01MOR060OTV > AA-MMAX24 
              MOVE CO01MOR060OTV TO AA-MMAX24 
           END-IF.
           IF CO01MOR060VEV > AA-MMAX24 
              MOVE CO01MOR060VEV TO AA-MMAX24 
           END-IF.
           IF CO01MOR060CCV > AA-MMAX24 
              MOVE CO01MOR060CCV TO AA-MMAX24 
           END-IF.
           IF CO01MOR060HPV > AA-MMAX24 
              MOVE CO01MOR060HPV TO AA-MMAX24 
           END-IF.
DCPE01 6500-MMAX48-USAAA.                                               RMB0003
REMARK*******************************************************************
REMARK*6500-MMAX48-USAAA.
REMARK*    CALCULO DE LA MORA MAXIMA EN LOS ULTIMOS 48 MESES
REMARK*******************************************************************
DCPE01*    MORA MAXIMA EN LOS ULTIMOS 48 MESES                          RMB0003
DCPE01     IF 01MOR074RO(1:1) = " " MOVE ZEROS      TO CO01MOR074ROV    RMB0003
DCPE01     ELSE                     MOVE 01MOR074RO TO CO01MOR074ROV.   RMB0003
DCPE01     IF 01MOR074IN(1:1) = " " MOVE ZEROS      TO CO01MOR074INV    RMB0003
DCPE01     ELSE                     MOVE 01MOR074IN TO CO01MOR074INV.   RMB0003
DCPE01     IF 01MOR074OT(1:1) = " " MOVE ZEROS      TO CO01MOR074OTV    RMB0003
DCPE01     ELSE                     MOVE 01MOR074OT TO CO01MOR074OTV.   RMB0003
DCPE01     IF 01MOR074VE(1:1) = " " MOVE ZEROS      TO CO01MOR074VEV    RMB0003
DCPE01     ELSE                     MOVE 01MOR074VE TO CO01MOR074VEV.   RMB0003
DCPE01     IF 01MOR074CC(1:1) = " " MOVE ZEROS      TO CO01MOR074CCV    RMB0003
DCPE01     ELSE                     MOVE 01MOR074CC TO CO01MOR074CCV.   RMB0003
DCPE01     IF 01MOR074HP(1:1) = " " MOVE ZEROS      TO CO01MOR074HPV    RMB0003
DCPE01     ELSE                     MOVE 01MOR074HP TO CO01MOR074HPV.   RMB0003
DCPE01     MOVE CO01MOR074ROV TO AA-MMAX48                              RMB0003
DCPE01     IF CO01MOR074INV > AA-MMAX48                                 RMB0003
DCPE01        MOVE CO01MOR074INV TO AA-MMAX48                           RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF CO01MOR074OTV > AA-MMAX48                                 RMB0003
DCPE01        MOVE CO01MOR074OTV TO AA-MMAX48                           RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF CO01MOR074VEV > AA-MMAX48                                 RMB0003
DCPE01        MOVE CO01MOR074VEV TO AA-MMAX48                           RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF CO01MOR074CCV > AA-MMAX48                                 RMB0003
DCPE01        MOVE CO01MOR074CCV TO AA-MMAX48                           RMB0003
DCPE01     END-IF.                                                      RMB0003
DCPE01     IF CO01MOR074HPV > AA-MMAX48                                 RMB0003
DCPE01        MOVE CO01MOR074HPV TO AA-MMAX48                           RMB0003
DCPE01     END-IF.                                                      RMB0003
DFUT01 6500-MOB12-USAAA.                                                RMB0002
REMARK*******************************************************************
REMARK*6500-MOB12-USAAA.
REMARK*    NUMERO DE PRODUCTOS CON HASTA 12 MESES EN LIBROS
REMARK*******************************************************************
DFUT01     IF 01EXP008RO(1:1) = " " MOVE ZEROS      TO CO01EXP008ROV    RMB0002
DFUT01     ELSE                     MOVE 01EXP008RO TO CO01EXP008ROV.   RMB0002
DFUT01     IF 01EXP008IN(1:1) = " " MOVE ZEROS      TO CO01EXP008INV    RMB0002
DFUT01     ELSE                     MOVE 01EXP008IN TO CO01EXP008INV.   RMB0002
DFUT01     IF 01EXP008OT(1:1) = " " MOVE ZEROS      TO CO01EXP008OTV    RMB0002
DFUT01     ELSE                     MOVE 01EXP008OT TO CO01EXP008OTV.   RMB0002
DFUT01     IF 01EXP008VE(1:1) = " " MOVE ZEROS      TO CO01EXP008VEV    RMB0002
DFUT01     ELSE                     MOVE 01EXP008VE TO CO01EXP008VEV.   RMB0002
DFUT01     IF 01EXP008CC(1:1) = " " MOVE ZEROS      TO CO01EXP008CCV    RMB0002
DFUT01     ELSE                     MOVE 01EXP008CC TO CO01EXP008CCV.   RMB0002
DFUT01     IF 01EXP008HP(1:1) = " " MOVE ZEROS      TO CO01EXP008HPV    RMB0002
DFUT01     ELSE                     MOVE 01EXP008HP TO CO01EXP008HPV.   RMB0002
DFUT01     COMPUTE AA-MOB12      = CO01EXP008ROV + CO01EXP008INV +      RMB0002
DFUT01                             CO01EXP008VEV + CO01EXP008HPV +      RMB0002
DFUT01                             CO01EXP008CCV + CO01EXP008OTV .      RMB0002
DFUT01 6500-MOB60M-USAAA.                                               RMB0002
REMARK*******************************************************************
REMARK*6500-MOB60M-USAAA.
REMARK*    NUMERO DE PRODUCTOS CON MAS DE 60 MESES EN LIBROS
REMARK*******************************************************************
DFUT01     IF 01EXP013RO(1:1) = " " MOVE ZEROS      TO CO01EXP013ROV    RMB0002
DFUT01     ELSE                     MOVE 01EXP013RO TO CO01EXP013ROV.   RMB0002
DFUT01     IF 01EXP013IN(1:1) = " " MOVE ZEROS      TO CO01EXP013INV    RMB0002
DFUT01     ELSE                     MOVE 01EXP013IN TO CO01EXP013INV.   RMB0002
DFUT01     IF 01EXP013OT(1:1) = " " MOVE ZEROS      TO CO01EXP013OTV    RMB0002
DFUT01     ELSE                     MOVE 01EXP013OT TO CO01EXP013OTV.   RMB0002
DFUT01     IF 01EXP013VE(1:1) = " " MOVE ZEROS      TO CO01EXP013VEV    RMB0002
DFUT01     ELSE                     MOVE 01EXP013VE TO CO01EXP013VEV.   RMB0002
DFUT01     IF 01EXP013CC(1:1) = " " MOVE ZEROS      TO CO01EXP013CCV    RMB0002
DFUT01     ELSE                     MOVE 01EXP013CC TO CO01EXP013CCV.   RMB0002
DFUT01     IF 01EXP013HP(1:1) = " " MOVE ZEROS      TO CO01EXP013HPV    RMB0002
DFUT01     ELSE                     MOVE 01EXP013HP TO CO01EXP013HPV.   RMB0002
DFUT01     COMPUTE AA-MOB60M     = CO01EXP013ROV + CO01EXP013INV +      RMB0002
DFUT01                             CO01EXP013VEV + CO01EXP013HPV +      RMB0002
DFUT01                             CO01EXP013CCV + CO01EXP013OTV .      RMB0002
       6000-DESPLEGAR-AUDITORIA-USAAA.
REMARK*******************************************************************
REMARK*6000-DESPLEGAR-AUDITORIA-USAAA.
REMARK*    ESTA RUTINA PERMITE GENERAR PARA AUDITORIA LA INFORMACION
REMARK*    COMPLETA SOBRE EL SCORE , DUMIES CARACT ETC
REMARK*******************************************************************
           MOVE SPACES TO AREA-VALI-USAAA.
REMARK     STRING  TIPO-ID-CARACT,";"
                   NRO-ID-CARACT           ,";",
                   SCORE-CARD-USAAA        ,";",
                   SCORE-USAAA             ,";",
                   ADVERSE-RAZON-USAAA(1)  ,";",
                   ADVERSE-RAZON-USAAA(2)  ,";",
                   ADVERSE-RAZON-USAAA(3)  ,";",
                   ADVERSE-RAZON-USAAA(4)  ,
                   INTO AREA-VALI-USAAA.
           PERFORM 7000-DESPLEGAR-CARACT-USAAA
           EVALUATE SCORE-CARD-USAAA
             WHEN 1 
                MOVE DUMMYS-S1-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN 2 
                MOVE DUMMYS-S2-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN 3 
                MOVE DUMMYS-S3-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN 4 
                MOVE DUMMYS-S4-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN 5 
                MOVE DUMMYS-S5-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN 6 
                MOVE DUMMYS-S6-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN 7 
                MOVE DUMMYS-S7-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN 8 
                MOVE DUMMYS-S8-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN 9 
                MOVE DUMMYS-S9-USAAA TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
             WHEN ANY
                MOVE ";" TO DUMMIES-DESPLEGAR-USAAA
                PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
           END-EVALUATE.
       6500-DESPLEGAR-DUMMIES-USAAA.
REMARK*******************************************************************
REMARK*6500-DESPLEGAR-DUMMIES-USAAA.
REMARK*    RUTINA QUE PERMITE DESPLEGAR LOS VALORES DE LAS VARIABLES 
REMARK*    DUMMIES PARA SEGUIMIENTO. ENTRADA : DUMMIES-DESPLEGAR-USAAA
REMARK*    EJEMPLO DE SU USO:
REMARK*          DISPLAY TIPO-ID-CARACT,NRO-ID-CARACT,";",INGRESO-USAAA1
REMARK*             NO ADVANCING
REMARK*          MOVE DUMMYS-01-USAAA TO DUMMIES-DESPLEGAR-USAHD
REMARK*          PERFORM 6500-DESPLEGAR-DUMMIES-USAAA
REMARK*
REMARK*******************************************************************
           MOVE 1 TO I-USAAA.
           PERFORM UNTIL I-USAAA > 500
             IF DUMMIES-DESPLEGAR-USAAA(I-USAHD:1) NOT = " "
                COMPUTE J-USAAA = I-USAHD + 1
                IF DUMMIES-DESPLEGAR-USAAA(J-USAHD:1) NOT = " "
                  STRING AREA-VALI-USAAA DELIMITED BY "               "
                           ";",
                            DUMMIES-DESPLEGAR-USAAA(I-USAHD:1)
                       INTO AREA-VALI-USAAA
                ELSE
                  STRING AREA-VALI-USAAA DELIMITED BY "               "
                           ";",
                            DUMMIES-DESPLEGAR-USAAA(I-USAHD:1)
                       INTO AREA-VALI-USAAA
                END-IF
             END-IF
             ADD 1 TO I-USAAA
           END-PERFORM.
       7000-DESPLEGAR-CARACT-USAAA.
REMARK*******************************************************************
REMARK*7000-DESPLEGAR-CARACT-USAAA.
REMARK*    SE DESPLIEGAN LAS CARACTERISTICAS PARA CADA SCORE CARD PARA 
REMARK*    EFECTOS DE DEBUG Y AUDITORIA
REMARK*******************************************************************
           EVALUATE SCORE-CARD-USAAA
             WHEN 1
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
                AA-S1-CO02EXP008TO-DCCN(1:18)    , ";"
                AA-S1-CO02EXP001TO-DCCN(1:18)    ,  ";"
                AA-S1-PRQALDIA-DCCN(1:18)        ,  ";"
                AA-S1-CO02NUM029TO-DCCN(1:18)    ,  ";"
                AA-S1-CO02EXP006TO-DCCN(1:18)    ,  ";"
                AA-TIPORELD01              ,  ";"
                AA-TIPORELD04              ,  ";"
                INTO AREA-VALI-USAAA
             WHEN 2 
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
                AA-S2-PRQALDIA-DCCE(1:18)        , ";"
                AA-S2-CO02EXP001TO-DCCE(1:18)    ,  ";"
                AA-S2-CO01EXP001CC-DCCE(1:18)    ,  ";"
                AA-S2-CO02NUM042CB-DCCE(1:18)    ,  ";"
                AA-S2-CO02EXP006TO-DCCE(1:18)    ,  ";"
                AA-S2-CO01NUM050CC-DCCE(1:18)    ,  ";"
                AA-TIPORELD04              ,  ";"
                INTO AREA-VALI-USAAA
             WHEN 3
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
DTRN01          AA-S3-CO02EXP001TO-DTRN(1:12)    ,  ";"                 RMB0002
DTRN01          AA-S3-CO02EXP006TO-DTRN(1:12)    ,  ";"                 RMB0002
DTRN01          AA-S3-CO02EXP008TO-DTRN(1:12)    ,  ";"                 RMB0002
DTRN01          AA-S3-PROQTOTAB-DTRN   (1:12)    ,  ";"                 RMB0002
DTRN01          AA-S3-PRQALDIA-DTRN    (1:12)    ,  ";"                 RMB0002
                INTO AREA-VALI-USAAA
             WHEN 4 
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
DTRE01          AA-S4-CO02EXP006TO-DTRE(1:12)    ,  ";"                 RMB0002
DTRE01          AA-S4-CO01NUM050RO-DTRE(1:12)    ,  ";"                 RMB0002
DTRE01          AA-S4-PRQALDIA-DTRE    (1:12)    ,  ";"                 RMB0002
DTRE01          AA-S4-CO02NUM042CB-DTRE(1:12)    ,  ";"                 RMB0002
DTRE01          AA-S4-CO01ACP004RO-DTRE(1:12)    ,  ";"                 RMB0002
DTRE01          AA-S4-PREEXPOSICIONIN-DTRE(1:12) ,  ";"                 RMB0002
DTRE01          AA-S4-CO02EXP008TO-DTRE(1:12)    ,  ";"                 RMB0002
                INTO AREA-VALI-USAAA
             WHEN 5 
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
DINT01          AA-S5-PRQALDIA-DINT    (1:12)    ,  ";"                 RMB0002
DINT01          AA-S5-CO02NUM042CB-DINT(1:12)    ,  ";"                 RMB0002
DINT01          AA-S5-CO02EXP001TO-DINT(1:12)    ,  ";"                 RMB0002
DINT01          AA-S5-CO02NUM005TO-DINT(1:12)    ,  ";"                 RMB0002
                INTO AREA-VALI-USAAA
             WHEN 6 
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
DHVT01          AA-S6-CO02NUM042CB-DHVT(1:12)    ,  ";"                 RMB0002
DHVT01          AA-S6-PRQALDIA-DHVT    (1:12)    ,  ";"                 RMB0002
DHVT01          AA-S6-CO02EXP009TO-DHVT(1:12)    ,  ";"                 RMB0002
                INTO AREA-VALI-USAAA
             WHEN 7 
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
DCPN01          AA-S7-MOB12-DCPN       (1:12)    ,  ";"                 RMB0003
DCPN01          AA-S7-CO02EXP006TO-DCPN(1:12)    ,  ";"                 RMB0003
DCPN01          AA-S7-PRQALDIA-DCPN    (1:12)    ,  ";"                 RMB0003
                INTO AREA-VALI-USAAA
             WHEN 8 
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
DCPE01          AA-S8-PRQALDIA-DCPE    (1:12)    ,  ";"                 RMB0003
DCPE01          AA-S8-CO01MOR040IN-DCPE(1:12)    ,  ";"                 RMB0003
DCPE01          AA-S8-CO02NUM042CB-DCPE(1:12)    ,  ";"                 RMB0003
DCPE01          AA-S8-CO02EXP006TO-DCPE(1:12)    ,  ";"                 RMB0003
                INTO AREA-VALI-USAAA
             WHEN 9 
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
DFUT01          AA-S9-CO02EXP006TO-DPU (1:12)    ,  ";"                 RMB0002
DFUT01          AA-S9-PRQALDIA-DPU     (1:12)    ,  ";"                 RMB0002
DFUT01          AA-S9-MOB60M-DPU       (1:12)    ,  ";"                 RMB0002
DFUT01          AA-S9-CO02NUM042CB-DPU (1:12)    ,  ";"                 RMB0002
DFUT01          AA-S9-CO02EXP007TO-DPU (1:12)    ,  ";"                 RMB0002
DFUT01          AA-S9-MOB12-DPU        (1:12)    ,  ";"                 RMB0002
                INTO AREA-VALI-USAAA
             WHEN ANY
                STRING AREA-VALI-USAAA DELIMITED BY SPACES,
                        ";"
                01NUM001RO    , ";"                       
                01NUM001IN    , ";"                       
                01NUM001VE    , ";"                       
                01NUM001HP    , ";"                       
                01NUM001CC    , ";"                       
                01NUM001OT    , ";"                       
                01NUM001CO    , ";"                       
                01NUM001AH    , ";"                       
                01NUM001CT    , ";"                       
                02NUM018TO    , ";"                       
                02NUM020TO
                INTO AREA-VALI-USAAA
           END-EVALUATE.
