      * SCOUSAHD-PROC.v.0006
REMARK************************************************************************
REMARK* CONJUNTO DE RUTINAS QUE PERMITE CALCULAR EL SCORE GENERICO DE
REMARK* PREDICTA HD .                                                      *
REMARK* ENTRADA :CUANDO SE INVOCA ESTE COPY LAS CARACTERÍSTICAS YA DEBEN
REMARK*  ESTAR LEÍDAS Y CALCULADAS Y LA FORMA DE LLAMADO ES PERFORM A
REMARK*  5000-CALCULAR-SCORE-USAHD.
REMARK* SALIDAS
REMARK*   EL CALCULO DEL SCORE SE ENTREGA EN SALARIOS MINIMOS EN LAS
REMARK*   SIGUIENTES VARIABLES
REMARK*      SCORE-USAHD                        PIC 9(3).
REMARK*  ADICIONALMENTE SE ENTREGAN LAS RAZONES ADVERSAS Y EL SCORE-CARD
REMARK*      ADVERSE-RAZON-USAPI OCCURS 4 TIMES PIC 9(02).
REMARK*      SCORE-CARD-USAPI                   PIC 9(01).
REMARK*
REMARK**********************************************************************
REMARK* RMB0002    * IGUA01 : SCORE CARD 1 DEFINICIONES SIN CAMBIO
REMARK* 29-OCT-2009* NUEV01 : SCORE CARD 1 DEFINICIONES NUEVAS
REMARK*            * MODI01 : SCORE CARD 1 DEFINICIONES MODIFICADAS
REMARK**********************************************************************
REMARK* RMB0003    * EXCL01 : SE ADICIONA LA EXCLUSION PARA CUANDO ES
REMARK* 22-DIC-2009*          SOLO REAL Y EXPERIENCIA MENOR A 7 MESES.
REMARK**********************************************************************
REMARK* RMB0004    * OPTI01 : SE OPTIMIZA EL MODELO CON LA INCLUSIN DE
REMARK* 12-MAR-2010*          MORAS DE 120 EN LAS VARIABLES           
REMARK**********************************************************************
REMARK* RMB0005    * ACIMAS : SE ADICIONA CONTROL PARA EVITAR QUE SE CALCULE
REMARK* 05-ABR-2011*          ACIERTA+ PARA PERSONAS JURIDICAS        
REMARK**********************************************************************
REMARK* GJC0006    * EXCL02 : SE CAMBIA EXCLUSION 76 PARA QUE TENGA EN CUENTA
REMARK* 05-DIC-2011*          SOLO CUENTAS CREDITICIAS COMO LO HACE ACIERTA
REMARK* G.JIMENEZ  *
REMARK**********************************************************************
       5000-CALCULAR-CAR-SCORE-USAHD.
REMARK**********************************************************************
REMARK*5000-CALCULAR-CAR-SCORE-USAHD.
REMARK* RUTINA QUE LLAMA LAS CARACTERISTICAS SIN LEY EL SCORE PREDICTA HD
REMARK**********************************************************************
           MOVE AMNISTIA21-LEEMSTRS TO AMNISTIA21-CARACT.      
           MOVE SW-ART13-AMNIST21   TO AMNISTIA21-ART13-CARACT.
           MOVE 0 TO AMNISTIA21-LEEMSTRS .
           MOVE 0 TO SW-ART13-AMNIST21  .  
ACIMAS     IF TIPO-ID-CARACT = 1 OR TIPO-ID-CARACT  = 4                 VHF0005
ACIMAS        PERFORM 1000-CALCULAR-CARACTERISTICAS                     VHF0005
ACIMAS        PERFORM 5000-CALCULAR-SCORE-USAHD                         VHF0005
ACIMAS     ELSE                                                         VHF0005
ACIMAS        PERFORM 5000A-INICIALIZAR-USAHD                           VHF0005
ACIMAS        MOVE 1 TO SIN-EXCLUSION-USAHD                             VHF0005
ACIMAS        MOVE 70  TO  ADVERSE-RAZON-USAHD(1)                       VHF0005
ACIMAS     END-IF.                                                      VHF0005
           MOVE  AMNISTIA21-CARACT TO AMNISTIA21-LEEMSTRS.
           MOVE  AMNISTIA21-ART13-CARACT TO SW-ART13-AMNIST21.
       5000-CALCULAR-SCORE-USAHD.
REMARK**********************************************************************
REMARK*5000-CALCULAR-SCORE-USAHD.
REMARK* RUTINA QUE EXAMINA EL PERFIL DE UNA PERSONA, APLICA EXCLUSIONES
REMARK* Y SI PASA EL FILTRO ESTIMA EL INGRESO DE ELLA.
REMARK**********************************************************************
           PERFORM 5000A-INICIALIZAR-USAHD.
           PERFORM 5100-VER-EXCLUSIONES-USAHD
           IF SIN-EXCLUSION-USAHD = 0
              PERFORM 5200-VER-SCORE-CARD-USAHD
           END-IF.    
       5000A-INICIALIZAR-USAHD.
REMARK**********************************************************************
REMARK*    SE INICIALIZAN LAS VARIABLES INVOLUCRADAS EN LAS EXCLUSIONES Y
REMARK*    CALCULO DE LA SEGMENTACION A APLICAR.
REMARK**********************************************************************
           INITIALIZE VARIABLES-WORK-USAHD.
      *    EXCLUSION FALLECIDOS
           MOVE 00DEM001    TO CO00DEM001.    
           MOVE 00DEM002    TO CO00DEM002.    
      *    EXCLUSION TIPO 5 O TIPO 1 SIN DESEMPEÑO O SOLO CODEUDORES
           MOVE 01NUM001RO  TO CO01NUM001RO.
           MOVE 01NUM001IN  TO CO01NUM001IN.
           MOVE 01NUM001VE  TO CO01NUM001VE.
           MOVE 01NUM001HP  TO CO01NUM001HP.
           MOVE 01NUM001OT  TO CO01NUM001OT.
           MOVE 01NUM001CC  TO CO01NUM001CC.
           MOVE 01NUM001CO  TO CO01NUM001CO.
           MOVE 01NUM001AH  TO CO01NUM001AH.
           MOVE 01NUM001CT  TO CO01NUM001CT.
      *
           MOVE 01NUM002RO  TO CO01NUM002RO.
           MOVE 01NUM002IN  TO CO01NUM002IN.
           MOVE 01NUM002VE  TO CO01NUM002VE.
           MOVE 01NUM002HP  TO CO01NUM002HP.
           MOVE 02NUM001TO  TO CO02NUM001TO.
           MOVE 02NUM002TO  TO CO02NUM002TO.
           MOVE 02EXP001TO  TO CO02EXP001TO.
           MOVE 02NUM018TO  TO CO02NUM018TO.
           IF CO02NUM018TO NUMERIC
              MOVE CO02NUM018TO TO CO02NUM018TOV
           ELSE
              MOVE ZERO         TO CO02NUM018TOV
           END-IF.
           MOVE 02NUM020TO  TO CO02NUM020TO.
           IF CO02NUM020TO NUMERIC
              MOVE CO02NUM020TO TO CO02NUM020TOV
           ELSE
              MOVE ZERO         TO CO02NUM020TOV
           END-IF.
       5100-VER-EXCLUSIONES-USAHD.
REMARK**********************************************************************
REMARK*5100-VER-EXCLUSIONES-USAHD.
REMARK* DE ACUERDO A CARACTERISTICAS ESPECIFICAS SE EXAMINA SI ES UNA
REMARK* PERSONA SUJETA A EXCLUSION EN EL CALCULO DE PREDICTA HD
REMARK**********************************************************************
           *> CLIENTES TIPO ID 2 OR 3
           IF TIPO-ID-CARACT NOT = 1 AND TIPO-ID-CARACT NOT = 4
              MOVE 1 TO SIN-EXCLUSION-USAHD 
              MOVE 70  TO  ADVERSE-RAZON-USAHD(1)  
           END-IF.
           *> CLIENTES TIPO 5
           IF SIN-EXCLUSION-USAHD = 0
              IF CO01NUM001AH = "  -1" AND CO01NUM001CT = "  -1" AND 
                 CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND 
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND 
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND 
                 CO01NUM001CO = "  -1" 
                 MOVE 1 TO SIN-EXCLUSION-USAHD 
                 MOVE 71  TO  ADVERSE-RAZON-USAHD(1)     
              END-IF
           END-IF.
           *> CLIENTES TIPO 1 SIN DESEMPEÑO
           IF SIN-EXCLUSION-USAHD = 0
              IF (CO01NUM001AH > 0000 OR CO01NUM001CT > 0000 )   AND
                 CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND 
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND 
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND 
                 CO01NUM001CO = "  -1" 
                 MOVE 1 TO SIN-EXCLUSION-USAHD 
                 MOVE 72  TO  ADVERSE-RAZON-USAHD(1)     
              END-IF
           END-IF.
           *> CLIENTES FALLECIDOS                
           IF SIN-EXCLUSION-USAHD = 0
              IF CO00DEM001 = 01 OR CO00DEM002 = 01         
                 MOVE 1 TO SIN-EXCLUSION-USAHD 
                 MOVE 73  TO  ADVERSE-RAZON-USAHD(1)     
                 MOVE 3   TO SCORE-USAHD
              END-IF
           END-IF.
           *> CLIENTES QUE SON SOLO CODEUDORES  
           IF SIN-EXCLUSION-USAHD = 0
              IF CO01NUM001RO = "  -1" AND CO01NUM001IN = "  -1" AND 
                 CO01NUM001VE = "  -1" AND CO01NUM001HP = "  -1" AND 
                 CO01NUM001CC = "  -1" AND CO01NUM001OT = "  -1" AND 
MODI01*          CO01NUM001AH = "  -1" AND CO01NUM001CT = "  -1" AND    RMB0002
                 CO01NUM001CO <> "  -1" 
                 MOVE 1 TO SIN-EXCLUSION-USAHD 
                 MOVE 74  TO  ADVERSE-RAZON-USAHD(1)     
                 MOVE 4   TO SCORE-USAHD
              END-IF
           END-IF.
           *> SIN CON TODAS LAS CUENTAS EN DEFAULT            
           IF SIN-EXCLUSION-USAHD = 0 
              PERFORM 6000-QTOTAB-USAHD
              COMPUTE HD-QCTASDEFAULT = CO02NUM018TOV + CO02NUM020TOV
              IF HD-QCTASDEFAULT > 0 AND
                 HD-QCTASDEFAULT = HD-QTOTAB
                 MOVE 1 TO SIN-EXCLUSION-USAHD 
                 MOVE 75  TO  ADVERSE-RAZON-USAHD(1)  
                 MOVE 1   TO SCORE-USAHD
              END-IF
           END-IF.
EXCL02     IF SIN-EXCLUSION-USAHD = 0                                   GJC0006
EXCL02        PERFORM 6000-QTOT-USAHD                                   GJC0006
EXCL02        COMPUTE HD-QREAL = CO01NUM001OTV + CO01NUM001CCV          GJC0006
EXCL02        PERFORM 6500-MOB-SOLOREAL-USAHD                           GJC0006
EXCL02        IF HD-QREAL = HD-QTOT AND HD-MOB-SOLOREAL <=  6           GJC0006
EXCL02           MOVE 1 TO SIN-EXCLUSION-USAHD                          GJC0006
EXCL02           MOVE 76  TO  ADVERSE-RAZON-USAHD(1)                    GJC0006
EXCL02           MOVE 7   TO SCORE-USAHD                                GJC0006
EXCL02        END-IF                                                    GJC0006
EXCL02     END-IF.                                                      GJC0006
      *    CALCULO DEL SALARIO MINIMO AL RUN DATE
           IF ANO-SMLMV-CARACT(99) <> 9999
              PERFORM 1100-CARGA-SAL-MINIMO
           END-IF.
           MOVE ANO-RUN-CARACT TO ANO-NOV-SMLMV-CARACT
           MOVE 1 TO IND-E-CARACT
           PERFORM UNTIL ANO-SMLMV-CARACT(IND-E-CARACT) = 9999 OR
                ANO-SMLMV-CARACT(IND-E-CARACT) =
                ANO-NOV-SMLMV-CARACT
                ADD 1 TO IND-E-CARACT
           END-PERFORM
           IF ANO-SMLMV-CARACT(IND-E-CARACT) <> 9999
              MOVE VLR-SMLMV-CARACT(IND-E-CARACT) TO VLR-SMLMV-USAHD
           ELSE
              MOVE 1 TO SIN-EXCLUSION-USAHD 
              MOVE 78  TO  ADVERSE-RAZON-USAHD(1)  
              DISPLAY "ERROR BUSCANDO SALARIO MINIMO"
                      ANO-NOV-SMLMV-CARACT 
           END-IF.
       5200-VER-SCORE-CARD-USAHD.
REMARK**********************************************************************
REMARK*5200-VER-SCORE-CARD-USAHD.
REMARK*    SE EXAMINAN LAS CARACTERISTICAS QUE DETERMINAN A QUE SEGMENTO 
REMARK*    PERTENECE LA PERSONA EXAMINANADA.
REMARK**********************************************************************
      *    CALCULO CALCULO VARIABLE MOB-SOLOREAL
      *    CALCULO VARIABLE SOLOREAL
           PERFORM 6000-QTOT-USAHD.
           COMPUTE HD-QREAL = CO01NUM001OTV + CO01NUM001CCV.
OPTI01*    CALCULO VARIABLE NEW-EVER12048 (TOTAL DE 120)                RMB0004
OPTI01     PERFORM 6500-CALCULAR-EVER12006.                             RMB0004
OPTI01     PERFORM 6500-CALCULAR-EVER12012.                             RMB0004
OPTI01     PERFORM 6500-CALCULAR-EVER12018.                             RMB0004
OPTI01     PERFORM 6500-CALCULAR-EVER12024.                             RMB0004
OPTI01     PERFORM 6500-CALCULAR-EVER12036.                             RMB0004
OPTI01     PERFORM 6500-CALCULAR-EVER12048.                             RMB0004
OPTI01     PERFORM 6500-CALCULO-01MOR05.                                RMB0004
OPTI01     COMPUTE HD-NEW-EVER12048 = HD-EVER12006 + HD-EVER12012 +     RMB0004
OPTI01                                HD-EVER12018 + HD-EVER12024 +     RMB0004
OPTI01                                HD-EVER12036 + HD-EVER12048 +     RMB0004
OPTI01                                HD-01MOR05TO .                    RMB0004
      *
           MOVE 02EXP001TO  TO CO02EXP001TO.
           MOVE 02EXP002TO  TO CO02EXP002TO.
      *
           PERFORM 6500-RECMORA-USAHD.
OPTI01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0004
OPTI01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0004
OPTI01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0004
OPTI01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0004
OPTI01        HD-RECMORA > 0                                            RMB0004
OPTI01        MOVE 0 TO HD-RECMORA                                      RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE HD-RECMORA TO HD-RECMORA                             RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     PERFORM 6500-RECMORACC-USAHD.                                RMB0004
OPTI01     IF HD-RECMORACC = 0 AND HD-RECMORA > 0                       RMB0004
OPTI01        MOVE 0 TO HD-RECMORA                                      RMB0004
OPTI01     END-IF.                                                      RMB0004
           IF HD-QREAL = HD-QTOT                                
              MOVE 1 TO SCORE-CARD-USAHD
              PERFORM 6100-SCORE-CARD1-USAHD
EXCL02*       IF CO02EXP001TO <= 006                                    GJC0006
EXCL02*          MOVE SCORE-USAHD TO SCORE-SINEXC-USAHD                 GJC0006
EXCL02*          MOVE 76  TO  ADVERSE-RAZON-USAHD(1)                    GJC0006
EXCL02*          MOVE 7   TO  SCORE-USAHD                               GJC0006
EXCL02*          MOVE 0 TO SCORE-CARD-USAHD                             GJC0006
EXCL02*       END-IF                                                    GJC0006
           ELSE
OPTI01        IF HD-NEW-EVER12048 >= 1                                  RMB0004
                 MOVE 2 TO SCORE-CARD-USAHD
                 PERFORM 6200-SCORE-CARD2-USAHD
              ELSE
                 IF CO02EXP001TO < 025                              
                    MOVE 3 TO SCORE-CARD-USAHD
                    PERFORM 6300-SCORE-CARD3-USAHD
                 ELSE
                    IF HD-RECMORA < 7       
                       MOVE 4 TO SCORE-CARD-USAHD
                       PERFORM 6400-SCORE-CARD4-USAHD
                    ELSE
                       IF CO02EXP002TO < 007   
                          MOVE 5 TO SCORE-CARD-USAHD
                          PERFORM 6500-SCORE-CARD5-USAHD
                       ELSE
                          MOVE 6 TO SCORE-CARD-USAHD
                          PERFORM 6600-SCORE-CARD6-USAHD
                       END-IF
                    END-IF
                 END-IF
              END-IF
           END-IF.
EXCL01     IF ADVERSE-RAZON-USAHD(1) =  99                              RMB0003
EXCL01        MOVE SCORE-USAHD TO SCORE-SINEXC-USAHD                    RMB0003
EXCL01     END-IF.                                                      RMB0003
       6000-QTOTAB-USAHD.
REMARK********************************************************************
REMARK*6000-QTOTAB-USAHD.
REMARK*    CALCULO DEL TOTAL DE OBLIGACIONES ABIERTAS DE UNA PERSONA
REMARK********************************************************************
           MOVE 01NUM002CC TO CO01NUM002CC
           IF CO01NUM002CC NUMERIC
              MOVE CO01NUM002CC TO CO01NUM002CCV
           ELSE
              MOVE ZERO         TO CO01NUM002CCV
           END-IF.
           MOVE 01NUM002RO TO CO01NUM002RO
           IF CO01NUM002RO NUMERIC
              MOVE CO01NUM002RO TO CO01NUM002ROV
           ELSE
              MOVE ZERO         TO CO01NUM002ROV
           END-IF.
           MOVE 01NUM002IN TO CO01NUM002IN
           IF CO01NUM002IN NUMERIC
              MOVE CO01NUM002IN TO CO01NUM002INV
           ELSE
              MOVE ZERO         TO CO01NUM002INV
           END-IF.
           MOVE 01NUM002OT TO CO01NUM002OT
           IF CO01NUM002OT NUMERIC
              MOVE CO01NUM002OT TO CO01NUM002OTV
           ELSE
              MOVE ZERO         TO CO01NUM002OTV
           END-IF.
           MOVE 01NUM002CO TO CO01NUM002CO
           IF CO01NUM002CO NUMERIC
              MOVE CO01NUM002CO TO CO01NUM002COV
           ELSE
              MOVE ZERO         TO CO01NUM002COV
           END-IF.
           MOVE 01NUM002VE TO CO01NUM002VE
           IF CO01NUM002VE NUMERIC
              MOVE CO01NUM002VE TO CO01NUM002VEV
           ELSE
              MOVE ZERO         TO CO01NUM002VEV
           END-IF.
           MOVE 01NUM002HP TO CO01NUM002HP
           IF CO01NUM002HP NUMERIC
              MOVE CO01NUM002HP TO CO01NUM002HPV
           ELSE
              MOVE ZERO         TO CO01NUM002HPV
           END-IF.
           COMPUTE HD-QTOTAB  = CO01NUM002CCV + CO01NUM002ROV
                            + CO01NUM002INV + CO01NUM002OTV
                            + CO01NUM002COV + CO01NUM002VEV
                            + CO01NUM002HPV .
       6000-QTOT-USAHD.
REMARK********************************************************************
REMARK*6000-QTOT-USAHD.
REMARK*    CALCULO DEL TOTAL DE OBLIGACIONES DE UNA PERSONA
REMARK********************************************************************
           MOVE 01NUM001CC TO CO01NUM001CC
           IF CO01NUM001CC NUMERIC
              MOVE CO01NUM001CC TO CO01NUM001CCV
           ELSE
              MOVE ZERO         TO CO01NUM001CCV
           END-IF.
           MOVE 01NUM001RO TO CO01NUM001RO
           IF CO01NUM001RO NUMERIC
              MOVE CO01NUM001RO TO CO01NUM001ROV
           ELSE
              MOVE ZERO         TO CO01NUM001ROV
           END-IF.
           MOVE 01NUM001IN TO CO01NUM001IN
           IF CO01NUM001IN NUMERIC
              MOVE CO01NUM001IN TO CO01NUM001INV
           ELSE
              MOVE ZERO         TO CO01NUM001INV
           END-IF.
           MOVE 01NUM001OT TO CO01NUM001OT
           IF CO01NUM001OT NUMERIC
              MOVE CO01NUM001OT TO CO01NUM001OTV
           ELSE
              MOVE ZERO         TO CO01NUM001OTV
           END-IF.
           MOVE 01NUM001CO TO CO01NUM001CO
           IF CO01NUM001CO NUMERIC
              MOVE CO01NUM001CO TO CO01NUM001COV
           ELSE
              MOVE ZERO         TO CO01NUM001COV
           END-IF.
           MOVE 01NUM001VE TO CO01NUM001VE
           IF CO01NUM001VE NUMERIC
              MOVE CO01NUM001VE TO CO01NUM001VEV
           ELSE
              MOVE ZERO         TO CO01NUM001VEV
           END-IF.
           MOVE 01NUM001HP TO CO01NUM001HP
           IF CO01NUM001HP NUMERIC
              MOVE CO01NUM001HP TO CO01NUM001HPV
           ELSE
              MOVE ZERO         TO CO01NUM001HPV
           END-IF.
           COMPUTE HD-QTOT  = CO01NUM001CCV + CO01NUM001ROV 
                            + CO01NUM001INV + CO01NUM001OTV 
                            + CO01NUM001COV + CO01NUM001VEV 
                            + CO01NUM001HPV .
       6100-SCORE-CARD1-USAHD.
REMARK********************************************************************
REMARK*6100-SCORE-CARD1-USAHD.
REMARK*    SE CALCULA EL SCORE PARA LOS CLIENTES O PERSONAS SIN UN         
REMARK*    PORTAFOLIO MUY COMPLEJO           
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAHD(1) .
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES 
REMARK********************************************************************
IGUA01     MOVE 00DEM016       TO CO00DEM016  .                         RMB0002
NUEV01*                                                                 RMB0002
NUEV01     MOVE 02END001CB  TO CO02END001CB.                            RMB0002
NUEV01     IF CO02END001CB(2:1) NUMERIC  *> CARACT CON VALORES NEGATIVOSRMB0002
NUEV01        AND CO02END001CB(1:1) <> "-"                              RMB0002
NUEV01        MOVE CO02END001CB(1:8)  TO CO02END001CBV(1:8)             RMB0002
NUEV01        MOVE "0"                TO CO02END001CBV(1:1)             RMB0002
NUEV01        MOVE CO02END001CB(10:2) TO CO02END001CBV(9:2)             RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE ZEROS              TO CO02END001CBV                  RMB0002
NUEV01     END-IF                                                       RMB0002
IGUA01*                                                                 RMB0002
IGUA01     MOVE 01END017CC  TO CO01END017CC.                            RMB0002
IGUA01     IF CO01END017CC(9:1) = "."                                   RMB0002
IGUA01        MOVE CO01END017CC(1:8)  TO CO01END017CCV(1:8)             RMB0002
IGUA01        MOVE CO01END017CC(10:2) TO CO01END017CCV(9:2)             RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE ZEROS              TO CO01END017CCV                  RMB0002
IGUA01     END-IF                                                       RMB0002
NUEV01*                                                                 RMB0002
NUEV01     MOVE 01END018CC  TO CO01END018CC.                            RMB0002
NUEV01     IF CO01END018CC(9:1) = "."                                   RMB0002
NUEV01        MOVE CO01END018CC(1:8)  TO CO01END018CCV(1:8)             RMB0002
NUEV01        MOVE CO01END018CC(10:2) TO CO01END018CCV(9:2)             RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE ZEROS              TO CO01END018CCV                  RMB0002
NUEV01     END-IF                                                       RMB0002
NUEV01*                                                                 RMB0002
NUEV01     MOVE 01END027CC      TO CO01END027CC.                        RMB0002
NUEV01     IF CO01END027CC(9:1) = "."                                   RMB0002
NUEV01        MOVE CO01END027CC(1:8)  TO CO01END027CCV(1:8)             RMB0002
NUEV01        MOVE CO01END027CC(10:2) TO CO01END027CCV(9:2)             RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE ZEROS              TO CO01END027CCV                  RMB0002
NUEV01     END-IF                                                       RMB0002
IGUA01*                                                                 RMB0002
IGUA01     MOVE 01END027OT      TO CO01END027OT.                        RMB0002
IGUA01     IF CO01END027OT(9:1) = "."                                   RMB0002
IGUA01        MOVE CO01END027OT(1:8)  TO CO01END027OTV(1:8)             RMB0002
IGUA01        MOVE CO01END027OT(10:2) TO CO01END027OTV(9:2)             RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE ZEROS              TO CO01END027OTV                  RMB0002
IGUA01     END-IF                                                       RMB0002
IGUA01*                                                                 RMB0002
MODI01     MOVE 01END004RO      TO CO01END004RO.                        RMB0002
MODI01     IF CO01END004RO(9:1) = "."                                   RMB0002
MODI01        MOVE CO01END004RO(1:8)  TO CO01END004ROV(1:8)             RMB0002
MODI01        MOVE CO01END004RO(10:2) TO CO01END004ROV(9:2)             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE ZEROS              TO CO01END004ROV                  RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01*                                                                 RMB0002
MODI01     MOVE 01END004IN      TO CO01END004IN.                        RMB0002
MODI01     IF CO01END004IN(9:1) = "."                                   RMB0002
MODI01        MOVE CO01END004IN(1:8)  TO CO01END004INV(1:8)             RMB0002
MODI01        MOVE CO01END004IN(10:2) TO CO01END004INV(9:2)             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE ZEROS              TO CO01END004INV                  RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01*                                                                 RMB0002
MODI01     MOVE 01END004VE      TO CO01END004VE.                        RMB0002
MODI01     IF CO01END004VE(9:1) = "."                                   RMB0002
MODI01        MOVE CO01END004VE(1:8)  TO CO01END004VEV(1:8)             RMB0002
MODI01        MOVE CO01END004VE(10:2) TO CO01END004VEV(9:2)             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE ZEROS              TO CO01END004VEV                  RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01*                                                                 RMB0002
MODI01     MOVE 01END004HP      TO CO01END004HP.                        RMB0002
MODI01     IF CO01END004HP(9:1) = "."                                   RMB0002
MODI01        MOVE CO01END004HP(1:8)  TO CO01END004HPV(1:8)             RMB0002
MODI01        MOVE CO01END004HP(10:2) TO CO01END004HPV(9:2)             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE ZEROS              TO CO01END004HPV                  RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01*                                                                 RMB0002
MODI01     MOVE 01END004CC      TO CO01END004CC.                        RMB0002
MODI01     IF CO01END004CC(9:1) = "."                                   RMB0002
MODI01        MOVE CO01END004CC(1:8)  TO CO01END004CCV(1:8)             RMB0002
MODI01        MOVE CO01END004CC(10:2) TO CO01END004CCV(9:2)             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE ZEROS              TO CO01END004CCV                  RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01*                                                                 RMB0002
MODI01     MOVE 01END004OT      TO CO01END004OT.                        RMB0002
MODI01     IF CO01END004OT(9:1) = "."                                   RMB0002
MODI01        MOVE CO01END004OT(1:8)  TO CO01END004OTV(1:8)             RMB0002
MODI01        MOVE CO01END004OT(10:2) TO CO01END004OTV(9:2)             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE ZEROS              TO CO01END004OTV                  RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01*                                                                 RMB0002
MODI01     MOVE 01END004CO      TO CO01END004CO.                        RMB0002
MODI01     IF CO01END004CO(9:1) = "."                                   RMB0002
MODI01        MOVE CO01END004CO(1:8)  TO CO01END004COV(1:8)             RMB0002
MODI01        MOVE CO01END004CO(10:2) TO CO01END004COV(9:2)             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE ZEROS              TO CO01END004COV                  RMB0002
MODI01     END-IF.                                                      RMB0002
NUEV01*                                                                 RMB0002
NUEV01     MOVE 01MOR090CC     TO CO01MOR090CC.                         RMB0002
NUEV01     IF CO01MOR090CC(4:1) = "."                                   RMB0002
NUEV01        MOVE CO01MOR090CC(1:3)  TO CO01MOR090CCV(1:3)             RMB0002
NUEV01        MOVE CO01MOR090CC(05:2) TO CO01MOR090CCV(4:2)             RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE ZEROS              TO CO01MOR090CCV                  RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*                                                                 RMB0002
NUEV01     MOVE 01MOR022OT     TO CO01MOR022OT.                         RMB0002
IGUA01*                                                                 RMB0002
IGUA01     MOVE 01MOR101OT     TO CO01MOR101OT.                         RMB0002
IGUA01     IF CO01MOR101OT(4:1) = "."                                   RMB0002
IGUA01        MOVE CO01MOR101OT(1:3)  TO CO01MOR101OTV(1:3)             RMB0002
IGUA01        MOVE CO01MOR101OT(05:2) TO CO01MOR101OTV(4:2)             RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE ZEROS              TO CO01MOR101OTV                  RMB0002
IGUA01     END-IF.                                                      RMB0002
NUEV01*                                                                 RMB0002
NUEV01     MOVE 01MOR005CC     TO CO01MOR005CC.                         RMB0002
NUEV01     MOVE 01MOR017CC     TO CO01MOR017CC.                         RMB0002
IGUA01     MOVE 01MOR033CC     TO CO01MOR033CC.                         RMB0002
NUEV01     MOVE 01MOR034CC     TO CO01MOR034CC.                         RMB0002
NUEV01     MOVE 01MOR035OT     TO CO01MOR035OT.                         RMB0002
NUEV01     MOVE 01MOR043OT     TO CO01MOR043OT.                         RMB0002
MODI01     MOVE 02NUM028TO     TO CO02NUM028TO.                         RMB0002
NUEV01     MOVE 01NUM050AH     TO CO01NUM050AH.                         RMB0002
NUEV01     MOVE 02NUM018TO     TO CO02NUM018TO.                         RMB0002
IGUA01     MOVE 00DEM003       TO CO00DEM003  .                         RMB0002
NUEV01     MOVE 02EXP003TO     TO CO02EXP003TO.                         RMB0002
REMARK********************************************************************
REMARK*    CALCULO DE VARIABLES ACOTADAS Y DUMMYS SEGEMENTO 1
REMARK********************************************************************
IGUA01*    DEPARTAMENTO DE EXPEDICION DE LA CEDULA                      RMB0002
IGUA01     IF CO00DEM016 NOT NUMERIC OR                                 RMB0002
IGUA01        (CO00DEM016 = 56 OR 48 OR 21 OR 03 OR 28 OR 12 OR 17 OR   RMB0002
IGUA01                      05 OR 13 )                                  RMB0002
IGUA01        MOVE 1 TO HD-S1-CO00DEM016D01                             RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO00DEM016D01                             RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF (CO00DEM016 = 60 OR 31 OR 25 OR 27 OR 29 OR 23 OR 01 OR   RMB0002
IGUA01                      15 OR 26 OR 11 OR 19 OR 44 OR 52 OR 40 OR   RMB0002
IGUA01                      68 OR 50 OR 72 OR 54 OR 64 )                RMB0002
IGUA01        MOVE 1 TO HD-S1-CO00DEM016D02                             RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO00DEM016D02                             RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF (CO00DEM016 = 24 OR 07 OR 46 OR 09 )                      RMB0002
IGUA01        MOVE 1 TO HD-S1-CO00DEM016D03                             RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO00DEM016D03                             RMB0002
IGUA01     END-IF.                                                      RMB0002
NUEV01*    PORCENTAJE DE AMORTIZACION A LA FECHA PARA PORTAFOLIO CB     RMB0002
NUEV01     IF CO02END001CB(2:1) NOT NUMERIC *> CARACT CON VALORES NEGATIRMB0002
NUEV01        OR CO02END001CB(1:1) = "-"                                RMB0002
NUEV01        MOVE 1 TO HD-S1-CO02END001CBD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO02END001CBD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0 <= CO02END001CBV AND CO02END001CBV < 13                 RMB0002
NUEV01        AND CO02END001CB(2:1) NUMERIC       *> MANEJAR EL VALOR NERMB0002
NUEV01        AND CO02END001CB(1:1) <> "-"                              RMB0002
NUEV01        MOVE 1 TO HD-S1-CO02END001CBD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO02END001CBD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 13   <= CO02END001CBV AND CO02END001CBV < 36              RMB0002
NUEV01        MOVE 1 TO HD-S1-CO02END001CBD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO02END001CBD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO02END001CBV >= 36                                       RMB0002
NUEV01        MOVE 1 TO HD-S1-CO02END001CBD04                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO02END001CBD04                           RMB0002
NUEV01     END-IF.                                                      RMB0002
IGUA01*    CUOTA PROMEDIO SALDO EN PRODUCTOS DE CC ULT 6 MESES          RMB0002
IGUA01     IF CO01END017CC(1:1) = " "                                   RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01END017CCD01                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01END017CCD01                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF 0 <= CO01END017CCV AND CO01END017CCV < 0.01               RMB0002
IGUA01        AND CO01END017CC(1:1) <> " "        *> MANEJAR EL -1      RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01END017CCD02                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01END017CCD02                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF 0.01 <= CO01END017CCV AND CO01END017CCV < 0.2             RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01END017CCD03                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01END017CCD03                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF CO01END017CCV >= 0.2                                      RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01END017CCD04                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01END017CCD04                           RMB0002
IGUA01     END-IF.                                                      RMB0002
NUEV01*    PROMEDIO DE CUOTA PROMEDIO EN PRODUCTOS ULTIMOS 6 MESES EN CCRMB0002
NUEV01     IF CO01END018CC(1:1) = " "                                   RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01END018CCD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01END018CCD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
OPTI01     IF 0 <= CO01END018CCV AND CO01END018CCV < 0.24               RMB0004
NUEV01        AND  CO01END018CC(1:1) <> " "       *> MANEJAR EL -1      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01END018CCD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01END018CCD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01END018CCV >= 0.24                                     RMB0002
OPTI01        MOVE 1 TO HD-S1-CO01END018CCD03                           RMB0004
NUEV01     ELSE                                                         RMB0002
OPTI01        MOVE 0 TO HD-S1-CO01END018CCD03                           RMB0004
NUEV01     END-IF.                                                      RMB0002
NUEV01*    PROMEDIO DEL SALDO EN MORA PROMEDIO EN PROD CC   ULT 12 MESESRMB0002
NUEV01     IF CO01END027CC(1:1) = " "                                   RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01END027CCD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01END027CCD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0 <= CO01END027CCV AND CO01END027CCV < 0.01               RMB0002
NUEV01        AND  CO01END027CC(1:1) <> " "       *> MANEJAR EL -1      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01END027CCD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01END027CCD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0.01 <= CO01END027CCV AND CO01END027CCV < 0.06            RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01END027CCD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01END027CCD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0.06 <= CO01END027CCV AND CO01END027CCV < 0.4             RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01END027CCD04                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01END027CCD04                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01END027CCV >= 0.4                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01END027CCD05                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01END027CCD05                           RMB0002
NUEV01     END-IF.                                                      RMB0002
IGUA01*    PROMEDIO DEL SALDO EN MORA PROMEDIO EN PROD REAL ULT 12 MESESRMB0002
IGUA01     IF CO01END027OT(1:1) = " "                                   RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01END027OTD01                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01END027OTD01                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF 0 <= CO01END027OTV AND CO01END027OTV < 0.01               RMB0002
IGUA01        AND  CO01END027OT(1:1) <> " "       *> MANEJAR EL -1      RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01END027OTD02                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01END027OTD02                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF 0.01 <= CO01END027OTV AND CO01END027OTV < 0.26            RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01END027OTD03                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01END027OTD03                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF CO01END027OTV >= 0.26                                     RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01END027OTD04                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01END027OTD04                           RMB0002
IGUA01     END-IF.                                                      RMB0002
MODI01*    PROMEDIO DE SALDOS PROMEDIO EN MORA EN PRODUCTOS A LA FECHA  RMB0002
MODI01     COMPUTE HD-S1-TO01END004 = CO01END004ROV + CO01END004INV +   RMB0002
MODI01                            CO01END004VEV + CO01END004HPV +       RMB0002
MODI01                            CO01END004CCV + CO01END004OTV +       RMB0002
MODI01                            CO01END004COV .                       RMB0002
MODI01     COMPUTE HD-S1-TO01END004 = HD-S1-TO01END004 / 7 *> MEAN      RMB0002
MODI01     IF 0 <= HD-S1-TO01END004 AND HD-S1-TO01END004  <  0.01       RMB0002
MODI01        MOVE 1 TO HD-S1-TO01END004D01                             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE 0 TO HD-S1-TO01END004D01                             RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01     IF 0.01 <= HD-S1-TO01END004 AND                              RMB0002
MODI01                              HD-S1-TO01END004  < 0.0414285714    RMB0002
MODI01        MOVE 1 TO HD-S1-TO01END004D02                             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE 0 TO HD-S1-TO01END004D02                             RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01     IF 0.0414285714 <= HD-S1-TO01END004                          RMB0002
MODI01        MOVE 1 TO HD-S1-TO01END004D03                             RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE 0 TO HD-S1-TO01END004D03                             RMB0002
MODI01     END-IF.                                                      RMB0002
NUEV01*    PONDERACION DE MORAS DW 120 DIAS      ULTIMOS 12 MESES       RMB0002
NUEV01     IF CO01MOR090CC(1:1) = " "                                   RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR090CCD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR090CCD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0 <= CO01MOR090CCV AND CO01MOR090CCV <  3.79              RMB0002
NUEV01        AND CO01MOR090CC(1:1) <> " "        *> MANEJAR EL -1      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR090CCD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR090CCD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR090CCV >= 3.79                                     RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR090CCD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR090CCD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*    NUMERO DE PRODUCTOS CON APERTURA INF A 24 MESES DUR 9 MESES  RMB0002
NUEV01     IF CO01MOR022OT NOT NUMERIC                                  RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR022OTD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR022OTD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= CO01MOR022OT AND CO01MOR022OT < 0001              RMB0002
NUEV01        AND     CO01MOR022OT NUMERIC      *> MANEJAR EL -1        RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR022OTD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR022OTD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR022OT >= 0001                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR022OTD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR022OTD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
IGUA01*    PONDERACION DE MORAS DE 90 DIAS O PEOR EN ULT 24 MESES       RMB0002
IGUA01     IF CO01MOR101OT(1:1) = " "                                   RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01MOR101OTD01                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01MOR101OTD01                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF 0 <= CO01MOR101OTV AND CO01MOR101OTV <  3.55              RMB0002
IGUA01        AND CO01MOR101OT(1:1) <> " "        *> MANEJAR EL -1      RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01MOR101OTD02                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01MOR101OTD02                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF  3.55 <= CO01MOR101OTV AND CO01MOR101OTV < 90.7           RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01MOR101OTD03                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01MOR101OTD03                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF CO01MOR101OTV >= 90.7                                     RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01MOR101OTD04                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01MOR101OTD04                           RMB0002
IGUA01     END-IF.                                                      RMB0002
NUEV01*    CALCULO FINAL MINIMO RECMORA                                 RMB0002
NUEV01     PERFORM 6500-RECMORA-USAHD.                                  RMB0002
OPTI01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0004
OPTI01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0004
OPTI01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0004
OPTI01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0004
OPTI01        HD-RECMORA > 0                                            RMB0004
OPTI01        MOVE 0 TO HD-S1-RECMORA                                   RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE HD-RECMORA TO HD-S1-RECMORA                          RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     PERFORM 6500-RECMORACC-USAHD.                                RMB0004
OPTI01     IF HD-RECMORACC = 0 AND HD-S1-RECMORA > 0                    RMB0004
OPTI01        MOVE 0 TO HD-S1-RECMORA                                   RMB0004
OPTI01     END-IF.                                                      RMB0004
NUEV01     IF 0999 = HD-S1-RECMORA                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-RECMORAD01                                RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-RECMORAD01                                RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= HD-S1-RECMORA AND HD-S1-RECMORA < 0001            RMB0002
NUEV01        MOVE 1 TO HD-S1-RECMORAD02                                RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-RECMORAD02                                RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0001 <= HD-S1-RECMORA AND HD-S1-RECMORA < 0002            RMB0002
NUEV01        MOVE 1 TO HD-S1-RECMORAD03                                RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-RECMORAD03                                RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0002 <= HD-S1-RECMORA AND HD-S1-RECMORA < 0007            RMB0002
NUEV01        MOVE 1 TO HD-S1-RECMORAD04                                RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-RECMORAD04                                RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0007 <= HD-S1-RECMORA AND HD-S1-RECMORA < 0999            RMB0002
NUEV01        MOVE 1 TO HD-S1-RECMORAD05                                RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-RECMORAD05                                RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*    CALCULO FINAL MINIMO RECMORA60                               RMB0002
NUEV01     PERFORM 6500-RECMORA60-USAHD.                                RMB0002
NUEV01     MOVE HD-RECMORA60 TO HD-S1-RECMORA60.                        RMB0002
NUEV01     IF 0999 = HD-S1-RECMORA60                                    RMB0002
NUEV01        MOVE 1 TO HD-S1-RECMORA60D01                              RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-RECMORA60D01                              RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= HD-S1-RECMORA60 AND HD-S1-RECMORA60 < 0999        RMB0002
NUEV01        MOVE 1 TO HD-S1-RECMORA60D02                              RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-RECMORA60D02                              RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*    NUMERO DE PRODUCTOS EN MORA DE 120 DIAS O MAS DE CC          RMB0002
NUEV01     IF CO01MOR005CC NOT NUMERIC                                  RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR005CCD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR005CCD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= CO01MOR005CC AND CO01MOR005CC < 0001              RMB0002
NUEV01        AND     CO01MOR005CC NUMERIC      *> MANEJAR EL -1        RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR005CCD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR005CCD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR005CC >= 0001                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR005CCD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR005CCD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*    NUMERO DE PRODUCTOS DE APERTURA INFERIOR A 24 MESES          RMB0002
NUEV01     IF CO01MOR017CC NOT NUMERIC                                  RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR017CCD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR017CCD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= CO01MOR017CC AND CO01MOR017CC < 0001              RMB0002
NUEV01        AND     CO01MOR017CC NUMERIC      *> MANEJAR EL -1        RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR017CCD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR017CCD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR017CC >= 0001                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR017CCD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR017CCD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
IGUA01*    NUMERO DE PRODUCTOS CC SIEMPRE AL DIA EN LOS ULTIMOS 6 MESES RMB0002
IGUA01     IF CO01MOR033CC NOT NUMERIC                                  RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01MOR033CCD01                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01MOR033CCD01                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF 0000 <= CO01MOR033CC AND CO01MOR033CC < 0001              RMB0002
IGUA01        AND     CO01MOR033CC NUMERIC      *> MANEJAR EL -1        RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01MOR033CCD02                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01MOR033CCD02                           RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01     IF CO01MOR033CC >= 0001                                      RMB0002
IGUA01        MOVE 1 TO HD-S1-CO01MOR033CCD03                           RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        MOVE 0 TO HD-S1-CO01MOR033CCD03                           RMB0002
IGUA01     END-IF.                                                      RMB0002
NUEV01*    NUMERO DE PRODUCTOS EVER 30 EN LOS ULTIMOS 6 MESES PARA CC   RMB0002
NUEV01     IF CO01MOR034CC NOT NUMERIC                                  RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR034CCD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR034CCD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= CO01MOR034CC AND CO01MOR034CC < 0001              RMB0002
NUEV01        AND     CO01MOR034CC NUMERIC      *> MANEJAR EL -1        RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR034CCD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR034CCD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0001 <= CO01MOR034CC AND CO01MOR034CC < 0002              RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR034CCD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR034CCD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR034CC >= 0002                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR034CCD04                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR034CCD04                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*    NUMERO DE PRODUCTOS EVER 60 EN LOS ULTIMOS 6 MESES PARA CC   RMB0002
NUEV01     IF CO01MOR035OT NOT NUMERIC                                  RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR035OTD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR035OTD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= CO01MOR035OT AND CO01MOR035OT < 0001              RMB0002
NUEV01        AND     CO01MOR035OT NUMERIC      *> MANEJAR EL -1        RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR035OTD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR035OTD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR035OT >= 0001                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR035OTD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR035OTD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*    NUMERO DE PRODUCTOS EVER 90 EN LOS ULTIMOS 6 MESES PARA CC   RMB0002
NUEV01     IF CO01MOR043OT NOT NUMERIC                                  RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR043OTD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR043OTD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= CO01MOR043OT AND CO01MOR043OT < 0001              RMB0002
NUEV01        AND     CO01MOR043OT NUMERIC      *> MANEJAR EL -1        RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR043OTD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR043OTD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR043OT >= 0001                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01MOR043OTD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01MOR043OTD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
MODI01*    TOTAL OBLIGACIONES ESTADOS NEGATIVOS                         RMB0002
MODI01     IF 0000 <= CO02NUM028TO AND CO02NUM028TO < 0001              RMB0002
MODI01        AND     CO02NUM028TO NUMERIC      *> MANEJAR EL -1        RMB0002
MODI01        MOVE 1 TO HD-S1-CO02NUM028TOD01                           RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE 0 TO HD-S1-CO02NUM028TOD01                           RMB0002
MODI01     END-IF.                                                      RMB0002
MODI01     IF 0001 <= CO02NUM028TO                                      RMB0002
MODI01        MOVE 1 TO HD-S1-CO02NUM028TOD02                           RMB0002
MODI01     ELSE                                                         RMB0002
MODI01        MOVE 0 TO HD-S1-CO02NUM028TOD02                           RMB0002
MODI01     END-IF.                                                      RMB0002
NUEV01*    NUMERO DE PRODUCTOS EN ESTADOS POSITIVOS EN AHORROS          RMB0002
NUEV01     IF CO01NUM050AH NOT NUMERIC                                  RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01NUM050AHD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01NUM050AHD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF 0000 <= CO01NUM050AH AND CO01NUM050AH < 0001              RMB0002
NUEV01        AND     CO01NUM050AH NUMERIC      *> MANEJAR EL -1        RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01NUM050AHD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01NUM050AHD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01NUM050AH >= 0001                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO01NUM050AHD03                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO01NUM050AHD03                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*    NUMERO DE PRODUCTOS CASTIGADOS                               RMB0002
NUEV01     IF 0000 <= CO02NUM018TO AND CO02NUM018TO < 0001              RMB0002
NUEV01        AND     CO02NUM018TO NUMERIC      *> MANEJAR EL -1        RMB0002
NUEV01        MOVE 1 TO HD-S1-CO02NUM018TOD01                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO02NUM018TOD01                           RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO02NUM018TO >= 0001                                      RMB0002
NUEV01        MOVE 1 TO HD-S1-CO02NUM018TOD02                           RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 0 TO HD-S1-CO02NUM018TOD02                           RMB0002
NUEV01     END-IF.                                                      RMB0002
IGUA01*    EDAD BASADO EN REPORTE DE LA REGISTRADURIA                   RMB0002
IGUA01     IF CO00DEM003 < 018 OR CO00DEM003 NOT NUMERIC THEN           RMB0002
IGUA01        MOVE 018 TO HD-S1-CO00DEM003-C                            RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        IF 018 <= CO00DEM003 AND CO00DEM003  <= 065               RMB0002
IGUA01           MOVE CO00DEM003 TO HD-S1-CO00DEM003-C                  RMB0002
IGUA01        ELSE                                                      RMB0002
IGUA01           MOVE 065 TO HD-S1-CO00DEM003-C                         RMB0002
IGUA01        END-IF                                                    RMB0002
IGUA01     END-IF.                                                      RMB0002
IGUA01*    MESES DE LA APERTURA DEL PRODUCTO MAS ANTIGUO                RMB0002
IGUA01     IF CO02EXP003TO NOT NUMERIC THEN                             RMB0002
IGUA01        MOVE 000 TO HD-S1-CO02EXP003TO-C                          RMB0002
IGUA01     ELSE                                                         RMB0002
IGUA01        IF 180 <= CO02EXP003TO                                    RMB0002
IGUA01           MOVE 180 TO HD-S1-CO02EXP003TO-C                       RMB0002
IGUA01        ELSE                                                      RMB0002
IGUA01           MOVE CO02EXP003TO TO HD-S1-CO02EXP003TO-C              RMB0002
IGUA01        END-IF                                                    RMB0002
IGUA01     END-IF.                                                      RMB0002
MODI01     COMPUTE HD-S1-EXPONENTE-C      =  0.893                +     RMB0002
MODI01             -0.4403              * HD-S1-CO00DEM016D01     +     RMB0002
MODI01             +0                   * HD-S1-CO00DEM016D02     +     RMB0002
MODI01             +0.0879              * HD-S1-CO00DEM016D03     +     RMB0002
MODI01             +0                   * HD-S1-CO02END001CBD01   +     RMB0002
MODI01             -0.179               * HD-S1-CO02END001CBD02   +     RMB0002
MODI01             +0                   * HD-S1-CO02END001CBD03   +     RMB0002
OPTI01             +0                   * HD-S1-CO02END001CBD04   +     RMB0004
MODI01             +0                   * HD-S1-CO01END017CCD01   +     RMB0002
MODI01             +0.3417              * HD-S1-CO01END017CCD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01END017CCD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01END017CCD04   +     RMB0002
MODI01             +0                   * HD-S1-CO01END018CCD01   +     RMB0002
MODI01             -0.6231              * HD-S1-CO01END018CCD02   +     RMB0002
MODI01             -0.7548              * HD-S1-CO01END018CCD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01END027CCD01   +     RMB0002
MODI01             +0                   * HD-S1-CO01END027CCD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01END027CCD03   +     RMB0002
MODI01             -0.6592              * HD-S1-CO01END027CCD04   +     RMB0002
MODI01             -0.808               * HD-S1-CO01END027CCD05   +     RMB0002
MODI01             +0                   * HD-S1-CO01END027OTD01   +     RMB0002
MODI01             +0.3973              * HD-S1-CO01END027OTD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01END027OTD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01END027OTD04   +     RMB0002
MODI01             +0                   * HD-S1-TO01END004D01     +     RMB0002
MODI01             -0.4327              * HD-S1-TO01END004D02     +     RMB0002
MODI01             -0.5018              * HD-S1-TO01END004D03     +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR090CCD01   +     RMB0002
MODI01             +0.7099              * HD-S1-CO01MOR090CCD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR090CCD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR022OTD01   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR022OTD02   +     RMB0002
MODI01             -0.1913              * HD-S1-CO01MOR022OTD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR101OTD01   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR101OTD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR101OTD03   +     RMB0002
MODI01             -0.6861              * HD-S1-CO01MOR101OTD04   +     RMB0002
MODI01             +0                   * HD-S1-RECMORAD01        +     RMB0002
MODI01             -2.3669              * HD-S1-RECMORAD02        +     RMB0002
MODI01             -1.2914              * HD-S1-RECMORAD03        +     RMB0002
MODI01             +0                   * HD-S1-RECMORAD04        +     RMB0002
MODI01             +0                   * HD-S1-RECMORAD05        +     RMB0002
MODI01             +0                   * HD-S1-RECMORA60D01      +     RMB0002
MODI01             -0.2625              * HD-S1-RECMORA60D02      +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR005CCD01   +     RMB0002
MODI01             +0.1256              * HD-S1-CO01MOR005CCD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR005CCD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR017CCD01   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR017CCD02   +     RMB0002
MODI01             -0.5659              * HD-S1-CO01MOR017CCD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR033CCD01   +     RMB0002
MODI01             -0.4971              * HD-S1-CO01MOR033CCD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR033CCD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR034CCD01   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR034CCD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR034CCD03   +     RMB0002
MODI01             -0.6163              * HD-S1-CO01MOR034CCD04   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR035OTD01   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR035OTD02   +     RMB0002
MODI01             -0.7125              * HD-S1-CO01MOR035OTD03   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR043OTD01   +     RMB0002
MODI01             +0.3236              * HD-S1-CO01MOR043OTD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01MOR043OTD03   +     RMB0002
MODI01             +0                   * HD-S1-CO02NUM028TOD01   +     RMB0002
MODI01             -1.0632              * HD-S1-CO02NUM028TOD02   +     RMB0002
MODI01             +0                   * HD-S1-CO01NUM050AHD01   +     RMB0002
MODI01             +0                   * HD-S1-CO01NUM050AHD02   +     RMB0002
MODI01             +0.2277              * HD-S1-CO01NUM050AHD03   +     RMB0002
MODI01             +0                   * HD-S1-CO02NUM018TOD01   +     RMB0002
MODI01             -1.2199              * HD-S1-CO02NUM018TOD02   +     RMB0002
MODI01             +0.00997             * HD-S1-CO00DEM003-C      +     RMB0002
MODI01             +0.00275             * HD-S1-CO02EXP003TO-C    .     RMB0002
          COMPUTE HD-SCOREN = HD-S1-EXPONENTE-C.
          COMPUTE HD-SCOREN        = 
OPTI01          ((68.784667 * HD-SCOREN ) + 589.447003 ).               RMB0004
OPTI01    IF HD-SCOREN < 0  MOVE 0 TO HD-SCOREN.                        RMB0004
          COMPUTE SCORE-USAHD      = HD-SCOREN .      
          IF SCORE-USAHD <= 150 MOVE 150 TO SCORE-USAHD.   
          IF SCORE-USAHD >= 950 MOVE 950 TO SCORE-USAHD.        
       6200-SCORE-CARD2-USAHD.
REMARK*******************************************************************
REMARK*6200-SCORE-CARD2-USAHD.
REMARK*    SEGMENTO 2 PARA CLIENTES BANCARIZADOS FOCALIZADOS 
REMARK*******************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAHD(1) .
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 2
REMARK********************************************************************
           MOVE 01NUM050AH  TO CO01NUM050AH.
      *
           MOVE 01END004IN      TO CO01END004IN.
           IF CO01END004IN(9:1) = "."
              MOVE CO01END004IN(1:8)  TO CO01END004INV(1:8)
              MOVE CO01END004IN(10:2) TO CO01END004INV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END004INV
           END-IF.
      *
           MOVE 01END012OT  TO CO01END012OT.
           IF CO01END012OT(9:1) = "."
              MOVE CO01END012OT(1:8)  TO CO01END012OTV(1:8)
              MOVE CO01END012OT(10:2) TO CO01END012OTV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END012OTV
           END-IF
      *
           MOVE 01NUM049CC      TO CO01NUM049CC.
      *
           MOVE 01END089RO      TO CO01END089RO.
           IF CO01END089RO(9:1) = "."
              MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)
              MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END089ROV
           END-IF
      *
           MOVE 02END017CB  TO CO02END017CB.
           IF CO02END017CB(1:1) NUMERIC    
              MOVE CO02END017CB(1:8)  TO CO02END017CBV(1:8)
              MOVE CO02END017CB(10:2) TO CO02END017CBV(9:2)
           ELSE
              MOVE ZEROS              TO CO02END017CBV
           END-IF
      *
           MOVE 01ACP009OT  TO CO01ACP009OT.
      *    
           MOVE 01MOR080CC     TO CO01MOR080CC.
           IF CO01MOR080CC(4:1) = "."
              MOVE CO01MOR080CC(1:3)  TO CO01MOR080CCV(1:3)
              MOVE CO01MOR080CC(05:2) TO CO01MOR080CCV(4:2)
           ELSE
              MOVE ZEROS              TO CO01MOR080CCV
           END-IF.
      *
           IF 01MOR004RO(1:1) = " " MOVE ZEROS      TO CO01MOR004ROV
           ELSE                     MOVE 01MOR004RO TO CO01MOR004ROV.
           IF 01MOR004IN(1:1) = " " MOVE ZEROS      TO CO01MOR004INV
           ELSE                     MOVE 01MOR004IN TO CO01MOR004INV.
           IF 01MOR004OT(1:1) = " " MOVE ZEROS      TO CO01MOR004OTV
           ELSE                     MOVE 01MOR004OT TO CO01MOR004OTV.
           IF 01MOR004VE(1:1) = " " MOVE ZEROS      TO CO01MOR004VEV
           ELSE                     MOVE 01MOR004VE TO CO01MOR004VEV.
           IF 01MOR004CC(1:1) = " " MOVE ZEROS      TO CO01MOR004CCV
           ELSE                     MOVE 01MOR004CC TO CO01MOR004CCV.
           IF 01MOR004CO(1:1) = " " MOVE ZEROS      TO CO01MOR004COV
           ELSE                     MOVE 01MOR004CO TO CO01MOR004COV.
           IF 01MOR004HP(1:1) = " " MOVE ZEROS      TO CO01MOR004HPV
           ELSE                     MOVE 01MOR004HP TO CO01MOR004HPV.
      *    
           MOVE 01MOR071RO  TO CO01MOR071RO.
           MOVE 01MOR071IN  TO CO01MOR071IN.
           MOVE 01MOR071OT  TO CO01MOR071OT.
           MOVE 01MOR071CO  TO CO01MOR071CO.
           MOVE 01MOR071VE  TO CO01MOR071VE.
           MOVE 01MOR071CC  TO CO01MOR071CC.
           MOVE 01MOR071HP  TO CO01MOR071HP.
           IF CO01MOR071RO NUMERIC
              MOVE CO01MOR071RO TO CO01MOR071ROV
           ELSE
              MOVE ZERO         TO CO01MOR071ROV
           END-IF.
           IF CO01MOR071IN NUMERIC
              MOVE CO01MOR071IN TO CO01MOR071INV
           ELSE
              MOVE ZERO         TO CO01MOR071INV
           END-IF.
           IF CO01MOR071VE NUMERIC
              MOVE CO01MOR071VE TO CO01MOR071VEV
           ELSE
              MOVE ZERO         TO CO01MOR071VEV
           END-IF.
           IF CO01MOR071HP NUMERIC
              MOVE CO01MOR071HP TO CO01MOR071HPV
           ELSE
              MOVE ZERO         TO CO01MOR071HPV
           END-IF.
           IF CO01MOR071CC NUMERIC
              MOVE CO01MOR071CC TO CO01MOR071CCV
           ELSE
              MOVE ZERO         TO CO01MOR071CCV
           END-IF.
           IF CO01MOR071OT NUMERIC
              MOVE CO01MOR071OT TO CO01MOR071OTV
           ELSE
              MOVE ZERO         TO CO01MOR071OTV
           END-IF.
           IF CO01MOR071CO NUMERIC
              MOVE CO01MOR071CO TO CO01MOR071COV
           ELSE
              MOVE ZERO         TO CO01MOR071COV
           END-IF.
REMARK*    ESTA VARIABLE SE ACOTA A CERO POR SI LLEGA VALOR NEGATIVO
REMARK*    SEGUN USA NUNCA DEBE SUCEDER, PERO POR SI LAS MOSCAS ......
           MOVE 02EXP001TO  TO CO02EXP001TO.
           IF 02EXP001TO NUMERIC
              MOVE 02EXP001TO  TO CO02EXP001TOV
           ELSE
              MOVE ZERO        TO CO02EXP001TOV
           END-IF.
REMARK********************************************************************
REMARK*    CALCULO DE VARIABLES ACOTADAS Y DUMMYS  SEGMENTO 2
REMARK********************************************************************
      *    NUMERO DE PRODUCTOS EN ESTADOS POSITIVOS EN AHORROS       
           IF CO01NUM050AH NOT NUMERIC
              MOVE 1 TO HD-S2-CO01NUM050AHD01
           ELSE
              MOVE 0 TO HD-S2-CO01NUM050AHD01
           END-IF.
           IF 0000 <= CO01NUM050AH AND CO01NUM050AH < 0001
              AND     CO01NUM050AH NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S2-CO01NUM050AHD02
           ELSE
              MOVE 0 TO HD-S2-CO01NUM050AHD02
           END-IF.
           IF 0001 <= CO01NUM050AH AND CO01NUM050AH < 0002
              MOVE 1 TO HD-S2-CO01NUM050AHD03
           ELSE
              MOVE 0 TO HD-S2-CO01NUM050AHD03
           END-IF.
           IF CO01NUM050AH >= 0002
              MOVE 1 TO HD-S2-CO01NUM050AHD04
           ELSE
              MOVE 0 TO HD-S2-CO01NUM050AHD04
           END-IF.
      *    PROMEDIO DEL SALDO EN MORA EN PROD IN A LA FECHA           
           IF CO01END004IN(1:1) = " "
              MOVE 1 TO HD-S2-CO01END004IND01
           ELSE
              MOVE 0 TO HD-S2-CO01END004IND01
           END-IF.
           IF 0 <= CO01END004INV AND CO01END004INV < 0.1  
              AND  CO01END004IN(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S2-CO01END004IND02
           ELSE
              MOVE 0 TO HD-S2-CO01END004IND02
           END-IF.
           IF 0.1 <= CO01END004INV AND CO01END004INV < 2.22
              MOVE 1 TO HD-S2-CO01END004IND03
           ELSE
              MOVE 0 TO HD-S2-CO01END004IND03
           END-IF.
           IF CO01END004INV >= 2.22
              MOVE 1 TO HD-S2-CO01END004IND04
           ELSE
              MOVE 0 TO HD-S2-CO01END004IND04
           END-IF.
      *    PROMEDIO SALDO PROMEDIO EN PRODUCTOS DE OT ULT 3 MESES
           IF CO01END012OT(1:1) = " "
              MOVE 1 TO HD-S2-CO01END012OTD01
           ELSE
              MOVE 0 TO HD-S2-CO01END012OTD01
           END-IF.
           IF 0 <= CO01END012OTV AND CO01END012OTV < 0.19
              AND CO01END012OT(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S2-CO01END012OTD02
           ELSE
              MOVE 0 TO HD-S2-CO01END012OTD02
           END-IF.
           IF CO01END012OTV >= 0.19
              MOVE 1 TO HD-S2-CO01END012OTD03
           ELSE
              MOVE 0 TO HD-S2-CO01END012OTD03
           END-IF.
      *    NUMERO DE PRODUCTOS EN ESTADOS NEGATIVOS EN COMUNICACIONES
           IF CO01NUM049CC NOT NUMERIC
              MOVE 1 TO HD-S2-CO01NUM049CCD01
           ELSE
              MOVE 0 TO HD-S2-CO01NUM049CCD01
           END-IF.
           IF 0000 <= CO01NUM049CC AND CO01NUM049CC < 0001
              AND     CO01NUM049CC NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S2-CO01NUM049CCD02
           ELSE
              MOVE 0 TO HD-S2-CO01NUM049CCD02
           END-IF.
           IF CO01NUM049CC >= 0001
              MOVE 1 TO HD-S2-CO01NUM049CCD03
           ELSE
              MOVE 0 TO HD-S2-CO01NUM049CCD03
           END-IF.
      *    TOTAL USO PROMEDIO DE ROTATIVOS EN LOS ULTIMOS 12 MESES    
           IF CO01END089RO(1:1) = " "
              MOVE 1 TO HD-S2-CO01END089ROD01
           ELSE
              MOVE 0 TO HD-S2-CO01END089ROD01
           END-IF.
           IF 0 <= CO01END089ROV AND CO01END089ROV < 44.38
              AND  CO01END089RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S2-CO01END089ROD02
           ELSE
              MOVE 0 TO HD-S2-CO01END089ROD02
           END-IF.
           IF 44.38 <= CO01END089ROV AND CO01END089ROV < 75.32
              MOVE 1 TO HD-S2-CO01END089ROD03
           ELSE
              MOVE 0 TO HD-S2-CO01END089ROD03
           END-IF.
           IF 75.32 <= CO01END089ROV AND CO01END089ROV < 95.61
              MOVE 1 TO HD-S2-CO01END089ROD04
           ELSE
              MOVE 0 TO HD-S2-CO01END089ROD04
           END-IF.
           IF CO01END089ROV >= 95.61 
              MOVE 1 TO HD-S2-CO01END089ROD05
           ELSE
              MOVE 0 TO HD-S2-CO01END089ROD05
           END-IF.
      *    CUOTA PROMEDIO SALDO EN PRODUCTOS DE CB ULT 6 MESES
           IF CO02END017CB(1:1) NOT NUMERIC 
              MOVE 1 TO HD-S2-CO02END017CBD01
           ELSE
              MOVE 0 TO HD-S2-CO02END017CBD01
           END-IF.
           IF 0 <= CO02END017CBV AND CO02END017CBV < 9.14
              AND CO02END017CB(1:1) NUMERIC       *> MANEJAR EL -1
              MOVE 1 TO HD-S2-CO02END017CBD02
           ELSE
              MOVE 0 TO HD-S2-CO02END017CBD02
           END-IF.
           IF 9.14 <= CO02END017CBV AND CO02END017CBV < 89.85
              MOVE 1 TO HD-S2-CO02END017CBD03
           ELSE
              MOVE 0 TO HD-S2-CO02END017CBD03
           END-IF.
           IF CO02END017CBV >= 89.85 
              MOVE 1 TO HD-S2-CO02END017CBD04
           ELSE
              MOVE 0 TO HD-S2-CO02END017CBD04
           END-IF.
      *    NUMERO DE CANCELACIONES POSITIVAS DE PROD OT    EN 3 MESES
           IF CO01ACP009OT NOT NUMERIC
              MOVE 1 TO HD-S2-CO01ACP009OTD01
           ELSE
              MOVE 0 TO HD-S2-CO01ACP009OTD01
           END-IF.
           IF 0000 <= CO01ACP009OT AND CO01ACP009OT < 0001
              AND     CO01ACP009OT NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S2-CO01ACP009OTD02
           ELSE
              MOVE 0 TO HD-S2-CO01ACP009OTD02
           END-IF.
           IF CO01ACP009OT >= 0001
              MOVE 1 TO HD-S2-CO01ACP009OTD03
           ELSE
              MOVE 0 TO HD-S2-CO01ACP009OTD03
           END-IF.
      *    CALCULO FINAL MINIMO RECMORA
           PERFORM 6500-RECMORA-USAHD.
OPTI01     PERFORM 6500-RECMORACC-USAHD.                                RMB0004
OPTI01     IF HD-RECMORACC < HD-RECMORA *> EL MINIMO DE MORA Y MORACC   RMB0004
OPTI01        MOVE HD-RECMORACC TO HD-RECMORA                           RMB0004
OPTI01     END-IF                                                       RMB0004
OPTI01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0004
OPTI01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0004
OPTI01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0004
OPTI01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0004
OPTI01        HD-RECMORA > 0                                            RMB0004
OPTI01        MOVE 0 TO HD-S2-RECMORA                                   RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE HD-RECMORA TO HD-S2-RECMORA                          RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF HD-S2-RECMORA = 0                                         RMB0004
OPTI01        MOVE 1 TO HD-S2-RECMORAD01                                RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S2-RECMORAD01                                RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF 0000 < HD-S2-RECMORA AND HD-S2-RECMORA <= 0002            RMB0004
              MOVE 1 TO HD-S2-RECMORAD02       
           ELSE
              MOVE 0 TO HD-S2-RECMORAD02       
           END-IF.
OPTI01     IF 0002 < HD-S2-RECMORA AND HD-S2-RECMORA <= 0005            RMB0004
              MOVE 1 TO HD-S2-RECMORAD03       
           ELSE
              MOVE 0 TO HD-S2-RECMORAD03       
           END-IF.
OPTI01     IF 0005 < HD-S2-RECMORA AND HD-S2-RECMORA <= 0010            RMB0004
              MOVE 1 TO HD-S2-RECMORAD04       
           ELSE
              MOVE 0 TO HD-S2-RECMORAD04       
           END-IF.
OPTI01     IF HD-S2-RECMORA > 0010                                      RMB0004
              MOVE 1 TO HD-S2-RECMORAD05       
           ELSE
              MOVE 0 TO HD-S2-RECMORAD05       
           END-IF.
      *    PONDERACION DE REPORTES AL DIA EN ULTIMOS 6 MESES
           IF CO01MOR080CC(1:1) = " "
              MOVE 1 TO HD-S2-CO01MOR080CCD01
           ELSE
              MOVE 0 TO HD-S2-CO01MOR080CCD01
           END-IF.
           IF 0 <= CO01MOR080CCV AND CO01MOR080CCV <  15.53
              AND CO01MOR080CC(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S2-CO01MOR080CCD02
           ELSE
              MOVE 0 TO HD-S2-CO01MOR080CCD02
           END-IF.
           IF 15.53  <= CO01MOR080CCV AND CO01MOR080CCV < 89.81
              MOVE 1 TO HD-S2-CO01MOR080CCD03
           ELSE
              MOVE 0 TO HD-S2-CO01MOR080CCD03
           END-IF.
           IF CO01MOR080CCV >= 89.81
              MOVE 1 TO HD-S2-CO01MOR080CCD04
           ELSE
              MOVE 0 TO HD-S2-CO01MOR080CCD04
           END-IF.
      *    NUMERO DE PRODUCTOS EN MORA DE 90                  
           COMPUTE HD-S2-QTOT90 = CO01MOR004ROV + CO01MOR004INV +
                                  CO01MOR004VEV + CO01MOR004HPV +
                                  CO01MOR004CCV + CO01MOR004OTV +
                                  CO01MOR004COV .
      *    CALCULO VARIABLE EVER9048
           COMPUTE HD-S2-EVER9048   = CO01MOR071CCV + CO01MOR071ROV 
                            + CO01MOR071INV + CO01MOR071OTV 
                            + CO01MOR071COV + CO01MOR071VEV 
                            + CO01MOR071HPV .
           IF 0 <= HD-S2-EVER9048 AND HD-S2-EVER9048  <  2
              MOVE 1 TO HD-S2-EVER9048D01
           ELSE
              MOVE 0 TO HD-S2-EVER9048D01
           END-IF.
           IF 2 <= HD-S2-EVER9048 
              MOVE 1 TO HD-S2-EVER9048D02
           ELSE
              MOVE 0 TO HD-S2-EVER9048D02
           END-IF.
OPTI01     COMPUTE HD-S2-EXPONENTE-C      = -0.687310435155339    +     RMB0004
                   +0                   * HD-S2-CO01NUM050AHD01   +
                   +0                   * HD-S2-CO01NUM050AHD02   +
OPTI01             +0.0949668643306164  * HD-S2-CO01NUM050AHD03   +     RMB0004
OPTI01             +0.120011105505764   * HD-S2-CO01NUM050AHD04   +     RMB0004
                   +0                   * HD-S2-CO01END004IND01   +
OPTI01             +0.153119666761014   * HD-S2-CO01END004IND02   +     RMB0004
                   +0                   * HD-S2-CO01END004IND03   +
OPTI01             -1.58740371767762    * HD-S2-CO01END004IND04   +     RMB0004
                   +0                   * HD-S2-CO01END012OTD01   +
                   +0                   * HD-S2-CO01END012OTD02   +
OPTI01             -0.525726539018678   * HD-S2-CO01END012OTD03   +     RMB0004
                   +0                   * HD-S2-CO01NUM049CCD01   +
                   +0                   * HD-S2-CO01NUM049CCD02   +
OPTI01             -1.54131581810944    * HD-S2-CO01NUM049CCD03   +     RMB0004
                   +0                   * HD-S2-CO01END089ROD01   +
OPTI01             +0.404046663477819   * HD-S2-CO01END089ROD02   +     RMB0004
OPTI01             +0.0740434181165722  * HD-S2-CO01END089ROD03   +     RMB0004
                   +0                   * HD-S2-CO01END089ROD04   +
OPTI01             -0.562829092330773   * HD-S2-CO01END089ROD05   +     RMB0004
                   +0                   * HD-S2-CO02END017CBD01   +
OPTI01             +0.265616350953963   * HD-S2-CO02END017CBD02   +     RMB0004
                   +0                   * HD-S2-CO02END017CBD03   +
                   +0                   * HD-S2-CO02END017CBD04   +
                   +0                   * HD-S2-CO01ACP009OTD01   +
                   +0                   * HD-S2-CO01ACP009OTD02   +
OPTI01             +0.291160139691878   * HD-S2-CO01ACP009OTD03   +     RMB0004
OPTI01             -1.76331745103009    * HD-S2-RECMORAD01        +     RMB0004
                   +0                   * HD-S2-RECMORAD02        +
OPTI01             +1.03987306059893    * HD-S2-RECMORAD03        +     RMB0004
OPTI01             +1.50222460644882    * HD-S2-RECMORAD04        +     RMB0004
OPTI01             +1.79778413378043    * HD-S2-RECMORAD05        +     RMB0004
                   +0                   * HD-S2-CO01MOR080CCD01   +
                   +0                   * HD-S2-CO01MOR080CCD02   +
OPTI01             +0                   * HD-S2-CO01MOR080CCD03   +     RMB0004
OPTI01             +0.270573472023925   * HD-S2-CO01MOR080CCD04   +     RMB0004
OPTI01             -0.908174190097898   * HD-S2-QTOT90            +     RMB0004
OPTI01             +0.00158013079437067 * CO02EXP001TOV           +     RMB0004
                   +0                   * HD-S2-EVER9048D01       +
OPTI01             -0.400483012032249   * HD-S2-EVER9048D02       .     RMB0004
          COMPUTE HD-SCOREN = HD-S2-EXPONENTE-C.
          COMPUTE HD-SCOREN        = 
OPTI01            ((71.715984 * HD-SCOREN ) + 579.641970 ).             RMB0004
OPTI01    IF HD-SCOREN < 0  MOVE 0 TO HD-SCOREN.                        RMB0004
          COMPUTE SCORE-USAHD      = HD-SCOREN .      
          IF SCORE-USAHD <= 150 MOVE 150 TO SCORE-USAHD.   
          IF SCORE-USAHD >= 950 MOVE 950 TO SCORE-USAHD.        
       6300-SCORE-CARD3-USAHD.
REMARK*******************************************************************
REMARK*6300-SCORE-CARD3-USAHD.
REMARK*    SCORE CARD PARA CLIENTES SIN EXPERIENCIA, CON PORTAFOLIO
REMARK*    COMPLEJO, SIN MOROSIDADES SEVERAS
REMARK*******************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAHD(1) .
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 3
REMARK********************************************************************
           MOVE 02END025CB  TO CO02END025CB.
           IF CO02END025CB(2:1) NUMERIC  *> CARACT CON VALORES NEGATIVOS
              AND CO02END025CB(1:1) <> "-" 
              MOVE CO02END025CB(1:8)  TO CO02END025CBV(1:8)
              MOVE "0"                TO CO02END025CBV(1:1)
              MOVE CO02END025CB(10:2) TO CO02END025CBV(9:2)
           ELSE
              MOVE ZEROS              TO CO02END025CBV
           END-IF
      *
           MOVE 01MOR008CC     TO CO01MOR008CC.
      *
           MOVE 02EXP008CC      TO CO02EXP008CC.
           IF CO02EXP008CC(6:1) = "."
              MOVE CO02EXP008CC(1:5)  TO CO02EXP008CCV(1:5)
              MOVE CO02EXP008CC(07:2) TO CO02EXP008CCV(6:2)
           ELSE
              MOVE ZEROS              TO CO02EXP008CCV
           END-IF
      *
           MOVE 01EXP008CO     TO CO01EXP008CO.
           MOVE 00DEM003       TO CO00DEM003  .
           MOVE 01MOR008IN     TO CO01MOR008IN.
           MOVE 01MOR009IN     TO CO01MOR009IN. 
           MOVE 01NUM042IN     TO CO01NUM042IN.
      *
           IF 01MOR009RO(1:1) = " " MOVE ZEROS      TO CO01MOR009ROV
           ELSE                     MOVE 01MOR009RO TO CO01MOR009ROV.
           IF 01MOR009IN(1:1) = " " MOVE ZEROS      TO CO01MOR009INV
           ELSE                     MOVE 01MOR009IN TO CO01MOR009INV.
           IF 01MOR009OT(1:1) = " " MOVE ZEROS      TO CO01MOR009OTV
           ELSE                     MOVE 01MOR009OT TO CO01MOR009OTV.
           IF 01MOR009VE(1:1) = " " MOVE ZEROS      TO CO01MOR009VEV
           ELSE                     MOVE 01MOR009VE TO CO01MOR009VEV.
           IF 01MOR009CC(1:1) = " " MOVE ZEROS      TO CO01MOR009CCV
           ELSE                     MOVE 01MOR009CC TO CO01MOR009CCV.
           IF 01MOR009CO(1:1) = " " MOVE ZEROS      TO CO01MOR009COV
           ELSE                     MOVE 01MOR009CO TO CO01MOR009COV.
           IF 01MOR009HP(1:1) = " " MOVE ZEROS      TO CO01MOR009HPV
           ELSE                     MOVE 01MOR009HP TO CO01MOR009HPV.
      *
           IF 01ACP002RO(1:1) = " " MOVE ZEROS      TO CO01ACP002ROV
           ELSE                     MOVE 01ACP002RO TO CO01ACP002ROV.
           IF 01ACP002IN(1:1) = " " MOVE ZEROS      TO CO01ACP002INV
           ELSE                     MOVE 01ACP002IN TO CO01ACP002INV.
           IF 01ACP002OT(1:1) = " " MOVE ZEROS      TO CO01ACP002OTV
           ELSE                     MOVE 01ACP002OT TO CO01ACP002OTV.
           IF 01ACP002VE(1:1) = " " MOVE ZEROS      TO CO01ACP002VEV
           ELSE                     MOVE 01ACP002VE TO CO01ACP002VEV.
           IF 01ACP002CC(1:1) = " " MOVE ZEROS      TO CO01ACP002CCV
           ELSE                     MOVE 01ACP002CC TO CO01ACP002CCV.
           IF 01ACP002CO(1:1) = " " MOVE ZEROS      TO CO01ACP002COV
           ELSE                     MOVE 01ACP002CO TO CO01ACP002COV.
           IF 01ACP002HP(1:1) = " " MOVE ZEROS      TO CO01ACP002HPV
           ELSE                     MOVE 01ACP002HP TO CO01ACP002HPV.
      *
           MOVE 01END020RO      TO CO01END020RO.
           IF CO01END020RO(9:1) = "."
              MOVE CO01END020RO(1:8)  TO CO01END020ROV(1:8)
              MOVE CO01END020RO(10:2) TO CO01END020ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END020ROV
           END-IF.
      *
           MOVE 01NUM001OT  TO CO01NUM001OT.
      *
           MOVE 01END080RO      TO CO01END080RO.
           IF CO01END080RO(9:1) = "."
              MOVE CO01END080RO(1:8)  TO CO01END080ROV(1:8)
              MOVE CO01END080RO(10:2) TO CO01END080ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END080ROV
           END-IF
      *
           MOVE 01END085RO      TO CO01END085RO.
           IF CO01END085RO(9:1) = "."
              MOVE CO01END085RO(1:8)  TO CO01END085ROV(1:8)
              MOVE CO01END085RO(10:2) TO CO01END085ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END085ROV
           END-IF
      *
           MOVE 01END003RO      TO CO01END003RO.
           IF CO01END003RO(9:1) = "."
              MOVE CO01END003RO(1:8)  TO CO01END003ROV(1:8)
              MOVE CO01END003RO(10:2) TO CO01END003ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003ROV
           END-IF.
      *
           MOVE 01END003IN      TO CO01END003IN.
           IF CO01END003IN(9:1) = "."
              MOVE CO01END003IN(1:8)  TO CO01END003INV(1:8)
              MOVE CO01END003IN(10:2) TO CO01END003INV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003INV
           END-IF.
      *
           MOVE 01END003VE      TO CO01END003VE.
           IF CO01END003VE(9:1) = "."
              MOVE CO01END003VE(1:8)  TO CO01END003VEV(1:8)
              MOVE CO01END003VE(10:2) TO CO01END003VEV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003VEV
           END-IF.
      *
           MOVE 01END003HP      TO CO01END003HP.
           IF CO01END003HP(9:1) = "."
              MOVE CO01END003HP(1:8)  TO CO01END003HPV(1:8)
              MOVE CO01END003HP(10:2) TO CO01END003HPV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003HPV
           END-IF.
      *
           MOVE 01END003CC      TO CO01END003CC.
           IF CO01END003CC(9:1) = "."
              MOVE CO01END003CC(1:8)  TO CO01END003CCV(1:8)
              MOVE CO01END003CC(10:2) TO CO01END003CCV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003CCV
           END-IF.
      *
           MOVE 01END003OT      TO CO01END003OT.
           IF CO01END003OT(9:1) = "."
              MOVE CO01END003OT(1:8)  TO CO01END003OTV(1:8)
              MOVE CO01END003OT(10:2) TO CO01END003OTV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003OTV
           END-IF.
      *
           MOVE 01END003CO      TO CO01END003CO.
           IF CO01END003CO(9:1) = "."
              MOVE CO01END003CO(1:8)  TO CO01END003COV(1:8)
              MOVE CO01END003CO(10:2) TO CO01END003COV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003COV
           END-IF.
REMARK*    ESTA VARIABLE SE ACOTA A CERO POR SI LLEGA VALOR NEGATIVO
REMARK*    SEGUN USA NUNCA DEBE SUCEDER, PERO POR SI LAS MOSCAS ......
           MOVE 02EXP001TO  TO CO02EXP001TO.
           IF 02EXP001TO NUMERIC
              MOVE 02EXP001TO  TO CO02EXP001TOV
           ELSE
              MOVE ZERO        TO CO02EXP001TOV
           END-IF.
OPTI01     MOVE 01END006RO      TO CO01END006RO.                        RMB0004
OPTI01     IF CO01END006RO(9:1) = "."                                   RMB0004
OPTI01        MOVE CO01END006RO(1:8)  TO CO01END006ROV(1:8)             RMB0004
OPTI01        MOVE CO01END006RO(10:2) TO CO01END006ROV(9:2)             RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZEROS              TO CO01END006ROV                  RMB0004
OPTI01     END-IF.                                                      RMB0004
REMARK********************************************************************
REMARK*    CALCULO DE VARIABLES ACOTADAS Y DUMMYS SEGEMENTO 3
REMARK********************************************************************
      *    PORCENTAJE DE VARIACION DEL SALDO TOTAL EN LOS ULT 6 MESES
OPTI01*    IF CO02END025CB(2:1) NOT NUMERIC *> CARACT CON VALORES NEGATIRMB0004
OPTI01*       OR CO02END025CB(1:1) = "-"                                RMB0004
OPTI01*       MOVE 1 TO HD-S3-CO02END025CBD01                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S3-CO02END025CBD01                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF 0 <= CO02END025CBV AND CO02END025CBV < 51.43              RMB0004
OPTI01*       AND CO02END025CB(2:1) NUMERIC       *> MANEJAR EL VALOR NERMB0004
OPTI01*       AND CO02END025CB(1:1) <> "-"                              RMB0004
OPTI01*       MOVE 1 TO HD-S3-CO02END025CBD02                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S3-CO02END025CBD02                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF CO02END025CBV >= 51.43                                    RMB0004
OPTI01*       MOVE 1 TO HD-S3-CO02END025CBD03                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S3-CO02END025CBD03                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    MORA MAXIMA A LA FECHA EN PORTAFOLIO CC                      RMB0004
OPTI01*    IF CO01MOR008CC NOT NUMERIC                                  RMB0004
OPTI01*       MOVE 1 TO HD-S3-CO01MOR008CCD01                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S3-CO01MOR008CCD01                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF 0000 <= CO01MOR008CC AND CO01MOR008CC < 0001              RMB0004
OPTI01*       AND     CO01MOR008CC NUMERIC      *> MANEJAR EL -1        RMB0004
OPTI01*       MOVE 1 TO HD-S3-CO01MOR008CCD02                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S3-CO01MOR008CCD02                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF CO01MOR008CC >= 0001                                      RMB0004
OPTI01*       MOVE 1 TO HD-S3-CO01MOR008CCD03                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S3-CO01MOR008CCD03                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
      *    PORCENTAJE DE PRODUCTOS CC HASTA 12 MESES EN LIBROS
           IF CO02EXP008CC(1:1) = " "
              MOVE 1 TO HD-S3-CO02EXP008CCD01
           ELSE
              MOVE 0 TO HD-S3-CO02EXP008CCD01
           END-IF.
           IF 0 = CO02EXP008CCV      *> AJUSTADO DOCUMENTACION MAL
              AND CO02EXP008CC(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S3-CO02EXP008CCD02
           ELSE
              MOVE 0 TO HD-S3-CO02EXP008CCD02
           END-IF.
           IF CO02EXP008CCV >  0      *> AJUSTADO DOCUMENTACION MAL 
              MOVE 1 TO HD-S3-CO02EXP008CCD03
           ELSE
              MOVE 0 TO HD-S3-CO02EXP008CCD03
           END-IF.
      *    NUMERO DE PRODUCTOS PARA PRODUCTO CO HASTA 12 MESES EN LIBROS
           IF CO01EXP008CO NOT NUMERIC
              MOVE 1 TO HD-S3-CO01EXP008COD01
           ELSE
              MOVE 0 TO HD-S3-CO01EXP008COD01
           END-IF.
           IF 0000 <= CO01EXP008CO 
              AND     CO01EXP008CO NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S3-CO01EXP008COD02
           ELSE
              MOVE 0 TO HD-S3-CO01EXP008COD02
           END-IF.
      *    EDAD BASADO EN REPORTE DE LA REGISTRADURIA
           IF CO00DEM003 < 018 OR CO00DEM003 NOT NUMERIC THEN
              MOVE 018 TO HD-S3-CO00DEM003-C
           ELSE
              IF 018 <= CO00DEM003 AND CO00DEM003  <= 065
                 MOVE CO00DEM003 TO HD-S3-CO00DEM003-C
              ELSE
                 MOVE 065 TO HD-S3-CO00DEM003-C
              END-IF
           END-IF.
      *    MORA MAXIMA A LA FECHA EN PORTAFOLIO IN
           IF CO01MOR008IN NOT NUMERIC
              MOVE 1 TO HD-S3-CO01MOR008IND01
           ELSE
              MOVE 0 TO HD-S3-CO01MOR008IND01
           END-IF.
           IF 0000 <= CO01MOR008IN AND CO01MOR008IN < 0001
              AND     CO01MOR008IN NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S3-CO01MOR008IND02
           ELSE
              MOVE 0 TO HD-S3-CO01MOR008IND02
           END-IF.
           IF CO01MOR008IN >= 0001
              MOVE 1 TO HD-S3-CO01MOR008IND03
           ELSE
              MOVE 0 TO HD-S3-CO01MOR008IND03
           END-IF.
      *    MORA MAXIMA A HISTORICA EN PORTAFOLIO IN
           IF CO01MOR009IN NOT NUMERIC         
              MOVE 1 TO HD-S3-CO01MOR009IND01
           ELSE
              MOVE 0 TO HD-S3-CO01MOR009IND01
           END-IF.
           IF 0000 <= CO01MOR009IN AND CO01MOR009IN < 0001
              AND     CO01MOR009IN NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S3-CO01MOR009IND02
           ELSE
              MOVE 0 TO HD-S3-CO01MOR009IND02
           END-IF.
           IF CO01MOR009IN >= 0001
              MOVE 1 TO HD-S3-CO01MOR009IND03
           ELSE
              MOVE 0 TO HD-S3-CO01MOR009IND03
           END-IF.
      *    NUMERO DE PRODUCTOS CON TERMINOS 49 y 60 EN COMUNICACIONES
           IF CO01NUM042IN NOT NUMERIC
              MOVE 1 TO HD-S3-CO01NUM042IND01
           ELSE
              MOVE 0 TO HD-S3-CO01NUM042IND01
           END-IF.
           IF 0000 <= CO01NUM042IN AND CO01NUM042IN < 0001
              AND     CO01NUM042IN NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S3-CO01NUM042IND02
           ELSE
              MOVE 0 TO HD-S3-CO01NUM042IND02
           END-IF.
           IF CO01NUM042IN >= 0001
              MOVE 1 TO HD-S3-CO01NUM042IND03
           ELSE
              MOVE 0 TO HD-S3-CO01NUM042IND03
           END-IF.
      *    MORA MAXIMA HISTORICA
           MOVE CO01MOR009ROV TO HD-S3-MMAXHIST
           IF CO01MOR009INV > HD-S3-MMAXHIST
              MOVE CO01MOR009INV TO HD-S3-MMAXHIST
           END-IF.
           IF CO01MOR009OTV > HD-S3-MMAXHIST
              MOVE CO01MOR009OTV TO HD-S3-MMAXHIST
           END-IF.
           IF CO01MOR009COV > HD-S3-MMAXHIST
              MOVE CO01MOR009COV TO HD-S3-MMAXHIST
           END-IF.
           IF CO01MOR009VEV > HD-S3-MMAXHIST
              MOVE CO01MOR009VEV TO HD-S3-MMAXHIST
           END-IF.
           IF CO01MOR009CCV > HD-S3-MMAXHIST
              MOVE CO01MOR009CCV TO HD-S3-MMAXHIST
           END-IF.
           IF CO01MOR009HPV > HD-S3-MMAXHIST
              MOVE CO01MOR009HPV TO HD-S3-MMAXHIST
           END-IF.
           IF HD-S3-MMAXHIST = 0 
              MOVE 1 TO HD-S3-MMAXHISTD01
           ELSE
              MOVE 0 TO HD-S3-MMAXHISTD01
           END-IF.
           IF 0001 <= HD-S3-MMAXHIST AND HD-S3-MMAXHIST < 0002
              MOVE 1 TO HD-S3-MMAXHISTD02
           ELSE
              MOVE 0 TO HD-S3-MMAXHISTD02
           END-IF.
           IF 0002 <= HD-S3-MMAXHIST AND HD-S3-MMAXHIST < 0003
              MOVE 1 TO HD-S3-MMAXHISTD03
           ELSE
              MOVE 0 TO HD-S3-MMAXHISTD03
           END-IF.
           IF 0003 <= HD-S3-MMAXHIST AND HD-S3-MMAXHIST <= 0008
              MOVE 1 TO HD-S3-MMAXHISTD04
           ELSE
              MOVE 0 TO HD-S3-MMAXHISTD04
           END-IF.
      *   
           COMPUTE HD-S3-OPEN6  = CO01ACP002ROV + CO01ACP002INV 
                            + CO01ACP002OTV + CO01ACP002VEV 
                            + CO01ACP002CCV + CO01ACP002COV 
                            + CO01ACP002HPV .
           IF 0000 <= HD-S3-OPEN6    AND HD-S3-OPEN6    < 0001
              MOVE 1 TO HD-S3-OPEN6D01     
           ELSE
              MOVE 0 TO HD-S3-OPEN6D01     
           END-IF.
           IF 0001 <= HD-S3-OPEN6    AND HD-S3-OPEN6    < 0002
              MOVE 1 TO HD-S3-OPEN6D02     
           ELSE
              MOVE 0 TO HD-S3-OPEN6D02     
           END-IF.
           IF 0002 <= HD-S3-OPEN6    AND HD-S3-OPEN6    < 0003
              MOVE 1 TO HD-S3-OPEN6D03     
           ELSE
              MOVE 0 TO HD-S3-OPEN6D03     
           END-IF.
           IF 0003 <= HD-S3-OPEN6 
              MOVE 1 TO HD-S3-OPEN6D04     
           ELSE
              MOVE 0 TO HD-S3-OPEN6D04     
           END-IF.
      *    NUMERO DE PRODUCTOS EN PORTAFOLIO OT       
           IF CO01NUM001OT NOT NUMERIC
              MOVE 1 TO HD-S3-CO01NUM001OTD01
           ELSE
              MOVE 0 TO HD-S3-CO01NUM001OTD01
           END-IF.
           IF CO01NUM001OT >= 0001 AND CO01NUM001OT NUMERIC 
              MOVE 1 TO HD-S3-CO01NUM001OTD02
           ELSE
              MOVE 0 TO HD-S3-CO01NUM001OTD02
           END-IF.

      *    PROMEDIO DEL CUPO PROMEDIO DISPONIBLE ULT 6 MESES EN RO
           IF CO01END020RO(1:1) = " "
              MOVE 1 TO HD-S3-CO01END020ROD01
           ELSE
              MOVE 0 TO HD-S3-CO01END020ROD01
           END-IF.
           IF 0 <= CO01END020ROV AND CO01END020ROV < 0.12
              AND CO01END020RO(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S3-CO01END020ROD02
           ELSE
              MOVE 0 TO HD-S3-CO01END020ROD02
           END-IF.
           IF 0.12 <= CO01END020ROV AND CO01END020ROV < 0.39
              MOVE 1 TO HD-S3-CO01END020ROD03
           ELSE
              MOVE 0 TO HD-S3-CO01END020ROD03
           END-IF.
           IF 0.39 <= CO01END020ROV AND CO01END020ROV < 1     
              MOVE 1 TO HD-S3-CO01END020ROD04
           ELSE
              MOVE 0 TO HD-S3-CO01END020ROD04
           END-IF.
           IF CO01END020ROV >= 1    
              MOVE 1 TO HD-S3-CO01END020ROD05
           ELSE
              MOVE 0 TO HD-S3-CO01END020ROD05
           END-IF.
      *    UTILIZACION DE PRODUCTOS HACE 12 MESES                     
           IF CO01END080RO(1:1) = " "
              MOVE 1 TO HD-S3-CO01END080ROD01
           ELSE
              MOVE 0 TO HD-S3-CO01END080ROD01
           END-IF.
           IF 0 <= CO01END080ROV AND CO01END080ROV < 77.38   
              AND  CO01END080RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S3-CO01END080ROD02
           ELSE
              MOVE 0 TO HD-S3-CO01END080ROD02
           END-IF.
           IF CO01END080ROV >= 77.38   
              MOVE 1 TO HD-S3-CO01END080ROD03
           ELSE
              MOVE 0 TO HD-S3-CO01END080ROD03
           END-IF.

      *    NUMERO DE PRODUCTOS CON UTILIZACION MAYOR AL 100%
           IF CO01END085RO(1:1) = " "
              MOVE 1 TO HD-S3-CO01END085ROD01
           ELSE
              MOVE 0 TO HD-S3-CO01END085ROD01
           END-IF.
           IF 0 <= CO01END085ROV AND CO01END085ROV < 1        
              AND  CO01END085RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S3-CO01END085ROD02
           ELSE
              MOVE 0 TO HD-S3-CO01END085ROD02
           END-IF.
           IF CO01END085ROV >= 1        
              MOVE 1 TO HD-S3-CO01END085ROD03
           ELSE
              MOVE 0 TO HD-S3-CO01END085ROD03
           END-IF.
      *    SALDO TOTAl EN MORA EN PRODUCTOS A LA FECHA   
      *    AJUSTADO POR CODIFICACION MAL  0.001 
           COMPUTE HD-S3-SALDOMO    = CO01END003ROV + CO01END003INV +
                                  CO01END003VEV + CO01END003HPV +
                                  CO01END003CCV + CO01END003OTV +
                                  CO01END003COV .
           IF 0 = HD-S3-SALDOMO   
              MOVE 1 TO HD-S3-SALDOMOD01
           ELSE
              MOVE 0 TO HD-S3-SALDOMOD01
           END-IF.
           IF 0  <   HD-S3-SALDOMO    AND HD-S3-SALDOMO  < 0.4    
              MOVE 1 TO HD-S3-SALDOMOD02
           ELSE
              MOVE 0 TO HD-S3-SALDOMOD02
           END-IF.
           IF 0.4 <= HD-S3-SALDOMO   
              MOVE 1 TO HD-S3-SALDOMOD03
           ELSE
              MOVE 0 TO HD-S3-SALDOMOD03
           END-IF.
OPTI01     PERFORM 6000-QTOTAB-USAHD.                                   RMB0004
OPTI01     IF HD-QTOTAB < 2                                             RMB0004
OPTI01        MOVE 1 TO HD-S3-QTOTABD01                                 RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S3-QTOTABD01                                 RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF 2 <= HD-QTOTAB AND HD-QTOTAB < 3                          RMB0004
OPTI01        MOVE 1 TO HD-S3-QTOTABD02                                 RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S3-QTOTABD02                                 RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF 3 <= HD-QTOTAB AND HD-QTOTAB < 4                          RMB0004
OPTI01        MOVE 1 TO HD-S3-QTOTABD03                                 RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S3-QTOTABD03                                 RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF HD-QTOTAB >= 4                                            RMB0004
OPTI01        MOVE 1 TO HD-S3-QTOTABD04                                 RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S3-QTOTABD04                                 RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01*    CUOTA PROMEDIO DE PRODUCTOS A LA FECHA                       RMB0004
OPTI01     IF CO01END006RO(1:1) = " "                                   RMB0004
OPTI01        MOVE 1 TO HD-S3-CO01END006ROD01                           RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S3-CO01END006ROD01                           RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF 0 <= CO01END006ROV AND CO01END006ROV < 0.08               RMB0004
OPTI01        AND CO01END006RO(1:1) <> " "        *> MANEJAR EL -1      RMB0004
OPTI01        MOVE 1 TO HD-S3-CO01END006ROD02                           RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S3-CO01END006ROD02                           RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF 0.08 <= CO01END006ROV AND CO01END006ROV < 0.16            RMB0004
OPTI01        MOVE 1 TO HD-S3-CO01END006ROD03                           RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S3-CO01END006ROD03                           RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF CO01END006ROV >= 0.16                                     RMB0004
OPTI01        MOVE 1 TO HD-S3-CO01END006ROD04                           RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE 0 TO HD-S3-CO01END006ROD04                           RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     COMPUTE HD-S3-EXPONENTE-C      = 0.90877952206659      +     RMB0004
                   +0                   * HD-S3-CO02EXP008CCD01   +
                   +0                   * HD-S3-CO02EXP008CCD02   +
OPTI01             -0.492783931675702   * HD-S3-CO02EXP008CCD03   +     RMB0004
                   +0                   * HD-S3-CO01EXP008COD01   +
OPTI01             -0.224381219217488   * HD-S3-CO01EXP008COD02   +     RMB0004
OPTI01             +0.0150554692462039  * HD-S3-CO00DEM003-C      +     RMB0004
                   +0                   * HD-S3-CO01MOR008IND01   +
OPTI01             +0.210734252647839   * HD-S3-CO01MOR008IND02   +     RMB0004
OPTI01             +0                   * HD-S3-CO01MOR008IND03   +     RMB0004
                   +0                   * HD-S3-CO01MOR009IND01   +
OPTI01             +0                   * HD-S3-CO01MOR009IND02   +     RMB0004
OPTI01             -0.462003844750069   * HD-S3-CO01MOR009IND03   +     RMB0004
                   +0                   * HD-S3-CO01NUM042IND01   +
                   +0                   * HD-S3-CO01NUM042IND02   +
OPTI01             +0.197497551135911   * HD-S3-CO01NUM042IND03   +     RMB0004
                   +0                   * HD-S3-MMAXHISTD01       +
OPTI01             -1.34598421228623    * HD-S3-MMAXHISTD02       +     RMB0004
OPTI01             -1.96392698481601    * HD-S3-MMAXHISTD03       +     RMB0004
OPTI01             -2.34547440524126    * HD-S3-MMAXHISTD04       +     RMB0004
                   +0                   * HD-S3-OPEN6D01          +
                   +0                   * HD-S3-OPEN6D02          +
OPTI01             +0                   * HD-S3-OPEN6D03          +     RMB0004
OPTI01             -0.456803661869319   * HD-S3-OPEN6D04          +     RMB0004
                   +0                   * HD-S3-CO01NUM001OTD01   +
OPTI01             -0.232307431178125   * HD-S3-CO01NUM001OTD02   +     RMB0004
                   +0                   * HD-S3-CO01END020ROD01   +
OPTI01             -0.743609481989403   * HD-S3-CO01END020ROD02   +     RMB0004
                   +0                   * HD-S3-CO01END020ROD03   +
                   +0                   * HD-S3-CO01END020ROD04   +
OPTI01             +0.527490692805977   * HD-S3-CO01END020ROD05   +     RMB0004
                   +0                   * HD-S3-CO01END080ROD01   +
OPTI01             +0.434597194919375   * HD-S3-CO01END080ROD02   +     RMB0004
                   +0                   * HD-S3-CO01END080ROD03   +
                   +0                   * HD-S3-CO01END085ROD01   +
                   +0                   * HD-S3-CO01END085ROD02   +
OPTI01             -0.919711175500004   * HD-S3-CO01END085ROD03   +     RMB0004
                   +0                   * HD-S3-SALDOMOD01        +
OPTI01             -0.85355556945344    * HD-S3-SALDOMOD02        +     RMB0004
OPTI01             -1.65124647082393    * HD-S3-SALDOMOD03        +     RMB0004
OPTI01             +0.34092307200629    * HD-S3-QTOTABD01         +     RMB0004
OPTI01             +0                   * HD-S3-QTOTABD02         +     RMB0004
OPTI01             +0                   * HD-S3-QTOTABD03         +     RMB0004
OPTI01             +0                   * HD-S3-QTOTABD04         +     RMB0004
OPTI01             +0                   * HD-S3-CO01END006ROD01   +     RMB0004
OPTI01             +0                   * HD-S3-CO01END006ROD02   +     RMB0004
OPTI01             +0                   * HD-S3-CO01END006ROD03   +     RMB0004
OPTI01             -0.447784556294255   * HD-S3-CO01END006ROD04   +     RMB0004
OPTI01             +0.0403751042186628  * CO02EXP001TOV           .     RMB0004
          COMPUTE HD-SCOREN = HD-S3-EXPONENTE-C.
          COMPUTE HD-SCOREN        = 
OPTI01            ((64.572324 * HD-SCOREN ) + 600.404381 ).             RMB0004
OPTI01    IF HD-SCOREN < 0  MOVE 0 TO HD-SCOREN.                        RMB0004
          COMPUTE SCORE-USAHD      = HD-SCOREN .      
          IF SCORE-USAHD <= 150 MOVE 150 TO SCORE-USAHD.   
          IF SCORE-USAHD >= 950 MOVE 950 TO SCORE-USAHD.        
       6400-SCORE-CARD4-USAHD.
REMARK********************************************************************
REMARK*6400-SCORE-CARD4-USAHD.
REMARK*    SCORE CARD PARA CLIENTES CON EXPERIENCIA, CON PORTAFOLIO
REMARK*    COMPLEJO,SIN MOROSIDADES SEVERAS Y MOROSIDADES RECIENTES
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAHD(1) .
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 4
REMARK********************************************************************
REMARK*    ESTA VARIABLE SE ACOTA A CERO POR SI LLEGA VALOR NEGATIVO
REMARK*    SEGUN USA NUNCA DEBE SUCEDER, PERO POR SI LAS MOSCAS ......
           MOVE 02EXP001TO  TO CO02EXP001TO.
           IF 02EXP001TO NUMERIC
              MOVE 02EXP001TO  TO CO02EXP001TOV
           ELSE
              MOVE ZERO        TO CO02EXP001TOV
           END-IF.
      *
           MOVE 01MOR083CC     TO CO01MOR083CC.
           IF CO01MOR083CC(4:1) = "."
              MOVE CO01MOR083CC(1:3)  TO CO01MOR083CCV(1:3)
              MOVE CO01MOR083CC(05:2) TO CO01MOR083CCV(4:2)
           ELSE
              MOVE ZEROS              TO CO01MOR083CCV
           END-IF.
      *
           MOVE 01MOR056RO TO CO01MOR056RO
           IF CO01MOR056RO NUMERIC
              MOVE CO01MOR056RO TO CO01MOR056ROV
           ELSE
              MOVE ZERO         TO CO01MOR056ROV
           END-IF.
           MOVE 01MOR056IN TO CO01MOR056IN
           IF CO01MOR056IN NUMERIC
              MOVE CO01MOR056IN TO CO01MOR056INV
           ELSE
              MOVE ZERO         TO CO01MOR056INV
           END-IF.
           MOVE 01MOR056OT TO CO01MOR056OT
           IF CO01MOR056OT NUMERIC
              MOVE CO01MOR056OT TO CO01MOR056OTV
           ELSE
              MOVE ZERO         TO CO01MOR056OTV
           END-IF.
           MOVE 01MOR056CO TO CO01MOR056CO
           IF CO01MOR056CO NUMERIC
              MOVE CO01MOR056CO TO CO01MOR056COV
           ELSE
              MOVE ZERO         TO CO01MOR056COV
           END-IF.
           MOVE 01MOR056VE TO CO01MOR056VE
           IF CO01MOR056VE NUMERIC
              MOVE CO01MOR056VE TO CO01MOR056VEV
           ELSE
              MOVE ZERO         TO CO01MOR056VEV
           END-IF.
           MOVE 01MOR056CC TO CO01MOR056CC
           IF CO01MOR056CC NUMERIC
              MOVE CO01MOR056CC TO CO01MOR056CCV
           ELSE
              MOVE ZERO         TO CO01MOR056CCV
           END-IF.
           MOVE 01MOR056HP TO CO01MOR056HP
           IF CO01MOR056HP NUMERIC
              MOVE CO01MOR056HP TO CO01MOR056HPV
           ELSE
              MOVE ZERO         TO CO01MOR056HPV
           END-IF.
      *
           MOVE 01MOR098IN     TO CO01MOR098IN.
           IF CO01MOR098IN(4:1) = "."
              MOVE CO01MOR098IN(1:3)  TO CO01MOR098INV(1:3)
              MOVE CO01MOR098IN(05:2) TO CO01MOR098INV(4:2)
           ELSE
              MOVE ZEROS              TO CO01MOR098INV
           END-IF.
      *
           IF 01MOR001RO(1:1) = " " MOVE ZEROS      TO CO01MOR001ROV
           ELSE                     MOVE 01MOR001RO TO CO01MOR001ROV.
           IF 01MOR001IN(1:1) = " " MOVE ZEROS      TO CO01MOR001INV
           ELSE                     MOVE 01MOR001IN TO CO01MOR001INV.
           IF 01MOR001OT(1:1) = " " MOVE ZEROS      TO CO01MOR001OTV
           ELSE                     MOVE 01MOR001OT TO CO01MOR001OTV.
           IF 01MOR001VE(1:1) = " " MOVE ZEROS      TO CO01MOR001VEV
           ELSE                     MOVE 01MOR001VE TO CO01MOR001VEV.
           IF 01MOR001CC(1:1) = " " MOVE ZEROS      TO CO01MOR001CCV
           ELSE                     MOVE 01MOR001CC TO CO01MOR001CCV.
           IF 01MOR001CO(1:1) = " " MOVE ZEROS      TO CO01MOR001COV
           ELSE                     MOVE 01MOR001CO TO CO01MOR001COV.
           IF 01MOR001HP(1:1) = " " MOVE ZEROS      TO CO01MOR001HPV
           ELSE                     MOVE 01MOR001HP TO CO01MOR001HPV.
      *
           IF 01MOR008RO(1:1) = " " MOVE ZEROS      TO CO01MOR008ROV
           ELSE                     MOVE 01MOR008RO TO CO01MOR008ROV.
           IF 01MOR008IN(1:1) = " " MOVE ZEROS      TO CO01MOR008INV
           ELSE                     MOVE 01MOR008IN TO CO01MOR008INV.
           IF 01MOR008OT(1:1) = " " MOVE ZEROS      TO CO01MOR008OTV
           ELSE                     MOVE 01MOR008OT TO CO01MOR008OTV.
           IF 01MOR008VE(1:1) = " " MOVE ZEROS      TO CO01MOR008VEV
           ELSE                     MOVE 01MOR008VE TO CO01MOR008VEV.
           IF 01MOR008CC(1:1) = " " MOVE ZEROS      TO CO01MOR008CCV
           ELSE                     MOVE 01MOR008CC TO CO01MOR008CCV.
           IF 01MOR008CO(1:1) = " " MOVE ZEROS      TO CO01MOR008COV
           ELSE                     MOVE 01MOR008CO TO CO01MOR008COV.
           IF 01MOR008HP(1:1) = " " MOVE ZEROS      TO CO01MOR008HPV
           ELSE                     MOVE 01MOR008HP TO CO01MOR008HPV.
      *
           MOVE 01MOR008IN TO CO01MOR008IN. 
           MOVE 01MOR009VE TO CO01MOR009VE. 
           MOVE 01MOR009CO TO CO01MOR009CO. 
           MOVE 01MOR009CC TO CO01MOR009CC. 
      *
           MOVE 02NUM043CC     TO CO02NUM043CC.
           IF CO02NUM043CC(4:1) = "."
              MOVE CO02NUM043CC(1:3)  TO CO02NUM043CCV(1:3)
              MOVE CO02NUM043CC(05:2) TO CO02NUM043CCV(4:2)
           ELSE
              MOVE ZEROS              TO CO02NUM043CCV
           END-IF.
      *
           MOVE 01END017CC  TO CO01END017CC.
           IF CO01END017CC(9:1) = "."
              MOVE CO01END017CC(1:8)  TO CO01END017CCV(1:8)
              MOVE CO01END017CC(10:2) TO CO01END017CCV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END017CCV
           END-IF
      *
           MOVE 01END022CO      TO CO01END022CO.
           IF CO01END022CO(9:1) = "."
              MOVE CO01END022CO(1:8)  TO CO01END022COV(1:8)
              MOVE CO01END022CO(10:2) TO CO01END022COV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END022COV
           END-IF.
      *
           MOVE 01END027RO      TO CO01END027RO.
           IF CO01END027RO(9:1) = "."
              MOVE CO01END027RO(1:8)  TO CO01END027ROV(1:8)
              MOVE CO01END027RO(10:2) TO CO01END027ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END027ROV
           END-IF.
      *
           MOVE 01END080RO      TO CO01END080RO.
           IF CO01END080RO(9:1) = "."
              MOVE CO01END080RO(1:8)  TO CO01END080ROV(1:8)
              MOVE CO01END080RO(10:2) TO CO01END080ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END080ROV
           END-IF
      *
           MOVE 01END087RO      TO CO01END087RO.
           IF CO01END087RO(9:1) = "."
              MOVE CO01END087RO(1:8)  TO CO01END087ROV(1:8)
              MOVE CO01END087RO(10:2) TO CO01END087ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END087ROV
           END-IF
      *
           MOVE 02END018CB  TO CO02END018CB.
           IF CO02END018CB(1:1) NUMERIC      
              MOVE CO02END018CB(1:8)  TO CO02END018CBV(1:8)
              MOVE CO02END018CB(10:2) TO CO02END018CBV(9:2)
           ELSE
              MOVE ZEROS              TO CO02END018CBV
           END-IF
      *                     
           MOVE 01END003RO      TO CO01END003RO.
           IF CO01END003RO(9:1) = "."
              MOVE CO01END003RO(1:8)  TO CO01END003ROV(1:8)
              MOVE CO01END003RO(10:2) TO CO01END003ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003ROV
           END-IF.
      *
           MOVE 01END003IN      TO CO01END003IN.
           IF CO01END003IN(9:1) = "."
              MOVE CO01END003IN(1:8)  TO CO01END003INV(1:8)
              MOVE CO01END003IN(10:2) TO CO01END003INV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003INV
           END-IF.
      *
           MOVE 01END003VE      TO CO01END003VE.
           IF CO01END003VE(9:1) = "."
              MOVE CO01END003VE(1:8)  TO CO01END003VEV(1:8)
              MOVE CO01END003VE(10:2) TO CO01END003VEV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003VEV
           END-IF.
      *
           MOVE 01END003HP      TO CO01END003HP.
           IF CO01END003HP(9:1) = "."
              MOVE CO01END003HP(1:8)  TO CO01END003HPV(1:8)
              MOVE CO01END003HP(10:2) TO CO01END003HPV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003HPV
           END-IF.
      *
           MOVE 01END003CC      TO CO01END003CC.
           IF CO01END003CC(9:1) = "."
              MOVE CO01END003CC(1:8)  TO CO01END003CCV(1:8)
              MOVE CO01END003CC(10:2) TO CO01END003CCV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003CCV
           END-IF.
      *
           MOVE 01END003OT      TO CO01END003OT.
           IF CO01END003OT(9:1) = "."
              MOVE CO01END003OT(1:8)  TO CO01END003OTV(1:8)
              MOVE CO01END003OT(10:2) TO CO01END003OTV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003OTV
           END-IF.
      *
           MOVE 01END003CO      TO CO01END003CO.
           IF CO01END003CO(9:1) = "."
              MOVE CO01END003CO(1:8)  TO CO01END003COV(1:8)
              MOVE CO01END003CO(10:2) TO CO01END003COV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END003COV
           END-IF.
      *
           MOVE 01EXP006CC  TO CO01EXP006CC.
      *
           MOVE 02EXP008OT      TO CO02EXP008OT.
           IF CO02EXP008OT(6:1) = "."
              MOVE CO02EXP008OT(1:5)  TO CO02EXP008OTV(1:5)
              MOVE CO02EXP008OT(07:2) TO CO02EXP008OTV(6:2)
           ELSE
              MOVE ZEROS              TO CO02EXP008OTV
           END-IF
      *
           MOVE 01EXP006RO  TO CO01EXP006RO.
           MOVE 01EXP001IN      TO CO01EXP001IN.
           MOVE 02ACP002       TO CO02ACP002  .
           MOVE 00DEM016       TO CO00DEM016  .
REMARK********************************************************************
REMARK*    CALCULO DE VARIABLES ACOTADAS Y DUMMYS SEGMENTO 4
REMARK********************************************************************
      * MESES DESDE LA APERTURA DEL PRODUCTO MAS ANTIGUO
           IF CO02EXP001TOV >= 284  
              MOVE 284         TO CO02EXP001TOV
           END-IF.
      *    PONDERACION DE MORAS de 90 DIAS O PEOR ULTMOS 6 MESES.
           IF CO01MOR083CC(1:1) = " "
              MOVE 1 TO HD-S4-CO01MOR083CCD01
           ELSE
              MOVE 0 TO HD-S4-CO01MOR083CCD01
           END-IF.
           IF 0 <= CO01MOR083CCV AND CO01MOR083CCV <  1
              AND CO01MOR083CC(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01MOR083CCD02
           ELSE
              MOVE 0 TO HD-S4-CO01MOR083CCD02
           END-IF.
OPTI01     IF CO01MOR083CCV >= 1                                        RMB0004
OPTI01        MOVE 1 TO HD-S4-CO01MOR083CCD03                           RMB0004
           ELSE
OPTI01        MOVE 0 TO HD-S4-CO01MOR083CCD03                           RMB0004
           END-IF.
      *    CALCULO VARIABLE EVER9024
           COMPUTE HD-S4-EVER6024   = CO01MOR056CCV + CO01MOR056ROV
                            + CO01MOR056INV + CO01MOR056OTV
                            + CO01MOR056COV + CO01MOR056VEV
                            + CO01MOR056HPV .
           IF 0 <= HD-S4-EVER6024 AND HD-S4-EVER6024  <  1
              MOVE 1 TO HD-S4-EVER6024D01
           ELSE
              MOVE 0 TO HD-S4-EVER6024D01
           END-IF.
           IF 1 <= HD-S4-EVER6024 AND HD-S4-EVER6024  <  2
              MOVE 1 TO HD-S4-EVER6024D02
           ELSE
              MOVE 0 TO HD-S4-EVER6024D02
           END-IF.
OPTI01     IF 2 <= HD-S4-EVER6024                                       RMB0004
OPTI01        MOVE 1 TO HD-S4-EVER6024D03                               RMB0004
           ELSE
OPTI01        MOVE 0 TO HD-S4-EVER6024D03                               RMB0004
           END-IF.
      *    PONDERACION DE REPORTES AL DIA EN LOS ULTIMOS 24 MESES
           IF CO01MOR098IN(1:1) = " "
              MOVE 1 TO HD-S4-CO01MOR098IND01
           ELSE
              MOVE 0 TO HD-S4-CO01MOR098IND01
           END-IF.
           IF 0 <= CO01MOR098INV AND CO01MOR098INV <  69.94
              AND CO01MOR098IN(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01MOR098IND02
           ELSE
              MOVE 0 TO HD-S4-CO01MOR098IND02
           END-IF.
           IF 69.94  <= CO01MOR098INV AND CO01MOR098INV < 89.23
              MOVE 1 TO HD-S4-CO01MOR098IND03
           ELSE
              MOVE 0 TO HD-S4-CO01MOR098IND03
           END-IF.
           IF 89.23  <= CO01MOR098INV AND CO01MOR098INV < 99.14
              MOVE 1 TO HD-S4-CO01MOR098IND04
           ELSE
              MOVE 0 TO HD-S4-CO01MOR098IND04
           END-IF.
           IF CO01MOR098INV >= 99.14
              MOVE 1 TO HD-S4-CO01MOR098IND05
           ELSE
              MOVE 0 TO HD-S4-CO01MOR098IND05
           END-IF.
      *    NUMERO DE PRODUCTOS AL DIA
           COMPUTE HD-S4-QALDIA = CO01MOR001ROV + CO01MOR001INV +
                                  CO01MOR001OTV + CO01MOR001VEV +
                                  CO01MOR001CCV + CO01MOR001COV +
                                  CO01MOR001HPV .
           IF 0 <= HD-S4-QALDIA AND HD-S4-QALDIA  <  1
              MOVE 1 TO HD-S4-QALDIAD01
           ELSE
              MOVE 0 TO HD-S4-QALDIAD01
           END-IF.
           IF 1 <= HD-S4-QALDIA AND HD-S4-QALDIA  <  2
              MOVE 1 TO HD-S4-QALDIAD02
           ELSE
              MOVE 0 TO HD-S4-QALDIAD02
           END-IF.
           IF 2 <= HD-S4-QALDIA AND HD-S4-QALDIA  <  5
              MOVE 1 TO HD-S4-QALDIAD03
           ELSE
              MOVE 0 TO HD-S4-QALDIAD03
           END-IF.
           IF 5 <= HD-S4-QALDIA
              MOVE 1 TO HD-S4-QALDIAD04
           ELSE
              MOVE 0 TO HD-S4-QALDIAD04
           END-IF.
      *    MESES DESDE LA MORA MAS RECIENTE INCLUYENDO CASTIGOS
           PERFORM 6500-RECMORA-USAHD.
           MOVE HD-RECMORA TO HD-S4-RECMORACC.
           PERFORM 6500-RECMORACC-USAHD.
           IF HD-RECMORACC < HD-S4-RECMORACC *> EL MINIMO DE AMBAS
              MOVE HD-RECMORACC TO HD-S4-RECMORACC
           END-IF
OPTI01*    SE TIENE EN CUENTA EL ESTADO ACTUAL ADICIONALMENTE           RMB0004
OPTI01*    SE DA EL RESULTADO EN LA VARIABLE HD-S4-RECMORACCUSA         RMB0004
OPTI01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0004
OPTI01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0004
OPTI01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0004
OPTI01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0004
OPTI01        HD-S4-RECMORACC > 0                                       RMB0004
OPTI01        MOVE 0 TO HD-S4-RECMORACCUSA                              RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE HD-S4-RECMORACC TO HD-S4-RECMORACCUSA                RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     IF 0000 <= HD-S4-RECMORACCUSA AND HD-S4-RECMORACCUSA < 0001  RMB0004
              MOVE 1 TO HD-S4-RECMORACCD01
           ELSE
              MOVE 0 TO HD-S4-RECMORACCD01
           END-IF.
OPTI01     IF 0001 <= HD-S4-RECMORACCUSA AND HD-S4-RECMORACCUSA < 0002  RMB0004
              MOVE 1 TO HD-S4-RECMORACCD02
           ELSE
              MOVE 0 TO HD-S4-RECMORACCD02
           END-IF.
OPTI01     IF 0002 <= HD-S4-RECMORACCUSA AND HD-S4-RECMORACCUSA < 0005  RMB0004
              MOVE 1 TO HD-S4-RECMORACCD03
           ELSE
              MOVE 0 TO HD-S4-RECMORACCD03
           END-IF.
OPTI01     IF HD-S4-RECMORACCUSA >= 0005                                RMB0004
              MOVE 1 TO HD-S4-RECMORACCD04
           ELSE
              MOVE 0 TO HD-S4-RECMORACCD04
           END-IF.
      *    MAYOR MORA MAXIMA A LA FECHA
           MOVE CO01MOR008ROV TO HD-S4-MORMAX.
           IF CO01MOR008INV > HD-S4-MORMAX
              MOVE CO01MOR008INV TO HD-S4-MORMAX
           END-IF.
           IF CO01MOR008OTV > HD-S4-MORMAX
              MOVE CO01MOR008OTV TO HD-S4-MORMAX
           END-IF.
           IF CO01MOR008COV > HD-S4-MORMAX
              MOVE CO01MOR008COV TO HD-S4-MORMAX
           END-IF.
           IF CO01MOR008VEV > HD-S4-MORMAX
              MOVE CO01MOR008VEV TO HD-S4-MORMAX
           END-IF.
           IF CO01MOR008CCV > HD-S4-MORMAX
              MOVE CO01MOR008CCV TO HD-S4-MORMAX
           END-IF.
           IF CO01MOR008HPV > HD-S4-MORMAX
              MOVE CO01MOR008HPV TO HD-S4-MORMAX
           END-IF.
           IF 0000 = HD-S4-MORMAX 
              MOVE 1 TO HD-S4-MORMAXD01
           ELSE
              MOVE 0 TO HD-S4-MORMAXD01
           END-IF.
           IF 0001 <= HD-S4-MORMAX    AND HD-S4-MORMAX    < 0002
              MOVE 1 TO HD-S4-MORMAXD02
           ELSE
              MOVE 0 TO HD-S4-MORMAXD02
           END-IF.
           IF 0002 <= HD-S4-MORMAX    AND HD-S4-MORMAX    < 0003
              MOVE 1 TO HD-S4-MORMAXD03
           ELSE
              MOVE 0 TO HD-S4-MORMAXD03
           END-IF.
           IF 0003 <= HD-S4-MORMAX    AND HD-S4-MORMAX  <= 0008
              MOVE 1 TO HD-S4-MORMAXD04
           ELSE
              MOVE 0 TO HD-S4-MORMAXD04
           END-IF.
      *    MORA MAXIMA A LA FECHA EN PORTAFOLIO IN
           IF CO01MOR008IN NOT NUMERIC
              MOVE 1 TO HD-S4-CO01MOR008IND01
           ELSE
              MOVE 0 TO HD-S4-CO01MOR008IND01
           END-IF.
           IF 0000 = CO01MOR008IN 
              MOVE 1 TO HD-S4-CO01MOR008IND02
           ELSE
              MOVE 0 TO HD-S4-CO01MOR008IND02
           END-IF.
           IF 0001 <= CO01MOR008IN 
              MOVE 1 TO HD-S4-CO01MOR008IND03
           ELSE
              MOVE 0 TO HD-S4-CO01MOR008IND03
           END-IF.
      *    MORA MAXIMA HISTORICA  EN PORTAFOLIO VE
           IF CO01MOR009VE NOT NUMERIC
              MOVE 1 TO HD-S4-CO01MOR009VED01
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009VED01
           END-IF.
           IF 0000 = CO01MOR009VE 
              MOVE 1 TO HD-S4-CO01MOR009VED02
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009VED02
           END-IF.
           IF 0001 <= CO01MOR009VE AND CO01MOR009VE <= 0008
              MOVE 1 TO HD-S4-CO01MOR009VED03
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009VED03
           END-IF.
      *    MORA MAXIMA HISTORICA  EN PORTAFOLIO CO
           IF CO01MOR009CO NOT NUMERIC
              MOVE 1 TO HD-S4-CO01MOR009COD01
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009COD01
           END-IF.
           IF 0000 = CO01MOR009CO 
              MOVE 1 TO HD-S4-CO01MOR009COD02
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009COD02
           END-IF.
           IF 0001 <= CO01MOR009CO AND CO01MOR009CO < 0005
              MOVE 1 TO HD-S4-CO01MOR009COD03
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009COD03
           END-IF.
           IF 0005 <= CO01MOR009CO AND CO01MOR009CO <= 0008
              MOVE 1 TO HD-S4-CO01MOR009COD04
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009COD04
           END-IF.
      *    MORA MAXIMA HISTORICA  EN PORTAFOLIO CC
           IF CO01MOR009CC NOT NUMERIC
              MOVE 1 TO HD-S4-CO01MOR009CCD01
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009CCD01
           END-IF.
           IF 0000 = CO01MOR009CC 
              MOVE 1 TO HD-S4-CO01MOR009CCD02
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009CCD02
           END-IF.
           IF 0001 <= CO01MOR009CC AND CO01MOR009CC < 0003
              MOVE 1 TO HD-S4-CO01MOR009CCD03
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009CCD03
           END-IF.
           IF 0003 <= CO01MOR009CC AND CO01MOR009CC <= 0008
              MOVE 1 TO HD-S4-CO01MOR009CCD04
           ELSE
              MOVE 0 TO HD-S4-CO01MOR009CCD04
           END-IF.
      *    PORCENTAJE DE PRODUCTOS CERRADOS DEL TOTAL PARA CC.     
OPTI01*    IF CO02NUM043CC(1:1) = " "                                   RMB0004
OPTI01*       MOVE 1 TO HD-S4-CO02NUM043CCD01                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S4-CO02NUM043CCD01                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF 0 <= CO02NUM043CCV AND CO02NUM043CCV <  33.33             RMB0004
OPTI01*       AND CO02NUM043CC(1:1) <> " "        *> MANEJAR EL -1      RMB0004
OPTI01*       MOVE 1 TO HD-S4-CO02NUM043CCD02                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S4-CO02NUM043CCD02                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF 33.33  <= CO02NUM043CCV AND CO02NUM043CCV < 50            RMB0004
OPTI01*       MOVE 1 TO HD-S4-CO02NUM043CCD03                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S4-CO02NUM043CCD03                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF 50     <= CO02NUM043CCV AND CO02NUM043CCV < 66.66         RMB0004
OPTI01*       MOVE 1 TO HD-S4-CO02NUM043CCD04                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S4-CO02NUM043CCD04                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF CO02NUM043CCV >= 66.66                                    RMB0004
OPTI01*       MOVE 1 TO HD-S4-CO02NUM043CCD05                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S4-CO02NUM043CCD05                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
      *    CUOTA PROMEDIO SALDO EN PRODUCTOS DE CC ULT 6 MESES
           IF CO01END017CC(1:1) = " "
              MOVE 1 TO HD-S4-CO01END017CCD01
           ELSE
              MOVE 0 TO HD-S4-CO01END017CCD01
           END-IF.
           IF 0 <= CO01END017CCV AND CO01END017CCV < 0.08
              AND CO01END017CC(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01END017CCD02
           ELSE
              MOVE 0 TO HD-S4-CO01END017CCD02
           END-IF.
           IF CO01END017CCV >= 0.08
              MOVE 1 TO HD-S4-CO01END017CCD03
           ELSE
              MOVE 0 TO HD-S4-CO01END017CCD03
           END-IF.
      *    PROMEDIO DEL SALDO PROMEDIO EN MORA    ULT 9 MESES EN CO
           IF CO01END022CO(1:1) = " "
              MOVE 1 TO HD-S4-CO01END022COD01
           ELSE
              MOVE 0 TO HD-S4-CO01END022COD01
           END-IF.
           IF 0 <= CO01END022COV AND CO01END022COV < 0.08
              AND CO01END022CO(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01END022COD02
           ELSE
              MOVE 0 TO HD-S4-CO01END022COD02
           END-IF.
           IF 0.08 <= CO01END022COV AND CO01END022COV < 0.69
              MOVE 1 TO HD-S4-CO01END022COD03
           ELSE
              MOVE 0 TO HD-S4-CO01END022COD03
           END-IF.
           IF CO01END022COV >= 0.69
              MOVE 1 TO HD-S4-CO01END022COD04
           ELSE
              MOVE 0 TO HD-S4-CO01END022COD04
           END-IF.
OPTI01*    PROMEDIO DEL SALDO PROMEDIO EN MORA  ULT 12 MESES EN RO      RMB0004
OPTI01*    IF CO01END027RO(1:1) = " "                                   RMB0004
OPTI01*       MOVE 1 TO HD-S4-CO01END027ROD01                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S4-CO01END027ROD01                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF 0 <= CO01END027ROV AND CO01END027ROV < 0.05               RMB0004
OPTI01*       AND CO01END027RO(1:1) <> " "        *> MANEJAR EL -1      RMB0004
OPTI01*       MOVE 1 TO HD-S4-CO01END027ROD02                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S4-CO01END027ROD02                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF CO01END027ROV >= 0.05                                     RMB0004
OPTI01*       MOVE 1 TO HD-S4-CO01END027ROD03                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S4-CO01END027ROD03                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
      *    UTILIZACION DE PRODUCTOS HACE 12 MESES PARA RO
           IF CO01END080RO(1:1) = " "
              MOVE 1 TO HD-S4-CO01END080ROD01
           ELSE
              MOVE 0 TO HD-S4-CO01END080ROD01
           END-IF.
           IF 0 <= CO01END080ROV AND CO01END080ROV < 30.07
              AND  CO01END080RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01END080ROD02
           ELSE
              MOVE 0 TO HD-S4-CO01END080ROD02
           END-IF.
           IF 30.07 <= CO01END080ROV AND CO01END080ROV < 62.33
              MOVE 1 TO HD-S4-CO01END080ROD03
           ELSE
              MOVE 0 TO HD-S4-CO01END080ROD03
           END-IF.
           IF 62.33 <= CO01END080ROV AND CO01END080ROV < 87.29
              MOVE 1 TO HD-S4-CO01END080ROD04
           ELSE
              MOVE 0 TO HD-S4-CO01END080ROD04
           END-IF.
           IF CO01END080ROV >= 87.29
              MOVE 1 TO HD-S4-CO01END080ROD05
           ELSE
              MOVE 0 TO HD-S4-CO01END080ROD05
           END-IF.
      *    UTILIZACION TOTAL DE PRODUCTOS ULT 6 MESES PARA RO
           IF CO01END087RO(1:1) = " "
              MOVE 1 TO HD-S4-CO01END087ROD01
           ELSE
              MOVE 0 TO HD-S4-CO01END087ROD01
           END-IF.
           IF 0 <= CO01END087ROV AND CO01END087ROV < 37.35
              AND  CO01END087RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01END087ROD02
           ELSE
              MOVE 0 TO HD-S4-CO01END087ROD02
           END-IF.
           IF 37.35 <= CO01END087ROV AND CO01END087ROV < 67.23
              MOVE 1 TO HD-S4-CO01END087ROD03
           ELSE
              MOVE 0 TO HD-S4-CO01END087ROD03
           END-IF.
           IF 67.23 <= CO01END087ROV AND CO01END087ROV < 88.57
              MOVE 1 TO HD-S4-CO01END087ROD04
           ELSE
              MOVE 0 TO HD-S4-CO01END087ROD04
           END-IF.
           IF CO01END087ROV >= 88.57
              MOVE 1 TO HD-S4-CO01END087ROD05
           ELSE
              MOVE 0 TO HD-S4-CO01END087ROD05
           END-IF.
      *    PORCENTAJE DE CARTERA VENCIDA HACE 9 MESES          
           IF CO02END018CB(1:1) NOT NUMERIC 
              MOVE 1 TO HD-S4-CO02END018CBD01
           ELSE
              MOVE 0 TO HD-S4-CO02END018CBD01
           END-IF.
           IF 0 <= CO02END018CBV AND CO02END018CBV < 0.74 
              AND CO02END018CB(1:1) NUMERIC       *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO02END018CBD02
           ELSE
              MOVE 0 TO HD-S4-CO02END018CBD02
           END-IF.
           IF CO02END018CBV >= 0.74     
              MOVE 1 TO HD-S4-CO02END018CBD03
           ELSE
              MOVE 0 TO HD-S4-CO02END018CBD03
           END-IF.
      *    SALDO TOTAl EN MORA EN PRODUCTOS A LA FECHA
           COMPUTE HD-S4-SALDOMO    = CO01END003ROV + CO01END003INV +
                                  CO01END003VEV + CO01END003HPV +
                                  CO01END003OTV +  *>OJO SOLO 6 CAR
                                  CO01END003COV .  *>LA OTRA TOMA 7
           IF 0  <=   HD-S4-SALDOMO    AND HD-S4-SALDOMO  < 0.01
              MOVE 1 TO HD-S4-SALDOMOD01
           ELSE
              MOVE 0 TO HD-S4-SALDOMOD01
           END-IF.
           IF 0.01 <=  HD-S4-SALDOMO    AND HD-S4-SALDOMO  < 0.18
              MOVE 1 TO HD-S4-SALDOMOD02
           ELSE
              MOVE 0 TO HD-S4-SALDOMOD02
           END-IF.
           IF 0.18 <=  HD-S4-SALDOMO    AND HD-S4-SALDOMO  < 0.55
              MOVE 1 TO HD-S4-SALDOMOD03
           ELSE
              MOVE 0 TO HD-S4-SALDOMOD03
           END-IF.
           IF 0.55 <=  HD-S4-SALDOMO    AND HD-S4-SALDOMO  < 1.49
              MOVE 1 TO HD-S4-SALDOMOD04
           ELSE
              MOVE 0 TO HD-S4-SALDOMOD04
           END-IF.
           IF 1.49 <= HD-S4-SALDOMO
              MOVE 1 TO HD-S4-SALDOMOD05
           ELSE
              MOVE 0 TO HD-S4-SALDOMOD05
           END-IF.
      *    EDAD PROMEDIO DEL PORTAFOLIO DE PRODUCTOS ABIERTOS PARA CC
           IF CO01EXP006CC NOT NUMERIC
              MOVE 1 TO HD-S4-CO01EXP006CCD01
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006CCD01
           END-IF.
           IF 000 <= CO01EXP006CC AND CO01EXP006CC < 012
              AND     CO01EXP006CC NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01EXP006CCD02
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006CCD02
           END-IF.
           IF 012 <= CO01EXP006CC AND CO01EXP006CC < 024
              MOVE 1 TO HD-S4-CO01EXP006CCD03
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006CCD03
           END-IF.
           IF 024 <= CO01EXP006CC AND CO01EXP006CC < 036
              MOVE 1 TO HD-S4-CO01EXP006CCD04
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006CCD04
           END-IF.
           IF CO01EXP006CC >= 036
              MOVE 1 TO HD-S4-CO01EXP006CCD05
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006CCD05
           END-IF.
      *    PORCENTAJE DE PRODUCTOS OT HASTA 12 MESES EN LIBROS
           IF CO02EXP008OT(1:1) = " "
              MOVE 1 TO HD-S4-CO02EXP008OTD01
           ELSE
              MOVE 0 TO HD-S4-CO02EXP008OTD01
           END-IF.
           IF 0 = CO02EXP008OTV      
              AND CO02EXP008OT(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO02EXP008OTD02
           ELSE
              MOVE 0 TO HD-S4-CO02EXP008OTD02
           END-IF.
           IF CO02EXP008OTV >  0      *> AJUSTADO DOCUMENTACION MAL
              MOVE 1 TO HD-S4-CO02EXP008OTD03
           ELSE
              MOVE 0 TO HD-S4-CO02EXP008OTD03
           END-IF.
      *    EDAD PROMEDIO DEL PORTAFOLIO DE PRODUCTOS ABIERTOS PARA RO
           IF CO01EXP006RO NOT NUMERIC
              MOVE 1 TO HD-S4-CO01EXP006ROD01
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006ROD01
           END-IF.
           IF 000 <= CO01EXP006RO AND CO01EXP006RO < 012
              AND     CO01EXP006RO NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01EXP006ROD02
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006ROD02
           END-IF.
           IF 012 <= CO01EXP006RO AND CO01EXP006RO < 024
              MOVE 1 TO HD-S4-CO01EXP006ROD03
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006ROD03
           END-IF.
           IF CO01EXP006RO >= 024
              MOVE 1 TO HD-S4-CO01EXP006ROD04
           ELSE
              MOVE 0 TO HD-S4-CO01EXP006ROD04
           END-IF.
      *    MESES DESDE LA APERTURA DEL IN      MAS ANTIGUO
           IF CO01EXP001IN NOT NUMERIC
              MOVE 1 TO HD-S4-CO01EXP001IND01
           ELSE
              MOVE 0 TO HD-S4-CO01EXP001IND01
           END-IF.
           IF 000 <= CO01EXP001IN AND CO01EXP001IN < 025
              AND    CO01EXP001IN NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO01EXP001IND02
           ELSE
              MOVE 0 TO HD-S4-CO01EXP001IND02
           END-IF.
           IF 025 <= CO01EXP001IN AND CO01EXP001IN < 057
              MOVE 1 TO HD-S4-CO01EXP001IND03
           ELSE
              MOVE 0 TO HD-S4-CO01EXP001IND03
           END-IF.
           IF 057 <= CO01EXP001IN AND CO01EXP001IN < 117
              MOVE 1 TO HD-S4-CO01EXP001IND04
           ELSE
              MOVE 0 TO HD-S4-CO01EXP001IND04
           END-IF.
           IF CO01EXP001IN >= 117
              MOVE 1 TO HD-S4-CO01EXP001IND05
           ELSE
              MOVE 0 TO HD-S4-CO01EXP001IND05
           END-IF.
      *    MESES DESDE LA CANCELACION POSITIVA MAS RECIENTE
           IF CO02ACP002 NOT NUMERIC
              MOVE 1 TO HD-S4-CO02ACP002D01
           ELSE
              MOVE 0 TO HD-S4-CO02ACP002D01
           END-IF.
           IF 0000 <= CO02ACP002 AND CO02ACP002 < 0002
              AND     CO02ACP002 NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S4-CO02ACP002D02
           ELSE
              MOVE 0 TO HD-S4-CO02ACP002D02
           END-IF.
           IF 0002 <= CO02ACP002 AND CO02ACP002 < 0007
              MOVE 1 TO HD-S4-CO02ACP002D03
           ELSE
              MOVE 0 TO HD-S4-CO02ACP002D03
           END-IF.
           IF 0007 <= CO02ACP002 AND CO02ACP002 < 0020
              MOVE 1 TO HD-S4-CO02ACP002D04
           ELSE
              MOVE 0 TO HD-S4-CO02ACP002D04
           END-IF.
           IF CO02ACP002 >= 0020
              MOVE 1 TO HD-S4-CO02ACP002D05
           ELSE
              MOVE 0 TO HD-S4-CO02ACP002D05
           END-IF.
      *    DEPARTAMENTO DE EXPEDICION DE LA CEDULA
           IF (CO00DEM016 =  21 OR 03 OR 12 OR 48 OR 28 OR 05 OR 13)
              MOVE 1 TO HD-S4-CO00DEM016D01
           ELSE
              MOVE 0 TO HD-S4-CO00DEM016D01
           END-IF.
           IF CO00DEM016 NOT NUMERIC OR
              (CO00DEM016 = 50 OR 60 OR 17 OR 11 OR 54 OR 44 OR 52 OR 
                            46 OR 29 OR 56 OR 23 OR 64 OR 27 OR 19 OR
                            40 OR 68 OR 72)
              MOVE 1 TO HD-S4-CO00DEM016D02
           ELSE
              MOVE 0 TO HD-S4-CO00DEM016D02
           END-IF.
           IF (CO00DEM016 = 31 OR 15 OR 25 OR 24 OR 09 OR 26 OR 01 OR
                            07)             
              MOVE 1 TO HD-S4-CO00DEM016D03
           ELSE
              MOVE 0 TO HD-S4-CO00DEM016D03
           END-IF.
OPTI01     COMPUTE HD-S4-EXPONENTE-C      = 0.44091207312642      +     RMB0004
OPTI01             +0.00245917709975207 * CO02EXP001TOV           +     RMB0004
                   +0                   * HD-S4-CO01MOR083CCD01   +
                   +0                   * HD-S4-CO01MOR083CCD02   +
OPTI01             -0.103816291401002   * HD-S4-CO01MOR083CCD03   +     RMB0004
                   +0                   * HD-S4-EVER6024D01       +
                   +0                   * HD-S4-EVER6024D02       +
OPTI01             -0.751566677942849   * HD-S4-EVER6024D03       +     RMB0004
                   +0                   * HD-S4-CO01MOR098IND01   +
                   +0                   * HD-S4-CO01MOR098IND02   +
                   +0                   * HD-S4-CO01MOR098IND03   +
OPTI01             +0                   * HD-S4-CO01MOR098IND04   +     RMB0004
OPTI01             +0.14257048929448    * HD-S4-CO01MOR098IND05   +     RMB0004
OPTI01             -0.357616499672217   * HD-S4-QALDIAD01         +     RMB0004
                   +0                   * HD-S4-QALDIAD02         +
                   +0                   * HD-S4-QALDIAD03         +
                   +0                   * HD-S4-QALDIAD04         +
                   +0                   * HD-S4-RECMORACCD01      +
                   +0                   * HD-S4-RECMORACCD02      +
                   +0                   * HD-S4-RECMORACCD03      +
OPTI01             +0.84779837422091    * HD-S4-RECMORACCD04      +     RMB0004
                   +0                   * HD-S4-MORMAXD01         +
                   +0                   * HD-S4-MORMAXD02         +
OPTI01             -1.61423706876104    * HD-S4-MORMAXD03         +     RMB0004
OPTI01             -2.31650699035707    * HD-S4-MORMAXD04         +     RMB0004
                   +0                   * HD-S4-CO01MOR008IND01   +
                   +0                   * HD-S4-CO01MOR008IND02   +
OPTI01             -0.696535508107526   * HD-S4-CO01MOR008IND03   +     RMB0004
                   +0                   * HD-S4-CO01MOR009VED01   +
                   +0                   * HD-S4-CO01MOR009VED02   +
OPTI01             -0.457773631655222   * HD-S4-CO01MOR009VED03   +     RMB0004
                   +0                   * HD-S4-CO01MOR009COD01   +
OPTI01             +0.0614591072800547  * HD-S4-CO01MOR009COD02   +     RMB0004
                   +0                   * HD-S4-CO01MOR009COD03   +
                   +0                   * HD-S4-CO01MOR009COD04   +
                   +0                   * HD-S4-CO01MOR009CCD01   +
OPTI01             +0.198850445829027   * HD-S4-CO01MOR009CCD02   +     RMB0004
                   +0                   * HD-S4-CO01MOR009CCD03   +
                   +0                   * HD-S4-CO01MOR009CCD04   +
                   +0                   * HD-S4-CO01END017CCD01   +
                   +0                   * HD-S4-CO01END017CCD02   +
OPTI01             -0.390179751031714   * HD-S4-CO01END017CCD03   +     RMB0004
                   +0                   * HD-S4-CO01END022COD01   +
                   +0                   * HD-S4-CO01END022COD02   +
                   +0                   * HD-S4-CO01END022COD03   +
OPTI01             -0.478694481644643   * HD-S4-CO01END022COD04   +     RMB0004
                   +0                   * HD-S4-CO01END080ROD01   +
OPTI01             +0.10482393350723    * HD-S4-CO01END080ROD02   +     RMB0004
                   +0                   * HD-S4-CO01END080ROD03   +
                   +0                   * HD-S4-CO01END080ROD04   +
OPTI01             +0                   * HD-S4-CO01END080ROD05   +     RMB0004
                   +0                   * HD-S4-CO01END087ROD01   +
OPTI01             +0.558026071201328   * HD-S4-CO01END087ROD02   +     RMB0004
OPTI01             +0.231585101637374   * HD-S4-CO01END087ROD03   +     RMB0004
                   +0                   * HD-S4-CO01END087ROD04   +
OPTI01             -0.418658416246951   * HD-S4-CO01END087ROD05   +     RMB0004
                   +0                   * HD-S4-CO02END018CBD01   +
OPTI01             +0.0940887733704908  * HD-S4-CO02END018CBD02   +     RMB0004
                   +0                   * HD-S4-CO02END018CBD03   +
OPTI01             +0                   * HD-S4-SALDOMOD01        +     RMB0004
                   +0                   * HD-S4-SALDOMOD02        +
                   +0                   * HD-S4-SALDOMOD03        +
                   +0                   * HD-S4-SALDOMOD04        +
OPTI01             -0.660760531515201   * HD-S4-SALDOMOD05        +     RMB0004
                   +0                   * HD-S4-CO01EXP006CCD01   +
OPTI01             -0.482468151025489   * HD-S4-CO01EXP006CCD02   +     RMB0004
                   +0                   * HD-S4-CO01EXP006CCD03   +
                   +0                   * HD-S4-CO01EXP006CCD04   +
                   +0                   * HD-S4-CO01EXP006CCD05   +
                   +0                   * HD-S4-CO02EXP008OTD01   +
                   +0                   * HD-S4-CO02EXP008OTD02   +
OPTI01             -0.360043377681863   * HD-S4-CO02EXP008OTD03   +     RMB0004
                   +0                   * HD-S4-CO01EXP006ROD01   +
OPTI01             -0.424782115797859   * HD-S4-CO01EXP006ROD02   +     RMB0004
                   +0                   * HD-S4-CO01EXP006ROD03   +
                   +0                   * HD-S4-CO01EXP006ROD04   +
                   +0                   * HD-S4-CO01EXP001IND01   +
OPTI01             -0.187938628903349   * HD-S4-CO01EXP001IND02   +     RMB0004
                   +0                   * HD-S4-CO01EXP001IND03   +
                   +0                   * HD-S4-CO01EXP001IND04   +
                   +0                   * HD-S4-CO01EXP001IND05   +
                   +0                   * HD-S4-CO02ACP002D01     +
OPTI01             +0.140033302135679   * HD-S4-CO02ACP002D02     +     RMB0004
OPTI01             +0                   * HD-S4-CO02ACP002D03     +     RMB0004
                   +0                   * HD-S4-CO02ACP002D04     +
                   +0                   * HD-S4-CO02ACP002D05     +
OPTI01             -0.38602731908189    * HD-S4-CO00DEM016D01     +     RMB0004
                   +0                   * HD-S4-CO00DEM016D02     +
                   +0                   * HD-S4-CO00DEM016D03     .
          COMPUTE HD-SCOREN = HD-S4-EXPONENTE-C.
          COMPUTE HD-SCOREN        = 
OPTI01            ((69.596510 * HD-SCOREN ) + 579.461647 ).             RMB0004
OPTI01    IF HD-SCOREN < 0  MOVE 0 TO HD-SCOREN.                        RMB0004
          COMPUTE SCORE-USAHD      = HD-SCOREN .      
          IF SCORE-USAHD <= 150 MOVE 150 TO SCORE-USAHD.   
          IF SCORE-USAHD >= 950 MOVE 950 TO SCORE-USAHD.        
       6500-SCORE-CARD5-USAHD.
REMARK********************************************************************
REMARK*6500-SCORE-CARD5-USAHD.
REMARK*    SCORE CARD PARA CLIENTES CON EXPERIENCIA, CON PORTAFOLIO 
REMARK*    COMPLEJO, SIN MOROSIDADES SEVERAS NI RECIENTES Y APERTURAS
REMARK*    EN EL ULTIMO SEMESTRE.
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAHD(1) .
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGEMENTO 5
REMARK********************************************************************
           MOVE 00DEM003       TO CO00DEM003  .
           MOVE 00DEM016       TO CO00DEM016  .
           MOVE 02ACP002       TO CO02ACP002  .
      *
           MOVE 02END019CB  TO CO02END019CB.
           IF CO02END019CB(1:1) NUMERIC  
              MOVE CO02END019CB(1:8)  TO CO02END019CBV(1:8)
              MOVE CO02END019CB(10:2) TO CO02END019CBV(9:2)
           ELSE
              MOVE ZEROS              TO CO02END019CBV
           END-IF
      *
           MOVE 02NUM043CB     TO CO02NUM043CB.
           IF CO02NUM043CB(4:1) = "."
              MOVE CO02NUM043CB(1:3)  TO CO02NUM043CBV(1:3)
              MOVE CO02NUM043CB(05:2) TO CO02NUM043CBV(4:2)
           ELSE
              MOVE ZEROS              TO CO02NUM043CBV
           END-IF.
      *
           MOVE 01END017CC  TO CO01END017CC.
           IF CO01END017CC(9:1) = "."
              MOVE CO01END017CC(1:8)  TO CO01END017CCV(1:8)
              MOVE CO01END017CC(10:2) TO CO01END017CCV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END017CCV
           END-IF
      *
           MOVE 01EXP001CC      TO CO01EXP001CC.
      *
           MOVE 01END007CO      TO CO01END007CO.
           IF CO01END007CO(9:1) = "."
              MOVE CO01END007CO(1:8)  TO CO01END007COV(1:8)
              MOVE CO01END007CO(10:2) TO CO01END007COV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END007COV
           END-IF.
      *
           MOVE 01END021CO      TO CO01END021CO.
           IF CO01END021CO(9:1) = "."
              MOVE CO01END021CO(1:8)  TO CO01END021COV(1:8)
              MOVE CO01END021CO(10:2) TO CO01END021COV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END021COV
           END-IF.
      *
           MOVE 01EXP006CT  TO CO01EXP006CT.
      *
           MOVE 01MOR055RO TO CO01MOR055RO
           IF CO01MOR055RO NUMERIC
              MOVE CO01MOR055RO TO CO01MOR055ROV
           ELSE
              MOVE ZERO         TO CO01MOR055ROV
           END-IF.
           MOVE 01MOR055IN TO CO01MOR055IN
           IF CO01MOR055IN NUMERIC
              MOVE CO01MOR055IN TO CO01MOR055INV
           ELSE
              MOVE ZERO         TO CO01MOR055INV
           END-IF.
           MOVE 01MOR055OT TO CO01MOR055OT
           IF CO01MOR055OT NUMERIC
              MOVE CO01MOR055OT TO CO01MOR055OTV
           ELSE
              MOVE ZERO         TO CO01MOR055OTV
           END-IF.
           MOVE 01MOR055CO TO CO01MOR055CO
           IF CO01MOR055CO NUMERIC
              MOVE CO01MOR055CO TO CO01MOR055COV
           ELSE
              MOVE ZERO         TO CO01MOR055COV
           END-IF.
           MOVE 01MOR055VE TO CO01MOR055VE
           IF CO01MOR055VE NUMERIC
              MOVE CO01MOR055VE TO CO01MOR055VEV
           ELSE
              MOVE ZERO         TO CO01MOR055VEV
           END-IF.
           MOVE 01MOR055CC TO CO01MOR055CC
           IF CO01MOR055CC NUMERIC
              MOVE CO01MOR055CC TO CO01MOR055CCV
           ELSE
              MOVE ZERO         TO CO01MOR055CCV
           END-IF.
           MOVE 01MOR055HP TO CO01MOR055HP
           IF CO01MOR055HP NUMERIC
              MOVE CO01MOR055HP TO CO01MOR055HPV
           ELSE
              MOVE ZERO         TO CO01MOR055HPV
           END-IF.
      *
           MOVE 01END018IN  TO CO01END018IN.
           IF CO01END018IN(9:1) = "."
              MOVE CO01END018IN(1:8)  TO CO01END018INV(1:8)
              MOVE CO01END018IN(10:2) TO CO01END018INV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END018INV
           END-IF
      *
           MOVE 01MOR068IN     TO CO01MOR068IN.
           MOVE 01NUM002IN     TO CO01NUM002IN.
      *
           MOVE 01EXP007RO TO CO01EXP007RO
           IF CO01EXP007RO NUMERIC
              MOVE CO01EXP007RO TO CO01EXP007ROV
           ELSE
              MOVE ZERO         TO CO01EXP007ROV
           END-IF.
           MOVE 01EXP007IN TO CO01EXP007IN
           IF CO01EXP007IN NUMERIC
              MOVE CO01EXP007IN TO CO01EXP007INV
           ELSE
              MOVE ZERO         TO CO01EXP007INV
           END-IF.
           MOVE 01EXP007OT TO CO01EXP007OT
           IF CO01EXP007OT NUMERIC
              MOVE CO01EXP007OT TO CO01EXP007OTV
           ELSE
              MOVE ZERO         TO CO01EXP007OTV
           END-IF.
           MOVE 01EXP007CO TO CO01EXP007CO
           IF CO01EXP007CO NUMERIC
              MOVE CO01EXP007CO TO CO01EXP007COV
           ELSE
              MOVE ZERO         TO CO01EXP007COV
           END-IF.
           MOVE 01EXP007VE TO CO01EXP007VE
           IF CO01EXP007VE NUMERIC
              MOVE CO01EXP007VE TO CO01EXP007VEV
           ELSE
              MOVE ZERO         TO CO01EXP007VEV
           END-IF.
           MOVE 01EXP007CC TO CO01EXP007CC
           IF CO01EXP007CC NUMERIC
              MOVE CO01EXP007CC TO CO01EXP007CCV
           ELSE
              MOVE ZERO         TO CO01EXP007CCV
           END-IF.
           MOVE 01EXP007HP TO CO01EXP007HP
           IF CO01EXP007HP NUMERIC
              MOVE CO01EXP007HP TO CO01EXP007HPV
           ELSE
              MOVE ZERO         TO CO01EXP007HPV
           END-IF.
      *
           IF 01ACP003RO(1:1) = " " MOVE ZEROS      TO CO01ACP003ROV
           ELSE                     MOVE 01ACP003RO TO CO01ACP003ROV.
           IF 01ACP003IN(1:1) = " " MOVE ZEROS      TO CO01ACP003INV
           ELSE                     MOVE 01ACP003IN TO CO01ACP003INV.
           IF 01ACP003OT(1:1) = " " MOVE ZEROS      TO CO01ACP003OTV
           ELSE                     MOVE 01ACP003OT TO CO01ACP003OTV.
           IF 01ACP003VE(1:1) = " " MOVE ZEROS      TO CO01ACP003VEV
           ELSE                     MOVE 01ACP003VE TO CO01ACP003VEV.
           IF 01ACP003CC(1:1) = " " MOVE ZEROS      TO CO01ACP003CCV
           ELSE                     MOVE 01ACP003CC TO CO01ACP003CCV.
           IF 01ACP003CO(1:1) = " " MOVE ZEROS      TO CO01ACP003COV
           ELSE                     MOVE 01ACP003CO TO CO01ACP003COV.
           IF 01ACP003HP(1:1) = " " MOVE ZEROS      TO CO01ACP003HPV
           ELSE                     MOVE 01ACP003HP TO CO01ACP003HPV.
      *
           MOVE 01EXP003OT      TO CO01EXP003OT.
           MOVE 01ACP001RO      TO CO01ACP001RO.
      *
           MOVE 01END030RO      TO CO01END030RO.
           IF CO01END030RO(9:1) = "."
              MOVE CO01END030RO(1:8)  TO CO01END030ROV(1:8)
              MOVE CO01END030RO(10:2) TO CO01END030ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END030ROV
           END-IF
      *
           MOVE 01END071RO      TO CO01END071RO.
           IF CO01END071RO(9:1) = "."
              MOVE CO01END071RO(1:8)  TO CO01END071ROV(1:8)
              MOVE CO01END071RO(10:2) TO CO01END071ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END071ROV
           END-IF
      *
           MOVE 01END080RO      TO CO01END080RO.
           IF CO01END080RO(9:1) = "."
              MOVE CO01END080RO(1:8)  TO CO01END080ROV(1:8)
              MOVE CO01END080RO(10:2) TO CO01END080ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END080ROV
           END-IF
      *
           MOVE 01EXP008RO      TO CO01EXP008RO.
      *
           MOVE 02END045RO      TO CO02END045RO.
           IF CO02END045RO(2:1) NUMERIC   *> CAR CON VALORES NEGATIVOS
              AND CO02END045RO(1:1) NOT = "-" 
              MOVE CO02END045RO(1:8)  TO CO02END045ROV(1:8)
              MOVE "0"                TO CO02END045ROV(1:1)
              MOVE CO02END045RO(10:2) TO CO02END045ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO02END045ROV
           END-IF
      *
           MOVE 01NUM001HP      TO CO01NUM001HP.
           IF CO01NUM001HP NUMERIC
              MOVE CO01NUM001HP TO CO01NUM001HPV
           ELSE
              MOVE ZERO         TO CO01NUM001HPV
           END-IF.
      *
           MOVE 01END004RO      TO CO01END004RO.
           IF CO01END004RO(9:1) = "."
              MOVE CO01END004RO(1:8)  TO CO01END004ROV(1:8)
              MOVE CO01END004RO(10:2) TO CO01END004ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END004ROV
           END-IF.
      *
           MOVE 01END004IN      TO CO01END004IN.
           IF CO01END004IN(9:1) = "."
              MOVE CO01END004IN(1:8)  TO CO01END004INV(1:8)
              MOVE CO01END004IN(10:2) TO CO01END004INV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END004INV
           END-IF.
      *
           MOVE 01END004VE      TO CO01END004VE.
           IF CO01END004VE(9:1) = "."
              MOVE CO01END004VE(1:8)  TO CO01END004VEV(1:8)
              MOVE CO01END004VE(10:2) TO CO01END004VEV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END004VEV
           END-IF.
      *
           MOVE 01END004HP      TO CO01END004HP.
           IF CO01END004HP(9:1) = "."
              MOVE CO01END004HP(1:8)  TO CO01END004HPV(1:8)
              MOVE CO01END004HP(10:2) TO CO01END004HPV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END004HPV
           END-IF.
      *
           MOVE 01END004CC      TO CO01END004CC.
           IF CO01END004CC(9:1) = "."
              MOVE CO01END004CC(1:8)  TO CO01END004CCV(1:8)
              MOVE CO01END004CC(10:2) TO CO01END004CCV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END004CCV
           END-IF.
      *
           MOVE 01END004OT      TO CO01END004OT.
           IF CO01END004OT(9:1) = "."
              MOVE CO01END004OT(1:8)  TO CO01END004OTV(1:8)
              MOVE CO01END004OT(10:2) TO CO01END004OTV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END004OTV
           END-IF.
      *
           MOVE 01END004CO      TO CO01END004CO.
           IF CO01END004CO(9:1) = "."
              MOVE CO01END004CO(1:8)  TO CO01END004COV(1:8)
              MOVE CO01END004CO(10:2) TO CO01END004COV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END004COV
           END-IF.
      *
           MOVE 01END005VE      TO CO01END005VE.
           IF CO01END005VE(9:1) = "."
              MOVE CO01END005VE(1:8)  TO CO01END005VEV(1:8)
              MOVE CO01END005VE(10:2) TO CO01END005VEV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END005VEV
           END-IF.
      *
           MOVE 01EXP001AH      TO CO01EXP001AH.
      *
           MOVE 02EXP013TO      TO CO02EXP013TO.
           IF CO02EXP013TO(6:1) = "."
              MOVE CO02EXP013TO(1:5)  TO CO02EXP013TOV(1:5)
              MOVE CO02EXP013TO(07:2) TO CO02EXP013TOV(6:2)
           ELSE
              MOVE ZEROS              TO CO02EXP013TOV
           END-IF
      *
REMARK*    ESTA VARIABLE SE ACOTA A CERO POR SI LLEGA VALOR NEGATIVO
REMARK*    SEGUN USA NUNCA DEBE SUCEDER, PERO POR SI LAS MOSCAS ......
           MOVE 02EXP002TO  TO CO02EXP002TO.
           IF 02EXP002TO NUMERIC
              MOVE 02EXP002TO  TO CO02EXP002TOV
           ELSE
              MOVE ZERO        TO CO02EXP002TOV
           END-IF.
REMARK********************************************************************
REMARK*    CALCULO DE VARIABLES ACOTADAS Y DUMMYS SEGMENTO 5
REMARK********************************************************************
      *    EDAD BASADO EN REPORTE DE LA REGISTRADURIA
           IF CO00DEM003 < 018 OR CO00DEM003 NOT NUMERIC THEN
              MOVE 018 TO HD-S5-CO00DEM003-C
           ELSE
              IF 018 <= CO00DEM003 AND CO00DEM003  <= 065
                 MOVE CO00DEM003 TO HD-S5-CO00DEM003-C
              ELSE
                 MOVE 065 TO HD-S5-CO00DEM003-C
              END-IF
           END-IF.
      *    DEPARTAMENTO DE EXPEDICION DE LA CEDULA
           IF CO00DEM016 NOT NUMERIC OR
              (CO00DEM016 = 54 OR 68 OR 72 OR 40 OR 50 OR 03 OR 21 OR 
                            48 OR 12 OR 56 OR 05 OR 17 OR 28 OR 64 OR
                            60 OR 13 )
              MOVE 1 TO HD-S5-CO00DEM016D01
           ELSE
              MOVE 0 TO HD-S5-CO00DEM016D01
           END-IF.
           IF (CO00DEM016 = 11 OR 52 OR 31 OR 25 OR 15 OR 29 OR 27 OR 
                            23 OR 24 OR 26 OR 01 OR 19 OR 44 OR 09 OR
                            46 OR 07 )
              MOVE 1 TO HD-S5-CO00DEM016D02
           ELSE
              MOVE 0 TO HD-S5-CO00DEM016D02
           END-IF.
      *    MESES DESDE LA CANCELACION POSITIVA MAS RECIENTE
           IF CO02ACP002 NOT NUMERIC
              MOVE 1 TO HD-S5-CO02ACP002D01
           ELSE
              MOVE 0 TO HD-S5-CO02ACP002D01
           END-IF.
           IF 0000 <= CO02ACP002 AND CO02ACP002 < 0006
              AND     CO02ACP002 NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO02ACP002D02
           ELSE
              MOVE 0 TO HD-S5-CO02ACP002D02
           END-IF.
           IF 0006 <= CO02ACP002 AND CO02ACP002 < 0017
              MOVE 1 TO HD-S5-CO02ACP002D03
           ELSE
              MOVE 0 TO HD-S5-CO02ACP002D03
           END-IF.
           IF CO02ACP002 >= 0017
              MOVE 1 TO HD-S5-CO02ACP002D04
           ELSE
              MOVE 0 TO HD-S5-CO02ACP002D04
           END-IF.
      *    PORCENTAJE DE CARTERA VENCIDA HACE 12 MESES
           IF CO02END019CB(1:1) NOT NUMERIC
              MOVE 1 TO HD-S5-CO02END019CBD01
           ELSE
              MOVE 0 TO HD-S5-CO02END019CBD01
           END-IF.
           IF CO02END019CBV = 0
              AND CO02END019CB(1:1) NUMERIC       *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO02END019CBD02
           ELSE
              MOVE 0 TO HD-S5-CO02END019CBD02
           END-IF.
           IF CO02END019CBV >  0
              MOVE 1 TO HD-S5-CO02END019CBD03
           ELSE
              MOVE 0 TO HD-S5-CO02END019CBD03
           END-IF.
      *    PORCENTAJE DE PRODUCTOS CERRADOS DEL TOTAL 
           IF 0 <= CO02NUM043CBV AND CO02NUM043CBV <  33.34
              AND CO02NUM043CB(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO02NUM043CBD01
           ELSE
              MOVE 0 TO HD-S5-CO02NUM043CBD01
           END-IF.
           IF 33.34  <= CO02NUM043CBV AND CO02NUM043CBV < 66.68
              MOVE 1 TO HD-S5-CO02NUM043CBD02
           ELSE
              MOVE 0 TO HD-S5-CO02NUM043CBD02
           END-IF.
           IF CO02NUM043CBV >= 66.68
              MOVE 1 TO HD-S5-CO02NUM043CBD03
           ELSE
              MOVE 0 TO HD-S5-CO02NUM043CBD03
           END-IF.
      *    CUOTA PROMEDIO SALDO EN PRODUCTOS DE CC ULT 6 MESES
           IF CO01END017CC(1:1) = " "
              MOVE 1 TO HD-S5-CO01END017CCD01
           ELSE
              MOVE 0 TO HD-S5-CO01END017CCD01
           END-IF.
           IF CO01END017CCV = 0       
              AND CO01END017CC(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01END017CCD02
           ELSE
              MOVE 0 TO HD-S5-CO01END017CCD02
           END-IF.
           IF CO01END017CCV > 0       
              MOVE 1 TO HD-S5-CO01END017CCD03
           ELSE
              MOVE 0 TO HD-S5-CO01END017CCD03
           END-IF.
      *    MESES DESDE LA APERTURA DE CC       MAS ANTIGUO
           IF CO01EXP001CC NOT NUMERIC
              MOVE 1 TO HD-S5-CO01EXP001CCD01
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001CCD01
           END-IF.
           IF 000 <= CO01EXP001CC AND CO01EXP001CC < 012
              AND    CO01EXP001CC NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01EXP001CCD02
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001CCD02
           END-IF.
           IF 012 <= CO01EXP001CC AND CO01EXP001CC < 036
              MOVE 1 TO HD-S5-CO01EXP001CCD03
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001CCD03
           END-IF.
           IF 036 <= CO01EXP001CC AND CO01EXP001CC < 072
              MOVE 1 TO HD-S5-CO01EXP001CCD04
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001CCD04
           END-IF.
           IF CO01EXP001CC >= 072
              MOVE 1 TO HD-S5-CO01EXP001CCD05
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001CCD05
           END-IF.
      *    CUPO TOTAL EN PRODUCTOS A LA FECHA EN PORTAFOLIO CO       
           IF CO01END007CO(1:1) = " "
              MOVE 1 TO HD-S5-CO01END007COD01
           ELSE
              MOVE 0 TO HD-S5-CO01END007COD01
           END-IF.
           IF 0 <= CO01END007COV AND CO01END007COV < 5.76
              AND CO01END007CO(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01END007COD02
           ELSE
              MOVE 0 TO HD-S5-CO01END007COD02
           END-IF.
           IF 5.76 <= CO01END007COV AND CO01END007COV < 12.25
              MOVE 1 TO HD-S5-CO01END007COD03
           ELSE
              MOVE 0 TO HD-S5-CO01END007COD03
           END-IF.
           IF 12.25 <= CO01END007COV AND CO01END007COV < 30.15
              MOVE 1 TO HD-S5-CO01END007COD04
           ELSE
              MOVE 0 TO HD-S5-CO01END007COD04
           END-IF.
           IF CO01END007COV >= 30.15   
              MOVE 1 TO HD-S5-CO01END007COD05
           ELSE
              MOVE 0 TO HD-S5-CO01END007COD05
           END-IF.
      *    PROMEDIO DEL SALDO PROMEDIO  ULT 9 MESES EN CO
           IF CO01END021CO(1:1) = " "
              MOVE 1 TO HD-S5-CO01END021COD01
           ELSE
              MOVE 0 TO HD-S5-CO01END021COD01
           END-IF.
           IF 0 <= CO01END021COV AND CO01END021COV < 2.68
              AND CO01END021CO(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01END021COD02
           ELSE
              MOVE 0 TO HD-S5-CO01END021COD02
           END-IF.
           IF 2.68 <= CO01END021COV AND CO01END021COV < 6.47
              MOVE 1 TO HD-S5-CO01END021COD03
           ELSE
              MOVE 0 TO HD-S5-CO01END021COD03
           END-IF.
           IF 6.47 <= CO01END021COV AND CO01END021COV < 15.54
              MOVE 1 TO HD-S5-CO01END021COD04
           ELSE
              MOVE 0 TO HD-S5-CO01END021COD04
           END-IF.
           IF CO01END021COV >= 15.54
              MOVE 1 TO HD-S5-CO01END021COD05
           ELSE
              MOVE 0 TO HD-S5-CO01END021COD05
           END-IF.
      *    EDAD PROMEDIO DEL PORTAFOLIO DE PRODUCTOS ABIERTOS PARA CT
           IF CO01EXP006CT NOT NUMERIC
              MOVE 1 TO HD-S5-CO01EXP006CTD01
           ELSE
              MOVE 0 TO HD-S5-CO01EXP006CTD01
           END-IF.
           IF 000 <= CO01EXP006CT AND CO01EXP006CT < 024
              AND     CO01EXP006CT NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01EXP006CTD02
           ELSE
              MOVE 0 TO HD-S5-CO01EXP006CTD02
           END-IF.
           IF 024 <= CO01EXP006CT AND CO01EXP006CT < 072
              MOVE 1 TO HD-S5-CO01EXP006CTD03
           ELSE
              MOVE 0 TO HD-S5-CO01EXP006CTD03
           END-IF.
           IF CO01EXP006CT >= 072
              MOVE 1 TO HD-S5-CO01EXP006CTD04
           ELSE
              MOVE 0 TO HD-S5-CO01EXP006CTD04
           END-IF.
      *    CALCULO VARIABLE EVER3024
           COMPUTE HD-S5-EVER3024   = CO01MOR055CCV + CO01MOR055ROV
                            + CO01MOR055INV + CO01MOR055OTV
                            + CO01MOR055COV + CO01MOR055VEV
                            + CO01MOR055HPV .
           IF 0 <= HD-S5-EVER3024 AND HD-S5-EVER3024  <  1
              MOVE 1 TO HD-S5-EVER3024D01
           ELSE
              MOVE 0 TO HD-S5-EVER3024D01
           END-IF.
           IF 1 <= HD-S5-EVER3024 AND HD-S5-EVER3024  <  2
              MOVE 1 TO HD-S5-EVER3024D02
           ELSE
              MOVE 0 TO HD-S5-EVER3024D02
           END-IF.
           IF 2 <= HD-S5-EVER3024
              MOVE 1 TO HD-S5-EVER3024D03
           ELSE
              MOVE 0 TO HD-S5-EVER3024D03
           END-IF.
      *    PROMEDIO DE CUOTA PROMEDIO EN PRODUCTOS ULTIMOS 6 MESES EN IN
           IF CO01END018IN(1:1) = " "
              MOVE 1 TO HD-S5-CO01END018IND01
           ELSE
              MOVE 0 TO HD-S5-CO01END018IND01
           END-IF.
OPTI01     IF 0 <= CO01END018INV AND CO01END018INV < 0.64               RMB0004
              AND  CO01END018IN(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01END018IND02
           ELSE
              MOVE 0 TO HD-S5-CO01END018IND02
           END-IF.
           IF CO01END018INV >= 0.64
OPTI01        MOVE 1 TO HD-S5-CO01END018IND03                           RMB0004
           ELSE
OPTI01        MOVE 0 TO HD-S5-CO01END018IND03                           RMB0004
           END-IF.
      *    NUMERO DE PRODUCTOS SIEMPRE AL DIA EN LOS ULTIMOS 48 MESES
           IF CO01MOR068IN NOT NUMERIC
              MOVE 1 TO HD-S5-CO01MOR068IND01
           ELSE
              MOVE 0 TO HD-S5-CO01MOR068IND01
           END-IF.
           IF 0000 <= CO01MOR068IN AND CO01MOR068IN < 0001
              AND     CO01MOR068IN NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01MOR068IND02
           ELSE
              MOVE 0 TO HD-S5-CO01MOR068IND02
           END-IF.
           IF CO01MOR068IN >= 0001
              MOVE 1 TO HD-S5-CO01MOR068IND03
           ELSE
              MOVE 0 TO HD-S5-CO01MOR068IND03
           END-IF.
      *    NUMERO DE PRODUCTOS ABIERTOS EN EL PORTAFOLIO IN
           IF CO01NUM002IN NOT NUMERIC OR CO01NUM002IN = 0000
              MOVE 1 TO HD-S5-CO01NUM002IND01
           ELSE
              MOVE 0 TO HD-S5-CO01NUM002IND01
           END-IF.
           IF 0001 <= CO01NUM002IN AND CO01NUM002IN < 0003
              MOVE 1 TO HD-S5-CO01NUM002IND02
           ELSE
              MOVE 0 TO HD-S5-CO01NUM002IND02
           END-IF.
           IF CO01NUM002IN >= 0003
              MOVE 1 TO HD-S5-CO01NUM002IND03
           ELSE
              MOVE 0 TO HD-S5-CO01NUM002IND03
           END-IF.
      *    CALCULO VARIABLE MOB6    
           COMPUTE HD-S5-MOB6       = CO01EXP007CCV + CO01EXP007ROV
                            + CO01EXP007INV + CO01EXP007OTV
                            + CO01EXP007COV + CO01EXP007VEV
                            + CO01EXP007HPV .
           IF 0 <= HD-S5-MOB6     AND HD-S5-MOB6      <  1
              MOVE 1 TO HD-S5-MOB6D01
           ELSE
              MOVE 0 TO HD-S5-MOB6D01
           END-IF.
           IF 1 <= HD-S5-MOB6     AND HD-S5-MOB6      <  2
              MOVE 1 TO HD-S5-MOB6D02
           ELSE
              MOVE 0 TO HD-S5-MOB6D02
           END-IF.
           IF 2 <= HD-S5-MOB6     AND HD-S5-MOB6      <  4
              MOVE 1 TO HD-S5-MOB6D03
           ELSE
              MOVE 0 TO HD-S5-MOB6D03
           END-IF.
           IF 4 <= HD-S5-MOB6    
              MOVE 1 TO HD-S5-MOB6D04
           ELSE
              MOVE 0 TO HD-S5-MOB6D04
           END-IF.
      *    CALCULO VARIABLE OPEN12
           COMPUTE HD-S5-OPEN12 = CO01ACP003ROV + CO01ACP003INV
                            + CO01ACP003OTV + CO01ACP003VEV
                            + CO01ACP003CCV + CO01ACP003COV
                            + CO01ACP003HPV .
           IF 0000 <= HD-S5-OPEN12   AND HD-S5-OPEN12   < 0002
              MOVE 1 TO HD-S5-OPEN12D01
           ELSE
              MOVE 0 TO HD-S5-OPEN12D01
           END-IF.
           IF 0002 <= HD-S5-OPEN12   AND HD-S5-OPEN12   < 0003
              MOVE 1 TO HD-S5-OPEN12D02
           ELSE
              MOVE 0 TO HD-S5-OPEN12D02
           END-IF.
           IF 0003 <= HD-S5-OPEN12
              MOVE 1 TO HD-S5-OPEN12D03
           ELSE
              MOVE 0 TO HD-S5-OPEN12D03
           END-IF.
      *    MESES DESDE EL PRODUCTO ABIERTO DE OT       MAS ANTIGUO
           IF CO01EXP003OT NOT NUMERIC
              MOVE 1 TO HD-S5-CO01EXP003OTD01
           ELSE
              MOVE 0 TO HD-S5-CO01EXP003OTD01
           END-IF.
           IF 000 <= CO01EXP003OT AND CO01EXP003OT < 024
              AND    CO01EXP003OT NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01EXP003OTD02
           ELSE
              MOVE 0 TO HD-S5-CO01EXP003OTD02
           END-IF.
           IF CO01EXP003OT >= 024
              MOVE 1 TO HD-S5-CO01EXP003OTD03
           ELSE
              MOVE 0 TO HD-S5-CO01EXP003OTD03
           END-IF.
      *    NUMERO DE APERTURAS DE PRODUCTOS EN ULT 3 MESES PARA RO    
           IF CO01ACP001RO NOT NUMERIC
              MOVE 1 TO HD-S5-CO01ACP001ROD01
           ELSE
              MOVE 0 TO HD-S5-CO01ACP001ROD01
           END-IF.
           IF 0000 <= CO01ACP001RO AND CO01ACP001RO < 0001
              AND     CO01ACP001RO NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01ACP001ROD02
           ELSE
              MOVE 0 TO HD-S5-CO01ACP001ROD02
           END-IF.
           IF CO01ACP001RO >= 0001
              MOVE 1 TO HD-S5-CO01ACP001ROD03
           ELSE
              MOVE 0 TO HD-S5-CO01ACP001ROD03
           END-IF.
      *    PROMEDIO DEL CUPO  PROMEDIO EN PROD RO        ULT 12 MESES
           IF CO01END030RO(1:1) = " "
              MOVE 1 TO HD-S5-CO01END030ROD01
           ELSE
              MOVE 0 TO HD-S5-CO01END030ROD01
           END-IF.
           IF 0 <= CO01END030ROV AND CO01END030ROV < 0.61
              AND  CO01END030RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01END030ROD02
           ELSE
              MOVE 0 TO HD-S5-CO01END030ROD02
           END-IF.
           IF 0.61 <= CO01END030ROV AND CO01END030ROV < 1.66
              MOVE 1 TO HD-S5-CO01END030ROD03
           ELSE
              MOVE 0 TO HD-S5-CO01END030ROD03
           END-IF.
           IF 1.66 <= CO01END030ROV AND CO01END030ROV < 04.2   
              MOVE 1 TO HD-S5-CO01END030ROD04
           ELSE
              MOVE 0 TO HD-S5-CO01END030ROD04
           END-IF.
           IF CO01END030ROV >= 4.2    
              MOVE 1 TO HD-S5-CO01END030ROD05
           ELSE
              MOVE 0 TO HD-S5-CO01END030ROD05
           END-IF.
      *    PROMEDIO UTILIZACION A LA FECHA PARA EL PRODUCTO RO        
           IF CO01END071RO(1:1) = " "
              MOVE 1 TO HD-S5-CO01END071ROD01
           ELSE
              MOVE 0 TO HD-S5-CO01END071ROD01
           END-IF.
           IF 0 <= CO01END071ROV AND CO01END071ROV < 25.56  
              AND  CO01END071RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01END071ROD02
           ELSE
              MOVE 0 TO HD-S5-CO01END071ROD02
           END-IF.
           IF 25.56 <= CO01END071ROV AND CO01END071ROV < 57.52 
              MOVE 1 TO HD-S5-CO01END071ROD03
           ELSE
              MOVE 0 TO HD-S5-CO01END071ROD03
           END-IF.
           IF 57.52 <= CO01END071ROV AND CO01END071ROV < 86.94
              MOVE 1 TO HD-S5-CO01END071ROD04
           ELSE
              MOVE 0 TO HD-S5-CO01END071ROD04
           END-IF.
           IF CO01END071ROV >= 86.94   
              MOVE 1 TO HD-S5-CO01END071ROD05
           ELSE
              MOVE 0 TO HD-S5-CO01END071ROD05
           END-IF.
      *    UTILIZACION DE PRODUCTOS HACE 12 MESES DE RO
           IF CO01END080RO(1:1) = " "
              MOVE 1 TO HD-S5-CO01END080ROD01
           ELSE
              MOVE 0 TO HD-S5-CO01END080ROD01
           END-IF.
           IF 0 <= CO01END080ROV AND CO01END080ROV < 21.23
              AND  CO01END080RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01END080ROD02
           ELSE
              MOVE 0 TO HD-S5-CO01END080ROD02
           END-IF.
           IF 21.23 <= CO01END080ROV AND CO01END080ROV < 52.32
              MOVE 1 TO HD-S5-CO01END080ROD03
           ELSE
              MOVE 0 TO HD-S5-CO01END080ROD03
           END-IF.
           IF 52.32 <= CO01END080ROV AND CO01END080ROV < 81.04
              MOVE 1 TO HD-S5-CO01END080ROD04
           ELSE
              MOVE 0 TO HD-S5-CO01END080ROD04
           END-IF.
           IF CO01END080ROV >= 81.04   
              MOVE 1 TO HD-S5-CO01END080ROD05
           ELSE
              MOVE 0 TO HD-S5-CO01END080ROD05
           END-IF.
OPTI01*    NUMERO DE PRODUCTSO HASTA 12MESES EN LIBROS                  RMB0004
OPTI01*    IF CO01EXP008RO NOT NUMERIC                                  RMB0004
OPTI01*       MOVE 1 TO HD-S5-CO01EXP008ROD01                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S5-CO01EXP008ROD01                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF 0000 <= CO01EXP008RO AND CO01EXP008RO < 0002              RMB0004
OPTI01*       AND    CO01EXP008RO NUMERIC      *> MANEJAR EL -1         RMB0004
OPTI01*       MOVE 1 TO HD-S5-CO01EXP008ROD02                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S5-CO01EXP008ROD02                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF 0002 <= CO01EXP008RO AND CO01EXP008RO < 0004              RMB0004
OPTI01*       MOVE 1 TO HD-S5-CO01EXP008ROD03                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S5-CO01EXP008ROD03                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
OPTI01*    IF CO01EXP008RO >= 0004                                      RMB0004
OPTI01*       MOVE 1 TO HD-S5-CO01EXP008ROD04                           RMB0004
OPTI01*    ELSE                                                         RMB0004
OPTI01*       MOVE 0 TO HD-S5-CO01EXP008ROD04                           RMB0004
OPTI01*    END-IF.                                                      RMB0004
      *    PORCENTAJE DE VARIACION DEL USO PROMEDIO ULT 6 MESES PARA RO
           IF CO02END045RO(2:1) NOT NUMERIC *> CAR CON VALORES NEGATIVOS
              OR CO02END045RO(1:1) = "-"      
              MOVE 1 TO HD-S5-CO02END045ROD01
           ELSE
              MOVE 0 TO HD-S5-CO02END045ROD01
           END-IF.
           IF 0 <= CO02END045ROV AND CO02END045ROV < 12.9 
              AND  CO02END045RO(2:1) NUMERIC      *> MANEJAR EL VALOR NEG
              AND  CO02END045RO(1:1) <> "-"                              
              MOVE 1 TO HD-S5-CO02END045ROD02
           ELSE
              MOVE 0 TO HD-S5-CO02END045ROD02
           END-IF.
           IF 12.9 <= CO02END045ROV AND CO02END045ROV < 40     
              MOVE 1 TO HD-S5-CO02END045ROD03
           ELSE
              MOVE 0 TO HD-S5-CO02END045ROD03
           END-IF.
           IF 40   <= CO02END045ROV AND CO02END045ROV < 114.23  
              MOVE 1 TO HD-S5-CO02END045ROD04
           ELSE
              MOVE 0 TO HD-S5-CO02END045ROD04
           END-IF.
           IF CO02END045ROV >= 114.23  
              MOVE 1 TO HD-S5-CO02END045ROD05
           ELSE
              MOVE 0 TO HD-S5-CO02END045ROD05
           END-IF.
      *    CALCULO VALIABLE TIENE CREDITOS HIPOTECARIOS
           IF CO01NUM001HPV > 0
              MOVE 1 TO HD-S5-TIENEHP
           ELSE
              MOVE 0 TO HD-S5-TIENEHP
           END-IF.
           IF HD-S5-TIENEHP = 0
              MOVE 1 TO HD-S5-TIENEHPD01
           ELSE
              MOVE 0 TO HD-S5-TIENEHPD01
           END-IF.
           IF HD-S5-TIENEHP = 1
              MOVE 1 TO HD-S5-TIENEHPD02
           ELSE
              MOVE 0 TO HD-S5-TIENEHPD02
           END-IF.
      *    PROMEDIO DE SALDOS PROMEDIO EN MORA EN PRODUCTOS A LA FECHA
           COMPUTE HD-S5-TO01END004 = CO01END004ROV + CO01END004INV +
                                  CO01END004VEV + CO01END004HPV +
                                  CO01END004CCV + CO01END004OTV +
                                  CO01END004COV .
           COMPUTE HD-S5-TO01END004 = HD-S5-TO01END004 / 7 *> MEAN
           IF 0 <= HD-S5-TO01END004 AND HD-S5-TO01END004  <  0.001
              MOVE 1 TO HD-S5-TO01END004D01
           ELSE
              MOVE 0 TO HD-S5-TO01END004D01
           END-IF.
           IF 0.001 <= HD-S5-TO01END004
              MOVE 1 TO HD-S5-TO01END004D02
           ELSE
              MOVE 0 TO HD-S5-TO01END004D02
           END-IF.
      *    CUOTA TOTAL EN PRODUCTOS A LA FECHA EN PORTAFOLIO VE
           IF CO01END005VE(1:1) = " "
              MOVE 1 TO HD-S5-CO01END005VED01
           ELSE
              MOVE 0 TO HD-S5-CO01END005VED01
           END-IF.
           IF 0 <= CO01END005VEV AND CO01END005VEV < 0.46 
              AND CO01END005VE(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01END005VED02
           ELSE
              MOVE 0 TO HD-S5-CO01END005VED02
           END-IF.
           IF CO01END005VEV >= 0.46      
              MOVE 1 TO HD-S5-CO01END005VED03
           ELSE
              MOVE 0 TO HD-S5-CO01END005VED03
           END-IF.
      *    MESES DESDE LA APERTURA DEL AHORROS MAS ANTIGUO
           IF CO01EXP001AH NOT NUMERIC
              MOVE 1 TO HD-S5-CO01EXP001AHD01
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001AHD01
           END-IF.
           IF 000 <= CO01EXP001AH AND CO01EXP001AH < 060
              AND    CO01EXP001AH NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO01EXP001AHD02
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001AHD02
           END-IF.
           IF 060 <= CO01EXP001AH AND CO01EXP001AH < 120
              MOVE 1 TO HD-S5-CO01EXP001AHD03
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001AHD03
           END-IF.
           IF CO01EXP001AH >= 120
              MOVE 1 TO HD-S5-CO01EXP001AHD04
           ELSE
              MOVE 0 TO HD-S5-CO01EXP001AHD04
           END-IF.
      *    PORCENTAJE DE PRODUCTOS TO CON MAS DE 60 MESES EN LIBROS
           IF CO02EXP013TO(1:1) = " "
              MOVE 1 TO HD-S5-CO02EXP013TOD01
           ELSE
              MOVE 0 TO HD-S5-CO02EXP013TOD01
           END-IF.
           IF 0 <= CO02EXP013TOV  AND CO02EXP013TOV <  25
              AND CO02EXP013TO(1:1) <> " "        *> MANEJAR EL -1
              MOVE 1 TO HD-S5-CO02EXP013TOD02
           ELSE
              MOVE 0 TO HD-S5-CO02EXP013TOD02
           END-IF.
           IF CO02EXP013TOV >= 25     
              MOVE 1 TO HD-S5-CO02EXP013TOD03
           ELSE
              MOVE 0 TO HD-S5-CO02EXP013TOD03
           END-IF.

OPTI01     COMPUTE HD-S5-EXPONENTE-C      =  1.56468472106833     +     RMB0004
OPTI01             +0.0108194566415718  * HD-S5-CO00DEM003-C      +     RMB0004
                   +0                   * HD-S5-CO00DEM016D01     +
OPTI01             +0.526065754782099   * HD-S5-CO00DEM016D02     +     RMB0004
                   +0                   * HD-S5-CO02ACP002D01     +
OPTI01             +0.218573179175477   * HD-S5-CO02ACP002D02     +     RMB0004
                   +0                   * HD-S5-CO02ACP002D03     +
OPTI01             +0                   * HD-S5-CO02ACP002D04     +     RMB0004
                   +0                   * HD-S5-CO02END019CBD01   +
OPTI01             +0.254079232057516   * HD-S5-CO02END019CBD02   +     RMB0004
                   +0                   * HD-S5-CO02END019CBD03   +
                   +0                   * HD-S5-CO02NUM043CBD01   +
                   +0                   * HD-S5-CO02NUM043CBD02   +
OPTI01             +0.158940918170394   * HD-S5-CO02NUM043CBD03   +     RMB0004
                   +0                   * HD-S5-CO01END017CCD01   +
                   +0                   * HD-S5-CO01END017CCD02   +
OPTI01             -0.432585994699084   * HD-S5-CO01END017CCD03   +     RMB0004
                   +0                   * HD-S5-CO01EXP001CCD01   +
OPTI01             -0.513131320714189   * HD-S5-CO01EXP001CCD02   +     RMB0004
                   +0                   * HD-S5-CO01EXP001CCD03   +
                   +0                   * HD-S5-CO01EXP001CCD04   +
                   +0                   * HD-S5-CO01EXP001CCD05   +
                   +0                   * HD-S5-CO01END007COD01   +
OPTI01             -0.368899589634825   * HD-S5-CO01END007COD02   +     RMB0004
OPTI01             -0.223916388889647   * HD-S5-CO01END007COD03   +     RMB0004
                   +0                   * HD-S5-CO01END007COD04   +
                   +0                   * HD-S5-CO01END007COD05   +
                   +0                   * HD-S5-CO01END021COD01   +
                   +0                   * HD-S5-CO01END021COD02   +
                   +0                   * HD-S5-CO01END021COD03   +
                   +0                   * HD-S5-CO01END021COD04   +
OPTI01             +0.185521215393334   * HD-S5-CO01END021COD05   +     RMB0004
                   +0                   * HD-S5-CO01EXP006CTD01   +
OPTI01             -0.172551087650533   * HD-S5-CO01EXP006CTD02   +     RMB0004
                   +0                   * HD-S5-CO01EXP006CTD03   +
                   +0                   * HD-S5-CO01EXP006CTD04   +
                   +0                   * HD-S5-EVER3024D01       +
OPTI01             -0.416390338916387   * HD-S5-EVER3024D02       +     RMB0004
OPTI01             -0.708135536346337   * HD-S5-EVER3024D03       +     RMB0004
                   +0                   * HD-S5-CO01END018IND01   +
OPTI01             -0.185569300067401   * HD-S5-CO01END018IND02   +     RMB0004
OPTI01             +0                   * HD-S5-CO01END018IND03   +     RMB0004
                   +0                   * HD-S5-CO01MOR068IND01   +
                   +0                   * HD-S5-CO01MOR068IND02   +
OPTI01             +0.264195627242267   * HD-S5-CO01MOR068IND03   +     RMB0004
                   +0                   * HD-S5-CO01NUM002IND01   +
OPTI01             +0.0635146844632413  * HD-S5-CO01NUM002IND02   +     RMB0004
                   +0                   * HD-S5-CO01NUM002IND03   +
                   +0                   * HD-S5-MOB6D01           +
                   +0                   * HD-S5-MOB6D02           +
                   +0                   * HD-S5-MOB6D03           +
OPTI01             -0.358894829770967   * HD-S5-MOB6D04           +     RMB0004
                   +0                   * HD-S5-OPEN12D01         +
                   +0                   * HD-S5-OPEN12D02         +
OPTI01             -0.299634532554973   * HD-S5-OPEN12D03         +     RMB0004
                   +0                   * HD-S5-CO01EXP003OTD01   +
OPTI01             -0.319630941305853   * HD-S5-CO01EXP003OTD02   +     RMB0004
                   +0                   * HD-S5-CO01EXP003OTD03   +
                   +0                   * HD-S5-CO01ACP001ROD01   +
                   +0                   * HD-S5-CO01ACP001ROD02   +
OPTI01             -0.19097638131769    * HD-S5-CO01ACP001ROD03   +     RMB0004
                   +0                   * HD-S5-CO01END030ROD01   +
                   +0                   * HD-S5-CO01END030ROD02   +
                   +0                   * HD-S5-CO01END030ROD03   +
                   +0                   * HD-S5-CO01END030ROD04   +
OPTI01             +0.230392085247235   * HD-S5-CO01END030ROD05   +     RMB0004
                   +0                   * HD-S5-CO01END071ROD01   +
OPTI01             +0.53098319426302    * HD-S5-CO01END071ROD02   +     RMB0004
OPTI01             +0.337934784748864   * HD-S5-CO01END071ROD03   +     RMB0004
                   +0                   * HD-S5-CO01END071ROD04   +
OPTI01             -0.536642681785678   * HD-S5-CO01END071ROD05   +     RMB0004
                   +0                   * HD-S5-CO01END080ROD01   +
                   +0                   * HD-S5-CO01END080ROD02   +
                   +0                   * HD-S5-CO01END080ROD03   +
                   +0                   * HD-S5-CO01END080ROD04   +
OPTI01             -0.0769414366141488  * HD-S5-CO01END080ROD05   +     RMB0004
                   +0                   * HD-S5-CO02END045ROD01   +
                   +0                   * HD-S5-CO02END045ROD02   +
                   +0                   * HD-S5-CO02END045ROD03   +
                   +0                   * HD-S5-CO02END045ROD04   +
OPTI01             +0.176478867357001   * HD-S5-CO02END045ROD05   +     RMB0004
                   +0                   * HD-S5-TIENEHPD01        +
OPTI01             +0.27519037785524    * HD-S5-TIENEHPD02        +     RMB0004
                   +0                   * HD-S5-TO01END004D01     +
OPTI01             -0.498168795186944   * HD-S5-TO01END004D02     +     RMB0004
                   +0                   * HD-S5-CO01END005VED01   +
OPTI01             -0.227552709363299   * HD-S5-CO01END005VED02   +     RMB0004
                   +0                   * HD-S5-CO01END005VED03   +
                   +0                   * HD-S5-CO01EXP001AHD01   +
                   +0                   * HD-S5-CO01EXP001AHD02   +
                   +0                   * HD-S5-CO01EXP001AHD03   +
OPTI01             +0.117544198388577   * HD-S5-CO01EXP001AHD04   +     RMB0004
                   +0                   * HD-S5-CO02EXP013TOD01   +
OPTI01             -0.222728628988525   * HD-S5-CO02EXP013TOD02   +     RMB0004
                   +0                   * HD-S5-CO02EXP013TOD03   +
OPTI01             +0.0162091910543464  * CO02EXP002TOV     .           RMB0004

          COMPUTE HD-SCOREN = HD-S5-EXPONENTE-C.
          COMPUTE HD-SCOREN        = 
OPTI01            ((65.281402 * HD-SCOREN ) + 599.942762 ).             RMB0004
OPTI01    IF HD-SCOREN < 0  MOVE 0 TO HD-SCOREN.                        RMB0004
          COMPUTE SCORE-USAHD      = HD-SCOREN .      
          IF SCORE-USAHD <= 150 MOVE 150 TO SCORE-USAHD.   
          IF SCORE-USAHD >= 950 MOVE 950 TO SCORE-USAHD.        
       6600-SCORE-CARD6-USAHD.
REMARK********************************************************************
REMARK*6600-SCORE-CARD6-USAHD.
REMARK*    SCORE CARD PARA CLIENTES CON EXPERIENCIA, CON PORTAFOLIO
REMARK*    COMPLEJO, SIN MOROSIDADES SEVERAS NI RECIENTERS, SIN
REMARK*    APERTURAS EN EL ULTIMO SEMESTRE.
REMARK********************************************************************
           MOVE 99  TO  ADVERSE-RAZON-USAHD(1) .
REMARK********************************************************************
REMARK*    ADECUACION DE VARIABLES SEGMENTO 6
REMARK********************************************************************
           MOVE 01MOR061IN     TO CO01MOR061IN.
      *
           MOVE 01NUM001HP      TO CO01NUM001HP.
           IF CO01NUM001HP NUMERIC
              MOVE CO01NUM001HP TO CO01NUM001HPV
           ELSE
              MOVE ZERO         TO CO01NUM001HPV
           END-IF.
      *
           MOVE 01NUM050AH      TO CO01NUM050AH.
           MOVE 01NUM001OT      TO CO01NUM001OT.
           MOVE 02NUM035TO      TO CO02NUM035TO.
      *
           MOVE 01END089RO      TO CO01END089RO.
           IF CO01END089RO(9:1) = "."
              MOVE CO01END089RO(1:8)  TO CO01END089ROV(1:8)
              MOVE CO01END089RO(10:2) TO CO01END089ROV(9:2)
           ELSE
              MOVE ZEROS              TO CO01END089ROV
           END-IF
      *
           MOVE 01EXP004AH     TO CO01EXP004AH.
           MOVE 01EXP008CC     TO CO01EXP008CC.
REMARK*    ESTA VARIABLE SE ACOTA A CERO POR SI LLEGA VALOR NEGATIVO
REMARK*    SEGUN USA NUNCA DEBE SUCEDER, PERO POR SI LAS MOSCAS ......
           MOVE 02EXP001TO  TO CO02EXP001TO.
           IF 02EXP001TO NUMERIC
              MOVE 02EXP001TO  TO CO02EXP001TOV
           ELSE
              MOVE ZERO        TO CO02EXP001TOV
           END-IF.
      *
           MOVE 02EXP002TO     TO CO02EXP002TO.
           MOVE 01ACP005RO     TO CO01ACP005RO.
           MOVE 00DEM003       TO CO00DEM003  .
           MOVE 00DEM016       TO CO00DEM016  .
           MOVE 02ACP002       TO CO02ACP002  .
REMARK********************************************************************
REMARK*    CALCULO DE VARIABLES ACOTADAS Y DUMMYS SEGMENTO 6
REMARK********************************************************************
      *    NUMERO DE PRODUCTOS SIEMPRE AL DIA EN LOS ULTIMOS 36 MESES IN
           IF CO01MOR061IN NOT NUMERIC
              MOVE 1 TO HD-S6-CO01MOR061IND01
           ELSE
              MOVE 0 TO HD-S6-CO01MOR061IND01
           END-IF.
           IF 0000 <= CO01MOR061IN AND CO01MOR061IN < 0001
              AND     CO01MOR061IN NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO01MOR061IND02
           ELSE
              MOVE 0 TO HD-S6-CO01MOR061IND02
           END-IF.
           IF CO01MOR061IN >= 0001
              MOVE 1 TO HD-S6-CO01MOR061IND03
           ELSE
              MOVE 0 TO HD-S6-CO01MOR061IND03
           END-IF.
      *    CALCULO VALIABLE TIENE CREDITOS HIPOTECARIOS
           IF CO01NUM001HPV > 0
              MOVE 1 TO HD-S6-TIENEHP
           ELSE
              MOVE 0 TO HD-S6-TIENEHP
           END-IF.
           IF HD-S6-TIENEHP = 0
              MOVE 1 TO HD-S6-TIENEHPD01
           ELSE
              MOVE 0 TO HD-S6-TIENEHPD01
           END-IF.
           IF HD-S6-TIENEHP = 1
              MOVE 1 TO HD-S6-TIENEHPD02
           ELSE
              MOVE 0 TO HD-S6-TIENEHPD02
           END-IF.
      *    NUMERO DE PRODUCTOS EN ESTADOS POSITIVOS EN AHORROS
           IF CO01NUM050AH NOT NUMERIC
              MOVE 1 TO HD-S6-CO01NUM050AHD01
           ELSE
              MOVE 0 TO HD-S6-CO01NUM050AHD01
           END-IF.
           IF 0000 <= CO01NUM050AH AND CO01NUM050AH < 0001
              AND     CO01NUM050AH NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO01NUM050AHD02
           ELSE
              MOVE 0 TO HD-S6-CO01NUM050AHD02
           END-IF.
           IF 0001 <= CO01NUM050AH AND CO01NUM050AH < 0002
              MOVE 1 TO HD-S6-CO01NUM050AHD03
           ELSE
              MOVE 0 TO HD-S6-CO01NUM050AHD03
           END-IF.
           IF CO01NUM050AH >= 0002
              MOVE 1 TO HD-S6-CO01NUM050AHD04
           ELSE
              MOVE 0 TO HD-S6-CO01NUM050AHD04
           END-IF.
      *    NUMERO DE PRODUCTOS PARA EL PORTAFOLIO OT                  
           IF CO01NUM001OT NOT NUMERIC
              MOVE 1 TO HD-S6-CO01NUM001OTD01
           ELSE
              MOVE 0 TO HD-S6-CO01NUM001OTD01
           END-IF.
           IF 0001 <= CO01NUM001OT AND CO01NUM001OT < 0002
              MOVE 1 TO HD-S6-CO01NUM001OTD02
           ELSE
              MOVE 0 TO HD-S6-CO01NUM001OTD02
           END-IF.
           IF CO01NUM001OT >= 0002
              MOVE 1 TO HD-S6-CO01NUM001OTD03
           ELSE
              MOVE 0 TO HD-S6-CO01NUM001OTD03
           END-IF.
      *    TOTAL DE PRODUCTOS CON TERMINO ENTRE 49 Y 60 MESES
           IF CO02NUM035TO NOT NUMERIC
              MOVE 1 TO HD-S6-CO02NUM035TOD01
           ELSE
              MOVE 0 TO HD-S6-CO02NUM035TOD01
           END-IF.
           IF 0000 <= CO02NUM035TO AND CO02NUM035TO < 0001
              AND     CO02NUM035TO NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO02NUM035TOD02
           ELSE
              MOVE 0 TO HD-S6-CO02NUM035TOD02
           END-IF.
           IF CO02NUM035TO >= 0001
              MOVE 1 TO HD-S6-CO02NUM035TOD03
           ELSE
              MOVE 0 TO HD-S6-CO02NUM035TOD03
           END-IF.
      *    TOTAL USO PROMEDIO DE ROTATIVOS EN LOS ULTIMOS 12 MESES
           IF CO01END089RO(1:1) = " "
              MOVE 1 TO HD-S6-CO01END089ROD01
           ELSE
              MOVE 0 TO HD-S6-CO01END089ROD01
           END-IF.
           IF 0 <= CO01END089ROV AND CO01END089ROV < 15.48
              AND  CO01END089RO(1:1) <> " "       *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO01END089ROD02
           ELSE
              MOVE 0 TO HD-S6-CO01END089ROD02
           END-IF.
           IF 15.48 <= CO01END089ROV AND CO01END089ROV < 42.91
              MOVE 1 TO HD-S6-CO01END089ROD03
           ELSE
              MOVE 0 TO HD-S6-CO01END089ROD03
           END-IF.
           IF 42.91 <= CO01END089ROV AND CO01END089ROV < 72      
              MOVE 1 TO HD-S6-CO01END089ROD04
           ELSE
              MOVE 0 TO HD-S6-CO01END089ROD04
           END-IF.
           IF CO01END089ROV >= 72      
              MOVE 1 TO HD-S6-CO01END089ROD05
           ELSE
              MOVE 0 TO HD-S6-CO01END089ROD05
           END-IF.
      *    MESES DESDE LA APERTURA  DE PROD ABIERTO MAS RECIENTE DE AH
           IF CO01EXP004AH NOT NUMERIC
              MOVE 1 TO HD-S6-CO01EXP004AHD01
           ELSE
              MOVE 0 TO HD-S6-CO01EXP004AHD01
           END-IF.
           IF 000 <= CO01EXP004AH AND CO01EXP004AH < 091
              AND    CO01EXP004AH NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO01EXP004AHD02
           ELSE
              MOVE 0 TO HD-S6-CO01EXP004AHD02
           END-IF.
           IF CO01EXP004AH >= 091
              MOVE 1 TO HD-S6-CO01EXP004AHD03
           ELSE
              MOVE 0 TO HD-S6-CO01EXP004AHD03
           END-IF.
      *    NUMERO DE PRODUCTOS PARA PRODUCTO CC HASTA 12 MESES EN LIBROS
           IF CO01EXP008CC NOT NUMERIC
              MOVE 1 TO HD-S6-CO01EXP008CCD01
           ELSE
              MOVE 0 TO HD-S6-CO01EXP008CCD01
           END-IF.
           IF 0000 <= CO01EXP008CC AND CO01EXP008CC < 0001
              AND     CO01EXP008CC NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO01EXP008CCD02
           ELSE
              MOVE 0 TO HD-S6-CO01EXP008CCD02
           END-IF.
           IF CO01EXP008CC >= 0001
              MOVE 1 TO HD-S6-CO01EXP008CCD03
           ELSE
              MOVE 0 TO HD-S6-CO01EXP008CCD03
           END-IF.
      *    MESES DESDE LA APERTURA  DE PROD MAS ANTIGUO PARA TO        
           IF 000 <= CO02EXP001TO AND CO02EXP001TO < 063
              AND    CO02EXP001TO NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO02EXP001TOD01
           ELSE
              MOVE 0 TO HD-S6-CO02EXP001TOD01
           END-IF.
           IF 063 <= CO02EXP001TO AND CO02EXP001TO < 113
              MOVE 1 TO HD-S6-CO02EXP001TOD02
           ELSE
              MOVE 0 TO HD-S6-CO02EXP001TOD02
           END-IF.
           IF 113 <= CO02EXP001TO AND CO02EXP001TO < 176
              MOVE 1 TO HD-S6-CO02EXP001TOD03
           ELSE
              MOVE 0 TO HD-S6-CO02EXP001TOD03
           END-IF.
           IF CO02EXP001TO >= 176
              MOVE 1 TO HD-S6-CO02EXP001TOD04
           ELSE
              MOVE 0 TO HD-S6-CO02EXP001TOD04
           END-IF.
      *    MESES DESDE LA APERTURA  DE PROD MAS RECIENTE PARA TO
           IF 000 <= CO02EXP002TO AND CO02EXP002TO < 011
              AND    CO02EXP002TO NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO02EXP002TOD01
           ELSE
              MOVE 0 TO HD-S6-CO02EXP002TOD01
           END-IF.
           IF 011 <= CO02EXP002TO AND CO02EXP002TO < 014
              MOVE 1 TO HD-S6-CO02EXP002TOD02
           ELSE
              MOVE 0 TO HD-S6-CO02EXP002TOD02
           END-IF.
           IF 014 <= CO02EXP002TO AND CO02EXP002TO < 025
              MOVE 1 TO HD-S6-CO02EXP002TOD03
           ELSE
              MOVE 0 TO HD-S6-CO02EXP002TOD03
           END-IF.
           IF CO02EXP002TO >= 025
              MOVE 1 TO HD-S6-CO02EXP002TOD04
           ELSE
              MOVE 0 TO HD-S6-CO02EXP002TOD04
           END-IF.
      *    NUMERO DE APERTURAS EN LOS ULTIMOS 24 MESES PARA RO        
           IF CO01ACP005RO NOT NUMERIC
              MOVE 1 TO HD-S6-CO01ACP005ROD01
           ELSE
              MOVE 0 TO HD-S6-CO01ACP005ROD01
           END-IF.
           IF 0000 <= CO01ACP005RO AND CO01ACP005RO < 0001
              AND     CO01ACP005RO NUMERIC      *> MANEJAR EL -1
              MOVE 1 TO HD-S6-CO01ACP005ROD02
           ELSE
              MOVE 0 TO HD-S6-CO01ACP005ROD02
           END-IF.
           IF 0001 <= CO01ACP005RO AND CO01ACP005RO < 0002
              MOVE 1 TO HD-S6-CO01ACP005ROD03
           ELSE
              MOVE 0 TO HD-S6-CO01ACP005ROD03
           END-IF.
           IF CO01ACP005RO >= 0002
              MOVE 1 TO HD-S6-CO01ACP005ROD04
           ELSE
              MOVE 0 TO HD-S6-CO01ACP005ROD04
           END-IF.
      *    EDAD BASADO EN REPORTE DE LA REGISTRADURIA
           IF CO00DEM003 < 018 OR CO00DEM003 NOT NUMERIC THEN
              MOVE 018 TO HD-S6-CO00DEM003-C
           ELSE
              IF 018 <= CO00DEM003 AND CO00DEM003  <= 065
                 MOVE CO00DEM003 TO HD-S6-CO00DEM003-C
              ELSE
                 MOVE 065 TO HD-S6-CO00DEM003-C
              END-IF
           END-IF.
      *    DEPARTAMENTO DE EXPEDICION DE LA CEDULA
           IF CO00DEM016 NOT NUMERIC OR
              (CO00DEM016 = 72 OR 21 OR 48 OR 03 OR 56 OR 17 OR 54 OR
                            13 OR 05 OR 28 OR 12 OR 50 OR 40 OR 46 OR
                            44 OR 68 OR 64 )
              MOVE 1 TO HD-S6-CO00DEM016D01
           ELSE
              MOVE 0 TO HD-S6-CO00DEM016D01
           END-IF.
           IF (CO00DEM016 = 11 OR 31 OR 19 OR 52 OR 26 OR 25 OR 01 OR
                            24 OR 27 OR 23 OR 15 OR 29 OR 09 OR 60 OR
                            07 )
              MOVE 1 TO HD-S6-CO00DEM016D02
           ELSE
              MOVE 0 TO HD-S6-CO00DEM016D02
           END-IF.
OPTI01*    CALCULO FINAL MINIMO RECMORA-USA SE UTILIZA AL FINAL         RMB0004
           PERFORM 6500-RECMORA-USAHD.
OPTI01     MOVE 02NUM018TO TO CO02NUM018TO.                             RMB0004
OPTI01     MOVE 01NUM018CO TO CO01NUM018CO.                             RMB0004
OPTI01     IF (CO02NUM018TO NUMERIC AND CO02NUM018TO >= 0001 ) AND      RMB0004
OPTI01        CO02NUM018TO <> CO01NUM018CO AND                          RMB0004
OPTI01        HD-RECMORA > 0                                            RMB0004
OPTI01        MOVE 0 TO HD-S6-RECMORA                                   RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE HD-RECMORA TO HD-S6-RECMORA                          RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     PERFORM 6500-RECMORACC-USAHD.                                RMB0004
OPTI01     IF HD-RECMORACC = 0 AND HD-S6-RECMORA > 0                    RMB0004
OPTI01        MOVE 0 TO HD-S6-RECMORA                                   RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01*    LA MISMA VARIABLE HD-S6-RECMORA SE USA COMA HD-S6-RECMORAUSA RMB0004
           IF HD-S6-RECMORA > 48                          
              MOVE 48 TO HD-S6-RECMORA
           END-IF.
      *    NUMERO DE LA CANCELACION POSITIVA MAS RECIENTE             
           IF CO02ACP002   NOT NUMERIC OR
              CO02ACP002   > 0120            
              MOVE 120         TO HD-S6-CO02ACP002-C  
           ELSE
              MOVE CO02ACP002  TO HD-S6-CO02ACP002-C 
           END-IF.

OPTI01     COMPUTE HD-S6-EXPONENTE-C      =  1.56465163855671     +     RMB0004
                   +0                   * HD-S6-CO01MOR061IND01   +
                   +0                   * HD-S6-CO01MOR061IND02   +
OPTI01             +0.368475351008228   * HD-S6-CO01MOR061IND03   +     RMB0004
                   +0                   * HD-S6-TIENEHPD01        +
OPTI01             +0.231949458167594   * HD-S6-TIENEHPD02        +     RMB0004
                   +0                   * HD-S6-CO01NUM050AHD01   +
OPTI01             -0.164220930244974   * HD-S6-CO01NUM050AHD02   +     RMB0004
                   +0                   * HD-S6-CO01NUM050AHD03   +
OPTI01             +0.205209165069356   * HD-S6-CO01NUM050AHD04   +     RMB0004
                   +0                   * HD-S6-CO01NUM001OTD01   +
OPTI01             -0.121928820978138   * HD-S6-CO01NUM001OTD02   +     RMB0004
OPTI01             -0.18272459678512    * HD-S6-CO01NUM001OTD03   +     RMB0004
                   +0                   * HD-S6-CO02NUM035TOD01   +
                   +0                   * HD-S6-CO02NUM035TOD02   +
OPTI01             +0.281243365170349   * HD-S6-CO02NUM035TOD03   +     RMB0004
                   +0                   * HD-S6-CO01END089ROD01   +
OPTI01             +0.782038427786106   * HD-S6-CO01END089ROD02   +     RMB0004
OPTI01             +0.612062272041684   * HD-S6-CO01END089ROD03   +     RMB0004
                   +0                   * HD-S6-CO01END089ROD04   +
OPTI01             -0.2320748119477     * HD-S6-CO01END089ROD05   +     RMB0004
                   +0                   * HD-S6-CO01EXP004AHD01   +
                   +0                   * HD-S6-CO01EXP004AHD02   +
OPTI01             +0.214297851279539   * HD-S6-CO01EXP004AHD03   +     RMB0004
                   +0                   * HD-S6-CO01EXP008CCD01   +
                   +0                   * HD-S6-CO01EXP008CCD02   +
OPTI01             -0.314277493087763   * HD-S6-CO01EXP008CCD03   +     RMB0004
OPTI01             -0.145567613459032   * HD-S6-CO02EXP001TOD01   +     RMB0004
                   +0                   * HD-S6-CO02EXP001TOD02   +
                   +0                   * HD-S6-CO02EXP001TOD03   +
                   +0                   * HD-S6-CO02EXP001TOD04   +
OPTI01             -0.158906835765915   * HD-S6-CO02EXP002TOD01   +     RMB0004
                   +0                   * HD-S6-CO02EXP002TOD02   +
                   +0                   * HD-S6-CO02EXP002TOD03   +
                   +0                   * HD-S6-CO02EXP002TOD04   +
                   +0                   * HD-S6-CO01ACP005ROD01   +
                   +0                   * HD-S6-CO01ACP005ROD02   +
                   +0                   * HD-S6-CO01ACP005ROD03   +
OPTI01             -0.118476723429465   * HD-S6-CO01ACP005ROD04   +     RMB0004
OPTI01             +0.0117561431547211  * HD-S6-CO00DEM003-C      +     RMB0004
OPTI01             -0.496602545372193   * HD-S6-CO00DEM016D01     +     RMB0004
                   +0                   * HD-S6-CO00DEM016D02     +
OPTI01             +0.0202792909046278  * HD-S6-RECMORA           +     RMB0004
OPTI01             -0.00174586613078062 * HD-S6-CO02ACP002-C      .     RMB0004

          COMPUTE HD-SCOREN = HD-S6-EXPONENTE-C.
          COMPUTE HD-SCOREN        = 
OPTI01            ((67.822252 * HD-SCOREN ) + 595.304050 ).             RMB0004
OPTI01    IF HD-SCOREN < 0  MOVE 0 TO HD-SCOREN.                        RMB0004
          COMPUTE SCORE-USAHD      = HD-SCOREN .      
          IF SCORE-USAHD <= 150 MOVE 150 TO SCORE-USAHD.   
          IF SCORE-USAHD >= 950 MOVE 950 TO SCORE-USAHD.        
EXCL02 6500-MOB-SOLOREAL-USAHD.                                         GJC0006
EXCL02     MOVE 01EXP001CC  TO CO01EXP001CC.                            GJC0006
EXCL02     MOVE 01EXP001OT  TO CO01EXP001OT.                            GJC0006
EXCL02*                                                                 GJC0006
EXCL02     IF CO01EXP001CC NUMERIC                                      GJC0006
EXCL02        MOVE CO01EXP001CC TO CO01EXP001CCV                        GJC0006
EXCL02     ELSE                                                         GJC0006
EXCL02        MOVE 0            TO CO01EXP001CCV                        GJC0006
EXCL02     END-IF.                                                      GJC0006
EXCL02     IF CO01EXP001OT NUMERIC                                      GJC0006
EXCL02        MOVE CO01EXP001OT TO CO01EXP001OTV                        GJC0006
EXCL02     ELSE                                                         GJC0006
EXCL02        MOVE 0            TO CO01EXP001OTV                        GJC0006
EXCL02     END-IF.                                                      GJC0006
EXCL02     MOVE CO01EXP001CCV TO HD-MOB-SOLOREAL.                       GJC0006
EXCL02     IF CO01EXP001OTV > HD-MOB-SOLOREAL                           GJC0006
EXCL02        MOVE CO01EXP001OTV TO HD-MOB-SOLOREAL                     GJC0006
EXCL02     END-IF.                                                      GJC0006
NUEV01 6500-RECMORA60-USAHD.                                            RMB0002
REMARK*******************************************************************
REMARK*6500-RECMORA60-USAHD.
REMARK*    CALCULO DEL ESTADO MORA 60           
REMARK*******************************************************************
NUEV01     MOVE 01MOR076RO  TO CO01MOR076RO.                            RMB0002
NUEV01     MOVE 01MOR076IN  TO CO01MOR076IN.                            RMB0002
NUEV01     MOVE 01MOR076OT  TO CO01MOR076OT.                            RMB0002
NUEV01     MOVE 01MOR076CO  TO CO01MOR076CO.                            RMB0002
NUEV01     MOVE 01MOR076VE  TO CO01MOR076VE.                            RMB0002
NUEV01     MOVE 01MOR076CC  TO CO01MOR076CC.                            RMB0002
NUEV01     MOVE 01MOR076HP  TO CO01MOR076HP.                            RMB0002
NUEV01*                                                                 RMB0002
NUEV01     IF CO01MOR076RO NUMERIC                                      RMB0002
NUEV01        MOVE CO01MOR076RO TO CO01MOR076ROV                        RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 999          TO CO01MOR076ROV                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076IN NUMERIC                                      RMB0002
NUEV01        MOVE CO01MOR076IN TO CO01MOR076INV                        RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 999          TO CO01MOR076INV                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076OT NUMERIC                                      RMB0002
NUEV01        MOVE CO01MOR076OT TO CO01MOR076OTV                        RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 999          TO CO01MOR076OTV                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076CO NUMERIC                                      RMB0002
NUEV01        MOVE CO01MOR076CO TO CO01MOR076COV                        RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 999          TO CO01MOR076COV                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076VE NUMERIC                                      RMB0002
NUEV01        MOVE CO01MOR076VE TO CO01MOR076VEV                        RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 999          TO CO01MOR076VEV                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076CC NUMERIC                                      RMB0002
NUEV01        MOVE CO01MOR076CC TO CO01MOR076CCV                        RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 999          TO CO01MOR076CCV                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076HP NUMERIC                                      RMB0002
NUEV01        MOVE CO01MOR076HP TO CO01MOR076HPV                        RMB0002
NUEV01     ELSE                                                         RMB0002
NUEV01        MOVE 999          TO CO01MOR076HPV                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01*                                                                 RMB0002
NUEV01     MOVE CO01MOR076ROV TO HD-RECMORA60.                          RMB0002
NUEV01     IF CO01MOR076INV < HD-RECMORA60                              RMB0002
NUEV01        MOVE CO01MOR076INV TO HD-RECMORA60                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076OTV < HD-RECMORA60                              RMB0002
NUEV01        MOVE CO01MOR076OTV TO HD-RECMORA60                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076COV < HD-RECMORA60                              RMB0002
NUEV01        MOVE CO01MOR076COV TO HD-RECMORA60                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076VEV < HD-RECMORA60                              RMB0002
NUEV01        MOVE CO01MOR076VEV TO HD-RECMORA60                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076CCV < HD-RECMORA60                              RMB0002
NUEV01        MOVE CO01MOR076CCV TO HD-RECMORA60                        RMB0002
NUEV01     END-IF.                                                      RMB0002
NUEV01     IF CO01MOR076HPV < HD-RECMORA60                              RMB0002
NUEV01        MOVE CO01MOR076HPV TO HD-RECMORA60                        RMB0002
NUEV01     END-IF.                                                      RMB0002
       6500-RECMORA-USAHD.
REMARK*******************************************************************
REMARK*6500-RECMORA-USAHD.
REMARK*    CALCULO DEL ESTADO TOTAL DE MORA
REMARK*******************************************************************
           MOVE 01MOR075RO  TO CO01MOR075RO.
           MOVE 01MOR075IN  TO CO01MOR075IN.
           MOVE 01MOR075OT  TO CO01MOR075OT.
           MOVE 01MOR075CO  TO CO01MOR075CO.
           MOVE 01MOR075VE  TO CO01MOR075VE.
           MOVE 01MOR075CC  TO CO01MOR075CC.
           MOVE 01MOR075HP  TO CO01MOR075HP.
           MOVE 01MOR076RO  TO CO01MOR076RO.
           MOVE 01MOR076IN  TO CO01MOR076IN.
           MOVE 01MOR076OT  TO CO01MOR076OT.
           MOVE 01MOR076CO  TO CO01MOR076CO.
           MOVE 01MOR076VE  TO CO01MOR076VE.
           MOVE 01MOR076CC  TO CO01MOR076CC.
           MOVE 01MOR076HP  TO CO01MOR076HP.
           MOVE 01MOR077RO  TO CO01MOR077RO.
           MOVE 01MOR077IN  TO CO01MOR077IN.
           MOVE 01MOR077OT  TO CO01MOR077OT.
           MOVE 01MOR077CO  TO CO01MOR077CO.
           MOVE 01MOR077VE  TO CO01MOR077VE.
           MOVE 01MOR077CC  TO CO01MOR077CC.
           MOVE 01MOR077HP  TO CO01MOR077HP.
           MOVE 01MOR078RO  TO CO01MOR078RO.
           MOVE 01MOR078IN  TO CO01MOR078IN.
           MOVE 01MOR078OT  TO CO01MOR078OT.
           MOVE 01MOR078CO  TO CO01MOR078CO.
           MOVE 01MOR078VE  TO CO01MOR078VE.
           MOVE 01MOR078CC  TO CO01MOR078CC.
           MOVE 01MOR078HP  TO CO01MOR078HP.
           IF CO01MOR075RO NUMERIC
              MOVE CO01MOR075RO TO CO01MOR075ROV
           ELSE
              MOVE 999          TO CO01MOR075ROV
           END-IF.
           IF CO01MOR075IN NUMERIC
              MOVE CO01MOR075IN TO CO01MOR075INV
           ELSE
              MOVE 999          TO CO01MOR075INV
           END-IF.
           IF CO01MOR075OT NUMERIC
              MOVE CO01MOR075OT TO CO01MOR075OTV
           ELSE
              MOVE 999          TO CO01MOR075OTV
           END-IF.
           IF CO01MOR075CO NUMERIC
              MOVE CO01MOR075CO TO CO01MOR075COV
           ELSE
              MOVE 999          TO CO01MOR075COV
           END-IF.
           IF CO01MOR075VE NUMERIC
              MOVE CO01MOR075VE TO CO01MOR075VEV
           ELSE
              MOVE 999          TO CO01MOR075VEV
           END-IF.
           IF CO01MOR075CC NUMERIC
              MOVE CO01MOR075CC TO CO01MOR075CCV
           ELSE
              MOVE 999          TO CO01MOR075CCV
           END-IF.
           IF CO01MOR075HP NUMERIC
              MOVE CO01MOR075HP TO CO01MOR075HPV
           ELSE
              MOVE 999          TO CO01MOR075HPV
           END-IF.
      *
           IF CO01MOR076RO NUMERIC
              MOVE CO01MOR076RO TO CO01MOR076ROV
           ELSE
              MOVE 999          TO CO01MOR076ROV
           END-IF.
           IF CO01MOR076IN NUMERIC
              MOVE CO01MOR076IN TO CO01MOR076INV
           ELSE
              MOVE 999          TO CO01MOR076INV
           END-IF.
           IF CO01MOR076OT NUMERIC
              MOVE CO01MOR076OT TO CO01MOR076OTV
           ELSE
              MOVE 999          TO CO01MOR076OTV
           END-IF.
           IF CO01MOR076CO NUMERIC
              MOVE CO01MOR076CO TO CO01MOR076COV
           ELSE
              MOVE 999          TO CO01MOR076COV
           END-IF.
           IF CO01MOR076VE NUMERIC
              MOVE CO01MOR076VE TO CO01MOR076VEV
           ELSE
              MOVE 999          TO CO01MOR076VEV
           END-IF.
           IF CO01MOR076CC NUMERIC
              MOVE CO01MOR076CC TO CO01MOR076CCV
           ELSE
              MOVE 999          TO CO01MOR076CCV
           END-IF.
           IF CO01MOR076HP NUMERIC
              MOVE CO01MOR076HP TO CO01MOR076HPV
           ELSE
              MOVE 999          TO CO01MOR076HPV
           END-IF.
      *
           IF CO01MOR077RO NUMERIC
              MOVE CO01MOR077RO TO CO01MOR077ROV
           ELSE
              MOVE 999          TO CO01MOR077ROV
           END-IF.
           IF CO01MOR077IN NUMERIC
              MOVE CO01MOR077IN TO CO01MOR077INV
           ELSE
              MOVE 999          TO CO01MOR077INV
           END-IF.
           IF CO01MOR077OT NUMERIC
              MOVE CO01MOR077OT TO CO01MOR077OTV
           ELSE
              MOVE 999          TO CO01MOR077OTV
           END-IF.
           IF CO01MOR077CO NUMERIC
              MOVE CO01MOR077CO TO CO01MOR077COV
           ELSE
              MOVE 999          TO CO01MOR077COV
           END-IF.
           IF CO01MOR077VE NUMERIC
              MOVE CO01MOR077VE TO CO01MOR077VEV
           ELSE
              MOVE 999          TO CO01MOR077VEV
           END-IF.
           IF CO01MOR077CC NUMERIC
              MOVE CO01MOR077CC TO CO01MOR077CCV
           ELSE
              MOVE 999          TO CO01MOR077CCV
           END-IF.
           IF CO01MOR077HP NUMERIC
              MOVE CO01MOR077HP TO CO01MOR077HPV
           ELSE
              MOVE 999          TO CO01MOR077HPV
           END-IF.
      *
           IF CO01MOR078RO NUMERIC
              MOVE CO01MOR078RO TO CO01MOR078ROV
           ELSE
              MOVE 999          TO CO01MOR078ROV
           END-IF.
           IF CO01MOR078IN NUMERIC
              MOVE CO01MOR078IN TO CO01MOR078INV
           ELSE
              MOVE 999          TO CO01MOR078INV
           END-IF.
           IF CO01MOR078OT NUMERIC
              MOVE CO01MOR078OT TO CO01MOR078OTV
           ELSE
              MOVE 999          TO CO01MOR078OTV
           END-IF.
           IF CO01MOR078CO NUMERIC
              MOVE CO01MOR078CO TO CO01MOR078COV
           ELSE
              MOVE 999          TO CO01MOR078COV
           END-IF.
           IF CO01MOR078VE NUMERIC
              MOVE CO01MOR078VE TO CO01MOR078VEV
           ELSE
              MOVE 999          TO CO01MOR078VEV
           END-IF.
           IF CO01MOR078CC NUMERIC
              MOVE CO01MOR078CC TO CO01MOR078CCV
           ELSE
              MOVE 999          TO CO01MOR078CCV
           END-IF.
           IF CO01MOR078HP NUMERIC
              MOVE CO01MOR078HP TO CO01MOR078HPV
           ELSE
              MOVE 999          TO CO01MOR078HPV
           END-IF.
      *
           MOVE CO01MOR075ROV TO HD-RECMORA.
           IF CO01MOR075INV < HD-RECMORA
              MOVE CO01MOR075INV TO HD-RECMORA
           END-IF.
           IF CO01MOR075OTV < HD-RECMORA
              MOVE CO01MOR075OTV TO HD-RECMORA
           END-IF.
           IF CO01MOR075COV < HD-RECMORA
              MOVE CO01MOR075COV TO HD-RECMORA
           END-IF.
           IF CO01MOR075VEV < HD-RECMORA
              MOVE CO01MOR075VEV TO HD-RECMORA
           END-IF.
           IF CO01MOR075CCV < HD-RECMORA
              MOVE CO01MOR075CCV TO HD-RECMORA
           END-IF.
           IF CO01MOR075HPV < HD-RECMORA
              MOVE CO01MOR075HPV TO HD-RECMORA
           END-IF.
      *
           IF CO01MOR076ROV < HD-RECMORA
              MOVE CO01MOR076ROV TO HD-RECMORA
           END-IF.
           IF CO01MOR076INV < HD-RECMORA
              MOVE CO01MOR076INV TO HD-RECMORA
           END-IF.
           IF CO01MOR076OTV < HD-RECMORA
              MOVE CO01MOR076OTV TO HD-RECMORA
           END-IF.
           IF CO01MOR076COV < HD-RECMORA
              MOVE CO01MOR076COV TO HD-RECMORA
           END-IF.
           IF CO01MOR076VEV < HD-RECMORA
              MOVE CO01MOR076VEV TO HD-RECMORA
           END-IF.
           IF CO01MOR076CCV < HD-RECMORA
              MOVE CO01MOR076CCV TO HD-RECMORA
           END-IF.
           IF CO01MOR076HPV < HD-RECMORA
              MOVE CO01MOR076HPV TO HD-RECMORA
           END-IF.
      *
           IF CO01MOR077ROV < HD-RECMORA
              MOVE CO01MOR077ROV TO HD-RECMORA
           END-IF.
           IF CO01MOR077INV < HD-RECMORA
              MOVE CO01MOR077INV TO HD-RECMORA
           END-IF.
           IF CO01MOR077OTV < HD-RECMORA
              MOVE CO01MOR077OTV TO HD-RECMORA
           END-IF.
           IF CO01MOR077COV < HD-RECMORA
              MOVE CO01MOR077COV TO HD-RECMORA
           END-IF.
           IF CO01MOR077VEV < HD-RECMORA
              MOVE CO01MOR077VEV TO HD-RECMORA
           END-IF.
           IF CO01MOR077CCV < HD-RECMORA
              MOVE CO01MOR077CCV TO HD-RECMORA
           END-IF.
           IF CO01MOR077HPV < HD-RECMORA
              MOVE CO01MOR077HPV TO HD-RECMORA
           END-IF.
      *
           IF CO01MOR078ROV < HD-RECMORA
              MOVE CO01MOR078ROV TO HD-RECMORA
           END-IF.
           IF CO01MOR078INV < HD-RECMORA
              MOVE CO01MOR078INV TO HD-RECMORA
           END-IF.
           IF CO01MOR078OTV < HD-RECMORA
              MOVE CO01MOR078OTV TO HD-RECMORA
           END-IF.
           IF CO01MOR078COV < HD-RECMORA
              MOVE CO01MOR078COV TO HD-RECMORA
           END-IF.
           IF CO01MOR078VEV < HD-RECMORA
              MOVE CO01MOR078VEV TO HD-RECMORA
           END-IF.
           IF CO01MOR078CCV < HD-RECMORA
              MOVE CO01MOR078CCV TO HD-RECMORA
           END-IF.
           IF CO01MOR078HPV < HD-RECMORA
              MOVE CO01MOR078HPV TO HD-RECMORA
           END-IF.
       6500-RECMORACC-USAHD.
REMARK**********************************************************************
REMARK*6500-RECMORACC-USAHD.
REAMRK*    CALCULO DEL ESTADO DE MORAS CRITICOS
REMARK**********************************************************************
           MOVE 01MOR079RO  TO CO01MOR079RO.
           MOVE 01MOR079IN  TO CO01MOR079IN.
           MOVE 01MOR079OT  TO CO01MOR079OT.
           MOVE 01MOR079CO  TO CO01MOR079CO.
           MOVE 01MOR079VE  TO CO01MOR079VE.
           MOVE 01MOR079CC  TO CO01MOR079CC.
           MOVE 01MOR079HP  TO CO01MOR079HP.
           IF CO01MOR079RO NUMERIC
              MOVE CO01MOR079RO TO CO01MOR079ROV
           ELSE
              MOVE 999          TO CO01MOR079ROV
           END-IF.
           IF CO01MOR079IN NUMERIC
              MOVE CO01MOR079IN TO CO01MOR079INV
           ELSE
              MOVE 999          TO CO01MOR079INV
           END-IF.
           IF CO01MOR079OT NUMERIC
              MOVE CO01MOR079OT TO CO01MOR079OTV
           ELSE
              MOVE 999          TO CO01MOR079OTV
           END-IF.
           IF CO01MOR079CO NUMERIC
              MOVE CO01MOR079CO TO CO01MOR079COV
           ELSE
              MOVE 999          TO CO01MOR079COV
           END-IF.
           IF CO01MOR079VE NUMERIC
              MOVE CO01MOR079VE TO CO01MOR079VEV
           ELSE
              MOVE 999          TO CO01MOR079VEV
           END-IF.
           IF CO01MOR079CC NUMERIC
              MOVE CO01MOR079CC TO CO01MOR079CCV
           ELSE
              MOVE 999          TO CO01MOR079CCV
           END-IF.
           IF CO01MOR079HP NUMERIC
              MOVE CO01MOR079HP TO CO01MOR079HPV
           ELSE
              MOVE 999          TO CO01MOR079HPV
           END-IF.
      *
           MOVE CO01MOR079ROV TO HD-RECMORACC.
           IF CO01MOR079INV < HD-RECMORACC
              MOVE CO01MOR079INV TO HD-RECMORACC
           END-IF.
           IF CO01MOR079OTV < HD-RECMORACC
              MOVE CO01MOR079OTV TO HD-RECMORACC
           END-IF.
           IF CO01MOR079COV < HD-RECMORACC
              MOVE CO01MOR079COV TO HD-RECMORACC
           END-IF.
           IF CO01MOR079VEV < HD-RECMORACC
              MOVE CO01MOR079VEV TO HD-RECMORACC
           END-IF.
           IF CO01MOR079CCV < HD-RECMORACC
              MOVE CO01MOR079CCV TO HD-RECMORACC
           END-IF.
           IF CO01MOR079HPV < HD-RECMORACC
              MOVE CO01MOR079HPV TO HD-RECMORACC
           END-IF.
OPTI01 6500-CALCULAR-EVER12006.                                         RMB0004
OPTI01******************************************************************RMB0004
OPTI01*6500-CALCULAR-EVER12006.                                         RMB0004
OPTI01*    SIN CODEUDOR SEGUN DOCUMENTACION                             RMB0004
OPTI01******************************************************************RMB0004
OPTI01     MOVE 01MOR037RO  TO CO01MOR037RO.                            RMB0004
OPTI01     IF CO01MOR037RO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR037RO TO CO01MOR037ROV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR037ROV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR037IN  TO CO01MOR037IN.                            RMB0004
OPTI01     IF CO01MOR037IN NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR037IN TO CO01MOR037INV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR037INV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR037OT  TO CO01MOR037OT.                            RMB0004
OPTI01     IF CO01MOR037OT NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR037OT TO CO01MOR037OTV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR037OTV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR037VE  TO CO01MOR037VE.                            RMB0004
OPTI01     IF CO01MOR037VE NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR037VE TO CO01MOR037VEV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR037VEV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR037CC  TO CO01MOR037CC.                            RMB0004
OPTI01     IF CO01MOR037CC NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR037CC TO CO01MOR037CCV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR037CCV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR037HP  TO CO01MOR037HP.                            RMB0004
OPTI01     IF CO01MOR037HP NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR037HP TO CO01MOR037HPV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR037HPV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR037CO  TO CO01MOR037CO.                            RMB0004
OPTI01     IF CO01MOR037CO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR037CO TO CO01MOR037COV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR037COV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     COMPUTE HD-EVER12006  = CO01MOR037CCV + CO01MOR037ROV        RMB0004
OPTI01                      + CO01MOR037INV + CO01MOR037OTV             RMB0004
OPTI01                      + CO01MOR037HPV + CO01MOR037VEV.            RMB0004
OPTI01 6500-CALCULAR-EVER12012.                                         RMB0004
OPTI01******************************************************************RMB0004
OPTI01*6500-CALCULAR-EVER12012.                                         RMB0004
OPTI01*    CON CODEUDOR SEGUN DOCUMENTACION                             RMB0004
OPTI01******************************************************************RMB0004
OPTI01     MOVE 01MOR044RO  TO CO01MOR044RO.                            RMB0004
OPTI01     IF CO01MOR044RO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR044RO TO CO01MOR044ROV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR044ROV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR044IN  TO CO01MOR044IN.                            RMB0004
OPTI01     IF CO01MOR044IN NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR044IN TO CO01MOR044INV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR044INV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR044OT  TO CO01MOR044OT.                            RMB0004
OPTI01     IF CO01MOR044OT NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR044OT TO CO01MOR044OTV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR044OTV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR044VE  TO CO01MOR044VE.                            RMB0004
OPTI01     IF CO01MOR044VE NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR044VE TO CO01MOR044VEV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR044VEV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR044CC  TO CO01MOR044CC.                            RMB0004
OPTI01     IF CO01MOR044CC NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR044CC TO CO01MOR044CCV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR044CCV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR044HP  TO CO01MOR044HP.                            RMB0004
OPTI01     IF CO01MOR044HP NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR044HP TO CO01MOR044HPV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR044HPV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR044CO  TO CO01MOR044CO.                            RMB0004
OPTI01     IF CO01MOR044CO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR044CO TO CO01MOR044COV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR044COV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     COMPUTE HD-EVER12012  = CO01MOR044CCV + CO01MOR044ROV        RMB0004
OPTI01                      + CO01MOR044INV + CO01MOR044OTV             RMB0004
OPTI01                      + CO01MOR044HPV + CO01MOR044VEV             RMB0004
OPTI01                      + CO01MOR044COV .                           RMB0004
OPTI01 6500-CALCULAR-EVER12018.                                         RMB0004
OPTI01******************************************************************RMB0004
OPTI01*6500-CALCULAR-EVER12018.                                         RMB0004
OPTI01*    SIN CODEUDOR SEGUN DOCUMENTACION                             RMB0004
OPTI01******************************************************************RMB0004
OPTI01     MOVE 01MOR051RO  TO CO01MOR051RO.                            RMB0004
OPTI01     IF CO01MOR051RO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR051RO TO CO01MOR051ROV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR051ROV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR051IN  TO CO01MOR051IN.                            RMB0004
OPTI01     IF CO01MOR051IN NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR051IN TO CO01MOR051INV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR051INV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR051OT  TO CO01MOR051OT.                            RMB0004
OPTI01     IF CO01MOR051OT NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR051OT TO CO01MOR051OTV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR051OTV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR051VE  TO CO01MOR051VE.                            RMB0004
OPTI01     IF CO01MOR051VE NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR051VE TO CO01MOR051VEV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR051VEV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR051CC  TO CO01MOR051CC.                            RMB0004
OPTI01     IF CO01MOR051CC NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR051CC TO CO01MOR051CCV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR051CCV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR051HP  TO CO01MOR051HP.                            RMB0004
OPTI01     IF CO01MOR051HP NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR051HP TO CO01MOR051HPV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR051HPV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR051CO  TO CO01MOR051CO.                            RMB0004
OPTI01     IF CO01MOR051CO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR051CO TO CO01MOR051COV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR051COV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     COMPUTE HD-EVER12018  = CO01MOR051CCV + CO01MOR051ROV        RMB0004
OPTI01                      + CO01MOR051INV + CO01MOR051OTV             RMB0004
OPTI01                      + CO01MOR051HPV + CO01MOR051VEV.            RMB0004
OPTI01 6500-CALCULAR-EVER12024.                                         RMB0004
OPTI01******************************************************************RMB0004
OPTI01*6500-CALCULAR-EVER12024.                                         RMB0004
OPTI01*    CON CODEUDOR SEGUN DOCUMENTACION                             RMB0004
OPTI01******************************************************************RMB0004
OPTI01     MOVE 01MOR058RO  TO CO01MOR058RO.                            RMB0004
OPTI01     IF CO01MOR058RO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR058RO TO CO01MOR058ROV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR058ROV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR058IN  TO CO01MOR058IN.                            RMB0004
OPTI01     IF CO01MOR058IN NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR058IN TO CO01MOR058INV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR058INV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR058OT  TO CO01MOR058OT.                            RMB0004
OPTI01     IF CO01MOR058OT NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR058OT TO CO01MOR058OTV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR058OTV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR058VE  TO CO01MOR058VE.                            RMB0004
OPTI01     IF CO01MOR058VE NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR058VE TO CO01MOR058VEV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR058VEV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR058CC  TO CO01MOR058CC.                            RMB0004
OPTI01     IF CO01MOR058CC NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR058CC TO CO01MOR058CCV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR058CCV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR058HP  TO CO01MOR058HP.                            RMB0004
OPTI01     IF CO01MOR058HP NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR058HP TO CO01MOR058HPV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR058HPV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR058CO  TO CO01MOR058CO.                            RMB0004
OPTI01     IF CO01MOR058CO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR058CO TO CO01MOR058COV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR058COV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     COMPUTE HD-EVER12024  = CO01MOR058CCV + CO01MOR058ROV        RMB0004
OPTI01                      + CO01MOR058INV + CO01MOR058OTV             RMB0004
OPTI01                      + CO01MOR058HPV + CO01MOR058VEV             RMB0004
OPTI01                      + CO01MOR058COV .                           RMB0004
OPTI01 6500-CALCULAR-EVER12036.                                         RMB0004
OPTI01******************************************************************RMB0004
OPTI01*6500-CALCULAR-EVER12036.                                         RMB0004
OPTI01*    SIN CODEUDOR SEGUN DOCUMENTACION                             RMB0004
OPTI01******************************************************************RMB0004
OPTI01     MOVE 01MOR065RO  TO CO01MOR065RO.                            RMB0004
OPTI01     IF CO01MOR065RO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR065RO TO CO01MOR065ROV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR065ROV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR065IN  TO CO01MOR065IN.                            RMB0004
OPTI01     IF CO01MOR065IN NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR065IN TO CO01MOR065INV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR065INV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR065OT  TO CO01MOR065OT.                            RMB0004
OPTI01     IF CO01MOR065OT NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR065OT TO CO01MOR065OTV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR065OTV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR065VE  TO CO01MOR065VE.                            RMB0004
OPTI01     IF CO01MOR065VE NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR065VE TO CO01MOR065VEV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR065VEV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR065CC  TO CO01MOR065CC.                            RMB0004
OPTI01     IF CO01MOR065CC NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR065CC TO CO01MOR065CCV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR065CCV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR065HP  TO CO01MOR065HP.                            RMB0004
OPTI01     IF CO01MOR065HP NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR065HP TO CO01MOR065HPV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR065HPV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR065CO  TO CO01MOR065CO.                            RMB0004
OPTI01     IF CO01MOR065CO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR065CO TO CO01MOR065COV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR065COV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     COMPUTE HD-EVER12036  = CO01MOR065CCV + CO01MOR065ROV        RMB0004
OPTI01                      + CO01MOR065INV + CO01MOR065OTV             RMB0004
OPTI01                      + CO01MOR065HPV + CO01MOR065VEV.            RMB0004
OPTI01 6500-CALCULAR-EVER12048.                                         RMB0004
OPTI01******************************************************************RMB0004
OPTI01*6500-CALCULAR-EVER12048.                                         RMB0004
OPTI01*    CALCULO VARIABLE EVER12048 CON CODEUDOR                      RMB0004
OPTI01******************************************************************RMB0004
OPTI01     MOVE 01MOR072RO  TO CO01MOR072RO.                            RMB0004
OPTI01     IF CO01MOR072RO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR072RO TO CO01MOR072ROV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR072ROV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR072IN  TO CO01MOR072IN.                            RMB0004
OPTI01     IF CO01MOR072IN NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR072IN TO CO01MOR072INV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR072INV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR072OT  TO CO01MOR072OT.                            RMB0004
OPTI01     IF CO01MOR072OT NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR072OT TO CO01MOR072OTV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR072OTV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR072CO  TO CO01MOR072CO.                            RMB0004
OPTI01     IF CO01MOR072CO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR072CO TO CO01MOR072COV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR072COV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR072VE  TO CO01MOR072VE.                            RMB0004
OPTI01     IF CO01MOR072VE NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR072VE TO CO01MOR072VEV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR072VEV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR072CC  TO CO01MOR072CC.                            RMB0004
OPTI01     IF CO01MOR072CC NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR072CC TO CO01MOR072CCV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR072CCV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR072HP  TO CO01MOR072HP.                            RMB0004
OPTI01     IF CO01MOR072HP NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR072HP TO CO01MOR072HPV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR072HPV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     COMPUTE HD-EVER12048  = CO01MOR072CCV + CO01MOR072ROV        RMB0004
OPTI01                      + CO01MOR072INV + CO01MOR072OTV             RMB0004
OPTI01                      + CO01MOR072COV + CO01MOR072VEV             RMB0004
OPTI01                      + CO01MOR072HPV .                           RMB0004
OPTI01 6500-CALCULO-01MOR05.                                            RMB0004
OPTI01******************************************************************RMB0004
OPTI01*6500-CALCULO-01MOR05.                                            RMB0004
OPTI01*    SIN CODEUDOR SEGUN DOCUMENTACION                             RMB0004
OPTI01******************************************************************RMB0004
OPTI01     MOVE 01MOR005RO  TO CO01MOR005RO.                            RMB0004
OPTI01     IF CO01MOR005RO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR005RO TO CO01MOR005ROV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR005ROV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR005IN  TO CO01MOR005IN.                            RMB0004
OPTI01     IF CO01MOR005IN NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR005IN TO CO01MOR005INV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR005INV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR005OT  TO CO01MOR005OT.                            RMB0004
OPTI01     IF CO01MOR005OT NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR005OT TO CO01MOR005OTV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR005OTV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR005VE  TO CO01MOR005VE.                            RMB0004
OPTI01     IF CO01MOR005VE NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR005VE TO CO01MOR005VEV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR005VEV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR005CC  TO CO01MOR005CC.                            RMB0004
OPTI01     IF CO01MOR005CC NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR005CC TO CO01MOR005CCV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR005CCV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR005HP  TO CO01MOR005HP.                            RMB0004
OPTI01     IF CO01MOR005HP NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR005HP TO CO01MOR005HPV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR005HPV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     MOVE 01MOR005CO  TO CO01MOR005CO.                            RMB0004
OPTI01     IF CO01MOR005CO NUMERIC                                      RMB0004
OPTI01        MOVE CO01MOR005CO TO CO01MOR005COV                        RMB0004
OPTI01     ELSE                                                         RMB0004
OPTI01        MOVE ZERO         TO CO01MOR005COV                        RMB0004
OPTI01     END-IF.                                                      RMB0004
OPTI01     COMPUTE HD-01MOR05TO  = CO01MOR005CCV + CO01MOR005ROV        RMB0004
OPTI01                      + CO01MOR005INV + CO01MOR005OTV             RMB0004
OPTI01                      + CO01MOR005HPV + CO01MOR005VEV.            RMB0004
       6000-DESPLEGAR-AUDITORIA-USAHD.
REMARK*******************************************************************
REMARK*6000-DESPLEGAR-AUDITORIA-USAHD.
REMARK*    ESTA RUTINA PERMITE GENERAR PARA AUDITORIA LA INFORMACION
REMARK*    COMPLETA SOBRE EL SCORE , DUMIES CARACT ETC
REMARK*******************************************************************
           MOVE SPACES TO AREA-VALI-USAHD.
REMARK     STRING  TIPO-ID-CARACT,";"
                   NRO-ID-CARACT           ,";",
                   SCORE-CARD-USAHD        ,";",
                   SCORE-USAHD             ,";",
                   ADVERSE-RAZON-USAHD(1)  ,
                   INTO AREA-VALI-USAHD.
           PERFORM 7000-DESPLEGAR-CARACT-USAHD
           EVALUATE SCORE-CARD-USAHD
             WHEN 1 
                MOVE DUMMYS-S1-USAHD TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAHD
             WHEN 2 
                MOVE DUMMYS-S2-USAHD TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAHD
             WHEN 3 
                MOVE DUMMYS-S3-USAHD TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAHD
             WHEN 4 
                MOVE DUMMYS-S4-USAHD TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAHD
             WHEN 5 
                MOVE DUMMYS-S5-USAHD TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAHD
             WHEN 6 
                MOVE DUMMYS-S6-USAHD TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAHD
             WHEN ANY
                MOVE ";" TO DUMMIES-DESPLEGAR-USAHD
                PERFORM 6500-DESPLEGAR-DUMMIES-USAHD
           END-EVALUATE.
       6500-DESPLEGAR-DUMMIES-USAHD.
REMARK*******************************************************************
REMARK*6500-DESPLEGAR-DUMMIES-USAHD.
REMARK*    RUTINA QUE PERMITE DESPLEGAR LOS VALORES DE LAS VARIABLES 
REMARK*    DUMMIES PARA SEGUIMIENTO. ENTRADA : DUMMIES-DESPLEGAR-USAHD
REMARK*    EJEMPLO DE SU USO:
REMARK*          DISPLAY TIPO-ID-CARACT,NRO-ID-CARACT,";",INGRESO-USAHD1
REMARK*             NO ADVANCING
REMARK*          MOVE DUMMYS-01-USAHD TO DUMMIES-DESPLEGAR-USAHD
REMARK*          PERFORM 6500-DESPLEGAR-DUMMIES-USAHD
REMARK*
REMARK*******************************************************************
           MOVE 1 TO I-USAHD.
           PERFORM UNTIL I-USAHD > 500
             IF DUMMIES-DESPLEGAR-USAHD(I-USAHD:1) NOT = " "
                COMPUTE J-USAHD = I-USAHD + 1
                IF DUMMIES-DESPLEGAR-USAHD(J-USAHD:1) NOT = " "
                  STRING AREA-VALI-USAHD DELIMITED BY "               "
                           ";",
                            DUMMIES-DESPLEGAR-USAHD(I-USAHD:1)
                       INTO AREA-VALI-USAHD
                ELSE
                  STRING AREA-VALI-USAHD DELIMITED BY "               "
                           ";",
                            DUMMIES-DESPLEGAR-USAHD(I-USAHD:1)
                       INTO AREA-VALI-USAHD
                END-IF
             END-IF
             ADD 1 TO I-USAHD
           END-PERFORM.
       7000-DESPLEGAR-CARACT-USAHD.
REMARK*******************************************************************
REMARK*7000-DESPLEGAR-CARACT-USAHD.
REMARK*    SE DESPLIEGAN LAS CARACTERISTICAS PARA CADA SCORE CARD PARA 
REMARK*    EFECTOS DE DEBUG Y AUDITORIA
REMARK*******************************************************************
           EVALUATE SCORE-CARD-USAHD
             WHEN 1
                STRING AREA-VALI-USAHD DELIMITED BY SPACES,
                        ";"
MODI01          00DEM016     , ";"                                      RMB0002
MODI01          02END001CB   , ";"                                      RMB0002
MODI01          01END017CC   , ";"                                      RMB0002
MODI01          01END018CC   , ";"                                      RMB0002
MODI01          01END027CC   , ";"                                      RMB0002
MODI01          01END027OT   , ";"                                      RMB0002
MODI01          01MOR090CC   , ";"                                      RMB0002
MODI01          01MOR022OT   , ";"                                      RMB0002
OPTI01          01MOR101OT   , ";"                                      RMB0004
MODI01          01MOR005CC   , ";"                                      RMB0002
MODI01          01MOR017CC   , ";"                                      RMB0002
MODI01          01MOR033CC   , ";"                                      RMB0002
MODI01          01MOR034CC   , ";"                                      RMB0002
MODI01          01MOR035OT   , ";"                                      RMB0002
MODI01          01MOR043OT   , ";"                                      RMB0002
MODI01          02NUM028TO   , ";"                                      RMB0002
MODI01          01NUM050AH   , ";"                                      RMB0002
MODI01          02NUM018TO   , ";"                                      RMB0002
MODI01          00DEM003     , ";"                                      RMB0002
MODI01          02EXP003TO                                              RMB0002
                INTO AREA-VALI-USAHD
             WHEN 2 
                STRING AREA-VALI-USAHD DELIMITED BY SPACES,
                        ";"
                01NUM050AH   , ";"                       
                01END004IN   , ";"                       
                01END012OT   , ";"                       
                01NUM049CC   , ";"                       
                01END089RO   , ";"                       
                02END017CB   , ";"                       
                01ACP009OT   , ";"                       
                01MOR075RO   , ";"                       
                01MOR075IN   , ";"                       
                01MOR075OT   , ";"                       
                01MOR075CO   , ";"                       
                01MOR075VE   , ";"                       
                01MOR075CC   , ";"                       
                01MOR075HP   , ";"                       
                01MOR076RO   , ";"                       
                01MOR076IN   , ";"                       
                01MOR076OT   , ";"                       
                01MOR076CO   , ";"                       
                01MOR076VE   , ";"                       
                01MOR076CC   , ";"                       
                01MOR076HP   , ";"                       
                01MOR077RO   , ";"                       
                01MOR077IN   , ";"                       
                01MOR077OT   , ";"                       
                01MOR077CO   , ";"                       
                01MOR077VE   , ";"                       
                01MOR077CC   , ";"                       
                01MOR077HP   , ";"                       
                01MOR078RO   , ";"                       
                01MOR078IN   , ";"                       
                01MOR078OT   , ";"                       
                01MOR078CO   , ";"                       
                01MOR078VE   , ";"                       
                01MOR078CC   , ";"                       
                01MOR078HP   , ";"                       
                01MOR080CC   , ";"                       
                01MOR004RO   , ";"                       
                01MOR004IN   , ";"                       
                01MOR004VE   , ";"                       
                01MOR004HP   , ";"                       
                01MOR004CC   , ";"                       
                01MOR004OT   , ";"                       
                01MOR004CO   , ";"                       
                02EXP001TO   , ";"                       
                01MOR071RO   , ";"                       
                01MOR071IN   , ";"                       
                01MOR071OT   , ";"                       
                01MOR071CO   , ";"                       
                01MOR071VE   , ";"                       
                01MOR071CC   , ";"                       
                01MOR071HP
                INTO AREA-VALI-USAHD
             WHEN 3
                STRING AREA-VALI-USAHD DELIMITED BY SPACES,
                        ";"
                02EXP008CC   , ";"
                01EXP008CO   , ";"
                00DEM003     , ";"
                01MOR008IN   , ";"
                01MOR009IN   , ";"
                01NUM042IN   , ";"
                01MOR009RO   , ";"
                01MOR009IN   , ";"
                01MOR009VE   , ";"
                01MOR009HP   , ";"
                01MOR009CC   , ";"
                01MOR009OT   , ";"
                01MOR009CO   , ";"
                01ACP002RO   , ";"
                01ACP002IN   , ";"
                01ACP002OT   , ";"
                01ACP002VE   , ";"
                01ACP002CO   , ";"
                01ACP002CC   , ";"
                01ACP002HP   , ";"
                01NUM001OT   , ";"
                01END020RO   , ";"
                01END080RO   , ";"
                01END085RO   , ";"
                01END003RO   , ";"
                01END003IN   , ";"
                01END003OT   , ";"
                01END003VE   , ";"
                01END003CC   , ";"
                01END003CO   , ";"
                01END003HP   , ";"
OPTI01          01END006RO   , ";"                                      RMB0004
                02EXP001TO 
                INTO AREA-VALI-USAHD
             WHEN 4 
                STRING AREA-VALI-USAHD DELIMITED BY SPACES,
                        ";"
                02EXP001TO   , ";"                       
                01MOR083CC   , ";"                       
                01MOR056RO   , ";"                       
                01MOR056IN   , ";"                       
                01MOR056OT   , ";"                       
                01MOR056CO   , ";"                       
                01MOR056VE   , ";"                       
                01MOR056CC   , ";"                       
                01MOR056HP   , ";"                       
                01MOR098IN   , ";"                       
                01MOR001RO   , ";"                       
                01MOR001IN   , ";"                       
                01MOR001OT   , ";"                       
                01MOR001VE   , ";"                       
                01MOR001CC   , ";"                       
                01MOR001HP   , ";"                       
                01MOR075RO   , ";"                       
                01MOR075IN   , ";"                       
                01MOR075OT   , ";"                       
                01MOR075CO   , ";"                       
                01MOR075VE   , ";"                       
                01MOR075CC   , ";"                       
                01MOR075HP   , ";"                       
                01MOR076RO   , ";"                       
                01MOR076IN   , ";"                       
                01MOR076OT   , ";"                       
                01MOR076CO   , ";"                       
                01MOR076VE   , ";"                       
                01MOR076CC   , ";"                       
                01MOR076HP   , ";"                       
                01MOR077RO   , ";"                       
                01MOR077IN   , ";"                       
                01MOR077OT   , ";"                       
                01MOR077CO   , ";"                       
                01MOR077VE   , ";"                       
                01MOR077CC   , ";"                       
                01MOR077HP   , ";"                       
                01MOR078RO   , ";"                       
                01MOR078IN   , ";"                       
                01MOR078OT   , ";"                       
                01MOR078CO   , ";"                       
                01MOR078VE   , ";"                       
                01MOR078CC   , ";"                       
                01MOR078HP   , ";"                       
                01MOR079RO   , ";"                       
                01MOR079IN   , ";"                       
                01MOR079OT   , ";"                       
                01MOR079CO   , ";"                       
                01MOR079VE   , ";"                       
                01MOR079CC   , ";"                       
                01MOR079HP   , ";"                       
                01MOR008RO   , ";"                       
                01MOR008IN   , ";"                       
                01MOR008VE   , ";"                       
                01MOR008HP   , ";"                       
                01MOR008CC   , ";"                       
                01MOR008OT   , ";"                       
                01MOR008CO   , ";"                       
                01MOR008IN   , ";"                       
                01MOR009VE   , ";"                       
                01MOR009CO   , ";"                       
                01MOR009CC   , ";"                       
                01END017CC   , ";"                       
                01END022CO   , ";"                       
                01END080RO   , ";"                       
                01END087RO   , ";"                       
                02END018CB   , ";"                       
                01END003RO   , ";"                       
                01END003IN   , ";"                       
                01END003VE   , ";"                       
                01END003HP   , ";"                       
                01END003OT   , ";"                       
                01END003CO   , ";"                       
                01EXP006CC   , ";"                       
                02EXP008OT   , ";"                       
                01EXP001IN   , ";"                       
                02ACP002     , ";"                       
                00DEM016    
                INTO AREA-VALI-USAHD
             WHEN 5 
                STRING AREA-VALI-USAHD DELIMITED BY SPACES,
                        ";"
                00DEM003     , ";"                       
                00DEM016     , ";"                       
                02ACP002     , ";"                       
                02END019CB   , ";"                       
                02NUM043CB   , ";"                       
                01END017CC   , ";"                       
                01EXP001CC   , ";"                       
                01END007CO   , ";"                       
                01END021CO   , ";"                       
                01EXP006CT   , ";"                       
                01MOR055RO   , ";"                       
                01MOR055IN   , ";"                       
                01MOR055OT   , ";"                       
                01MOR055VE   , ";"                       
                01MOR055CC   , ";"                       
                01MOR055HP   , ";"                       
                01END018IN   , ";"                       
                01MOR068IN   , ";"                       
                01NUM002IN   , ";"                       
                01EXP007RO   , ";"                       
                01EXP007IN   , ";"                       
                01EXP007OT   , ";"                       
                01EXP007VE   , ";"                       
                01EXP007CC   , ";"                       
                01EXP007CO   , ";"                       
                01EXP007HP   , ";"                       
                01ACP003RO   , ";"                       
                01ACP003IN   , ";"                       
                01ACP003OT   , ";"                       
                01ACP003VE   , ";"                       
                01ACP003CC   , ";"                       
                01ACP003CO   , ";"                       
                01ACP003HP   , ";"                       
                01EXP003OT   , ";"                       
                01ACP001RO   , ";"                       
                01END030RO   , ";"                       
                01END071RO   , ";"                       
                01END080RO   , ";"                       
                02END045RO   , ";"                       
                01NUM001HP   , ";"                       
                01END004RO   , ";"                       
                01END004IN   , ";"                       
                01END004VE   , ";"                       
                01END004HP   , ";"                       
                01END004CC   , ";"                       
                01END004OT   , ";"                       
                01END004CO   , ";"                       
                01END005VE   , ";"                       
                01EXP001AH   , ";"                       
                02EXP013TO   , ";"                       
                02EXP002TO  
                INTO AREA-VALI-USAHD
             WHEN 6 
                STRING AREA-VALI-USAHD DELIMITED BY SPACES,
                        ";"
                01MOR061IN    , ";"                       
                01NUM001HP    , ";"                       
                01NUM050AH    , ";"                       
                01NUM001OT    , ";"                       
                02NUM035TO    , ";"                       
                01END089RO    , ";"                       
                01EXP004AH    , ";"                       
                01EXP008CC    , ";"                       
                02EXP001TO    , ";"                       
                02EXP002TO    , ";"                       
                01ACP005RO    , ";"                       
                00DEM003      , ";"                       
                00DEM016      , ";"                       
                01MOR075RO   , ";"                       
                01MOR075IN   , ";"                       
                01MOR075OT   , ";"                       
                01MOR075CO   , ";"                       
                01MOR075VE   , ";"                       
                01MOR075CC   , ";"                       
                01MOR075HP   , ";"                       
                01MOR076RO   , ";"                       
                01MOR076IN   , ";"                       
                01MOR076OT   , ";"                       
                01MOR076CO   , ";"                       
                01MOR076VE   , ";"                       
                01MOR076CC   , ";"                       
                01MOR076HP   , ";"                       
                01MOR077RO   , ";"                       
                01MOR077IN   , ";"                       
                01MOR077OT   , ";"                       
                01MOR077CO   , ";"                       
                01MOR077VE   , ";"                       
                01MOR077CC   , ";"                       
                01MOR077HP   , ";"                       
                01MOR078RO   , ";"                       
                01MOR078IN   , ";"                       
                01MOR078OT   , ";"                       
                01MOR078CO   , ";"                       
                01MOR078VE   , ";"                       
                01MOR078CC   , ";"                       
                01MOR078HP   , ";"                       
                02ACP002 
                INTO AREA-VALI-USAHD
             WHEN ANY
                STRING AREA-VALI-USAHD DELIMITED BY SPACES,
                        ";"
                01NUM001RO    , ";"                       
                01NUM001IN    , ";"                       
                01NUM001VE    , ";"                       
                01NUM001HP    , ";"                       
                01NUM001CC    , ";"                       
                01NUM001OT    , ";"                       
                01NUM001CO    , ";"                       
                01NUM001AH    , ";"                       
                01NUM001CT    , ";"                       
                00DEM001      , ";"                       
                00DEM002      , ";"                       
                02NUM018TO    , ";"                       
                02NUM020TO
                INTO AREA-VALI-USAHD
           END-EVALUATE.
